30 : Job ID 0eeca0e6d46e49c0a72cbb3e45666d8f
test outcome: killed
breadth_first_search.py, start pos: (36, 82), end pos: (36, 83)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 3
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height*1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.08s ==========================

31 : Job ID 7eff04522e324f9ca7468da4de729fc3
test outcome: killed
breadth_first_search.py, start pos: (35, 44), end pos: (35, 45)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]/1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - TypeError: lis...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - TypeError:...
========================= 2 failed, 2 passed in 0.09s ==========================

32 : Job ID 9d66cefa4c9e45d1a93f27e67ecb7e31
test outcome: killed
breadth_first_search.py, start pos: (35, 59), end pos: (35, 60)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]/1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - TypeError: lis...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - TypeError:...
========================= 2 failed, 2 passed in 0.08s ==========================

33 : Job ID ced49a8b68204d16b8db87ae99f4de7b
test outcome: killed
breadth_first_search.py, start pos: (36, 45), end pos: (36, 46)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 2
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width/1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.08s ==========================

34 : Job ID c0db0ecba597493aa6b96e86964eaa05
test outcome: killed
breadth_first_search.py, start pos: (36, 82), end pos: (36, 83)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 3
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height/1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.08s ==========================

35 : Job ID 65d4bbc581c14028b63d003724edc3a4
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 44), end pos: (35, 45)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]//1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

36 : Job ID 97c2d8a7b17e4b47bf1539b6c43ddbf3
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 59), end pos: (35, 60)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]//1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

37 : Job ID 0045bcecad5946eb8238beaeb2337ff0
test outcome: killed
breadth_first_search.py, start pos: (36, 45), end pos: (36, 46)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 2
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width//1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.09s ==========================

38 : Job ID 3b463bf3f6e9412eb8e9081a1888295a
test outcome: killed
breadth_first_search.py, start pos: (36, 82), end pos: (36, 83)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 3
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height//1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.08s ==========================

39 : Job ID eb87088f1bc249ddaf6338ff7dbe3efc
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 44), end pos: (35, 45)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]%1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

40 : Job ID 1a86950308c446a0abc3c097f9e80c08
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 59), end pos: (35, 60)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]%1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

41 : Job ID 6b9e11c50d6c4fa7b9d87ec5d5893f95
test outcome: killed
breadth_first_search.py, start pos: (36, 45), end pos: (36, 46)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 2
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width%1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert None ==...
========================= 1 failed, 3 passed in 0.09s ==========================

42 : Job ID 5fe11ed70c8e4c6887e54050cd68e56c
test outcome: killed
breadth_first_search.py, start pos: (36, 82), end pos: (36, 83)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 3
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height%1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert None ==...
========================= 1 failed, 3 passed in 0.08s ==========================

43 : Job ID 80cebb14ad6b4927b70183375b5a5273
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 44), end pos: (35, 45)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]**1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

44 : Job ID 535794064bf54508868513f04bbb51cf
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 59), end pos: (35, 60)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]**1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

45 : Job ID d11cb860941c49cf9f47573265fa4555
test outcome: killed
breadth_first_search.py, start pos: (36, 45), end pos: (36, 46)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 2
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width**1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.08s ==========================

46 : Job ID 6b94f3b16cb24e2e897a1aa0e94d8020
test outcome: killed
breadth_first_search.py, start pos: (36, 82), end pos: (36, 83)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 3
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height**1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.08s ==========================

47 : Job ID c01f1b6ba7b84b889e547faf61f0e1e1
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 44), end pos: (35, 45)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]>>1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

48 : Job ID 6e273ab712f644cc94d65e6a79c7656e
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 59), end pos: (35, 60)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]>>1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

49 : Job ID 69c55e22939348a0902e29548694b9f8
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (36, 45), end pos: (36, 46)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 2
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width>>1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

50 : Job ID 10bbe509fd8442e9acae1cc24e8f519d
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (36, 82), end pos: (36, 83)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 3
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height>>1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

51 : Job ID be80c38ec72b4dd58387db1ae1f00d09
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 44), end pos: (35, 45)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]<<1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

52 : Job ID cd69c6c48e4c47e798f9dadb37a422ba
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 59), end pos: (35, 60)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]<<1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

53 : Job ID f512255e240f4e6da3faa52f73a6c5ef
test outcome: killed
breadth_first_search.py, start pos: (36, 45), end pos: (36, 46)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 2
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width<<1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.09s ==========================

54 : Job ID b219fb0bac7144e786467b81ef138ab6
test outcome: killed
breadth_first_search.py, start pos: (36, 82), end pos: (36, 83)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 3
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height<<1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.08s ==========================

55 : Job ID 6c0c175ef7014fd69548b863546c3a06
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 44), end pos: (35, 45)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]|1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

56 : Job ID a0da896f0d20455f8af5cbb46d94e199
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 59), end pos: (35, 60)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]|1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

57 : Job ID 38e55fa1aa6042a9b52fbd306113ce7a
test outcome: killed
breadth_first_search.py, start pos: (36, 45), end pos: (36, 46)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 2
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width|1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.09s ==========================

58 : Job ID 458ed9675c074eeda87221d33d5edc22
test outcome: killed
breadth_first_search.py, start pos: (36, 82), end pos: (36, 83)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 3
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height|1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.09s ==========================

59 : Job ID eb29be0908b849d6a398b6b918901a63
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 44), end pos: (35, 45)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]&1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================
