60 : Job ID 2fce3d8fb29a4580afe044c27efe123c
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 59), end pos: (35, 60)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]&1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

61 : Job ID 8a4611c3978c41f08b12cdc264bc812f
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (36, 45), end pos: (36, 46)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 2
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width&1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

62 : Job ID 956be521a644437f91a170087b10d8cb
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (36, 82), end pos: (36, 83)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 3
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height&1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

63 : Job ID 42161a8c5e3a4c8fa4075ed9c8fd1f5d
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 44), end pos: (35, 45)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]^1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

64 : Job ID 361ae8105d014168871f67b520697c47
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 59), end pos: (35, 60)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]^1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

65 : Job ID bdf640d074364cf9a1c4d85f0a203be3
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (36, 45), end pos: (36, 46)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 2
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width^1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.10s ===============================

66 : Job ID b345769d37d645eb86a102ab239571d1
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (36, 82), end pos: (36, 83)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 3
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height^1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

67 : Job ID 285bb804a77846818703157ea147aa1f
test outcome: killed
breadth_first_search.py, start pos: (23, 30), end pos: (23, 32)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -20,7 +20,7 @@
     y_start = start[1]
     # short circuit the start lookup
-    if grid[y_start][x_start] == target:
+    if grid[y_start][x_start] != target:
         return (x_start, y_start)
     visited = set()
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert (0, 0) ...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - assert (0,...
========================= 2 failed, 2 passed in 0.09s ==========================

68 : Job ID fe5664580d514602aadc2f29697960d0
test outcome: killed
breadth_first_search.py, start pos: (38, 38), end pos: (38, 40)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -35,7 +35,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
-            if grid[coor[1]][coor[0]] == target:
+            if grid[coor[1]][coor[0]] != target:
                 return coor
             else:
                 if coor not in visited:
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert (1, 0) ...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - assert (1,...
========================= 2 failed, 2 passed in 0.09s ==========================

69 : Job ID 29e0d006134749fb9b3dbe0ab98b36ef
test outcome: killed
breadth_first_search.py, start pos: (67, 28), end pos: (67, 30)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 2
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -64,7 +64,7 @@
             if adjacent in visited:
                 continue
-            if adjacent.val == target:
+            if adjacent.val != target:
                 return adjacent
             else:
                 queue.insert(0, adjacent)
ts-3-5/test_3-5_0-1_44.py ..FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_graph_target_found - assert <test_...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_graph_target_not_found - assert <t...
========================= 2 failed, 2 passed in 0.08s ==========================

70 : Job ID f9c6ad61fc6d4b51b9b726bef4168737
test outcome: killed
breadth_first_search.py, start pos: (23, 30), end pos: (23, 32)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -20,7 +20,7 @@
     y_start = start[1]
     # short circuit the start lookup
-    if grid[y_start][x_start] == target:
+    if grid[y_start][x_start] < target:
         return (x_start, y_start)
     visited = set()
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert (0, 0) ...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - assert (0,...
========================= 2 failed, 2 passed in 0.08s ==========================

71 : Job ID 5b941f4f058d449caf875e72d5312f69
test outcome: killed
breadth_first_search.py, start pos: (38, 38), end pos: (38, 40)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -35,7 +35,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
-            if grid[coor[1]][coor[0]] == target:
+            if grid[coor[1]][coor[0]] < target:
                 return coor
             else:
                 if coor not in visited:
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert (1, 0) ...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - assert (1,...
========================= 2 failed, 2 passed in 0.08s ==========================

72 : Job ID 97211cd69cf145da923852280e7ae551
test outcome: killed
breadth_first_search.py, start pos: (67, 28), end pos: (67, 30)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 2
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -64,7 +64,7 @@
             if adjacent in visited:
                 continue
-            if adjacent.val == target:
+            if adjacent.val < target:
                 return adjacent
             else:
                 queue.insert(0, adjacent)
ts-3-5/test_3-5_0-1_44.py ..FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_graph_target_found - assert <test_...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_graph_target_not_found - assert <t...
========================= 2 failed, 2 passed in 0.08s ==========================

73 : Job ID c193276b750b4d4b944813a897221613
test outcome: killed
breadth_first_search.py, start pos: (23, 30), end pos: (23, 32)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -20,7 +20,7 @@
     y_start = start[1]
     # short circuit the start lookup
-    if grid[y_start][x_start] == target:
+    if grid[y_start][x_start] <= target:
         return (x_start, y_start)
     visited = set()
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert (0, 0) ...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - assert (0,...
========================= 2 failed, 2 passed in 0.08s ==========================

74 : Job ID cc6095e70e64465e9fa5159cb04d0cb7
test outcome: killed
breadth_first_search.py, start pos: (38, 38), end pos: (38, 40)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -35,7 +35,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
-            if grid[coor[1]][coor[0]] == target:
+            if grid[coor[1]][coor[0]] <= target:
                 return coor
             else:
                 if coor not in visited:
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert (1, 0) ...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - assert (1,...
========================= 2 failed, 2 passed in 0.08s ==========================

75 : Job ID f8299aad6acb49b69565fe5a80919273
test outcome: killed
breadth_first_search.py, start pos: (67, 28), end pos: (67, 30)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 2
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -64,7 +64,7 @@
             if adjacent in visited:
                 continue
-            if adjacent.val == target:
+            if adjacent.val <= target:
                 return adjacent
             else:
                 queue.insert(0, adjacent)
ts-3-5/test_3-5_0-1_44.py ..FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_graph_target_found - assert <test_...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_graph_target_not_found - assert <t...
========================= 2 failed, 2 passed in 0.08s ==========================

76 : Job ID f36e640ef8414dfa91d9bda571ce4348
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (23, 30), end pos: (23, 32)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -20,7 +20,7 @@
     y_start = start[1]
     # short circuit the start lookup
-    if grid[y_start][x_start] == target:
+    if grid[y_start][x_start] > target:
         return (x_start, y_start)
     visited = set()
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

77 : Job ID 93bc6f986230413baccc832369f80f4d
test outcome: killed
breadth_first_search.py, start pos: (38, 38), end pos: (38, 40)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -35,7 +35,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
-            if grid[coor[1]][coor[0]] == target:
+            if grid[coor[1]][coor[0]] > target:
                 return coor
             else:
                 if coor not in visited:
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert (0, 2) ...
========================= 1 failed, 3 passed in 0.08s ==========================

78 : Job ID 71c64351d03b4f849b73fbabbeb862d5
test outcome: killed
breadth_first_search.py, start pos: (67, 28), end pos: (67, 30)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 2
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -64,7 +64,7 @@
             if adjacent in visited:
                 continue
-            if adjacent.val == target:
+            if adjacent.val > target:
                 return adjacent
             else:
                 queue.insert(0, adjacent)
ts-3-5/test_3-5_0-1_44.py ..F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_graph_target_found - assert None =...
========================= 1 failed, 3 passed in 0.09s ==========================

79 : Job ID a9ed273f19024b12b60dfb9210967666
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (23, 30), end pos: (23, 32)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -20,7 +20,7 @@
     y_start = start[1]
     # short circuit the start lookup
-    if grid[y_start][x_start] == target:
+    if grid[y_start][x_start] >= target:
         return (x_start, y_start)
     visited = set()
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

80 : Job ID 6eb1c1f308d44ee7a061563582842270
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (38, 38), end pos: (38, 40)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -35,7 +35,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
-            if grid[coor[1]][coor[0]] == target:
+            if grid[coor[1]][coor[0]] >= target:
                 return coor
             else:
                 if coor not in visited:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

81 : Job ID a3079d31acb74fddae27fbe3e11a0bd8
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (67, 28), end pos: (67, 30)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 2
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -64,7 +64,7 @@
             if adjacent in visited:
                 continue
-            if adjacent.val == target:
+            if adjacent.val >= target:
                 return adjacent
             else:
                 queue.insert(0, adjacent)
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

82 : Job ID 4fa78c0e65ac42c7aa54cd92183d366b
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (23, 30), end pos: (23, 32)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -20,7 +20,7 @@
     y_start = start[1]
     # short circuit the start lookup
-    if grid[y_start][x_start] == target:
+    if grid[y_start][x_start] is target:
         return (x_start, y_start)
     visited = set()
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

83 : Job ID d4cbbc0353994f059c1518461c9fee9c
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (38, 38), end pos: (38, 40)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -35,7 +35,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
-            if grid[coor[1]][coor[0]] == target:
+            if grid[coor[1]][coor[0]] is target:
                 return coor
             else:
                 if coor not in visited:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

84 : Job ID 9bc0dce3cebc40399bbaaacfc00f902a
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (67, 28), end pos: (67, 30)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 2
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -64,7 +64,7 @@
             if adjacent in visited:
                 continue
-            if adjacent.val == target:
+            if adjacent.val is target:
                 return adjacent
             else:
                 queue.insert(0, adjacent)
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

85 : Job ID 1e756754a95e4573aed13f2dd56751a0
test outcome: killed
breadth_first_search.py, start pos: (23, 30), end pos: (23, 32)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -20,7 +20,7 @@
     y_start = start[1]
     # short circuit the start lookup
-    if grid[y_start][x_start] == target:
+    if grid[y_start][x_start] is not target:
         return (x_start, y_start)
     visited = set()
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert (0, 0) ...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - assert (0,...
========================= 2 failed, 2 passed in 0.08s ==========================

86 : Job ID 805af38c60ec40d9859bc5f2380d5378
test outcome: killed
breadth_first_search.py, start pos: (38, 38), end pos: (38, 40)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -35,7 +35,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
-            if grid[coor[1]][coor[0]] == target:
+            if grid[coor[1]][coor[0]] is not target:
                 return coor
             else:
                 if coor not in visited:
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert (1, 0) ...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - assert (1,...
========================= 2 failed, 2 passed in 0.08s ==========================

87 : Job ID 49a7e11d30104dc3a829f4d1e2cf6cbf
test outcome: killed
breadth_first_search.py, start pos: (67, 28), end pos: (67, 30)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 2
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -64,7 +64,7 @@
             if adjacent in visited:
                 continue
-            if adjacent.val == target:
+            if adjacent.val is not target:
                 return adjacent
             else:
                 queue.insert(0, adjacent)
ts-3-5/test_3-5_0-1_44.py ..FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_graph_target_found - assert <test_...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_graph_target_not_found - assert <t...
========================= 2 failed, 2 passed in 0.08s ==========================

88 : Job ID 4364e5202baa4a0d931568e495d90bec
test outcome: killed
breadth_first_search.py, start pos: (36, 23), end pos: (36, 24)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] == 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.09s ==========================

89 : Job ID 71e6cbaf717a439d8eabfade73444c15
test outcome: killed
breadth_first_search.py, start pos: (36, 59), end pos: (36, 60)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] == 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.08s ==========================

90 : Job ID 12185f9c7e88439f98c31f96398d8f00
test outcome: killed
breadth_first_search.py, start pos: (36, 23), end pos: (36, 24)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] != 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert None ==...
========================= 1 failed, 3 passed in 0.08s ==========================

91 : Job ID b8f6d50fb1594ebe82afc9d77b6683a5
test outcome: killed
breadth_first_search.py, start pos: (36, 59), end pos: (36, 60)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] != 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert None ==...
========================= 1 failed, 3 passed in 0.08s ==========================
