92 : Job ID 628405f8dc204c9298ba1516cefe3387
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (36, 23), end pos: (36, 24)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] <= 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

93 : Job ID ec6649b6a9fe4abdb7af0a1be2780278
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (36, 59), end pos: (36, 60)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] <= 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

94 : Job ID e2c584b79b8b499c8f927c24397f448b
test outcome: killed
breadth_first_search.py, start pos: (36, 23), end pos: (36, 24)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] > 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert (-2, 1)...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 2 failed, 2 passed in 0.08s ==========================

95 : Job ID a5afb459aaf742a6bc96c0dd871a23dc
test outcome: killed
breadth_first_search.py, start pos: (36, 59), end pos: (36, 60)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] > 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert (1, -2)...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 2 failed, 2 passed in 0.08s ==========================

96 : Job ID ff7f6d48c26e430590f4902e9e43b510
test outcome: killed
breadth_first_search.py, start pos: (36, 23), end pos: (36, 24)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] >= 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert (-2, 1)...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 2 failed, 2 passed in 0.08s ==========================

97 : Job ID 0bf20b3c328c4d04b7ef592500250e2e
test outcome: killed
breadth_first_search.py, start pos: (36, 59), end pos: (36, 60)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] >= 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert (1, -2)...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 2 failed, 2 passed in 0.09s ==========================

98 : Job ID 3381f81fb39d443ba8078bb823b8e15a
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (36, 38), end pos: (36, 39)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] == width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

99 : Job ID 2cc16cdeac1d4dafae606a6d2be340cd
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (36, 74), end pos: (36, 75)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] == height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

100 : Job ID 680f8c9a1cfa49ccb704569a57d52444
test outcome: killed
breadth_first_search.py, start pos: (36, 38), end pos: (36, 39)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] != width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert None ==...
========================= 1 failed, 3 passed in 0.08s ==========================

101 : Job ID 22f04fb185b247fbb7e82f51984074e2
test outcome: killed
breadth_first_search.py, start pos: (36, 74), end pos: (36, 75)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] != height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert None ==...
========================= 1 failed, 3 passed in 0.08s ==========================

102 : Job ID 10c16d57a0824d24b00a1fffba16711b
test outcome: killed
breadth_first_search.py, start pos: (36, 38), end pos: (36, 39)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] < width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert None ==...
========================= 1 failed, 3 passed in 0.09s ==========================

103 : Job ID 842279b6b0b04a37ac25c45ed387e627
test outcome: killed
breadth_first_search.py, start pos: (36, 74), end pos: (36, 75)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] < height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert None ==...
========================= 1 failed, 3 passed in 0.08s ==========================

104 : Job ID e466cddab5584bb5b579d22e065f9ce2
test outcome: killed
breadth_first_search.py, start pos: (36, 38), end pos: (36, 39)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] <= width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert None ==...
========================= 1 failed, 3 passed in 0.08s ==========================

105 : Job ID f9ca80e898974bf5b7e17968490b1c4a
test outcome: killed
breadth_first_search.py, start pos: (36, 74), end pos: (36, 75)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] <= height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert None ==...
========================= 1 failed, 3 passed in 0.08s ==========================

106 : Job ID 8a66a4c8e2ea4806a72c4b0eece970ed
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (36, 38), end pos: (36, 39)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] >= width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

107 : Job ID 8e1c7604a1a5469296a12eced8a61368
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (36, 74), end pos: (36, 75)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] >= height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

108 : Job ID 7971099af6c8413ead6a7aa2232928d0
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (36, 38), end pos: (36, 39)
operator: core/ReplaceComparisonOperator_Gt_Is, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] is width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

109 : Job ID 045035f9ac1d40aead160ecb6045b0dc
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (36, 74), end pos: (36, 75)
operator: core/ReplaceComparisonOperator_Gt_Is, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] is height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

110 : Job ID e7a4fdc474a841b8825417f692a2b38b
test outcome: killed
breadth_first_search.py, start pos: (36, 38), end pos: (36, 39)
operator: core/ReplaceComparisonOperator_Gt_IsNot, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] is not width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert None ==...
========================= 1 failed, 3 passed in 0.09s ==========================

111 : Job ID 2535b4961a994d989513d3f25f80c1f7
test outcome: killed
breadth_first_search.py, start pos: (36, 74), end pos: (36, 75)
operator: core/ReplaceComparisonOperator_Gt_IsNot, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] is not height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert None ==...
========================= 1 failed, 3 passed in 0.08s ==========================

112 : Job ID 24dfe2bcbc0543f48b7c0af1ddd72a74
test outcome: killed
breadth_first_search.py, start pos: (15, 7), end pos: (15, 10)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -12,7 +12,7 @@
         Coordinate of the target. Or None if cannot be found. 
     """
     height = len(grid)
-    if not height:
+    if  height:
         return None
     width = len(grid[0])
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert None ==...
========================= 1 failed, 3 passed in 0.09s ==========================

113 : Job ID f0c48a52b07a44538464d574737400a6
test outcome: killed
breadth_first_search.py, start pos: (15, 7), end pos: (15, 17)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -12,7 +12,7 @@
         Coordinate of the target. Or None if cannot be found. 
     """
     height = len(grid)
-    if not height:
+    if not not height:
         return None
     width = len(grid[0])
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert None ==...
========================= 1 failed, 3 passed in 0.08s ==========================

114 : Job ID 1cb402f9edc04524a7f33608fd1eb7cc
test outcome: killed
breadth_first_search.py, start pos: (23, 7), end pos: (23, 39)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -20,7 +20,7 @@
     y_start = start[1]
     # short circuit the start lookup
-    if grid[y_start][x_start] == target:
+    if not grid[y_start][x_start] == target:
         return (x_start, y_start)
     visited = set()
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert (0, 0) ...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - assert (0,...
========================= 2 failed, 2 passed in 0.09s ==========================

115 : Job ID 3af3b0827bda464d9dbc34d957b21bb0
test outcome: killed
breadth_first_search.py, start pos: (31, 10), end pos: (31, 15)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -28,7 +28,7 @@
     queue = deque([(x_start, y_start)])
     visited.add((x_start, y_start))
-    while queue:
+    while not queue:
         current = queue.pop()
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert None ==...
========================= 1 failed, 3 passed in 0.08s ==========================

116 : Job ID f82d7a1e7bf94e6e91147ecd0fda29d4
test outcome: killed
breadth_first_search.py, start pos: (36, 15), end pos: (36, 84)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if not coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert (-2, 1)...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 2 failed, 2 passed in 0.09s ==========================

117 : Job ID b4269d8565cc4c118bc0f05272373f63
test outcome: killed
breadth_first_search.py, start pos: (38, 15), end pos: (38, 47)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -35,7 +35,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
-            if grid[coor[1]][coor[0]] == target:
+            if not grid[coor[1]][coor[0]] == target:
                 return coor
             else:
                 if coor not in visited:
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert (1, 0) ...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - assert (1,...
========================= 2 failed, 2 passed in 0.11s ==========================

118 : Job ID 4ba24c52fbd44eddb55acf28fa104ccd
test outcome: killed
breadth_first_search.py, start pos: (41, 19), end pos: (41, 38)
operator: core/AddNot, occurrence: 5
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -38,7 +38,7 @@
             if grid[coor[1]][coor[0]] == target:
                 return coor
             else:
-                if coor not in visited:
+                if not coor not in visited:
                     queue.appendleft(coor)
                     visited.add(current)
     return None
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert None ==...
========================= 1 failed, 3 passed in 0.09s ==========================

119 : Job ID 908e58b331634d939e8fea046cc4e8f9
test outcome: killed
breadth_first_search.py, start pos: (60, 10), end pos: (60, 15)
operator: core/AddNot, occurrence: 6
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -57,7 +57,7 @@
     visited = set([head])
     queue = [head]
-    while queue:
+    while not queue:
         current = queue.pop()
         for adjacent in current.adjacent_list:
ts-3-5/test_3-5_0-1_44.py ..F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_graph_target_found - assert None =...
========================= 1 failed, 3 passed in 0.08s ==========================

120 : Job ID 809b40543e1f42f39c0484979fc59ad5
test outcome: killed
breadth_first_search.py, start pos: (64, 15), end pos: (64, 34)
operator: core/AddNot, occurrence: 7
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -61,7 +61,7 @@
         current = queue.pop()
         for adjacent in current.adjacent_list:
-            if adjacent in visited:
+            if not adjacent in visited:
                 continue
             if adjacent.val == target:
ts-3-5/test_3-5_0-1_44.py ..F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_graph_target_found - assert None =...
========================= 1 failed, 3 passed in 0.08s ==========================

121 : Job ID 118fbf2c48794056b8e96a1033513ded
test outcome: killed
breadth_first_search.py, start pos: (67, 15), end pos: (67, 37)
operator: core/AddNot, occurrence: 8
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -64,7 +64,7 @@
             if adjacent in visited:
                 continue
-            if adjacent.val == target:
+            if not adjacent.val == target:
                 return adjacent
             else:
                 queue.insert(0, adjacent)
ts-3-5/test_3-5_0-1_44.py ..FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_graph_target_found - assert <test_...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_graph_target_not_found - assert <t...
========================= 2 failed, 2 passed in 0.08s ==========================

122 : Job ID 70effd5986a84e70a21f3bc2823dc23a
test outcome: killed
breadth_first_search.py, start pos: (36, 27), end pos: (36, 29)
operator: core/ReplaceOrWithAnd, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 and coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.08s ==========================
