123 : Job ID 10da1865b7f9483097097b4a52983f93
test outcome: killed
breadth_first_search.py, start pos: (36, 48), end pos: (36, 50)
operator: core/ReplaceOrWithAnd, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 and coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.09s ==========================

124 : Job ID 629ebb327e4543d09932f7fc30cd2809
test outcome: killed
breadth_first_search.py, start pos: (36, 63), end pos: (36, 65)
operator: core/ReplaceOrWithAnd, occurrence: 2
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 and coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.09s ==========================

125 : Job ID 920a361bac0f4e79b886ef780b80cf23
test outcome: killed
breadth_first_search.py, start pos: (37, 16), end pos: (37, 24)
operator: core/ReplaceContinueWithBreak, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -34,7 +34,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
-                continue
+                break
             if grid[coor[1]][coor[0]] == target:
                 return coor
             else:
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert None ==...
========================= 1 failed, 3 passed in 0.08s ==========================

126 : Job ID 6b0c13cc594b417390f0129982670dbc
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (65, 16), end pos: (65, 24)
operator: core/ReplaceContinueWithBreak, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -62,7 +62,7 @@
         for adjacent in current.adjacent_list:
             if adjacent in visited:
-                continue
+                break
             if adjacent.val == target:
                 return adjacent
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

127 : Job ID a5ba3c1e254f4c7f8892ef3bbb02c7be
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (17, 21), end pos: (17, 22)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -14,7 +14,7 @@
     height = len(grid)
     if not height:
         return None
-    width = len(grid[0])
+    width = len(grid[ 1])
     x_start = start[0]
     y_start = start[1]
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

128 : Job ID 6734dfd6484e4fa5bd0f19696eb75227
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (17, 21), end pos: (17, 22)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -14,7 +14,7 @@
     height = len(grid)
     if not height:
         return None
-    width = len(grid[0])
+    width = len(grid[ -1])
     x_start = start[0]
     y_start = start[1]
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

129 : Job ID f13566193e8a438f90efcc25871e2b54
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (19, 20), end pos: (19, 21)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -16,7 +16,7 @@
         return None
     width = len(grid[0])
-    x_start = start[0]
+    x_start = start[ 1]
     y_start = start[1]
     # short circuit the start lookup
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

130 : Job ID 09bbd258e0454d60947ec473cdcfc9a7
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (19, 20), end pos: (19, 21)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -16,7 +16,7 @@
         return None
     width = len(grid[0])
-    x_start = start[0]
+    x_start = start[ -1]
     y_start = start[1]
     # short circuit the start lookup
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

131 : Job ID e9804d3be0d04a64a3af69e1095019bc
test outcome: killed
breadth_first_search.py, start pos: (20, 20), end pos: (20, 21)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -17,7 +17,7 @@
     width = len(grid[0])
     x_start = start[0]
-    y_start = start[1]
+    y_start = start[ 2]
     # short circuit the start lookup
     if grid[y_start][x_start] == target:
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - IndexError: tu...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 2 failed, 2 passed in 0.09s ==========================

132 : Job ID 10ddc870a9cd46db9d8d243ff8114e60
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (20, 20), end pos: (20, 21)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -17,7 +17,7 @@
     width = len(grid[0])
     x_start = start[0]
-    y_start = start[1]
+    y_start = start[ 0]
     # short circuit the start lookup
     if grid[y_start][x_start] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

133 : Job ID 5af2aa663251410da225638b77aba57f
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 30), end pos: (35, 31)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[ 1], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

134 : Job ID 682d4c21c90046939ee4f9d52b534b1e
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 30), end pos: (35, 31)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[ -1], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

135 : Job ID cc905a8f62d64a9994afedf353642d1b
test outcome: killed
breadth_first_search.py, start pos: (35, 42), end pos: (35, 43)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[ 2]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - IndexError: tu...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 2 failed, 2 passed in 0.09s ==========================

136 : Job ID 5b9d37a89d5b4a6b83b3469229bf7ade
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 42), end pos: (35, 43)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[ 0]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.10s ===============================

137 : Job ID c5d0a2ca55434189abf163f0a9b4ee9e
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 45), end pos: (35, 46)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]- 2),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

138 : Job ID 66d89215690f476aa0b8297351d9e400
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 45), end pos: (35, 46)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]- 0),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

139 : Job ID 7ddfe7efe01e46f699b47a3bc127a3b4
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 57), end pos: (35, 58)
operator: core/NumberReplacer, occurrence: 12
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[ 1]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

140 : Job ID 2bdc8cdfb50c46ea9cb3861e8d7a8ec5
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 57), end pos: (35, 58)
operator: core/NumberReplacer, occurrence: 13
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[ -1]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

141 : Job ID 584011aa71c748d1b597df090fe7e01d
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 60), end pos: (35, 61)
operator: core/NumberReplacer, occurrence: 14
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]- 2, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

142 : Job ID ff2ad12e059d4ff683582223ee6f80db
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 60), end pos: (35, 61)
operator: core/NumberReplacer, occurrence: 15
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]- 0, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

143 : Job ID 7d5c916da3df4b6fabeb4174e935ec86
test outcome: killed
breadth_first_search.py, start pos: (35, 71), end pos: (35, 72)
operator: core/NumberReplacer, occurrence: 16
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[ 2]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - IndexError: tu...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 2 failed, 2 passed in 0.08s ==========================

144 : Job ID fe7877e4ba384b6d8be086eabbe0ec97
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 71), end pos: (35, 72)
operator: core/NumberReplacer, occurrence: 17
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[ 0]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

145 : Job ID 5ce811c0144e45db826b5992c26f29d5
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 84), end pos: (35, 85)
operator: core/NumberReplacer, occurrence: 18
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[ 1]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

146 : Job ID f0fcfc3f03cf42ef934d61eb45804e51
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 84), end pos: (35, 85)
operator: core/NumberReplacer, occurrence: 19
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[ -1]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

147 : Job ID ded93c27cdbb4b45acb9eb9d95365790
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 87), end pos: (35, 88)
operator: core/NumberReplacer, occurrence: 20
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+ 2, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

148 : Job ID 9b316e5c669a45058d08b8520901a165
test outcome: killed
breadth_first_search.py, start pos: (35, 87), end pos: (35, 88)
operator: core/NumberReplacer, occurrence: 21
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+ 0, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert None ==...
========================= 1 failed, 3 passed in 0.08s ==========================

149 : Job ID 7a25aeb000e44c37a5dfa66c44595af6
test outcome: killed
breadth_first_search.py, start pos: (35, 98), end pos: (35, 99)
operator: core/NumberReplacer, occurrence: 22
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[ 2]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - IndexError: tu...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 2 failed, 2 passed in 0.08s ==========================

150 : Job ID 2c29658f21b646f2a0485f77479a1ce2
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 98), end pos: (35, 99)
operator: core/NumberReplacer, occurrence: 23
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[ 0]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

151 : Job ID 0da69cc4ca9c4e4ba846d8f4b35f7996
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 111), end pos: (35, 112)
operator: core/NumberReplacer, occurrence: 24
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[ 1], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

152 : Job ID d5a12c2664914dcb96f8d6f05a8f57da
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 111), end pos: (35, 112)
operator: core/NumberReplacer, occurrence: 25
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[ -1], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

153 : Job ID 7d0f5514b0ae4fc5b75d16f6a041892d
test outcome: killed
breadth_first_search.py, start pos: (35, 123), end pos: (35, 124)
operator: core/NumberReplacer, occurrence: 26
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[ 2]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - IndexError: tu...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 2 failed, 2 passed in 0.09s ==========================

154 : Job ID 6c696e36dd4a4f55ad054ece3686f694
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 123), end pos: (35, 124)
operator: core/NumberReplacer, occurrence: 27
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[ 0]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

155 : Job ID d89cafdb4c274ce6936eeae360630a45
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (35, 126), end pos: (35, 127)
operator: core/NumberReplacer, occurrence: 28
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+ 2)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================
