156 : Job ID 6f606ff6da3246ef841dabec9e3a943e
test outcome: killed
breadth_first_search.py, start pos: (35, 126), end pos: (35, 127)
operator: core/NumberReplacer, occurrence: 29
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+ 0)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert None ==...
========================= 1 failed, 3 passed in 0.08s ==========================

157 : Job ID 6dbad857214c4ff8a611f2f223c131b3
test outcome: killed
breadth_first_search.py, start pos: (36, 20), end pos: (36, 21)
operator: core/NumberReplacer, occurrence: 30
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[ 1] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.08s ==========================

158 : Job ID e7f0d0248e1e43d09bf034c7476c235f
test outcome: killed
breadth_first_search.py, start pos: (36, 20), end pos: (36, 21)
operator: core/NumberReplacer, occurrence: 31
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[ -1] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.09s ==========================

159 : Job ID ea6b1f519073469ebe2153834d17af84
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (36, 25), end pos: (36, 26)
operator: core/NumberReplacer, occurrence: 32
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 1 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

160 : Job ID 46867c132d5c454f99f6b9c1e3de1968
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (36, 25), end pos: (36, 26)
operator: core/NumberReplacer, occurrence: 33
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < -1 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

161 : Job ID af16da53ac4844f98df84673673435d6
test outcome: killed
breadth_first_search.py, start pos: (36, 35), end pos: (36, 36)
operator: core/NumberReplacer, occurrence: 34
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[ 1] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.09s ==========================

162 : Job ID 83011490cd8644f79af22d6cce2c202e
test outcome: killed
breadth_first_search.py, start pos: (36, 35), end pos: (36, 36)
operator: core/NumberReplacer, occurrence: 35
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[ -1] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.09s ==========================

163 : Job ID 919d93ea785143c6ab9e71da9542b499
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (36, 46), end pos: (36, 47)
operator: core/NumberReplacer, occurrence: 36
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width- 2 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

164 : Job ID a501bb3b4dd74c4380015d4d95cd65df
test outcome: killed
breadth_first_search.py, start pos: (36, 46), end pos: (36, 47)
operator: core/NumberReplacer, occurrence: 37
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width- 0 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.08s ==========================

165 : Job ID da4308a081234223a73e0062fd9c2028
test outcome: killed
breadth_first_search.py, start pos: (36, 56), end pos: (36, 57)
operator: core/NumberReplacer, occurrence: 38
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[ 2] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - IndexError: tu...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 2 failed, 2 passed in 0.09s ==========================

166 : Job ID c81438f9771a4e5ba8146df474a8c2e4
test outcome: killed
breadth_first_search.py, start pos: (36, 56), end pos: (36, 57)
operator: core/NumberReplacer, occurrence: 39
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[ 0] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.09s ==========================

167 : Job ID 38f466397c4c4e2c88b75254ea9c9860
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (36, 61), end pos: (36, 62)
operator: core/NumberReplacer, occurrence: 40
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 1 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

168 : Job ID 215f7ddecfb2455d82f499da590ac0f5
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (36, 61), end pos: (36, 62)
operator: core/NumberReplacer, occurrence: 41
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < -1 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

169 : Job ID 20b8c6676eb846bd93ead54eb6d0a948
test outcome: killed
breadth_first_search.py, start pos: (36, 71), end pos: (36, 72)
operator: core/NumberReplacer, occurrence: 42
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[ 2] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - IndexError: tu...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 2 failed, 2 passed in 0.08s ==========================

170 : Job ID 330e501a37c3477ab8a8b3cef4e43121
test outcome: killed
breadth_first_search.py, start pos: (36, 71), end pos: (36, 72)
operator: core/NumberReplacer, occurrence: 43
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[ 0] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.08s ==========================

171 : Job ID f10d9806f332413fb20d0d059b11c1ca
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (36, 83), end pos: (36, 84)
operator: core/NumberReplacer, occurrence: 44
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height- 2:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

172 : Job ID e5242ad0c11748bba941b50924b12dc9
test outcome: killed
breadth_first_search.py, start pos: (36, 83), end pos: (36, 84)
operator: core/NumberReplacer, occurrence: 45
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -33,7 +33,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
-            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
+            if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height- 0:
                 continue
             if grid[coor[1]][coor[0]] == target:
                 return coor
ts-3-5/test_3-5_0-1_44.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 1 failed, 3 passed in 0.08s ==========================

173 : Job ID 25684634a912485a9752db06e5bd0642
test outcome: killed
breadth_first_search.py, start pos: (38, 25), end pos: (38, 26)
operator: core/NumberReplacer, occurrence: 46
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -35,7 +35,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
-            if grid[coor[1]][coor[0]] == target:
+            if grid[coor[ 2]][coor[0]] == target:
                 return coor
             else:
                 if coor not in visited:
ts-3-5/test_3-5_0-1_44.py FF..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - IndexError: tu...
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_not_found - IndexError...
========================= 2 failed, 2 passed in 0.08s ==========================

174 : Job ID 2d880aa525904803acd7c7221f066d46
test outcome: killed
breadth_first_search.py, start pos: (38, 25), end pos: (38, 26)
operator: core/NumberReplacer, occurrence: 47
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -35,7 +35,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
-            if grid[coor[1]][coor[0]] == target:
+            if grid[coor[ 0]][coor[0]] == target:
                 return coor
             else:
                 if coor not in visited:
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert (1, 0) ...
========================= 1 failed, 3 passed in 0.08s ==========================

175 : Job ID 91f0ca2ca13348449b0cfd575e886bb5
test outcome: killed
breadth_first_search.py, start pos: (38, 34), end pos: (38, 35)
operator: core/NumberReplacer, occurrence: 48
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -35,7 +35,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
-            if grid[coor[1]][coor[0]] == target:
+            if grid[coor[1]][coor[ 1]] == target:
                 return coor
             else:
                 if coor not in visited:
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert (0, 1) ...
========================= 1 failed, 3 passed in 0.08s ==========================

176 : Job ID bf210ec051a34a90ad4404ab5ef9805d
test outcome: killed
breadth_first_search.py, start pos: (38, 34), end pos: (38, 35)
operator: core/NumberReplacer, occurrence: 49
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -35,7 +35,7 @@
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
-            if grid[coor[1]][coor[0]] == target:
+            if grid[coor[1]][coor[ -1]] == target:
                 return coor
             else:
                 if coor not in visited:
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert (0, 1) ...
========================= 1 failed, 3 passed in 0.09s ==========================

177 : Job ID 4030e9ca29a6498dace89d651200fd50
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (70, 29), end pos: (70, 30)
operator: core/NumberReplacer, occurrence: 50
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -67,7 +67,7 @@
             if adjacent.val == target:
                 return adjacent
             else:
-                queue.insert(0, adjacent)
+                queue.insert( 1, adjacent)
                 visited.add(adjacent)
     return None
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.09s ===============================

178 : Job ID 77c16939703440fea1eba53be3de3d57
SURVIVED
test outcome: survived
breadth_first_search.py, start pos: (70, 29), end pos: (70, 30)
operator: core/NumberReplacer, occurrence: 51
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -67,7 +67,7 @@
             if adjacent.val == target:
                 return adjacent
             else:
-                queue.insert(0, adjacent)
+                queue.insert( -1, adjacent)
                 visited.add(adjacent)
     return None
ts-3-5/test_3-5_0-1_44.py ....                                           [100%]
============================== 4 passed in 0.08s ===============================

179 : Job ID 4f7cde5d3dd947beb7f448d86293a539
test outcome: killed
breadth_first_search.py, start pos: (35, 20), end pos: (35, 129)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -32,7 +32,7 @@
         current = queue.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in []:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_0-1_44.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_grid_target_found - assert None ==...
========================= 1 failed, 3 passed in 0.09s ==========================

180 : Job ID 0c982320aaf34212bde48fde692db68a
test outcome: killed
breadth_first_search.py, start pos: (63, 24), end pos: (63, 45)
operator: core/ZeroIterationForLoop, occurrence: 1
--- mutation diff ---
--- abreadth_first_search.py
+++ bbreadth_first_search.py
@@ -60,7 +60,7 @@
     while queue:
         current = queue.pop()
-        for adjacent in current.adjacent_list:
+        for adjacent in []:
             if adjacent in visited:
                 continue
ts-3-5/test_3-5_0-1_44.py ..F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-1_44.py::test_bfs_graph_target_found - assert None =...
========================= 1 failed, 3 passed in 0.08s ==========================
