   - [#   1] AOR breadth_first_search: 
--------------------------------------------------------------------------------
  31:     while queue:
  32:         current = queue.pop()
  33:         
  34:         
- 35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
+ 35:         for coor in [(current[0], current[1] + 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
  36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
  37:                 continue
  38:             if grid[coor[1]][coor[0]] == target:
  39:                 return coor
--------------------------------------------------------------------------------
[0.13313 s] survived

   - [#   2] AOR breadth_first_search: 
--------------------------------------------------------------------------------
  31:     while queue:
  32:         current = queue.pop()
  33:         
  34:         
- 35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
+ 35:         for coor in [(current[0], current[1] - 1), (current[0] + 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
  36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
  37:                 continue
  38:             if grid[coor[1]][coor[0]] == target:
  39:                 return coor
--------------------------------------------------------------------------------
[0.12507 s] survived

   - [#   3] AOR breadth_first_search: 
--------------------------------------------------------------------------------
  31:     while queue:
  32:         current = queue.pop()
  33:         
  34:         
- 35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
+ 35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] - 1, current[1]), (current[0], current[1] + 1)]:
  36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
  37:                 continue
  38:             if grid[coor[1]][coor[0]] == target:
  39:                 return coor
--------------------------------------------------------------------------------
[0.12574 s] survived

   - [#   4] AOR breadth_first_search: 
--------------------------------------------------------------------------------
  31:     while queue:
  32:         current = queue.pop()
  33:         
  34:         
- 35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
+ 35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] - 1)]:
  36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
  37:                 continue
  38:             if grid[coor[1]][coor[0]] == target:
  39:                 return coor
--------------------------------------------------------------------------------
[0.12930 s] survived

   - [#   5] AOR breadth_first_search: 
--------------------------------------------------------------------------------
  32:         current = queue.pop()
  33:         
  34:         
  35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
- 36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
+ 36:             if (coor[0] < 0 or coor[0] > width + 1 or coor[1] < 0 or coor[1] > height - 1):
  37:                 continue
  38:             if grid[coor[1]][coor[0]] == target:
  39:                 return coor
  40:             
--------------------------------------------------------------------------------
[0.15177 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_target_not_found

def test_breadth_first_search_target_not_found():
        grid = [[1, 2], [3, 4]]
        start = (0, 0)
        target = 5
>       assert breadth_first_search(grid, start, target) == None

ts-3-5/test_3-5_0-2_85.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

grid = [[1, 2], [3, 4]], start = (0, 0), target = 5

>   ???
E   IndexError: list index out of range

breadth_first_search:38: IndexError

   - [#   6] AOR breadth_first_search: 
--------------------------------------------------------------------------------
  32:         current = queue.pop()
  33:         
  34:         
  35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
- 36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
+ 36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height + 1):
  37:                 continue
  38:             if grid[coor[1]][coor[0]] == target:
  39:                 return coor
  40:             
--------------------------------------------------------------------------------
[0.15186 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_target_not_found

def test_breadth_first_search_target_not_found():
        grid = [[1, 2], [3, 4]]
        start = (0, 0)
        target = 5
>       assert breadth_first_search(grid, start, target) == None

ts-3-5/test_3-5_0-2_85.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

grid = [[1, 2], [3, 4]], start = (0, 0), target = 5

>   ???
E   IndexError: list index out of range

breadth_first_search:38: IndexError

   - [#   7] BCR breadth_first_search: 
--------------------------------------------------------------------------------
  33:         
  34:         
  35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
  36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
- 37:                 continue
+ 37:                 break
  38:             if grid[coor[1]][coor[0]] == target:
  39:                 return coor
  40:             
  41:             elif coor not in visited:
--------------------------------------------------------------------------------
[0.12098 s] survived

   - [#  10] COD breadth_first_search: 
--------------------------------------------------------------------------------
  37:                 continue
  38:             if grid[coor[1]][coor[0]] == target:
  39:                 return coor
  40:             
- 41:             elif coor not in visited:
+ 41:             elif coor in visited:
  42:                 queue.appendleft(coor)
  43:                 visited.add(current)
  44:     return None
  45: 
--------------------------------------------------------------------------------
[0.12406 s] survived

   - [#  11] COI breadth_first_search: 
--------------------------------------------------------------------------------
  11:     Returns:
  12:         Coordinate of the target. Or None if cannot be found. 
  13:     '''
  14:     height = len(grid)
- 15:     if not height:
+ 15:     if not ((not height)):
  16:         return None
  17:     width = len(grid[0])
  18:     
  19:     x_start = start[0]
--------------------------------------------------------------------------------
[0.14950 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_empty_grid

def test_breadth_first_search_empty_grid():
        grid = []
        start = (0, 0)
        target = 1
>       assert breadth_first_search(grid, start, target) == None

ts-3-5/test_3-5_0-2_85.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

grid = [], start = (0, 0), target = 1

>   ???
E   IndexError: list index out of range

breadth_first_search:17: IndexError

   - [#  12] COI breadth_first_search: 
--------------------------------------------------------------------------------
  19:     x_start = start[0]
  20:     y_start = start[1]
  21:     
  22:     
- 23:     if grid[y_start][x_start] == target:
+ 23:     if not (grid[y_start][x_start] == target):
  24:         return (x_start, y_start)
  25:     
  26:     visited = set()
  27:     
--------------------------------------------------------------------------------
[0.15083 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_target_not_found

def test_breadth_first_search_target_not_found():
        grid = [[1, 2], [3, 4]]
        start = (0, 0)
        target = 5
>       assert breadth_first_search(grid, start, target) == None
E       AssertionError

ts-3-5/test_3-5_0-2_85.py:28: AssertionError

   - [#  13] COI breadth_first_search: 
--------------------------------------------------------------------------------
  27:     
  28:     queue = deque([(x_start, y_start)])
  29:     visited.add((x_start, y_start))
  30:     
- 31:     while queue:
+ 31:     while not queue:
  32:         current = queue.pop()
  33:         
  34:         
  35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
--------------------------------------------------------------------------------
[0.11957 s] survived

   - [#  14] COI breadth_first_search: 
--------------------------------------------------------------------------------
  32:         current = queue.pop()
  33:         
  34:         
  35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
- 36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
+ 36:             if not ((coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1)):
  37:                 continue
  38:             if grid[coor[1]][coor[0]] == target:
  39:                 return coor
  40:             
--------------------------------------------------------------------------------
[0.14963 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_target_not_found

def test_breadth_first_search_target_not_found():
        grid = [[1, 2], [3, 4]]
        start = (0, 0)
        target = 5
>       assert breadth_first_search(grid, start, target) == None

ts-3-5/test_3-5_0-2_85.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

grid = [[1, 2], [3, 4]], start = (0, 0), target = 5

>   ???
E   IndexError: list index out of range

breadth_first_search:38: IndexError

   - [#  15] COI breadth_first_search: 
--------------------------------------------------------------------------------
  34:         
  35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
  36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
  37:                 continue
- 38:             if grid[coor[1]][coor[0]] == target:
+ 38:             if not (grid[coor[1]][coor[0]] == target):
  39:                 return coor
  40:             
  41:             elif coor not in visited:
  42:                 queue.appendleft(coor)
--------------------------------------------------------------------------------
[0.14696 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_target_not_found

def test_breadth_first_search_target_not_found():
        grid = [[1, 2], [3, 4]]
        start = (0, 0)
        target = 5
>       assert breadth_first_search(grid, start, target) == None
E       AssertionError

ts-3-5/test_3-5_0-2_85.py:28: AssertionError

   - [#  16] COI breadth_first_search: 
--------------------------------------------------------------------------------
  37:                 continue
  38:             if grid[coor[1]][coor[0]] == target:
  39:                 return coor
  40:             
- 41:             elif coor not in visited:
+ 41:             elif not (coor not in visited):
  42:                 queue.appendleft(coor)
  43:                 visited.add(current)
  44:     return None
  45: 
--------------------------------------------------------------------------------
[0.13891 s] survived

   - [#  18] COI breadth_first_search: 
--------------------------------------------------------------------------------
  60:     while queue:
  61:         current = queue.pop()
  62:         
  63:         for adjacent in current.adjacent_list:
- 64:             if adjacent in visited:
+ 64:             if not (adjacent in visited):
  65:                 continue
  66:             
  67:             if adjacent.val == target:
  68:                 return adjacent
--------------------------------------------------------------------------------
[0.14990 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_graph_target_found

def test_breadth_first_search_graph_target_found():
        node1 = Node(1)
        node2 = Node(2)
        node3 = Node(3)
        node4 = Node(4)
    
        node1.adjacent_list = [node2, node3]
        node2.adjacent_list = [node1, node4]
        node3.adjacent_list = [node1]
        node4.adjacent_list = [node2]
    
        head = node1
        target = 4
    
>       assert breadth_first_search_graph(head, target) == node4
E       AssertionError

ts-3-5/test_3-5_0-2_85.py:50: AssertionError

   - [#  19] COI breadth_first_search: 
--------------------------------------------------------------------------------
  60:     while queue:
  61:         current = queue.pop()
  62:         
  63:         for adjacent in current.adjacent_list:
- 64:             if adjacent in visited:
+ 64:             if adjacent not in visited:
  65:                 continue
  66:             
  67:             if adjacent.val == target:
  68:                 return adjacent
--------------------------------------------------------------------------------
[0.14832 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_graph_target_found

def test_breadth_first_search_graph_target_found():
        node1 = Node(1)
        node2 = Node(2)
        node3 = Node(3)
        node4 = Node(4)
    
        node1.adjacent_list = [node2, node3]
        node2.adjacent_list = [node1, node4]
        node3.adjacent_list = [node1]
        node4.adjacent_list = [node2]
    
        head = node1
        target = 4
    
>       assert breadth_first_search_graph(head, target) == node4
E       AssertionError

ts-3-5/test_3-5_0-2_85.py:50: AssertionError

   - [#  20] COI breadth_first_search: 
--------------------------------------------------------------------------------
  63:         for adjacent in current.adjacent_list:
  64:             if adjacent in visited:
  65:                 continue
  66:             
- 67:             if adjacent.val == target:
+ 67:             if not (adjacent.val == target):
  68:                 return adjacent
  69:             else:
  70:                 queue.insert(0, adjacent)
  71:                 visited.add(adjacent)
--------------------------------------------------------------------------------
[0.14129 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_graph_target_found

def test_breadth_first_search_graph_target_found():
        node1 = Node(1)
        node2 = Node(2)
        node3 = Node(3)
        node4 = Node(4)
    
        node1.adjacent_list = [node2, node3]
        node2.adjacent_list = [node1, node4]
        node3.adjacent_list = [node1]
        node4.adjacent_list = [node2]
    
        head = node1
        target = 4
    
>       assert breadth_first_search_graph(head, target) == node4
E       AssertionError

ts-3-5/test_3-5_0-2_85.py:50: AssertionError

   - [#  21] LCR breadth_first_search: 
--------------------------------------------------------------------------------
  32:         current = queue.pop()
  33:         
  34:         
  35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
- 36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
+ 36:             if (coor[0] < 0 and coor[0] > width - 1 and coor[1] < 0 and coor[1] > height - 1):
  37:                 continue
  38:             if grid[coor[1]][coor[0]] == target:
  39:                 return coor
  40:             
--------------------------------------------------------------------------------
[0.14435 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_target_not_found

def test_breadth_first_search_target_not_found():
        grid = [[1, 2], [3, 4]]
        start = (0, 0)
        target = 5
>       assert breadth_first_search(grid, start, target) == None

ts-3-5/test_3-5_0-2_85.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

grid = [[1, 2], [3, 4]], start = (0, 0), target = 5

>   ???
E   IndexError: list index out of range

breadth_first_search:38: IndexError

   - [#  22] OIL breadth_first_search: 
--------------------------------------------------------------------------------
  39:                 return coor
  40:             
  41:             elif coor not in visited:
  42:                 queue.appendleft(coor)
- 43:                 visited.add(current)
+ 43:                 visited.add(current)break
  44:     return None
  45: 
  46: def breadth_first_search_graph(head, target):
  47:     '''
--------------------------------------------------------------------------------
[0.11834 s] survived

   - [#  24] OIL breadth_first_search: 
--------------------------------------------------------------------------------
  67:             if adjacent.val == target:
  68:                 return adjacent
  69:             else:
  70:                 queue.insert(0, adjacent)
- 71:                 visited.add(adjacent)
+ 71:                 visited.add(adjacent)break
  72:     return None
--------------------------------------------------------------------------------
[0.14316 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_graph_target_found

def test_breadth_first_search_graph_target_found():
        node1 = Node(1)
        node2 = Node(2)
        node3 = Node(3)
        node4 = Node(4)
    
        node1.adjacent_list = [node2, node3]
        node2.adjacent_list = [node1, node4]
        node3.adjacent_list = [node1]
        node4.adjacent_list = [node2]
    
        head = node1
        target = 4
    
>       assert breadth_first_search_graph(head, target) == node4
E       AssertionError

ts-3-5/test_3-5_0-2_85.py:50: AssertionError

   - [#  26] RIL breadth_first_search: 
--------------------------------------------------------------------------------
  31:     while queue:
  32:         current = queue.pop()
  33:         
  34:         
- 35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
+ 35:         for coor in reversed([(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]):
  36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
  37:                 continue
  38:             if grid[coor[1]][coor[0]] == target:
  39:                 return coor
--------------------------------------------------------------------------------
[0.11761 s] survived

   - [#  27] RIL breadth_first_search: 
--------------------------------------------------------------------------------
  59:     
  60:     while queue:
  61:         current = queue.pop()
  62:         
- 63:         for adjacent in current.adjacent_list:
+ 63:         for adjacent in reversed(current.adjacent_list):
  64:             if adjacent in visited:
  65:                 continue
  66:             
  67:             if adjacent.val == target:
--------------------------------------------------------------------------------
[0.11709 s] survived

   - [#  28] ROR breadth_first_search: 
--------------------------------------------------------------------------------
  19:     x_start = start[0]
  20:     y_start = start[1]
  21:     
  22:     
- 23:     if grid[y_start][x_start] == target:
+ 23:     if grid[y_start][x_start] != target:
  24:         return (x_start, y_start)
  25:     
  26:     visited = set()
  27:     
--------------------------------------------------------------------------------
[0.14373 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_target_not_found

def test_breadth_first_search_target_not_found():
        grid = [[1, 2], [3, 4]]
        start = (0, 0)
        target = 5
>       assert breadth_first_search(grid, start, target) == None
E       AssertionError

ts-3-5/test_3-5_0-2_85.py:28: AssertionError

   - [#  29] ROR breadth_first_search: 
--------------------------------------------------------------------------------
  32:         current = queue.pop()
  33:         
  34:         
  35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
- 36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
+ 36:             if (coor[0] > 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
  37:                 continue
  38:             if grid[coor[1]][coor[0]] == target:
  39:                 return coor
  40:             
--------------------------------------------------------------------------------
[0.14396 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_target_not_found

def test_breadth_first_search_target_not_found():
        grid = [[1, 2], [3, 4]]
        start = (0, 0)
        target = 5
>       assert breadth_first_search(grid, start, target) == None

ts-3-5/test_3-5_0-2_85.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

grid = [[1, 2], [3, 4]], start = (0, 0), target = 5

>   ???
E   IndexError: list index out of range

breadth_first_search:38: IndexError

   - [#  30] ROR breadth_first_search: 
--------------------------------------------------------------------------------
  32:         current = queue.pop()
  33:         
  34:         
  35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
- 36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
+ 36:             if (coor[0] <= 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
  37:                 continue
  38:             if grid[coor[1]][coor[0]] == target:
  39:                 return coor
  40:             
--------------------------------------------------------------------------------
[0.11807 s] survived

   - [#  31] ROR breadth_first_search: 
--------------------------------------------------------------------------------
  32:         current = queue.pop()
  33:         
  34:         
  35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
- 36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
+ 36:             if (coor[0] < 0 or coor[0] < width - 1 or coor[1] < 0 or coor[1] > height - 1):
  37:                 continue
  38:             if grid[coor[1]][coor[0]] == target:
  39:                 return coor
  40:             
--------------------------------------------------------------------------------
[0.15949 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_target_not_found

def test_breadth_first_search_target_not_found():
        grid = [[1, 2], [3, 4]]
        start = (0, 0)
        target = 5
>       assert breadth_first_search(grid, start, target) == None

ts-3-5/test_3-5_0-2_85.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

grid = [[1, 2], [3, 4]], start = (0, 0), target = 5

>   ???
E   IndexError: list index out of range

breadth_first_search:38: IndexError

   - [#  32] ROR breadth_first_search: 
--------------------------------------------------------------------------------
  32:         current = queue.pop()
  33:         
  34:         
  35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
- 36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
+ 36:             if (coor[0] < 0 or coor[0] >= width - 1 or coor[1] < 0 or coor[1] > height - 1):
  37:                 continue
  38:             if grid[coor[1]][coor[0]] == target:
  39:                 return coor
  40:             
--------------------------------------------------------------------------------
[0.11816 s] survived

   - [#  33] ROR breadth_first_search: 
--------------------------------------------------------------------------------
  32:         current = queue.pop()
  33:         
  34:         
  35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
- 36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
+ 36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] > 0 or coor[1] > height - 1):
  37:                 continue
  38:             if grid[coor[1]][coor[0]] == target:
  39:                 return coor
  40:             
--------------------------------------------------------------------------------
[0.14602 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_target_not_found

def test_breadth_first_search_target_not_found():
        grid = [[1, 2], [3, 4]]
        start = (0, 0)
        target = 5
>       assert breadth_first_search(grid, start, target) == None

ts-3-5/test_3-5_0-2_85.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

grid = [[1, 2], [3, 4]], start = (0, 0), target = 5

>   ???
E   IndexError: list index out of range

breadth_first_search:38: IndexError

   - [#  34] ROR breadth_first_search: 
--------------------------------------------------------------------------------
  32:         current = queue.pop()
  33:         
  34:         
  35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
- 36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
+ 36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] <= 0 or coor[1] > height - 1):
  37:                 continue
  38:             if grid[coor[1]][coor[0]] == target:
  39:                 return coor
  40:             
--------------------------------------------------------------------------------
[0.11948 s] survived

   - [#  35] ROR breadth_first_search: 
--------------------------------------------------------------------------------
  32:         current = queue.pop()
  33:         
  34:         
  35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
- 36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
+ 36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] < height - 1):
  37:                 continue
  38:             if grid[coor[1]][coor[0]] == target:
  39:                 return coor
  40:             
--------------------------------------------------------------------------------
[0.14407 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_target_not_found

def test_breadth_first_search_target_not_found():
        grid = [[1, 2], [3, 4]]
        start = (0, 0)
        target = 5
>       assert breadth_first_search(grid, start, target) == None

ts-3-5/test_3-5_0-2_85.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

grid = [[1, 2], [3, 4]], start = (0, 0), target = 5

>   ???
E   IndexError: list index out of range

breadth_first_search:38: IndexError

   - [#  36] ROR breadth_first_search: 
--------------------------------------------------------------------------------
  32:         current = queue.pop()
  33:         
  34:         
  35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
- 36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
+ 36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] >= height - 1):
  37:                 continue
  38:             if grid[coor[1]][coor[0]] == target:
  39:                 return coor
  40:             
--------------------------------------------------------------------------------
[0.11698 s] survived
