   - [#  38] ROR breadth_first_search: 
--------------------------------------------------------------------------------
  63:         for adjacent in current.adjacent_list:
  64:             if adjacent in visited:
  65:                 continue
  66:             
- 67:             if adjacent.val == target:
+ 67:             if adjacent.val != target:
  68:                 return adjacent
  69:             else:
  70:                 queue.insert(0, adjacent)
  71:                 visited.add(adjacent)
--------------------------------------------------------------------------------
[0.14554 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_graph_target_found

def test_breadth_first_search_graph_target_found():
        node1 = Node(1)
        node2 = Node(2)
        node3 = Node(3)
        node4 = Node(4)
    
        node1.adjacent_list = [node2, node3]
        node2.adjacent_list = [node1, node4]
        node3.adjacent_list = [node1]
        node4.adjacent_list = [node2]
    
        head = node1
        target = 4
    
>       assert breadth_first_search_graph(head, target) == node4
E       AssertionError

ts-3-5/test_3-5_0-2_85.py:50: AssertionError

   - [#  39] SDL breadth_first_search: 
--------------------------------------------------------------------------------
  10:         target: the target value to find in the grid
  11:     Returns:
  12:         Coordinate of the target. Or None if cannot be found. 
  13:     '''
- 14:     height = len(grid)
+ 14:     pass
  15:     if not height:
  16:         return None
  17:     width = len(grid[0])
  18:     
--------------------------------------------------------------------------------
[0.14080 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_empty_grid

def test_breadth_first_search_empty_grid():
        grid = []
        start = (0, 0)
        target = 1
>       assert breadth_first_search(grid, start, target) == None

ts-3-5/test_3-5_0-2_85.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

grid = [], start = (0, 0), target = 1

>   ???
E   NameError: name 'height' is not defined

breadth_first_search:15: NameError

   - [#  40] SDL breadth_first_search: 
--------------------------------------------------------------------------------
  12:         Coordinate of the target. Or None if cannot be found. 
  13:     '''
  14:     height = len(grid)
  15:     if not height:
- 16:         return None
+ 16:         pass
  17:     width = len(grid[0])
  18:     
  19:     x_start = start[0]
  20:     y_start = start[1]
--------------------------------------------------------------------------------
[0.14198 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_empty_grid

def test_breadth_first_search_empty_grid():
        grid = []
        start = (0, 0)
        target = 1
>       assert breadth_first_search(grid, start, target) == None

ts-3-5/test_3-5_0-2_85.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

grid = [], start = (0, 0), target = 1

>   ???
E   IndexError: list index out of range

breadth_first_search:17: IndexError

   - [#  41] SDL breadth_first_search: 
--------------------------------------------------------------------------------
  13:     '''
  14:     height = len(grid)
  15:     if not height:
  16:         return None
- 17:     width = len(grid[0])
+ 17:     pass
  18:     
  19:     x_start = start[0]
  20:     y_start = start[1]
  21:     
--------------------------------------------------------------------------------
[0.14804 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_target_not_found

def test_breadth_first_search_target_not_found():
        grid = [[1, 2], [3, 4]]
        start = (0, 0)
        target = 5
>       assert breadth_first_search(grid, start, target) == None

ts-3-5/test_3-5_0-2_85.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

grid = [[1, 2], [3, 4]], start = (0, 0), target = 5

>   ???
E   NameError: name 'width' is not defined

breadth_first_search:36: NameError

   - [#  42] SDL breadth_first_search: 
--------------------------------------------------------------------------------
  15:     if not height:
  16:         return None
  17:     width = len(grid[0])
  18:     
- 19:     x_start = start[0]
+ 19:     pass
  20:     y_start = start[1]
  21:     
  22:     
  23:     if grid[y_start][x_start] == target:
--------------------------------------------------------------------------------
[0.14354 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_target_at_start

def test_breadth_first_search_target_at_start():
        grid = [[1, 2], [3, 4]]
        start = (0, 0)
        target = 1
>       assert breadth_first_search(grid, start, target) == (0, 0)

ts-3-5/test_3-5_0-2_85.py:22: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

grid = [[1, 2], [3, 4]], start = (0, 0), target = 1

>   ???
E   NameError: name 'x_start' is not defined

breadth_first_search:23: NameError

   - [#  43] SDL breadth_first_search: 
--------------------------------------------------------------------------------
  16:         return None
  17:     width = len(grid[0])
  18:     
  19:     x_start = start[0]
- 20:     y_start = start[1]
+ 20:     pass
  21:     
  22:     
  23:     if grid[y_start][x_start] == target:
  24:         return (x_start, y_start)
--------------------------------------------------------------------------------
[0.14298 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_target_at_start

def test_breadth_first_search_target_at_start():
        grid = [[1, 2], [3, 4]]
        start = (0, 0)
        target = 1
>       assert breadth_first_search(grid, start, target) == (0, 0)

ts-3-5/test_3-5_0-2_85.py:22: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

grid = [[1, 2], [3, 4]], start = (0, 0), target = 1

>   ???
E   NameError: name 'y_start' is not defined

breadth_first_search:23: NameError

   - [#  44] SDL breadth_first_search: 
--------------------------------------------------------------------------------
  20:     y_start = start[1]
  21:     
  22:     
  23:     if grid[y_start][x_start] == target:
- 24:         return (x_start, y_start)
+ 24:         pass
  25:     
  26:     visited = set()
  27:     
  28:     queue = deque([(x_start, y_start)])
--------------------------------------------------------------------------------
[0.12003 s] survived

   - [#  45] SDL breadth_first_search: 
--------------------------------------------------------------------------------
  22:     
  23:     if grid[y_start][x_start] == target:
  24:         return (x_start, y_start)
  25:     
- 26:     visited = set()
+ 26:     pass
  27:     
  28:     queue = deque([(x_start, y_start)])
  29:     visited.add((x_start, y_start))
  30:     
--------------------------------------------------------------------------------
[0.14361 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_target_not_found

def test_breadth_first_search_target_not_found():
        grid = [[1, 2], [3, 4]]
        start = (0, 0)
        target = 5
>       assert breadth_first_search(grid, start, target) == None

ts-3-5/test_3-5_0-2_85.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

grid = [[1, 2], [3, 4]], start = (0, 0), target = 5

>   ???
E   NameError: name 'visited' is not defined

breadth_first_search:29: NameError

   - [#  46] SDL breadth_first_search: 
--------------------------------------------------------------------------------
  24:         return (x_start, y_start)
  25:     
  26:     visited = set()
  27:     
- 28:     queue = deque([(x_start, y_start)])
+ 28:     pass
  29:     visited.add((x_start, y_start))
  30:     
  31:     while queue:
  32:         current = queue.pop()
--------------------------------------------------------------------------------
[0.15999 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_target_not_found

def test_breadth_first_search_target_not_found():
        grid = [[1, 2], [3, 4]]
        start = (0, 0)
        target = 5
>       assert breadth_first_search(grid, start, target) == None

ts-3-5/test_3-5_0-2_85.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

grid = [[1, 2], [3, 4]], start = (0, 0), target = 5

>   ???
E   NameError: name 'queue' is not defined

breadth_first_search:31: NameError

   - [#  47] SDL breadth_first_search: 
--------------------------------------------------------------------------------
  25:     
  26:     visited = set()
  27:     
  28:     queue = deque([(x_start, y_start)])
- 29:     visited.add((x_start, y_start))
+ 29:     pass
  30:     
  31:     while queue:
  32:         current = queue.pop()
  33:         
--------------------------------------------------------------------------------
[0.13518 s] survived

   - [#  48] SDL breadth_first_search: 
--------------------------------------------------------------------------------
  28:     queue = deque([(x_start, y_start)])
  29:     visited.add((x_start, y_start))
  30:     
  31:     while queue:
- 32:         current = queue.pop()
+ 32:         pass
  33:         
  34:         
  35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
  36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
--------------------------------------------------------------------------------
[0.14071 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_target_not_found

def test_breadth_first_search_target_not_found():
        grid = [[1, 2], [3, 4]]
        start = (0, 0)
        target = 5
>       assert breadth_first_search(grid, start, target) == None

ts-3-5/test_3-5_0-2_85.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

grid = [[1, 2], [3, 4]], start = (0, 0), target = 5

>   ???
E   NameError: name 'current' is not defined

breadth_first_search:35: NameError

   - [#  49] SDL breadth_first_search: 
--------------------------------------------------------------------------------
  35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
  36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
  37:                 continue
  38:             if grid[coor[1]][coor[0]] == target:
- 39:                 return coor
+ 39:                 pass
  40:             
  41:             elif coor not in visited:
  42:                 queue.appendleft(coor)
  43:                 visited.add(current)
--------------------------------------------------------------------------------
[0.11842 s] survived

   - [#  50] SDL breadth_first_search: 
--------------------------------------------------------------------------------
  38:             if grid[coor[1]][coor[0]] == target:
  39:                 return coor
  40:             
  41:             elif coor not in visited:
- 42:                 queue.appendleft(coor)
+ 42:                 pass
  43:                 visited.add(current)
  44:     return None
  45: 
  46: def breadth_first_search_graph(head, target):
--------------------------------------------------------------------------------
[0.11853 s] survived

   - [#  51] SDL breadth_first_search: 
--------------------------------------------------------------------------------
  39:                 return coor
  40:             
  41:             elif coor not in visited:
  42:                 queue.appendleft(coor)
- 43:                 visited.add(current)
+ 43:                 pass
  44:     return None
  45: 
  46: def breadth_first_search_graph(head, target):
  47:     '''
--------------------------------------------------------------------------------
[5.00684 s] timeout

   - [#  52] SDL breadth_first_search: 
--------------------------------------------------------------------------------
  40:             
  41:             elif coor not in visited:
  42:                 queue.appendleft(coor)
  43:                 visited.add(current)
- 44:     return None
+ 44:     pass
  45: 
  46: def breadth_first_search_graph(head, target):
  47:     '''
  48:     Search a graph for a target value.
--------------------------------------------------------------------------------
[0.11426 s] survived

   - [#  53] SDL breadth_first_search: 
--------------------------------------------------------------------------------
  53:     
  54:     Returns:
  55:         Node which has value = target.
  56:     '''
- 57:     visited = set([head])
+ 57:     pass
  58:     queue = [head]
  59:     
  60:     while queue:
  61:         current = queue.pop()
--------------------------------------------------------------------------------
[0.14203 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_graph_target_found

def test_breadth_first_search_graph_target_found():
        node1 = Node(1)
        node2 = Node(2)
        node3 = Node(3)
        node4 = Node(4)
    
        node1.adjacent_list = [node2, node3]
        node2.adjacent_list = [node1, node4]
        node3.adjacent_list = [node1]
        node4.adjacent_list = [node2]
    
        head = node1
        target = 4
    
>       assert breadth_first_search_graph(head, target) == node4

ts-3-5/test_3-5_0-2_85.py:50: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

head = <test_3-5_0-2_85.Node object at 0x79e680970880>, target = 4

>   ???
E   NameError: name 'visited' is not defined

breadth_first_search:64: NameError

   - [#  54] SDL breadth_first_search: 
--------------------------------------------------------------------------------
  54:     Returns:
  55:         Node which has value = target.
  56:     '''
  57:     visited = set([head])
- 58:     queue = [head]
+ 58:     pass
  59:     
  60:     while queue:
  61:         current = queue.pop()
  62:         
--------------------------------------------------------------------------------
[0.14266 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_graph_target_found

def test_breadth_first_search_graph_target_found():
        node1 = Node(1)
        node2 = Node(2)
        node3 = Node(3)
        node4 = Node(4)
    
        node1.adjacent_list = [node2, node3]
        node2.adjacent_list = [node1, node4]
        node3.adjacent_list = [node1]
        node4.adjacent_list = [node2]
    
        head = node1
        target = 4
    
>       assert breadth_first_search_graph(head, target) == node4

ts-3-5/test_3-5_0-2_85.py:50: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

head = <test_3-5_0-2_85.Node object at 0x79e68081d450>, target = 4

>   ???
E   NameError: name 'queue' is not defined

breadth_first_search:60: NameError

   - [#  56] SDL breadth_first_search: 
--------------------------------------------------------------------------------
  64:             if adjacent in visited:
  65:                 continue
  66:             
  67:             if adjacent.val == target:
- 68:                 return adjacent
+ 68:                 pass
  69:             else:
  70:                 queue.insert(0, adjacent)
  71:                 visited.add(adjacent)
  72:     return None
--------------------------------------------------------------------------------
[0.14252 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_graph_target_found

def test_breadth_first_search_graph_target_found():
        node1 = Node(1)
        node2 = Node(2)
        node3 = Node(3)
        node4 = Node(4)
    
        node1.adjacent_list = [node2, node3]
        node2.adjacent_list = [node1, node4]
        node3.adjacent_list = [node1]
        node4.adjacent_list = [node2]
    
        head = node1
        target = 4
    
>       assert breadth_first_search_graph(head, target) == node4
E       AssertionError

ts-3-5/test_3-5_0-2_85.py:50: AssertionError

   - [#  57] SDL breadth_first_search: 
--------------------------------------------------------------------------------
  66:             
  67:             if adjacent.val == target:
  68:                 return adjacent
  69:             else:
- 70:                 queue.insert(0, adjacent)
+ 70:                 pass
  71:                 visited.add(adjacent)
  72:     return None
--------------------------------------------------------------------------------
[0.14271 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_graph_target_found

def test_breadth_first_search_graph_target_found():
        node1 = Node(1)
        node2 = Node(2)
        node3 = Node(3)
        node4 = Node(4)
    
        node1.adjacent_list = [node2, node3]
        node2.adjacent_list = [node1, node4]
        node3.adjacent_list = [node1]
        node4.adjacent_list = [node2]
    
        head = node1
        target = 4
    
>       assert breadth_first_search_graph(head, target) == node4
E       AssertionError

ts-3-5/test_3-5_0-2_85.py:50: AssertionError

   - [#  58] SDL breadth_first_search: 
--------------------------------------------------------------------------------
  67:             if adjacent.val == target:
  68:                 return adjacent
  69:             else:
  70:                 queue.insert(0, adjacent)
- 71:                 visited.add(adjacent)
+ 71:                 pass
  72:     return None
--------------------------------------------------------------------------------
[5.00681 s] timeout

   - [#  59] SDL breadth_first_search: 
--------------------------------------------------------------------------------
  68:                 return adjacent
  69:             else:
  70:                 queue.insert(0, adjacent)
  71:                 visited.add(adjacent)
- 72:     return None
+ 72:     pass
--------------------------------------------------------------------------------
[0.11335 s] survived

   - [#  60] ZIL breadth_first_search: 
--------------------------------------------------------------------------------
  28:     queue = deque([(x_start, y_start)])
  29:     visited.add((x_start, y_start))
  30:     
  31:     while queue:
- 32:         current = queue.pop()
- 33:         
- 34:         
- 35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
- 36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
- 37:                 continue
- 38:             if grid[coor[1]][coor[0]] == target:
- 39:                 return coor
- 40:             
- 41:             elif coor not in visited:
- 42:                 queue.appendleft(coor)
- 43:                 visited.add(current)
+ 32:         break
+ 33:     
+ 34:     
+ 35:     
+ 36:     
+ 37:     
+ 38:     
+ 39:     
+ 40:     
+ 41:     
+ 42:     
+ 43:     
  44:     return None
  45: 
  46: def breadth_first_search_graph(head, target):
  47:     '''
--------------------------------------------------------------------------------
[0.11746 s] survived

   - [#  61] ZIL breadth_first_search: 
--------------------------------------------------------------------------------
  32:         current = queue.pop()
  33:         
  34:         
  35:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
- 36:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
- 37:                 continue
- 38:             if grid[coor[1]][coor[0]] == target:
- 39:                 return coor
- 40:             
- 41:             elif coor not in visited:
- 42:                 queue.appendleft(coor)
- 43:                 visited.add(current)
+ 36:             break
+ 37:     
+ 38:     
+ 39:     
+ 40:     
+ 41:     
+ 42:     
+ 43:     
  44:     return None
  45: 
  46: def breadth_first_search_graph(head, target):
  47:     '''
--------------------------------------------------------------------------------
[0.11686 s] survived

   - [#  62] ZIL breadth_first_search: 
--------------------------------------------------------------------------------
  57:     visited = set([head])
  58:     queue = [head]
  59:     
  60:     while queue:
- 61:         current = queue.pop()
- 62:         
- 63:         for adjacent in current.adjacent_list:
- 64:             if adjacent in visited:
- 65:                 continue
- 66:             
- 67:             if adjacent.val == target:
- 68:                 return adjacent
- 69:             else:
- 70:                 queue.insert(0, adjacent)
- 71:                 visited.add(adjacent)
+ 61:         break
+ 62:     
+ 63:     
+ 64:     
+ 65:     
+ 66:     
+ 67:     
+ 68:     
+ 69:     
+ 70:     
+ 71:     
  72:     return None
--------------------------------------------------------------------------------
[0.15829 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_graph_target_found

def test_breadth_first_search_graph_target_found():
        node1 = Node(1)
        node2 = Node(2)
        node3 = Node(3)
        node4 = Node(4)
    
        node1.adjacent_list = [node2, node3]
        node2.adjacent_list = [node1, node4]
        node3.adjacent_list = [node1]
        node4.adjacent_list = [node2]
    
        head = node1
        target = 4

   - [#  63] ZIL breadth_first_search: 
--------------------------------------------------------------------------------
  60:     while queue:
  61:         current = queue.pop()
  62:         
  63:         for adjacent in current.adjacent_list:
- 64:             if adjacent in visited:
- 65:                 continue
- 66:             
- 67:             if adjacent.val == target:
- 68:                 return adjacent
- 69:             else:
- 70:                 queue.insert(0, adjacent)
- 71:                 visited.add(adjacent)
+ 64:             break
+ 65:     
+ 66:     
+ 67:     
+ 68:     
+ 69:     
+ 70:     
+ 71:     
  72:     return None
--------------------------------------------------------------------------------
[0.15611 s] killed by ts-3-5/test_3-5_0-2_85.py::test_breadth_first_search_graph_target_found

def test_breadth_first_search_graph_target_found():
        node1 = Node(1)
        node2 = Node(2)
        node3 = Node(3)
        node4 = Node(4)
    
        node1.adjacent_list = [node2, node3]
        node2.adjacent_list = [node1, node4]
        node3.adjacent_list = [node1]
        node4.adjacent_list = [node2]
    
        head = node1
        target = 4
    
>       assert breadth_first_search_graph(head, target) == node4
E       AssertionError

ts-3-5/test_3-5_0-2_85.py:50: AssertionError
