1 : Job ID ca47103c583340b49554df902298ec32
test outcome: killed
binheap.py, start pos: (59, 45), end pos: (59, 46)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -56,7 +56,7 @@
             to_show += buff * ' '
             for idx in range(v):
                 if l:
-                    to_show += str(l.pop(0)) + ' '
+                    to_show += str(l.pop(0)) - ' '
             to_show += '\n'
         return to_show
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: unsupported oper...
========================= 1 failed, 2 passed in 0.14s ==========================

2 : Job ID 540d240c7966429fbbae7ad4e92b436e
test outcome: killed
binheap.py, start pos: (59, 45), end pos: (59, 46)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -56,7 +56,7 @@
             to_show += buff * ' '
             for idx in range(v):
                 if l:
-                    to_show += str(l.pop(0)) + ' '
+                    to_show += str(l.pop(0)) * ' '
             to_show += '\n'
         return to_show
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: can't multiply s...
========================= 1 failed, 2 passed in 0.14s ==========================

3 : Job ID 1a9ce3e2edf845bca2dc7e98f7812ad8
test outcome: killed
binheap.py, start pos: (59, 45), end pos: (59, 46)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -56,7 +56,7 @@
             to_show += buff * ' '
             for idx in range(v):
                 if l:
-                    to_show += str(l.pop(0)) + ' '
+                    to_show += str(l.pop(0)) / ' '
             to_show += '\n'
         return to_show
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: unsupported oper...
========================= 1 failed, 2 passed in 0.14s ==========================

4 : Job ID b7240f9c9398449abd4f19da34637c6f
test outcome: killed
binheap.py, start pos: (59, 45), end pos: (59, 46)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -56,7 +56,7 @@
             to_show += buff * ' '
             for idx in range(v):
                 if l:
-                    to_show += str(l.pop(0)) + ' '
+                    to_show += str(l.pop(0)) // ' '
             to_show += '\n'
         return to_show
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: unsupported oper...
========================= 1 failed, 2 passed in 0.14s ==========================

5 : Job ID 006170e1cfc741f2baeec2e2a3529865
test outcome: killed
binheap.py, start pos: (59, 45), end pos: (59, 46)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -56,7 +56,7 @@
             to_show += buff * ' '
             for idx in range(v):
                 if l:
-                    to_show += str(l.pop(0)) + ' '
+                    to_show += str(l.pop(0)) % ' '
             to_show += '\n'
         return to_show
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: not all argument...
========================= 1 failed, 2 passed in 0.14s ==========================

6 : Job ID 56221bf011e141e0820aa27f2063c514
test outcome: killed
binheap.py, start pos: (59, 45), end pos: (59, 46)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -56,7 +56,7 @@
             to_show += buff * ' '
             for idx in range(v):
                 if l:
-                    to_show += str(l.pop(0)) + ' '
+                    to_show += str(l.pop(0)) ** ' '
             to_show += '\n'
         return to_show
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: unsupported oper...
========================= 1 failed, 2 passed in 0.14s ==========================

7 : Job ID 8f3bfeb916284a0ca2e53edcee08efdf
test outcome: killed
binheap.py, start pos: (59, 45), end pos: (59, 46)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -56,7 +56,7 @@
             to_show += buff * ' '
             for idx in range(v):
                 if l:
-                    to_show += str(l.pop(0)) + ' '
+                    to_show += str(l.pop(0)) >> ' '
             to_show += '\n'
         return to_show
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: unsupported oper...
========================= 1 failed, 2 passed in 0.14s ==========================

8 : Job ID 52a832d9ab48459dbf3b9cd770e3d21b
test outcome: killed
binheap.py, start pos: (59, 45), end pos: (59, 46)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -56,7 +56,7 @@
             to_show += buff * ' '
             for idx in range(v):
                 if l:
-                    to_show += str(l.pop(0)) + ' '
+                    to_show += str(l.pop(0)) << ' '
             to_show += '\n'
         return to_show
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: unsupported oper...
========================= 1 failed, 2 passed in 0.14s ==========================

9 : Job ID b42e305a2003455f92c24f139f55e8ce
test outcome: killed
binheap.py, start pos: (59, 45), end pos: (59, 46)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -56,7 +56,7 @@
             to_show += buff * ' '
             for idx in range(v):
                 if l:
-                    to_show += str(l.pop(0)) + ' '
+                    to_show += str(l.pop(0)) | ' '
             to_show += '\n'
         return to_show
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: unsupported oper...
========================= 1 failed, 2 passed in 0.14s ==========================

10 : Job ID dd43b2a5dfeb432ea5882cccb4fa97fc
test outcome: killed
binheap.py, start pos: (59, 45), end pos: (59, 46)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -56,7 +56,7 @@
             to_show += buff * ' '
             for idx in range(v):
                 if l:
-                    to_show += str(l.pop(0)) + ' '
+                    to_show += str(l.pop(0)) & ' '
             to_show += '\n'
         return to_show
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: unsupported oper...
========================= 1 failed, 2 passed in 0.14s ==========================

11 : Job ID 3f94c7ac5f204a789427f9d12df701f7
test outcome: killed
binheap.py, start pos: (59, 45), end pos: (59, 46)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -56,7 +56,7 @@
             to_show += buff * ' '
             for idx in range(v):
                 if l:
-                    to_show += str(l.pop(0)) + ' '
+                    to_show += str(l.pop(0)) ^ ' '
             to_show += '\n'
         return to_show
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: unsupported oper...
========================= 1 failed, 2 passed in 0.15s ==========================

12 : Job ID 2b7a3ce09f36456d83a0c617a2cf4bbf
test outcome: killed
binheap.py, start pos: (23, 35), end pos: (23, 36)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -20,7 +20,7 @@
     def _balance(self):
         """Helper function to balance heap."""
-        size = len(self.container) - 1
+        size = len(self.container) + 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list index out of r...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list index out ...
============================== 3 failed in 0.15s ===============================

13 : Job ID 1673a8178a6f4e22b94ecb7ca7c3f561
SURVIVED
test outcome: survived
binheap.py, start pos: (55, 27), end pos: (55, 28)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 + i] // 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ...                                           [100%]
============================== 3 passed in 0.14s ===============================

14 : Job ID d510c6c83fff426e9b2b26388411558f
test outcome: killed
binheap.py, start pos: (23, 35), end pos: (23, 36)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -20,7 +20,7 @@
     def _balance(self):
         """Helper function to balance heap."""
-        size = len(self.container) - 1
+        size = len(self.container) * 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list index out of r...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list index out ...
============================== 3 failed in 0.15s ===============================

15 : Job ID fb81cf4c9b37457a82c2f63ab700c944
test outcome: killed
binheap.py, start pos: (55, 27), end pos: (55, 28)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 * i] // 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert '10 ...
========================= 1 failed, 2 passed in 0.14s ==========================

16 : Job ID 02365ec0baca4a818d06c65c78f726f1
test outcome: killed
binheap.py, start pos: (23, 35), end pos: (23, 36)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -20,7 +20,7 @@
     def _balance(self):
         """Helper function to balance heap."""
-        size = len(self.container) - 1
+        size = len(self.container) / 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: list indices must be...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: list indices mus...
============================== 3 failed in 0.15s ===============================

17 : Job ID 97ec9124720f47b2b24d82072005010c
test outcome: killed
binheap.py, start pos: (55, 27), end pos: (55, 28)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 / i] // 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - ZeroDivisionError: division...
========================= 1 failed, 2 passed in 0.14s ==========================

18 : Job ID 7dd64bb609004e43aaf93e0f7949c0b3
test outcome: killed
binheap.py, start pos: (23, 35), end pos: (23, 36)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -20,7 +20,7 @@
     def _balance(self):
         """Helper function to balance heap."""
-        size = len(self.container) - 1
+        size = len(self.container) // 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list index out of r...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list index out ...
============================== 3 failed in 0.14s ===============================

19 : Job ID 5d1fb41f891a4e6d888502dc6f438b0c
test outcome: killed
binheap.py, start pos: (55, 27), end pos: (55, 28)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 // i] // 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - ZeroDivisionError: integer ...
========================= 1 failed, 2 passed in 0.14s ==========================

20 : Job ID 3d5020201ba349478f28ac77a661c00d
test outcome: killed
binheap.py, start pos: (23, 35), end pos: (23, 36)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -20,7 +20,7 @@
     def _balance(self):
         """Helper function to balance heap."""
-        size = len(self.container) - 1
+        size = len(self.container) % 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 5, 10] == [None,...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, 10] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 5 ...
============================== 3 failed in 0.15s ===============================

21 : Job ID 7ea873433cd5451fb9080620a4b0698c
test outcome: killed
binheap.py, start pos: (55, 27), end pos: (55, 28)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 % i] // 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - ZeroDivisionError: integer ...
========================= 1 failed, 2 passed in 0.14s ==========================

22 : Job ID f6e95a2e34a24712a160961e23e33217
test outcome: killed
binheap.py, start pos: (23, 35), end pos: (23, 36)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -20,7 +20,7 @@
     def _balance(self):
         """Helper function to balance heap."""
-        size = len(self.container) - 1
+        size = len(self.container) ** 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list index out of r...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list index out ...
============================== 3 failed in 0.15s ===============================

23 : Job ID 3196af08fe634a32822ccddb95d575c3
test outcome: killed
binheap.py, start pos: (55, 27), end pos: (55, 28)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 ** i] // 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 10...
========================= 1 failed, 2 passed in 0.15s ==========================

24 : Job ID aa610c75f4a94d92bb6d7e939a3be5dc
test outcome: killed
binheap.py, start pos: (23, 35), end pos: (23, 36)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -20,7 +20,7 @@
     def _balance(self):
         """Helper function to balance heap."""
-        size = len(self.container) - 1
+        size = len(self.container) >> 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
ts-3-5/test_3-5_0-8_247.py FF.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 5, 10] == [None,...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, 10] == [None, 5]
========================= 2 failed, 1 passed in 0.14s ==========================

25 : Job ID 7b729f6bf8504457bfc824bfdc3d09a4
test outcome: killed
binheap.py, start pos: (55, 27), end pos: (55, 28)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 >> i] // 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 10...
========================= 1 failed, 2 passed in 0.14s ==========================

26 : Job ID b7adec7be3bc4009afaa5d05172e16c2
test outcome: killed
binheap.py, start pos: (23, 35), end pos: (23, 36)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -20,7 +20,7 @@
     def _balance(self):
         """Helper function to balance heap."""
-        size = len(self.container) - 1
+        size = len(self.container) << 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list index out of r...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list index out ...
============================== 3 failed in 0.15s ===============================

27 : Job ID 916b54e5fdcc467bb94e76caf6728959
SURVIVED
test outcome: survived
binheap.py, start pos: (55, 27), end pos: (55, 28)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 << i] // 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ...                                           [100%]
============================== 3 passed in 0.14s ===============================

28 : Job ID 574820c68a944b6a862d80151ffe33fe
test outcome: killed
binheap.py, start pos: (23, 35), end pos: (23, 36)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -20,7 +20,7 @@
     def _balance(self):
         """Helper function to balance heap."""
-        size = len(self.container) - 1
+        size = len(self.container) | 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list index out of r...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list index out ...
============================== 3 failed in 0.14s ===============================

29 : Job ID 34c234edb9484eb2aeb18d3bdd3fd577
test outcome: killed
binheap.py, start pos: (55, 27), end pos: (55, 28)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 | i] // 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 10...
========================= 1 failed, 2 passed in 0.15s ==========================

30 : Job ID 9ace90d1635f4d0abc3544771a337885
test outcome: killed
binheap.py, start pos: (23, 35), end pos: (23, 36)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -20,7 +20,7 @@
     def _balance(self):
         """Helper function to balance heap."""
-        size = len(self.container) - 1
+        size = len(self.container) & 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 5, 10] == [None,...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, 10] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 5 ...
============================== 3 failed in 0.14s ===============================

31 : Job ID 2b2e14f0f16542ea8032c9c37ef83d36
test outcome: killed
binheap.py, start pos: (55, 27), end pos: (55, 28)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 & i] // 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert '10 ...
========================= 1 failed, 2 passed in 0.14s ==========================

32 : Job ID 30068f64a74c4ee4a08a94a748624570
test outcome: killed
binheap.py, start pos: (23, 35), end pos: (23, 36)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -20,7 +20,7 @@
     def _balance(self):
         """Helper function to balance heap."""
-        size = len(self.container) - 1
+        size = len(self.container) ^ 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list index out of r...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list index out ...
============================== 3 failed in 0.14s ===============================

33 : Job ID ed5e92651afd4ce0b5ed6680444da2c4
SURVIVED
test outcome: survived
binheap.py, start pos: (55, 27), end pos: (55, 28)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 ^ i] // 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ...                                           [100%]
============================== 3 passed in 0.14s ===============================

34 : Job ID 528b9d5adb71499aa7ae3aaa379e5930
test outcome: killed
binheap.py, start pos: (56, 28), end pos: (56, 29)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -53,7 +53,7 @@
         for i, v in enumerate(cols):
             buff = cols[-1 - i] // 2
-            to_show += buff * ' '
+            to_show += buff + ' '
             for idx in range(v):
                 if l:
                     to_show += str(l.pop(0)) + ' '
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: unsupported oper...
========================= 1 failed, 2 passed in 0.14s ==========================
