35 : Job ID 66df411d2b7044a689fd1c8f05e6d036
test outcome: killed
binheap.py, start pos: (56, 28), end pos: (56, 29)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -53,7 +53,7 @@
         for i, v in enumerate(cols):
             buff = cols[-1 - i] // 2
-            to_show += buff * ' '
+            to_show += buff - ' '
             for idx in range(v):
                 if l:
                     to_show += str(l.pop(0)) + ' '
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: unsupported oper...
========================= 1 failed, 2 passed in 0.14s ==========================

36 : Job ID 75901fcbd82d423caaaf1692c598a33c
test outcome: killed
binheap.py, start pos: (56, 28), end pos: (56, 29)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -53,7 +53,7 @@
         for i, v in enumerate(cols):
             buff = cols[-1 - i] // 2
-            to_show += buff * ' '
+            to_show += buff / ' '
             for idx in range(v):
                 if l:
                     to_show += str(l.pop(0)) + ' '
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: unsupported oper...
========================= 1 failed, 2 passed in 0.15s ==========================

37 : Job ID 70fca7fc69ef4a3a804e226135c711b3
test outcome: killed
binheap.py, start pos: (56, 28), end pos: (56, 29)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -53,7 +53,7 @@
         for i, v in enumerate(cols):
             buff = cols[-1 - i] // 2
-            to_show += buff * ' '
+            to_show += buff // ' '
             for idx in range(v):
                 if l:
                     to_show += str(l.pop(0)) + ' '
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: unsupported oper...
========================= 1 failed, 2 passed in 0.14s ==========================

38 : Job ID 748d3438e7f24d3bba03a2214bbef347
test outcome: killed
binheap.py, start pos: (56, 28), end pos: (56, 29)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -53,7 +53,7 @@
         for i, v in enumerate(cols):
             buff = cols[-1 - i] // 2
-            to_show += buff * ' '
+            to_show += buff % ' '
             for idx in range(v):
                 if l:
                     to_show += str(l.pop(0)) + ' '
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: unsupported oper...
========================= 1 failed, 2 passed in 0.14s ==========================

39 : Job ID e1c8b74287f64fe594d9e47b4f2e1880
test outcome: killed
binheap.py, start pos: (56, 28), end pos: (56, 29)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -53,7 +53,7 @@
         for i, v in enumerate(cols):
             buff = cols[-1 - i] // 2
-            to_show += buff * ' '
+            to_show += buff ** ' '
             for idx in range(v):
                 if l:
                     to_show += str(l.pop(0)) + ' '
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: unsupported oper...
========================= 1 failed, 2 passed in 0.15s ==========================

40 : Job ID 748f22e1619b40db9c1bed6bb52f9896
test outcome: killed
binheap.py, start pos: (56, 28), end pos: (56, 29)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -53,7 +53,7 @@
         for i, v in enumerate(cols):
             buff = cols[-1 - i] // 2
-            to_show += buff * ' '
+            to_show += buff >> ' '
             for idx in range(v):
                 if l:
                     to_show += str(l.pop(0)) + ' '
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: unsupported oper...
========================= 1 failed, 2 passed in 0.15s ==========================

41 : Job ID c0c7d73b5036446abe513a65a3c4cf03
test outcome: killed
binheap.py, start pos: (56, 28), end pos: (56, 29)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -53,7 +53,7 @@
         for i, v in enumerate(cols):
             buff = cols[-1 - i] // 2
-            to_show += buff * ' '
+            to_show += buff << ' '
             for idx in range(v):
                 if l:
                     to_show += str(l.pop(0)) + ' '
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: unsupported oper...
========================= 1 failed, 2 passed in 0.15s ==========================

42 : Job ID b7c5c785ba32440dbfc6cffcc29aa646
test outcome: killed
binheap.py, start pos: (56, 28), end pos: (56, 29)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -53,7 +53,7 @@
         for i, v in enumerate(cols):
             buff = cols[-1 - i] // 2
-            to_show += buff * ' '
+            to_show += buff | ' '
             for idx in range(v):
                 if l:
                     to_show += str(l.pop(0)) + ' '
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: unsupported oper...
========================= 1 failed, 2 passed in 0.14s ==========================

43 : Job ID eb88a0f5e35d41faa59ae794070823e1
test outcome: killed
binheap.py, start pos: (56, 28), end pos: (56, 29)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -53,7 +53,7 @@
         for i, v in enumerate(cols):
             buff = cols[-1 - i] // 2
-            to_show += buff * ' '
+            to_show += buff & ' '
             for idx in range(v):
                 if l:
                     to_show += str(l.pop(0)) + ' '
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: unsupported oper...
========================= 1 failed, 2 passed in 0.14s ==========================

44 : Job ID 41d3c92f501d49fda8c229df063507c8
test outcome: killed
binheap.py, start pos: (56, 28), end pos: (56, 29)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -53,7 +53,7 @@
         for i, v in enumerate(cols):
             buff = cols[-1 - i] // 2
-            to_show += buff * ' '
+            to_show += buff ^ ' '
             for idx in range(v):
                 if l:
                     to_show += str(l.pop(0)) + ' '
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: unsupported oper...
========================= 1 failed, 2 passed in 0.14s ==========================

45 : Job ID 0d1e241fd17c459da9d3dafa8a0a54c5
test outcome: killed
binheap.py, start pos: (24, 19), end pos: (24, 21)
operator: core/ReplaceBinaryOperator_FloorDiv_Add, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -21,7 +21,7 @@
     def _balance(self):
         """Helper function to balance heap."""
         size = len(self.container) - 1
-        while size // 2 > 0:
+        while size + 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: '>' not supported b...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: '>' not supported be...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: '>' not supporte...
============================== 3 failed in 0.14s ===============================

46 : Job ID 1e8cad296f7149b199e4f7b09e5a4360
test outcome: killed
binheap.py, start pos: (25, 58), end pos: (25, 60)
operator: core/ReplaceBinaryOperator_FloorDiv_Add, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -22,7 +22,7 @@
         """Helper function to balance heap."""
         size = len(self.container) - 1
         while size // 2 > 0:
-            if self.container[size] > self.container[size // 2]:
+            if self.container[size] > self.container[size + 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list index out of r...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list index out ...
============================== 3 failed in 0.15s ===============================

47 : Job ID 07ddad7ea0fc45c890369688b7b5b73d
test outcome: killed
binheap.py, start pos: (26, 42), end pos: (26, 44)
operator: core/ReplaceBinaryOperator_FloorDiv_Add, occurrence: 2
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -23,7 +23,7 @@
         size = len(self.container) - 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
-                tmp = self.container[size // 2]
+                tmp = self.container[size + 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list index out of r...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list index out ...
============================== 3 failed in 0.14s ===============================

48 : Job ID b82f0af94e5940588eb1f5c8c3503be1
test outcome: killed
binheap.py, start pos: (27, 36), end pos: (27, 38)
operator: core/ReplaceBinaryOperator_FloorDiv_Add, occurrence: 3
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -24,7 +24,7 @@
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
-                self.container[size // 2] = self.container[size]
+                self.container[size + 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list assignment in...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list assignment ind...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list assignment...
============================== 3 failed in 0.14s ===============================

49 : Job ID 5bb46e15587c42a698ef084fe2d9710c
test outcome: killed
binheap.py, start pos: (29, 24), end pos: (29, 26)
operator: core/ReplaceBinaryOperator_FloorDiv_Add, occurrence: 4
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -26,7 +26,7 @@
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
-            size = size // 2
+            size = size + 2
     def push(self, val):
         """Put a new value into the heap."""
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list index out of r...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list index out ...
============================== 3 failed in 0.14s ===============================

50 : Job ID b5b227ccbb4646729634de1f914c8a23
test outcome: killed
binheap.py, start pos: (55, 32), end pos: (55, 34)
operator: core/ReplaceBinaryOperator_FloorDiv_Add, occurrence: 5
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 - i] + 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert '   ...
========================= 1 failed, 2 passed in 0.14s ==========================

51 : Job ID e5044c7d9c164b53871ac3cdd31f64d4
test outcome: killed
binheap.py, start pos: (24, 19), end pos: (24, 21)
operator: core/ReplaceBinaryOperator_FloorDiv_Sub, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -21,7 +21,7 @@
     def _balance(self):
         """Helper function to balance heap."""
         size = len(self.container) - 1
-        while size // 2 > 0:
+        while size - 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 5, 10] == [None,...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, 10] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 8 ...
============================== 3 failed in 0.15s ===============================

52 : Job ID f3bae07db62645c8ab91419675f56100
test outcome: killed
binheap.py, start pos: (25, 58), end pos: (25, 60)
operator: core/ReplaceBinaryOperator_FloorDiv_Sub, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -22,7 +22,7 @@
         """Helper function to balance heap."""
         size = len(self.container) - 1
         while size // 2 > 0:
-            if self.container[size] > self.container[size // 2]:
+            if self.container[size] > self.container[size - 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: '>' not supported b...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: '>' not supported be...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: '>' not supporte...
============================== 3 failed in 0.15s ===============================

53 : Job ID 5d3c19f243724cb5be2634e08d6e8c19
test outcome: killed
binheap.py, start pos: (26, 42), end pos: (26, 44)
operator: core/ReplaceBinaryOperator_FloorDiv_Sub, occurrence: 2
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -23,7 +23,7 @@
         size = len(self.container) - 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
-                tmp = self.container[size // 2]
+                tmp = self.container[size - 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 10, None] == [No...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, None] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 10...
============================== 3 failed in 0.14s ===============================

54 : Job ID ffd5f7f057cf471fa39b60e812b66712
test outcome: killed
binheap.py, start pos: (27, 36), end pos: (27, 38)
operator: core/ReplaceBinaryOperator_FloorDiv_Sub, occurrence: 3
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -24,7 +24,7 @@
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
-                self.container[size // 2] = self.container[size]
+                self.container[size - 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [10, 5, 5] == [None, 10...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [10, 5] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 8 ...
============================== 3 failed in 0.14s ===============================

55 : Job ID c50716e7253e42458a645edd903500eb
SURVIVED
test outcome: survived
binheap.py, start pos: (29, 24), end pos: (29, 26)
operator: core/ReplaceBinaryOperator_FloorDiv_Sub, occurrence: 4
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -26,7 +26,7 @@
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
-            size = size // 2
+            size = size - 2
     def push(self, val):
         """Put a new value into the heap."""
ts-3-5/test_3-5_0-8_247.py ...                                           [100%]
============================== 3 passed in 0.14s ===============================

56 : Job ID bb9f3574aae04556a9a04ffea1103495
test outcome: killed
binheap.py, start pos: (55, 32), end pos: (55, 34)
operator: core/ReplaceBinaryOperator_FloorDiv_Sub, occurrence: 5
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 - i] - 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert '10 ...
========================= 1 failed, 2 passed in 0.14s ==========================

57 : Job ID b28de3dc17774685a1385ce07ed22d65
test outcome: killed
binheap.py, start pos: (24, 19), end pos: (24, 21)
operator: core/ReplaceBinaryOperator_FloorDiv_Mul, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -21,7 +21,7 @@
     def _balance(self):
         """Helper function to balance heap."""
         size = len(self.container) - 1
-        while size // 2 > 0:
+        while size * 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: '>' not supported b...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: '>' not supported be...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: '>' not supporte...
============================== 3 failed in 0.14s ===============================

58 : Job ID fe087b35d86943ab9626dce8af775462
test outcome: killed
binheap.py, start pos: (25, 58), end pos: (25, 60)
operator: core/ReplaceBinaryOperator_FloorDiv_Mul, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -22,7 +22,7 @@
         """Helper function to balance heap."""
         size = len(self.container) - 1
         while size // 2 > 0:
-            if self.container[size] > self.container[size // 2]:
+            if self.container[size] > self.container[size * 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list index out of r...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list index out ...
============================== 3 failed in 0.14s ===============================

59 : Job ID 3801e40343b944b985ead90b4705c25e
test outcome: killed
binheap.py, start pos: (26, 42), end pos: (26, 44)
operator: core/ReplaceBinaryOperator_FloorDiv_Mul, occurrence: 2
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -23,7 +23,7 @@
         size = len(self.container) - 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
-                tmp = self.container[size // 2]
+                tmp = self.container[size * 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list index out of r...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list index out ...
============================== 3 failed in 0.15s ===============================

60 : Job ID 045ce338cb7d4adaad329298160ec642
test outcome: killed
binheap.py, start pos: (27, 36), end pos: (27, 38)
operator: core/ReplaceBinaryOperator_FloorDiv_Mul, occurrence: 3
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -24,7 +24,7 @@
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
-                self.container[size // 2] = self.container[size]
+                self.container[size * 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list assignment in...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list assignment ind...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list assignment...
============================== 3 failed in 0.14s ===============================

61 : Job ID 23ac286898564589a6f35ee34b12223f
test outcome: killed
binheap.py, start pos: (29, 24), end pos: (29, 26)
operator: core/ReplaceBinaryOperator_FloorDiv_Mul, occurrence: 4
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -26,7 +26,7 @@
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
-            size = size // 2
+            size = size * 2
     def push(self, val):
         """Put a new value into the heap."""
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list index out of r...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list index out ...
============================== 3 failed in 0.14s ===============================

62 : Job ID f631f60d4e1e45d3b9c1fcf3c1cd0252
test outcome: killed
binheap.py, start pos: (55, 32), end pos: (55, 34)
operator: core/ReplaceBinaryOperator_FloorDiv_Mul, occurrence: 5
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 - i] * 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert '   ...
========================= 1 failed, 2 passed in 0.14s ==========================

63 : Job ID 76017c1426cd446b88d437077833b009
test outcome: killed
binheap.py, start pos: (24, 19), end pos: (24, 21)
operator: core/ReplaceBinaryOperator_FloorDiv_Div, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -21,7 +21,7 @@
     def _balance(self):
         """Helper function to balance heap."""
         size = len(self.container) - 1
-        while size // 2 > 0:
+        while size / 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: '>' not supported b...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: '>' not supported be...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: '>' not supporte...
============================== 3 failed in 0.14s ===============================

64 : Job ID e8ef379be1ea4f0c84dc07a2df0a4454
test outcome: killed
binheap.py, start pos: (25, 58), end pos: (25, 60)
operator: core/ReplaceBinaryOperator_FloorDiv_Div, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -22,7 +22,7 @@
         """Helper function to balance heap."""
         size = len(self.container) - 1
         while size // 2 > 0:
-            if self.container[size] > self.container[size // 2]:
+            if self.container[size] > self.container[size / 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: list indices must be...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: list indices mus...
============================== 3 failed in 0.14s ===============================
