65 : Job ID dcd0f6e4a3a04aa6ad336c5dece3893e
test outcome: killed
binheap.py, start pos: (26, 42), end pos: (26, 44)
operator: core/ReplaceBinaryOperator_FloorDiv_Div, occurrence: 2
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -23,7 +23,7 @@
         size = len(self.container) - 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
-                tmp = self.container[size // 2]
+                tmp = self.container[size / 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: list indices must be...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: list indices mus...
============================== 3 failed in 0.15s ===============================

66 : Job ID 2a7ca8f3c4f84f5cb5797a710cbb4f2e
test outcome: killed
binheap.py, start pos: (27, 36), end pos: (27, 38)
operator: core/ReplaceBinaryOperator_FloorDiv_Div, occurrence: 3
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -24,7 +24,7 @@
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
-                self.container[size // 2] = self.container[size]
+                self.container[size / 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: list indices must be...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: list indices mus...
============================== 3 failed in 0.15s ===============================

67 : Job ID 3b331d19bbb94c9ba371fdae7fbdf201
SURVIVED
test outcome: survived
binheap.py, start pos: (29, 24), end pos: (29, 26)
operator: core/ReplaceBinaryOperator_FloorDiv_Div, occurrence: 4
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -26,7 +26,7 @@
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
-            size = size // 2
+            size = size / 2
     def push(self, val):
         """Put a new value into the heap."""
ts-3-5/test_3-5_0-8_247.py ...                                           [100%]
============================== 3 passed in 0.14s ===============================

68 : Job ID ab6b25dc8b0b45d6a6ab071143b5ebc2
test outcome: killed
binheap.py, start pos: (55, 32), end pos: (55, 34)
operator: core/ReplaceBinaryOperator_FloorDiv_Div, occurrence: 5
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 - i] / 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: can't multiply s...
========================= 1 failed, 2 passed in 0.15s ==========================

69 : Job ID 4f2816765b9248a88203d733ea30a5cd
test outcome: killed
binheap.py, start pos: (24, 19), end pos: (24, 21)
operator: core/ReplaceBinaryOperator_FloorDiv_Mod, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -21,7 +21,7 @@
     def _balance(self):
         """Helper function to balance heap."""
         size = len(self.container) - 1
-        while size // 2 > 0:
+        while size % 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: '>' not supported b...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: '>' not supported be...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: '>' not supporte...
============================== 3 failed in 0.15s ===============================

70 : Job ID d2950efe80b148608fb21f526dbd59ae
test outcome: killed
binheap.py, start pos: (25, 58), end pos: (25, 60)
operator: core/ReplaceBinaryOperator_FloorDiv_Mod, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -22,7 +22,7 @@
         """Helper function to balance heap."""
         size = len(self.container) - 1
         while size // 2 > 0:
-            if self.container[size] > self.container[size // 2]:
+            if self.container[size] > self.container[size % 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: '>' not supported b...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: '>' not supported be...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: '>' not supporte...
============================== 3 failed in 0.14s ===============================

71 : Job ID a7207acaf6894b2796b2a65f3a9642a5
test outcome: killed
binheap.py, start pos: (26, 42), end pos: (26, 44)
operator: core/ReplaceBinaryOperator_FloorDiv_Mod, occurrence: 2
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -23,7 +23,7 @@
         size = len(self.container) - 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
-                tmp = self.container[size // 2]
+                tmp = self.container[size % 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 10, None] == [No...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, None] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 10...
============================== 3 failed in 0.15s ===============================

72 : Job ID 43f54aa18664480baa318c448dbfe993
test outcome: killed
binheap.py, start pos: (27, 36), end pos: (27, 38)
operator: core/ReplaceBinaryOperator_FloorDiv_Mod, occurrence: 3
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -24,7 +24,7 @@
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
-                self.container[size // 2] = self.container[size]
+                self.container[size % 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [10, 5, 5] == [None, 10...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [10, 5] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 8 ...
============================== 3 failed in 0.14s ===============================

73 : Job ID ae8e757d01c9495a861730a74e31900f
SURVIVED
test outcome: survived
binheap.py, start pos: (29, 24), end pos: (29, 26)
operator: core/ReplaceBinaryOperator_FloorDiv_Mod, occurrence: 4
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -26,7 +26,7 @@
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
-            size = size // 2
+            size = size % 2
     def push(self, val):
         """Put a new value into the heap."""
ts-3-5/test_3-5_0-8_247.py ...                                           [100%]
============================== 3 passed in 0.14s ===============================

74 : Job ID 6f62c2add8264140aa60ba56cb1a6e22
test outcome: killed
binheap.py, start pos: (55, 32), end pos: (55, 34)
operator: core/ReplaceBinaryOperator_FloorDiv_Mod, occurrence: 5
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 - i] % 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert '10 ...
========================= 1 failed, 2 passed in 0.15s ==========================

75 : Job ID 3e6ba3d9e6984e628fdc41063cc05a13
test outcome: killed
binheap.py, start pos: (24, 19), end pos: (24, 21)
operator: core/ReplaceBinaryOperator_FloorDiv_Pow, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -21,7 +21,7 @@
     def _balance(self):
         """Helper function to balance heap."""
         size = len(self.container) - 1
-        while size // 2 > 0:
+        while size ** 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: '>' not supported b...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: '>' not supported be...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: '>' not supporte...
============================== 3 failed in 0.15s ===============================

76 : Job ID e9b7ad89c5d44e95a4f7643115ef71f7
test outcome: killed
binheap.py, start pos: (25, 58), end pos: (25, 60)
operator: core/ReplaceBinaryOperator_FloorDiv_Pow, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -22,7 +22,7 @@
         """Helper function to balance heap."""
         size = len(self.container) - 1
         while size // 2 > 0:
-            if self.container[size] > self.container[size // 2]:
+            if self.container[size] > self.container[size ** 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list index out of r...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list index out ...
============================== 3 failed in 0.14s ===============================

77 : Job ID 73893af63352456dae519a8c41ce4cc8
test outcome: killed
binheap.py, start pos: (26, 42), end pos: (26, 44)
operator: core/ReplaceBinaryOperator_FloorDiv_Pow, occurrence: 2
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -23,7 +23,7 @@
         size = len(self.container) - 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
-                tmp = self.container[size // 2]
+                tmp = self.container[size ** 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list index out of r...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list index out ...
============================== 3 failed in 0.14s ===============================

78 : Job ID 0785b860f3ad47a59dbc4ca56a7d2728
test outcome: killed
binheap.py, start pos: (27, 36), end pos: (27, 38)
operator: core/ReplaceBinaryOperator_FloorDiv_Pow, occurrence: 3
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -24,7 +24,7 @@
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
-                self.container[size // 2] = self.container[size]
+                self.container[size ** 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list assignment in...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list assignment ind...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list assignment...
============================== 3 failed in 0.14s ===============================

79 : Job ID 822a4c9e296141edbc61698126eb8c68
test outcome: killed
binheap.py, start pos: (29, 24), end pos: (29, 26)
operator: core/ReplaceBinaryOperator_FloorDiv_Pow, occurrence: 4
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -26,7 +26,7 @@
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
-            size = size // 2
+            size = size ** 2
     def push(self, val):
         """Put a new value into the heap."""
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list index out of r...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list index out ...
============================== 3 failed in 0.14s ===============================

80 : Job ID a746f1e6c870424babd6ef0cf650dc9b
test outcome: killed
binheap.py, start pos: (55, 32), end pos: (55, 34)
operator: core/ReplaceBinaryOperator_FloorDiv_Pow, occurrence: 5
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 - i] ** 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert '   ...
========================= 1 failed, 2 passed in 0.14s ==========================

81 : Job ID 8e9b0280760c4fd391a874d3362f20c0
test outcome: killed
binheap.py, start pos: (24, 19), end pos: (24, 21)
operator: core/ReplaceBinaryOperator_FloorDiv_RShift, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -21,7 +21,7 @@
     def _balance(self):
         """Helper function to balance heap."""
         size = len(self.container) - 1
-        while size // 2 > 0:
+        while size >> 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 5, 10] == [None,...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, 10] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 5 ...
============================== 3 failed in 0.14s ===============================

82 : Job ID 44f494709119498aa784d72009750c0c
test outcome: killed
binheap.py, start pos: (25, 58), end pos: (25, 60)
operator: core/ReplaceBinaryOperator_FloorDiv_RShift, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -22,7 +22,7 @@
         """Helper function to balance heap."""
         size = len(self.container) - 1
         while size // 2 > 0:
-            if self.container[size] > self.container[size // 2]:
+            if self.container[size] > self.container[size >> 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: '>' not supported b...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: '>' not supported be...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: '>' not supporte...
============================== 3 failed in 0.14s ===============================

83 : Job ID 228c45448e284fc18cc429729af18bde
test outcome: killed
binheap.py, start pos: (26, 42), end pos: (26, 44)
operator: core/ReplaceBinaryOperator_FloorDiv_RShift, occurrence: 2
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -23,7 +23,7 @@
         size = len(self.container) - 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
-                tmp = self.container[size // 2]
+                tmp = self.container[size >> 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 10, None] == [No...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, None] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 10...
============================== 3 failed in 0.15s ===============================

84 : Job ID 663f267ffa6c48e8aa8644b26b836cf1
test outcome: killed
binheap.py, start pos: (27, 36), end pos: (27, 38)
operator: core/ReplaceBinaryOperator_FloorDiv_RShift, occurrence: 3
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -24,7 +24,7 @@
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
-                self.container[size // 2] = self.container[size]
+                self.container[size >> 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [10, 5, 5] == [None, 10...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [10, 5] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 5 ...
============================== 3 failed in 0.15s ===============================

85 : Job ID 7031a2a106404159831e676bfcc63a77
SURVIVED
test outcome: survived
binheap.py, start pos: (29, 24), end pos: (29, 26)
operator: core/ReplaceBinaryOperator_FloorDiv_RShift, occurrence: 4
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -26,7 +26,7 @@
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
-            size = size // 2
+            size = size >> 2
     def push(self, val):
         """Put a new value into the heap."""
ts-3-5/test_3-5_0-8_247.py ...                                           [100%]
============================== 3 passed in 0.14s ===============================

86 : Job ID 5cb23a21aaa44d748f70f5ca3fdf6efd
test outcome: killed
binheap.py, start pos: (55, 32), end pos: (55, 34)
operator: core/ReplaceBinaryOperator_FloorDiv_RShift, occurrence: 5
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 - i] >> 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert '10 ...
========================= 1 failed, 2 passed in 0.15s ==========================

87 : Job ID 4f3faa5438da4bf9a020b122afeb7e21
test outcome: killed
binheap.py, start pos: (24, 19), end pos: (24, 21)
operator: core/ReplaceBinaryOperator_FloorDiv_LShift, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -21,7 +21,7 @@
     def _balance(self):
         """Helper function to balance heap."""
         size = len(self.container) - 1
-        while size // 2 > 0:
+        while size << 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: '>' not supported b...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: '>' not supported be...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: '>' not supporte...
============================== 3 failed in 0.14s ===============================

88 : Job ID 6675f31e77f34c5cbd2522b7edf40950
test outcome: killed
binheap.py, start pos: (25, 58), end pos: (25, 60)
operator: core/ReplaceBinaryOperator_FloorDiv_LShift, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -22,7 +22,7 @@
         """Helper function to balance heap."""
         size = len(self.container) - 1
         while size // 2 > 0:
-            if self.container[size] > self.container[size // 2]:
+            if self.container[size] > self.container[size << 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list index out of r...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list index out ...
============================== 3 failed in 0.15s ===============================

89 : Job ID dd03d11c06c24863aa0d63b952abe6a0
test outcome: killed
binheap.py, start pos: (26, 42), end pos: (26, 44)
operator: core/ReplaceBinaryOperator_FloorDiv_LShift, occurrence: 2
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -23,7 +23,7 @@
         size = len(self.container) - 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
-                tmp = self.container[size // 2]
+                tmp = self.container[size << 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list index out of r...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list index out ...
============================== 3 failed in 0.14s ===============================

90 : Job ID d6980cbda08c4936bca74c7066c66197
test outcome: killed
binheap.py, start pos: (27, 36), end pos: (27, 38)
operator: core/ReplaceBinaryOperator_FloorDiv_LShift, occurrence: 3
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -24,7 +24,7 @@
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
-                self.container[size // 2] = self.container[size]
+                self.container[size << 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list assignment in...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list assignment ind...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list assignment...
============================== 3 failed in 0.15s ===============================

91 : Job ID fc9861a7c3764727b915fdbe260d7023
test outcome: killed
binheap.py, start pos: (29, 24), end pos: (29, 26)
operator: core/ReplaceBinaryOperator_FloorDiv_LShift, occurrence: 4
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -26,7 +26,7 @@
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
-            size = size // 2
+            size = size << 2
     def push(self, val):
         """Put a new value into the heap."""
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list index out of r...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list index out ...
============================== 3 failed in 0.14s ===============================

92 : Job ID 3721f7767df748f2943330212503e355
test outcome: killed
binheap.py, start pos: (55, 32), end pos: (55, 34)
operator: core/ReplaceBinaryOperator_FloorDiv_LShift, occurrence: 5
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 - i] << 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert '   ...
========================= 1 failed, 2 passed in 0.15s ==========================

93 : Job ID 4dcc194137e543739bf1fb3db4e023b5
test outcome: killed
binheap.py, start pos: (24, 19), end pos: (24, 21)
operator: core/ReplaceBinaryOperator_FloorDiv_BitOr, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -21,7 +21,7 @@
     def _balance(self):
         """Helper function to balance heap."""
         size = len(self.container) - 1
-        while size // 2 > 0:
+        while size | 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: '>' not supported b...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: '>' not supported be...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: '>' not supporte...
============================== 3 failed in 0.14s ===============================
