94 : Job ID 5bb94babed694f15adc763cac0131ad3
test outcome: killed
binheap.py, start pos: (25, 58), end pos: (25, 60)
operator: core/ReplaceBinaryOperator_FloorDiv_BitOr, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -22,7 +22,7 @@
         """Helper function to balance heap."""
         size = len(self.container) - 1
         while size // 2 > 0:
-            if self.container[size] > self.container[size // 2]:
+            if self.container[size] > self.container[size | 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 5, 10] == [None,...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, 10] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 5 ...
============================== 3 failed in 0.14s ===============================

95 : Job ID 5f1245013ca44277b9dfc91768d8a5d1
test outcome: killed
binheap.py, start pos: (26, 42), end pos: (26, 44)
operator: core/ReplaceBinaryOperator_FloorDiv_BitOr, occurrence: 2
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -23,7 +23,7 @@
         size = len(self.container) - 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
-                tmp = self.container[size // 2]
+                tmp = self.container[size | 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 10, 10] == [None...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, 10] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 10...
============================== 3 failed in 0.14s ===============================

96 : Job ID d09b3708f04e4c658059981b87b67bd1
test outcome: killed
binheap.py, start pos: (27, 36), end pos: (27, 38)
operator: core/ReplaceBinaryOperator_FloorDiv_BitOr, occurrence: 3
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -24,7 +24,7 @@
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
-                self.container[size // 2] = self.container[size]
+                self.container[size | 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 5, 5] == [None, ...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 5 ...
========================= 2 failed, 1 passed in 0.14s ==========================

97 : Job ID 07fe36d902af49678827d20d8bd0dadf
test outcome: killed
binheap.py, start pos: (29, 24), end pos: (29, 26)
operator: core/ReplaceBinaryOperator_FloorDiv_BitOr, occurrence: 4
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -26,7 +26,7 @@
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
-            size = size // 2
+            size = size | 2
     def push(self, val):
         """Put a new value into the heap."""
timeout

98 : Job ID eff39a14f06447bfa21a4b56f53255cd
test outcome: killed
binheap.py, start pos: (55, 32), end pos: (55, 34)
operator: core/ReplaceBinaryOperator_FloorDiv_BitOr, occurrence: 5
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 - i] | 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert '  1...
========================= 1 failed, 2 passed in 0.14s ==========================

99 : Job ID 5fb65861255c478f82dca0a448ccb943
SURVIVED
test outcome: survived
binheap.py, start pos: (24, 19), end pos: (24, 21)
operator: core/ReplaceBinaryOperator_FloorDiv_BitAnd, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -21,7 +21,7 @@
     def _balance(self):
         """Helper function to balance heap."""
         size = len(self.container) - 1
-        while size // 2 > 0:
+        while size & 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
ts-3-5/test_3-5_0-8_247.py ...                                           [100%]
============================== 3 passed in 0.14s ===============================

100 : Job ID 71abbc1cdba347319232466251cfab40
test outcome: killed
binheap.py, start pos: (25, 58), end pos: (25, 60)
operator: core/ReplaceBinaryOperator_FloorDiv_BitAnd, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -22,7 +22,7 @@
         """Helper function to balance heap."""
         size = len(self.container) - 1
         while size // 2 > 0:
-            if self.container[size] > self.container[size // 2]:
+            if self.container[size] > self.container[size & 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 5, 10] == [None,...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, 10] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 5 ...
============================== 3 failed in 0.14s ===============================

101 : Job ID 9d222b92098549d29bb3e91fceda9899
test outcome: killed
binheap.py, start pos: (26, 42), end pos: (26, 44)
operator: core/ReplaceBinaryOperator_FloorDiv_BitAnd, occurrence: 2
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -23,7 +23,7 @@
         size = len(self.container) - 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
-                tmp = self.container[size // 2]
+                tmp = self.container[size & 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 10, 10] == [None...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, 10] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 10...
============================== 3 failed in 0.14s ===============================

102 : Job ID 67861b61159b4e55b9e9245046638d4b
test outcome: killed
binheap.py, start pos: (27, 36), end pos: (27, 38)
operator: core/ReplaceBinaryOperator_FloorDiv_BitAnd, occurrence: 3
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -24,7 +24,7 @@
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
-                self.container[size // 2] = self.container[size]
+                self.container[size & 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 5, 5] == [None, ...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 5 ...
========================= 2 failed, 1 passed in 0.15s ==========================

103 : Job ID cdff166193b844b79cd84613fa31ff3d
test outcome: killed
binheap.py, start pos: (29, 24), end pos: (29, 26)
operator: core/ReplaceBinaryOperator_FloorDiv_BitAnd, occurrence: 4
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -26,7 +26,7 @@
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
-            size = size // 2
+            size = size & 2
     def push(self, val):
         """Put a new value into the heap."""
timeout

104 : Job ID cfdc28131d8e4236b5fe7844f54fe849
test outcome: killed
binheap.py, start pos: (55, 32), end pos: (55, 34)
operator: core/ReplaceBinaryOperator_FloorDiv_BitAnd, occurrence: 5
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 - i] & 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert '  1...
========================= 1 failed, 2 passed in 0.14s ==========================

105 : Job ID 8b8343eabdeb4165a8cd446967e90cbe
test outcome: killed
binheap.py, start pos: (24, 19), end pos: (24, 21)
operator: core/ReplaceBinaryOperator_FloorDiv_BitXor, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -21,7 +21,7 @@
     def _balance(self):
         """Helper function to balance heap."""
         size = len(self.container) - 1
-        while size // 2 > 0:
+        while size ^ 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: '>' not supported b...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: '>' not supported be...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: '>' not supporte...
============================== 3 failed in 0.15s ===============================

106 : Job ID 4905704c945d4e218a023f11e89c0b3d
test outcome: killed
binheap.py, start pos: (25, 58), end pos: (25, 60)
operator: core/ReplaceBinaryOperator_FloorDiv_BitXor, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -22,7 +22,7 @@
         """Helper function to balance heap."""
         size = len(self.container) - 1
         while size // 2 > 0:
-            if self.container[size] > self.container[size // 2]:
+            if self.container[size] > self.container[size ^ 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: '>' not supported b...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: '>' not supported be...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: '>' not supporte...
============================== 3 failed in 0.15s ===============================

107 : Job ID 2492153f608c49cc8691286f82090d11
test outcome: killed
binheap.py, start pos: (26, 42), end pos: (26, 44)
operator: core/ReplaceBinaryOperator_FloorDiv_BitXor, occurrence: 2
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -23,7 +23,7 @@
         size = len(self.container) - 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
-                tmp = self.container[size // 2]
+                tmp = self.container[size ^ 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 10, None] == [No...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, None] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 10...
============================== 3 failed in 0.15s ===============================

108 : Job ID fede881b59764e0b8c605711a031a124
test outcome: killed
binheap.py, start pos: (27, 36), end pos: (27, 38)
operator: core/ReplaceBinaryOperator_FloorDiv_BitXor, occurrence: 3
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -24,7 +24,7 @@
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
-                self.container[size // 2] = self.container[size]
+                self.container[size ^ 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [10, 5, 5] == [None, 10...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [10, 5] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 8 ...
============================== 3 failed in 0.15s ===============================

109 : Job ID a616095933444983ba6c9d6b67113e35
SURVIVED
test outcome: survived
binheap.py, start pos: (29, 24), end pos: (29, 26)
operator: core/ReplaceBinaryOperator_FloorDiv_BitXor, occurrence: 4
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -26,7 +26,7 @@
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
-            size = size // 2
+            size = size ^ 2
     def push(self, val):
         """Put a new value into the heap."""
ts-3-5/test_3-5_0-8_247.py ...                                           [100%]
============================== 3 passed in 0.14s ===============================

110 : Job ID 0a8a69c81ec04d928f90d3b63d5b704f
test outcome: killed
binheap.py, start pos: (55, 32), end pos: (55, 34)
operator: core/ReplaceBinaryOperator_FloorDiv_BitXor, occurrence: 5
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 - i] ^ 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert '10 ...
========================= 1 failed, 2 passed in 0.14s ==========================

111 : Job ID 75c8d609a7d940dfad373ce2b9462cef
test outcome: killed
binheap.py, start pos: (24, 24), end pos: (24, 25)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -21,7 +21,7 @@
     def _balance(self):
         """Helper function to balance heap."""
         size = len(self.container) - 1
-        while size // 2 > 0:
+        while size // 2 == 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: '>' not supported b...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: '>' not supported be...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: '>' not supporte...
============================== 3 failed in 0.15s ===============================

112 : Job ID ba83f8ede1c94516bfe806ebc9d16d19
test outcome: killed
binheap.py, start pos: (25, 36), end pos: (25, 37)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -22,7 +22,7 @@
         """Helper function to balance heap."""
         size = len(self.container) - 1
         while size // 2 > 0:
-            if self.container[size] > self.container[size // 2]:
+            if self.container[size] == self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 5, 10] == [None,...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, 10] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 5 ...
============================== 3 failed in 0.15s ===============================

113 : Job ID 4f3d0355009643e3a0f0c7a689981ff4
test outcome: killed
binheap.py, start pos: (50, 34), end pos: (50, 35)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 2
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -47,7 +47,7 @@
         to_show = ''
         l = self.container[1:]
-        while len(self.container) > col:
+        while len(self.container) == col:
             cols.append(col)
             col *= 2
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert '' =...
========================= 1 failed, 2 passed in 0.14s ==========================

114 : Job ID 474f80ccc80544419938d761780f4bd7
SURVIVED
test outcome: survived
binheap.py, start pos: (24, 24), end pos: (24, 25)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -21,7 +21,7 @@
     def _balance(self):
         """Helper function to balance heap."""
         size = len(self.container) - 1
-        while size // 2 > 0:
+        while size // 2 != 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
ts-3-5/test_3-5_0-8_247.py ...                                           [100%]
============================== 3 passed in 0.15s ===============================

115 : Job ID 07315bd2ec804e9b9f137f04faef77be
test outcome: killed
binheap.py, start pos: (25, 36), end pos: (25, 37)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -22,7 +22,7 @@
         """Helper function to balance heap."""
         size = len(self.container) - 1
         while size // 2 > 0:
-            if self.container[size] > self.container[size // 2]:
+            if self.container[size] != self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
ts-3-5/test_3-5_0-8_247.py .FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, 8, 5] == [None, 5...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 8 ...
========================= 2 failed, 1 passed in 0.15s ==========================

116 : Job ID e8b27e564d494449962f6dd39a544792
SURVIVED
test outcome: survived
binheap.py, start pos: (50, 34), end pos: (50, 35)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 2
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -47,7 +47,7 @@
         to_show = ''
         l = self.container[1:]
-        while len(self.container) > col:
+        while len(self.container) != col:
             cols.append(col)
             col *= 2
ts-3-5/test_3-5_0-8_247.py ...                                           [100%]
============================== 3 passed in 0.14s ===============================

117 : Job ID 97817d97d23c4055bd4830ebcafa26b2
test outcome: killed
binheap.py, start pos: (24, 24), end pos: (24, 25)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -21,7 +21,7 @@
     def _balance(self):
         """Helper function to balance heap."""
         size = len(self.container) - 1
-        while size // 2 > 0:
+        while size // 2 < 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 5, 10] == [None,...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, 10] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 5 ...
============================== 3 failed in 0.14s ===============================

118 : Job ID f12868221c1945ccb6fa00332d9ae93f
test outcome: killed
binheap.py, start pos: (25, 36), end pos: (25, 37)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -22,7 +22,7 @@
         """Helper function to balance heap."""
         size = len(self.container) - 1
         while size // 2 > 0:
-            if self.container[size] > self.container[size // 2]:
+            if self.container[size] < self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 5, 10] == [None,...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, 10] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 5 ...
============================== 3 failed in 0.15s ===============================

119 : Job ID f3b5f3aa5cc94e7d8750674c5cef466d
test outcome: killed
binheap.py, start pos: (50, 34), end pos: (50, 35)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 2
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -47,7 +47,7 @@
         to_show = ''
         l = self.container[1:]
-        while len(self.container) > col:
+        while len(self.container) < col:
             cols.append(col)
             col *= 2
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert '' =...
========================= 1 failed, 2 passed in 0.14s ==========================

120 : Job ID ef21dd81d4ed40478f20af26b447161e
test outcome: killed
binheap.py, start pos: (24, 24), end pos: (24, 25)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -21,7 +21,7 @@
     def _balance(self):
         """Helper function to balance heap."""
         size = len(self.container) - 1
-        while size // 2 > 0:
+        while size // 2 <= 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: '>' not supported b...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: '>' not supported be...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: '>' not supporte...
============================== 3 failed in 0.16s ===============================

121 : Job ID 51de4d3836f04762b956cf41c441eded
test outcome: killed
binheap.py, start pos: (25, 36), end pos: (25, 37)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -22,7 +22,7 @@
         """Helper function to balance heap."""
         size = len(self.container) - 1
         while size // 2 > 0:
-            if self.container[size] > self.container[size // 2]:
+            if self.container[size] <= self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 5, 10] == [None,...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, 10] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 5 ...
============================== 3 failed in 0.14s ===============================

122 : Job ID a06c30dbb8be4123a02fc9dcbebe52f7
test outcome: killed
binheap.py, start pos: (50, 34), end pos: (50, 35)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 2
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -47,7 +47,7 @@
         to_show = ''
         l = self.container[1:]
-        while len(self.container) > col:
+        while len(self.container) <= col:
             cols.append(col)
             col *= 2
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert '' =...
========================= 1 failed, 2 passed in 0.14s ==========================

123 : Job ID 989310738f6740b6a44dd78d85af1e8a
test outcome: killed
binheap.py, start pos: (24, 24), end pos: (24, 25)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -21,7 +21,7 @@
     def _balance(self):
         """Helper function to balance heap."""
         size = len(self.container) - 1
-        while size // 2 > 0:
+        while size // 2 >= 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: '>' not supported b...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: '>' not supported be...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: '>' not supporte...
============================== 3 failed in 0.15s ===============================

124 : Job ID 5a70725697e042edb3e591cc4dabfc9d
SURVIVED
test outcome: survived
binheap.py, start pos: (25, 36), end pos: (25, 37)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -22,7 +22,7 @@
         """Helper function to balance heap."""
         size = len(self.container) - 1
         while size // 2 > 0:
-            if self.container[size] > self.container[size // 2]:
+            if self.container[size] >= self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
ts-3-5/test_3-5_0-8_247.py ...                                           [100%]
============================== 3 passed in 0.14s ===============================
