125 : Job ID f7438812539d4c6883c8388ab2648c63
test outcome: killed
binheap.py, start pos: (50, 34), end pos: (50, 35)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 2
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -47,7 +47,7 @@
         to_show = ''
         l = self.container[1:]
-        while len(self.container) > col:
+        while len(self.container) >= col:
             cols.append(col)
             col *= 2
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert '  1...
========================= 1 failed, 2 passed in 0.14s ==========================

126 : Job ID 5390db66831d4c7fa56c426a487cdb07
test outcome: killed
binheap.py, start pos: (25, 36), end pos: (25, 37)
operator: core/ReplaceComparisonOperator_Gt_Is, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -22,7 +22,7 @@
         """Helper function to balance heap."""
         size = len(self.container) - 1
         while size // 2 > 0:
-            if self.container[size] > self.container[size // 2]:
+            if self.container[size] is self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 5, 10] == [None,...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, 10] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 5 ...
============================== 3 failed in 0.15s ===============================

127 : Job ID a6c7b161b87e4893bf74460c94ba4424
test outcome: killed
binheap.py, start pos: (50, 34), end pos: (50, 35)
operator: core/ReplaceComparisonOperator_Gt_Is, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -47,7 +47,7 @@
         to_show = ''
         l = self.container[1:]
-        while len(self.container) > col:
+        while len(self.container) is col:
             cols.append(col)
             col *= 2
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert '' =...
========================= 1 failed, 2 passed in 0.14s ==========================

128 : Job ID 58c60dc41cf7452b81c61873fa826a74
test outcome: killed
binheap.py, start pos: (25, 36), end pos: (25, 37)
operator: core/ReplaceComparisonOperator_Gt_IsNot, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -22,7 +22,7 @@
         """Helper function to balance heap."""
         size = len(self.container) - 1
         while size // 2 > 0:
-            if self.container[size] > self.container[size // 2]:
+            if self.container[size] is not self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
ts-3-5/test_3-5_0-8_247.py .FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, 8, 5] == [None, 5...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 8 ...
========================= 2 failed, 1 passed in 0.15s ==========================

129 : Job ID 89fa791e07b847afa1488749cc160dd7
SURVIVED
test outcome: survived
binheap.py, start pos: (50, 34), end pos: (50, 35)
operator: core/ReplaceComparisonOperator_Gt_IsNot, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -47,7 +47,7 @@
         to_show = ''
         l = self.container[1:]
-        while len(self.container) > col:
+        while len(self.container) is not col:
             cols.append(col)
             col *= 2
ts-3-5/test_3-5_0-8_247.py ...                                           [100%]
============================== 3 passed in 0.14s ===============================

130 : Job ID 441e2cce829548a3949cb4531927673c
SURVIVED
test outcome: survived
binheap.py, start pos: (55, 24), end pos: (55, 25)
operator: core/ReplaceUnaryOperator_USub_UAdd, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[+1 - i] // 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ...                                           [100%]
============================== 3 passed in 0.14s ===============================

131 : Job ID 8a778502f9f145388c66a7972e81ceb1
test outcome: killed
binheap.py, start pos: (55, 24), end pos: (55, 25)
operator: core/ReplaceUnaryOperator_USub_Invert, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[~1 - i] // 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list index out ...
========================= 1 failed, 2 passed in 0.15s ==========================

132 : Job ID d8d8ec5768fc4cb5bbe28a29723c7a88
test outcome: killed
binheap.py, start pos: (55, 24), end pos: (55, 25)
operator: core/ReplaceUnaryOperator_USub_Not, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[not 1 - i] // 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert '10 ...
========================= 1 failed, 2 passed in 0.14s ==========================

133 : Job ID f4f52e4899ef4789a4f1f84851060862
SURVIVED
test outcome: survived
binheap.py, start pos: (55, 24), end pos: (55, 25)
operator: core/ReplaceUnaryOperator_Delete_USub, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[1 - i] // 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ...                                           [100%]
============================== 3 passed in 0.14s ===============================

134 : Job ID 3d60bbe061314eb09d32ad734092e6d3
test outcome: killed
binheap.py, start pos: (38, 11), end pos: (38, 14)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -35,7 +35,7 @@
     def pop(self):
         """Remove the top value of the heap."""
-        if not self.container:
+        if  self.container:
             raise IndexError('Can\'t pop from and empty heap')
         self.container.pop(1)
         self._balance()
ts-3-5/test_3-5_0-8_247.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: Can't pop from and ...
========================= 1 failed, 2 passed in 0.15s ==========================

135 : Job ID bbd3c6b076964df59b293951586c289b
test outcome: killed
binheap.py, start pos: (17, 11), end pos: (17, 15)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -14,7 +14,7 @@
     def __init__(self, data=None):
         """Initialize bin heap."""
         self.container = [None]
-        if data:
+        if not data:
             for val in data:
                 self.push(val)
ts-3-5/test_3-5_0-8_247.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: 'NoneType' object is...
ERROR ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: 'NoneType' object is ...
ERROR ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: 'NoneType' object...
============================== 3 errors in 0.15s ===============================

136 : Job ID 87143a1ec4204778ae9c7ddcf90934b5
test outcome: killed
binheap.py, start pos: (24, 14), end pos: (24, 27)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -21,7 +21,7 @@
     def _balance(self):
         """Helper function to balance heap."""
         size = len(self.container) - 1
-        while size // 2 > 0:
+        while not size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: '>' not supported b...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: '>' not supported be...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: '>' not supporte...
============================== 3 failed in 0.14s ===============================

137 : Job ID 91bc24f76cd24f368816571c3b3bb0b2
test outcome: killed
binheap.py, start pos: (25, 15), end pos: (25, 63)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -22,7 +22,7 @@
         """Helper function to balance heap."""
         size = len(self.container) - 1
         while size // 2 > 0:
-            if self.container[size] > self.container[size // 2]:
+            if not self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 5, 10] == [None,...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, 10] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 5 ...
============================== 3 failed in 0.14s ===============================

138 : Job ID 1da455edbe1a4ef889ea26a2dbf28d5a
test outcome: killed
binheap.py, start pos: (38, 11), end pos: (38, 29)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -35,7 +35,7 @@
     def pop(self):
         """Remove the top value of the heap."""
-        if not self.container:
+        if not not self.container:
             raise IndexError('Can\'t pop from and empty heap')
         self.container.pop(1)
         self._balance()
ts-3-5/test_3-5_0-8_247.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: Can't pop from and ...
========================= 1 failed, 2 passed in 0.14s ==========================

139 : Job ID 3f940fe410764245a9f57b78f5602821
test outcome: killed
binheap.py, start pos: (50, 14), end pos: (50, 39)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -47,7 +47,7 @@
         to_show = ''
         l = self.container[1:]
-        while len(self.container) > col:
+        while not len(self.container) > col:
             cols.append(col)
             col *= 2
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert '' =...
========================= 1 failed, 2 passed in 0.14s ==========================

140 : Job ID e7c26bbe0d8c4abe92d1922991f7e061
test outcome: killed
binheap.py, start pos: (58, 19), end pos: (58, 20)
operator: core/AddNot, occurrence: 5
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -55,7 +55,7 @@
             buff = cols[-1 - i] // 2
             to_show += buff * ' '
             for idx in range(v):
-                if l:
+                if not l:
                     to_show += str(l.pop(0)) + ' '
             to_show += '\n'
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' \n...
========================= 1 failed, 2 passed in 0.14s ==========================

141 : Job ID e51d23f6600247d7a0fb8efb4a52e4ea
test outcome: killed
binheap.py, start pos: (23, 37), end pos: (23, 38)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -20,7 +20,7 @@
     def _balance(self):
         """Helper function to balance heap."""
-        size = len(self.container) - 1
+        size = len(self.container) - 2
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
ts-3-5/test_3-5_0-8_247.py FF.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 5, 10] == [None,...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, 10] == [None, 5]
========================= 2 failed, 1 passed in 0.14s ==========================

142 : Job ID 636ce0b2f13047e8a922f700c8b183d9
test outcome: killed
binheap.py, start pos: (23, 37), end pos: (23, 38)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -20,7 +20,7 @@
     def _balance(self):
         """Helper function to balance heap."""
-        size = len(self.container) - 1
+        size = len(self.container) - 0
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - IndexError: list index out of r...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list index out ...
============================== 3 failed in 0.15s ===============================

143 : Job ID 1f21c37f7d9948318cb1374e707c5b83
test outcome: killed
binheap.py, start pos: (24, 22), end pos: (24, 23)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -21,7 +21,7 @@
     def _balance(self):
         """Helper function to balance heap."""
         size = len(self.container) - 1
-        while size // 2 > 0:
+        while size // 3 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 5, 10] == [None,...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, 10] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 8 ...
============================== 3 failed in 0.15s ===============================

144 : Job ID 199a0228a8a74ed99aef7c74300c5b9c
test outcome: killed
binheap.py, start pos: (24, 22), end pos: (24, 23)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -21,7 +21,7 @@
     def _balance(self):
         """Helper function to balance heap."""
         size = len(self.container) - 1
-        while size // 2 > 0:
+        while size // 1 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: '>' not supported b...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: '>' not supported be...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: '>' not supporte...
============================== 3 failed in 0.14s ===============================

145 : Job ID de361ad528e840feb22aaa78cda65668
test outcome: killed
binheap.py, start pos: (24, 26), end pos: (24, 27)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -21,7 +21,7 @@
     def _balance(self):
         """Helper function to balance heap."""
         size = len(self.container) - 1
-        while size // 2 > 0:
+        while size // 2 > 1:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 5, 10] == [None,...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, 10] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 5 ...
============================== 3 failed in 0.14s ===============================

146 : Job ID ac0f88469a0e478a8dff13db419b7455
test outcome: killed
binheap.py, start pos: (24, 26), end pos: (24, 27)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -21,7 +21,7 @@
     def _balance(self):
         """Helper function to balance heap."""
         size = len(self.container) - 1
-        while size // 2 > 0:
+        while size // 2 > -1:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: '>' not supported b...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: '>' not supported be...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: '>' not supporte...
============================== 3 failed in 0.15s ===============================

147 : Job ID c232eac1f7a247adb215e8e8d4dae3cb
test outcome: killed
binheap.py, start pos: (25, 61), end pos: (25, 62)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -22,7 +22,7 @@
         """Helper function to balance heap."""
         size = len(self.container) - 1
         while size // 2 > 0:
-            if self.container[size] > self.container[size // 2]:
+            if self.container[size] > self.container[size // 3]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - TypeError: '>' not supported b...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - TypeError: '>' not supported be...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - TypeError: '>' not supporte...
============================== 3 failed in 0.14s ===============================

148 : Job ID e363c4fad8434c8e9823c742301f14f5
test outcome: killed
binheap.py, start pos: (25, 61), end pos: (25, 62)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -22,7 +22,7 @@
         """Helper function to balance heap."""
         size = len(self.container) - 1
         while size // 2 > 0:
-            if self.container[size] > self.container[size // 2]:
+            if self.container[size] > self.container[size // 1]:
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 5, 10] == [None,...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, 10] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 5 ...
============================== 3 failed in 0.14s ===============================

149 : Job ID 91dce22e028844d68f164c85a8323c34
test outcome: killed
binheap.py, start pos: (26, 45), end pos: (26, 46)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -23,7 +23,7 @@
         size = len(self.container) - 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
-                tmp = self.container[size // 2]
+                tmp = self.container[size // 3]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 10, None] == [No...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, None] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 10...
============================== 3 failed in 0.14s ===============================

150 : Job ID 74a373d0eff647da87d121b7dadbee9d
test outcome: killed
binheap.py, start pos: (26, 45), end pos: (26, 46)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -23,7 +23,7 @@
         size = len(self.container) - 1
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
-                tmp = self.container[size // 2]
+                tmp = self.container[size // 1]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 10, 10] == [None...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, 10] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 10...
============================== 3 failed in 0.14s ===============================

151 : Job ID 5f66e3b34cff4c2dbc2c097192e41f04
test outcome: killed
binheap.py, start pos: (27, 39), end pos: (27, 40)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -24,7 +24,7 @@
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
-                self.container[size // 2] = self.container[size]
+                self.container[size // 3] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [10, 5, 5] == [None, 10...
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [10, 5] == [None, 5]
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 8 ...
============================== 3 failed in 0.15s ===============================

152 : Job ID 4499d20b784b42f3889ea99d40d18009
test outcome: killed
binheap.py, start pos: (27, 39), end pos: (27, 40)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -24,7 +24,7 @@
         while size // 2 > 0:
             if self.container[size] > self.container[size // 2]:
                 tmp = self.container[size // 2]
-                self.container[size // 2] = self.container[size]
+                self.container[size // 1] = self.container[size]
                 self.container[size] = tmp
             size = size // 2
ts-3-5/test_3-5_0-8_247.py F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_push - assert [None, 5, 5] == [None, ...
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 5 ...
========================= 2 failed, 1 passed in 0.14s ==========================

153 : Job ID ebc25b2be4a24130bb67d5a0bf2a1145
SURVIVED
test outcome: survived
binheap.py, start pos: (29, 27), end pos: (29, 28)
operator: core/NumberReplacer, occurrence: 12
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -26,7 +26,7 @@
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
-            size = size // 2
+            size = size // 3
     def push(self, val):
         """Put a new value into the heap."""
ts-3-5/test_3-5_0-8_247.py ...                                           [100%]
============================== 3 passed in 0.15s ===============================

154 : Job ID 63d32ba355c24cd2b789095764befbe2
test outcome: killed
binheap.py, start pos: (29, 27), end pos: (29, 28)
operator: core/NumberReplacer, occurrence: 13
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -26,7 +26,7 @@
                 tmp = self.container[size // 2]
                 self.container[size // 2] = self.container[size]
                 self.container[size] = tmp
-            size = size // 2
+            size = size // 1
     def push(self, val):
         """Put a new value into the heap."""
timeout

155 : Job ID 89c542e832084908bd98ea67fef84d90
test outcome: killed
binheap.py, start pos: (40, 27), end pos: (40, 28)
operator: core/NumberReplacer, occurrence: 14
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -37,7 +37,7 @@
         """Remove the top value of the heap."""
         if not self.container:
             raise IndexError('Can\'t pop from and empty heap')
-        self.container.pop(1)
+        self.container.pop( 2)
         self._balance()
     def display(self):
ts-3-5/test_3-5_0-8_247.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [None, 10] == [None, 5]
========================= 1 failed, 2 passed in 0.14s ==========================

156 : Job ID 8789724ef3a944c2b76abcc46fff2102
test outcome: killed
binheap.py, start pos: (40, 27), end pos: (40, 28)
operator: core/NumberReplacer, occurrence: 15
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -37,7 +37,7 @@
         """Remove the top value of the heap."""
         if not self.container:
             raise IndexError('Can\'t pop from and empty heap')
-        self.container.pop(1)
+        self.container.pop( 0)
         self._balance()
     def display(self):
ts-3-5/test_3-5_0-8_247.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_pop - assert [10, 5] == [None, 5]
========================= 1 failed, 2 passed in 0.14s ==========================

157 : Job ID 2352d8df7bce4cb5aad3a4b5f19f8b7f
test outcome: killed
binheap.py, start pos: (46, 14), end pos: (46, 15)
operator: core/NumberReplacer, occurrence: 16
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -43,7 +43,7 @@
     def display(self):
         """Display the heap as a tree."""
         cols = []
-        col = 1
+        col = 2
         to_show = ''
         l = self.container[1:]
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 10...
========================= 1 failed, 2 passed in 0.14s ==========================
