158 : Job ID 01934d43b31f46519a610243199c3dc3
test outcome: killed
binheap.py, start pos: (46, 14), end pos: (46, 15)
operator: core/NumberReplacer, occurrence: 17
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -43,7 +43,7 @@
     def display(self):
         """Display the heap as a tree."""
         cols = []
-        col = 1
+        col = 0
         to_show = ''
         l = self.container[1:]
timeout

159 : Job ID 20f67f83a68641268c570e7027404574
test outcome: killed
binheap.py, start pos: (48, 27), end pos: (48, 28)
operator: core/NumberReplacer, occurrence: 18
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -45,7 +45,7 @@
         cols = []
         col = 1
         to_show = ''
-        l = self.container[1:]
+        l = self.container[ 2:]
         while len(self.container) > col:
             cols.append(col)
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 5 ...
========================= 1 failed, 2 passed in 0.15s ==========================

160 : Job ID 8214c0ee14c4426a8b052a2feb04771d
test outcome: killed
binheap.py, start pos: (48, 27), end pos: (48, 28)
operator: core/NumberReplacer, occurrence: 19
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -45,7 +45,7 @@
         cols = []
         col = 1
         to_show = ''
-        l = self.container[1:]
+        l = self.container[ 0:]
         while len(self.container) > col:
             cols.append(col)
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' No...
========================= 1 failed, 2 passed in 0.15s ==========================

161 : Job ID 75541b00a187474cad6056b441804365
SURVIVED
test outcome: survived
binheap.py, start pos: (52, 19), end pos: (52, 20)
operator: core/NumberReplacer, occurrence: 20
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -49,7 +49,7 @@
         while len(self.container) > col:
             cols.append(col)
-            col *= 2
+            col *= 3
         for i, v in enumerate(cols):
             buff = cols[-1 - i] // 2
ts-3-5/test_3-5_0-8_247.py ...                                           [100%]
============================== 3 passed in 0.14s ===============================

162 : Job ID 08c87ad08023417ebc5e2e801cd51a77
test outcome: killed
binheap.py, start pos: (52, 19), end pos: (52, 20)
operator: core/NumberReplacer, occurrence: 21
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -49,7 +49,7 @@
         while len(self.container) > col:
             cols.append(col)
-            col *= 2
+            col *= 1
         for i, v in enumerate(cols):
             buff = cols[-1 - i] // 2
timeout

163 : Job ID 7025c8d0c0cb47fdbad8975ee975b0c5
test outcome: killed
binheap.py, start pos: (55, 25), end pos: (55, 26)
operator: core/NumberReplacer, occurrence: 22
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[- 2 - i] // 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: list index out ...
========================= 1 failed, 2 passed in 0.14s ==========================

164 : Job ID d96f100b4c6f4e5ab97c07dea55dcd49
test outcome: killed
binheap.py, start pos: (55, 25), end pos: (55, 26)
operator: core/NumberReplacer, occurrence: 23
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[- 0 - i] // 2
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert '10 ...
========================= 1 failed, 2 passed in 0.15s ==========================

165 : Job ID 29aa95d3dbff482894952019d35016f0
test outcome: killed
binheap.py, start pos: (55, 35), end pos: (55, 36)
operator: core/NumberReplacer, occurrence: 24
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 - i] // 3
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert '10 ...
========================= 1 failed, 2 passed in 0.14s ==========================

166 : Job ID c65ac4912d49420f8540db4c12e6f603
test outcome: killed
binheap.py, start pos: (55, 35), end pos: (55, 36)
operator: core/NumberReplacer, occurrence: 25
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -52,7 +52,7 @@
             col *= 2
         for i, v in enumerate(cols):
-            buff = cols[-1 - i] // 2
+            buff = cols[-1 - i] // 1
             to_show += buff * ' '
             for idx in range(v):
                 if l:
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert '  1...
========================= 1 failed, 2 passed in 0.14s ==========================

167 : Job ID 09fd345dadf442879cce255bd33fa5fb
test outcome: killed
binheap.py, start pos: (59, 41), end pos: (59, 42)
operator: core/NumberReplacer, occurrence: 26
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -56,7 +56,7 @@
             to_show += buff * ' '
             for idx in range(v):
                 if l:
-                    to_show += str(l.pop(0)) + ' '
+                    to_show += str(l.pop( 1)) + ' '
             to_show += '\n'
         return to_show
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - IndexError: pop index out o...
========================= 1 failed, 2 passed in 0.14s ==========================

168 : Job ID 5abd0efb055e4b2a869da51057be3465
test outcome: killed
binheap.py, start pos: (59, 41), end pos: (59, 42)
operator: core/NumberReplacer, occurrence: 27
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -56,7 +56,7 @@
             to_show += buff * ' '
             for idx in range(v):
                 if l:
-                    to_show += str(l.pop(0)) + ' '
+                    to_show += str(l.pop( -1)) + ' '
             to_show += '\n'
         return to_show
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' 8 ...
========================= 1 failed, 2 passed in 0.15s ==========================

169 : Job ID de64f6a0771342c69d7898d53b34ce72
SURVIVED
test outcome: survived
binheap.py, start pos: (18, 23), end pos: (18, 27)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -15,7 +15,7 @@
         """Initialize bin heap."""
         self.container = [None]
         if data:
-            for val in data:
+            for val in []:
                 self.push(val)
     def _balance(self):
ts-3-5/test_3-5_0-8_247.py ...                                           [100%]
============================== 3 passed in 0.14s ===============================

170 : Job ID eb6b802350cb44429506e4dc08856524
test outcome: killed
binheap.py, start pos: (54, 20), end pos: (54, 35)
operator: core/ZeroIterationForLoop, occurrence: 1
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -51,7 +51,7 @@
             cols.append(col)
             col *= 2
-        for i, v in enumerate(cols):
+        for i, v in []:
             buff = cols[-1 - i] // 2
             to_show += buff * ' '
             for idx in range(v):
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert '' =...
========================= 1 failed, 2 passed in 0.14s ==========================

171 : Job ID 894882ed0fcf4ea7ac85411a7339e2bc
test outcome: killed
binheap.py, start pos: (57, 23), end pos: (57, 31)
operator: core/ZeroIterationForLoop, occurrence: 2
--- mutation diff ---
--- abinheap.py
+++ bbinheap.py
@@ -54,7 +54,7 @@
         for i, v in enumerate(cols):
             buff = cols[-1 - i] // 2
             to_show += buff * ' '
-            for idx in range(v):
+            for idx in []:
                 if l:
                     to_show += str(l.pop(0)) + ' '
             to_show += '\n'
ts-3-5/test_3-5_0-8_247.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_247.py::test_display - AssertionError: assert ' \n...
========================= 1 failed, 2 passed in 0.15s ==========================
