   - [#   1] AOD binheap: 
--------------------------------------------------------------------------------
  51:             cols.append(col)
  52:             col *= 2
  53:         
  54:         for (i, v) in enumerate(cols):
- 55:             buff = cols[(-1) - i] // 2
+ 55:             buff = cols[1 - i] // 2
  56:             to_show += buff * ' '
  57:             for idx in range(v):
  58:                 if l:
  59:                     to_show += str(l.pop(0)) + ' '
--------------------------------------------------------------------------------
[0.19013 s] survived

   - [#   2] AOR binheap: 
--------------------------------------------------------------------------------
  19:                 self.push(val)
  20:     
  21:     def _balance(self):
  22:         '''Helper function to balance heap.'''
- 23:         size = len(self.container) - 1
+ 23:         size = len(self.container) + 1
  24:         while size // 2 > 0:
  25:             if self.container[size] > self.container[size // 2]:
  26:                 tmp = self.container[size // 2]
  27:                 self.container[size // 2] = self.container[size]
--------------------------------------------------------------------------------
[0.21438 s] killed by ts-3-5/test_3-5_0-7_223.py::test_push

binheap = <binheap.Binheap object at 0x74ec12b975e0>

    def test_push(binheap):
>       binheap.push(5)

ts-3-5/test_3-5_0-7_223.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binheap:34: in push
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec12b975e0>

>   ???
E   IndexError: list index out of range

binheap:25: IndexError

   - [#  13] AOR binheap: 
--------------------------------------------------------------------------------
  51:             cols.append(col)
  52:             col *= 2
  53:         
  54:         for (i, v) in enumerate(cols):
- 55:             buff = cols[(-1) - i] // 2
+ 55:             buff = cols[(+1) - i] // 2
  56:             to_show += buff * ' '
  57:             for idx in range(v):
  58:                 if l:
  59:                     to_show += str(l.pop(0)) + ' '
--------------------------------------------------------------------------------
[0.17356 s] survived

   - [#  14] AOR binheap: 
--------------------------------------------------------------------------------
  51:             cols.append(col)
  52:             col *= 2
  53:         
  54:         for (i, v) in enumerate(cols):
- 55:             buff = cols[(-1) - i] // 2
+ 55:             buff = cols[(-1) + i] // 2
  56:             to_show += buff * ' '
  57:             for idx in range(v):
  58:                 if l:
  59:                     to_show += str(l.pop(0)) + ' '
--------------------------------------------------------------------------------
[0.17845 s] survived

   - [#  16] AOR binheap: 
--------------------------------------------------------------------------------
  51:             cols.append(col)
  52:             col *= 2
  53:         
  54:         for (i, v) in enumerate(cols):
- 55:             buff = cols[(-1) - i] // 2
+ 55:             buff = cols[(-1) - i] * 2
  56:             to_show += buff * ' '
  57:             for idx in range(v):
  58:                 if l:
  59:                     to_show += str(l.pop(0)) + ' '
--------------------------------------------------------------------------------
[0.19441 s] killed by ts-3-5/test_3-5_0-7_223.py::test_display

binheap = <binheap.Binheap object at 0x74ec12b94e80>

    def test_display(binheap):
        binheap.push(5)
        binheap.push(10)
        binheap.push(15)
>       assert binheap.display() == ' 15 \n5 10 \n'
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:32: AssertionError

   - [#  21] ASR binheap: 
--------------------------------------------------------------------------------
  48:         l = self.container[1:]
  49:         
  50:         while len(self.container) > col:
  51:             cols.append(col)
- 52:             col *= 2
+ 52:             col /= 2
  53:         
  54:         for (i, v) in enumerate(cols):
  55:             buff = cols[(-1) - i] // 2
  56:             to_show += buff * ' '
--------------------------------------------------------------------------------
[5.00664 s] timeout

   - [#  22] ASR binheap: 
--------------------------------------------------------------------------------
  48:         l = self.container[1:]
  49:         
  50:         while len(self.container) > col:
  51:             cols.append(col)
- 52:             col *= 2
+ 52:             col //= 2
  53:         
  54:         for (i, v) in enumerate(cols):
  55:             buff = cols[(-1) - i] // 2
  56:             to_show += buff * ' '
--------------------------------------------------------------------------------
[5.00683 s] timeout

   - [#  23] ASR binheap: 
--------------------------------------------------------------------------------
  48:         l = self.container[1:]
  49:         
  50:         while len(self.container) > col:
  51:             cols.append(col)
- 52:             col *= 2
+ 52:             col **= 2
  53:         
  54:         for (i, v) in enumerate(cols):
  55:             buff = cols[(-1) - i] // 2
  56:             to_show += buff * ' '
--------------------------------------------------------------------------------
[5.00639 s] timeout

   - [#  27] CDI binheap: 
--------------------------------------------------------------------------------
  10:     pop(): removes the top value in the heap, maintaining the heap property.
  11:     dislplay(): displays the heap as a string representation of a tree.
  12:     '''
  13:     
- 14:     def __init__(self, data=None):
- 15:         '''Initialize bin heap.'''
- 16:         self.container = [None]
- 17:         if data:
- 18:             for val in data:
- 19:                 self.push(val)
- 20:     
+ 14:     @classmethod
+ 15:     def __init__(self, data=None):
+ 16:         '''Initialize bin heap.'''
+ 17:         self.container = [None]
+ 18:         if data:
+ 19:             for val in data:
+ 20:                 self.push(val)
  21:     def _balance(self):
  22:         '''Helper function to balance heap.'''
  23:         size = len(self.container) - 1
  24:         while size // 2 > 0:
--------------------------------------------------------------------------------
[0.18319 s] survived

   - [#  28] CDI binheap: 
--------------------------------------------------------------------------------
  17:         if data:
  18:             for val in data:
  19:                 self.push(val)
  20:     
- 21:     def _balance(self):
- 22:         '''Helper function to balance heap.'''
- 23:         size = len(self.container) - 1
- 24:         while size // 2 > 0:
- 25:             if self.container[size] > self.container[size // 2]:
- 26:                 tmp = self.container[size // 2]
- 27:                 self.container[size // 2] = self.container[size]
- 28:                 self.container[size] = tmp
- 29:             size = size // 2
- 30:     
+ 21:     @classmethod
+ 22:     def _balance(self):
+ 23:         '''Helper function to balance heap.'''
+ 24:         size = len(self.container) - 1
+ 25:         while size // 2 > 0:
+ 26:             if self.container[size] > self.container[size // 2]:
+ 27:                 tmp = self.container[size // 2]
+ 28:                 self.container[size // 2] = self.container[size]
+ 29:                 self.container[size] = tmp
+ 30:             size = size // 2
  31:     def push(self, val):
  32:         '''Put a new value into the heap.'''
  33:         self.container.append(val)
  34:         self._balance()
--------------------------------------------------------------------------------
[0.20645 s] killed by ts-3-5/test_3-5_0-7_223.py::test_push

binheap = <binheap.Binheap object at 0x74ec12a9d300>

    def test_push(binheap):
>       binheap.push(5)

ts-3-5/test_3-5_0-7_223.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binheap:34: in push
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'binheap.Binheap'>

   - [#  29] CDI binheap: 
--------------------------------------------------------------------------------
  27:                 self.container[size // 2] = self.container[size]
  28:                 self.container[size] = tmp
  29:             size = size // 2
  30:     
- 31:     def push(self, val):
- 32:         '''Put a new value into the heap.'''
- 33:         self.container.append(val)
- 34:         self._balance()
- 35:     
+ 31:     @classmethod
+ 32:     def push(self, val):
+ 33:         '''Put a new value into the heap.'''
+ 34:         self.container.append(val)
+ 35:         self._balance()
  36:     def pop(self):
  37:         '''Remove the top value of the heap.'''
  38:         if not (self.container):
  39:             raise IndexError("Can't pop from and empty heap")
--------------------------------------------------------------------------------
[0.21268 s] killed by ts-3-5/test_3-5_0-7_223.py::test_push

binheap = <binheap.Binheap object at 0x74ec12a48a30>

    def test_push(binheap):
>       binheap.push(5)

ts-3-5/test_3-5_0-7_223.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'binheap.Binheap'>, val = 5

>   ???
E   AttributeError: type object 'Binheap' has no attribute 'container'

binheap:34: AttributeError

   - [#  30] CDI binheap: 
--------------------------------------------------------------------------------
  32:         '''Put a new value into the heap.'''
  33:         self.container.append(val)
  34:         self._balance()
  35:     
- 36:     def pop(self):
- 37:         '''Remove the top value of the heap.'''
- 38:         if not (self.container):
- 39:             raise IndexError("Can't pop from and empty heap")
- 40:         self.container.pop(1)
- 41:         self._balance()
- 42:     
+ 36:     @classmethod
+ 37:     def pop(self):
+ 38:         '''Remove the top value of the heap.'''
+ 39:         if not (self.container):
+ 40:             raise IndexError("Can't pop from and empty heap")
+ 41:         self.container.pop(1)
+ 42:         self._balance()
  43:     def display(self):
  44:         '''Display the heap as a tree.'''
  45:         cols = []
  46:         col = 1
--------------------------------------------------------------------------------
[0.21056 s] killed by ts-3-5/test_3-5_0-7_223.py::test_pop

binheap = <binheap.Binheap object at 0x74ec1284ec50>

    def test_pop(binheap):
        binheap.push(5)
        binheap.push(10)
>       binheap.pop()

ts-3-5/test_3-5_0-7_223.py:25: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'binheap.Binheap'>

>   ???
E   AttributeError: type object 'Binheap' has no attribute 'container'

binheap:39: AttributeError

   - [#  31] CDI binheap: 
--------------------------------------------------------------------------------
  39:             raise IndexError("Can't pop from and empty heap")
  40:         self.container.pop(1)
  41:         self._balance()
  42:     
- 43:     def display(self):
- 44:         '''Display the heap as a tree.'''
- 45:         cols = []
- 46:         col = 1
- 47:         to_show = ''
- 48:         l = self.container[1:]
- 49:         
- 50:         while len(self.container) > col:
- 51:             cols.append(col)
- 52:             col *= 2
- 53:         
- 54:         for (i, v) in enumerate(cols):
- 55:             buff = cols[(-1) - i] // 2
- 56:             to_show += buff * ' '
- 57:             for idx in range(v):
- 58:                 if l:
- 59:                     to_show += str(l.pop(0)) + ' '
- 60:             to_show += '\n'
- 61:         
- 62:         return to_show
+ 43:     @classmethod
+ 44:     def display(self):
+ 45:         '''Display the heap as a tree.'''
+ 46:         cols = []
+ 47:         col = 1
+ 48:         to_show = ''
+ 49:         l = self.container[1:]
+ 50:         
+ 51:         while len(self.container) > col:
+ 52:             cols.append(col)
+ 53:             col *= 2
+ 54:         
+ 55:         for (i, v) in enumerate(cols):
+ 56:             buff = cols[(-1) - i] // 2
+ 57:             to_show += buff * ' '
+ 58:             for idx in range(v):
+ 59:                 if l:
+ 60:                     to_show += str(l.pop(0)) + ' '
+ 61:             to_show += '\n'

   - [#  32] COD binheap: 
--------------------------------------------------------------------------------
  34:         self._balance()
  35:     
  36:     def pop(self):
  37:         '''Remove the top value of the heap.'''
- 38:         if not (self.container):
+ 38:         if self.container:
  39:             raise IndexError("Can't pop from and empty heap")
  40:         self.container.pop(1)
  41:         self._balance()
  42:     
--------------------------------------------------------------------------------
[0.20464 s] killed by ts-3-5/test_3-5_0-7_223.py::test_pop

binheap = <binheap.Binheap object at 0x74ec12ae7df0>

    def test_pop(binheap):
        binheap.push(5)
        binheap.push(10)
>       binheap.pop()

ts-3-5/test_3-5_0-7_223.py:25: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec12ae7df0>

>   ???
E   IndexError: Can't pop from and empty heap

binheap:39: IndexError

   - [#  35] COI binheap: 
--------------------------------------------------------------------------------
  21:     def _balance(self):
  22:         '''Helper function to balance heap.'''
  23:         size = len(self.container) - 1
  24:         while size // 2 > 0:
- 25:             if self.container[size] > self.container[size // 2]:
+ 25:             if not (self.container[size] > self.container[size // 2]):
  26:                 tmp = self.container[size // 2]
  27:                 self.container[size // 2] = self.container[size]
  28:                 self.container[size] = tmp
  29:             size = size // 2
--------------------------------------------------------------------------------
[0.20709 s] killed by ts-3-5/test_3-5_0-7_223.py::test_push

binheap = <binheap.Binheap object at 0x74ec12a1df60>

    def test_push(binheap):
        binheap.push(5)
        assert binheap.container == [None, 5]
    
        binheap.push(10)
>       assert binheap.container == [None, 10, 5]
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:20: AssertionError

   - [#  36] COI binheap: 
--------------------------------------------------------------------------------
  34:         self._balance()
  35:     
  36:     def pop(self):
  37:         '''Remove the top value of the heap.'''
- 38:         if not (self.container):
+ 38:         if not ((not (self.container))):
  39:             raise IndexError("Can't pop from and empty heap")
  40:         self.container.pop(1)
  41:         self._balance()
  42:     
--------------------------------------------------------------------------------
[0.20493 s] killed by ts-3-5/test_3-5_0-7_223.py::test_pop

binheap = <binheap.Binheap object at 0x74ec12703850>

    def test_pop(binheap):
        binheap.push(5)
        binheap.push(10)
>       binheap.pop()

ts-3-5/test_3-5_0-7_223.py:25: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec12703850>

>   ???
E   IndexError: Can't pop from and empty heap

binheap:39: IndexError

   - [#  37] COI binheap: 
--------------------------------------------------------------------------------
  46:         col = 1
  47:         to_show = ''
  48:         l = self.container[1:]
  49:         
- 50:         while len(self.container) > col:
+ 50:         while not (len(self.container) > col):
  51:             cols.append(col)
  52:             col *= 2
  53:         
  54:         for (i, v) in enumerate(cols):
--------------------------------------------------------------------------------
[0.20609 s] killed by ts-3-5/test_3-5_0-7_223.py::test_display

binheap = <binheap.Binheap object at 0x74ec12cd1660>

    def test_display(binheap):
        binheap.push(5)
        binheap.push(10)
        binheap.push(15)
>       assert binheap.display() == ' 15 \n5 10 \n'
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:32: AssertionError

   - [#  39] OIL binheap: 
--------------------------------------------------------------------------------
  16:         self.container = [None]
  17:         if data:
  18:             for val in data:
  19:                 self.push(val)
- 20:     
+ 20:                 break
  21:     def _balance(self):
  22:         '''Helper function to balance heap.'''
  23:         size = len(self.container) - 1
  24:         while size // 2 > 0:
--------------------------------------------------------------------------------
[0.18232 s] survived

   - [#  40] OIL binheap: 
--------------------------------------------------------------------------------
  26:                 tmp = self.container[size // 2]
  27:                 self.container[size // 2] = self.container[size]
  28:                 self.container[size] = tmp
  29:             size = size // 2
- 30:     
+ 30:             break
  31:     def push(self, val):
  32:         '''Put a new value into the heap.'''
  33:         self.container.append(val)
  34:         self._balance()
--------------------------------------------------------------------------------
[0.18342 s] survived

   - [#  41] OIL binheap: 
--------------------------------------------------------------------------------
  49:         
  50:         while len(self.container) > col:
  51:             cols.append(col)
  52:             col *= 2
- 53:         
+ 53:             break
  54:         for (i, v) in enumerate(cols):
  55:             buff = cols[(-1) - i] // 2
  56:             to_show += buff * ' '
  57:             for idx in range(v):
--------------------------------------------------------------------------------
[0.20738 s] killed by ts-3-5/test_3-5_0-7_223.py::test_display

binheap = <binheap.Binheap object at 0x74ec12869960>

    def test_display(binheap):
        binheap.push(5)
        binheap.push(10)
        binheap.push(15)
>       assert binheap.display() == ' 15 \n5 10 \n'
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:32: AssertionError

   - [#  42] OIL binheap: 
--------------------------------------------------------------------------------
  57:             for idx in range(v):
  58:                 if l:
  59:                     to_show += str(l.pop(0)) + ' '
  60:             to_show += '\n'
- 61:         
+ 61:             break
  62:         return to_show
--------------------------------------------------------------------------------
[0.20969 s] killed by ts-3-5/test_3-5_0-7_223.py::test_display

binheap = <binheap.Binheap object at 0x74ec12826a40>

    def test_display(binheap):
        binheap.push(5)
        binheap.push(10)
        binheap.push(15)
>       assert binheap.display() == ' 15 \n5 10 \n'
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:32: AssertionError

   - [#  43] OIL binheap: 
--------------------------------------------------------------------------------
  56:             to_show += buff * ' '
  57:             for idx in range(v):
  58:                 if l:
  59:                     to_show += str(l.pop(0)) + ' '
- 60:             to_show += '\n'
- 61:         
+ 60:                 break
+ 61:             to_show += '\n'
  62:         return to_show
--------------------------------------------------------------------------------
[0.20859 s] killed by ts-3-5/test_3-5_0-7_223.py::test_display

binheap = <binheap.Binheap object at 0x74ec1270f2b0>

    def test_display(binheap):
        binheap.push(5)
        binheap.push(10)
        binheap.push(15)
>       assert binheap.display() == ' 15 \n5 10 \n'
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:32: AssertionError

   - [#  44] RIL binheap: 
--------------------------------------------------------------------------------
  14:     def __init__(self, data=None):
  15:         '''Initialize bin heap.'''
  16:         self.container = [None]
  17:         if data:
- 18:             for val in data:
+ 18:             for val in reversed(data):
  19:                 self.push(val)
  20:     
  21:     def _balance(self):
  22:         '''Helper function to balance heap.'''
--------------------------------------------------------------------------------
[0.18203 s] survived

   - [#  46] RIL binheap: 
--------------------------------------------------------------------------------
  53:         
  54:         for (i, v) in enumerate(cols):
  55:             buff = cols[(-1) - i] // 2
  56:             to_show += buff * ' '
- 57:             for idx in range(v):
+ 57:             for idx in reversed(range(v)):
  58:                 if l:
  59:                     to_show += str(l.pop(0)) + ' '
  60:             to_show += '\n'
  61:         
--------------------------------------------------------------------------------
[0.18348 s] survived

   - [#  51] ROR binheap: 
--------------------------------------------------------------------------------
  46:         col = 1
  47:         to_show = ''
  48:         l = self.container[1:]
  49:         
- 50:         while len(self.container) > col:
+ 50:         while len(self.container) < col:
  51:             cols.append(col)
  52:             col *= 2
  53:         
  54:         for (i, v) in enumerate(cols):
--------------------------------------------------------------------------------
[0.19883 s] killed by ts-3-5/test_3-5_0-7_223.py::test_display

binheap = <binheap.Binheap object at 0x74ec128bd4e0>

    def test_display(binheap):
        binheap.push(5)
        binheap.push(10)
        binheap.push(15)
>       assert binheap.display() == ' 15 \n5 10 \n'
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:32: AssertionError

   - [#  52] ROR binheap: 
--------------------------------------------------------------------------------
  46:         col = 1
  47:         to_show = ''
  48:         l = self.container[1:]
  49:         
- 50:         while len(self.container) > col:
+ 50:         while len(self.container) >= col:
  51:             cols.append(col)
  52:             col *= 2
  53:         
  54:         for (i, v) in enumerate(cols):
--------------------------------------------------------------------------------
[0.20368 s] killed by ts-3-5/test_3-5_0-7_223.py::test_display

binheap = <binheap.Binheap object at 0x74ec127b20e0>

    def test_display(binheap):
        binheap.push(5)
        binheap.push(10)
        binheap.push(15)
>       assert binheap.display() == ' 15 \n5 10 \n'
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:32: AssertionError

   - [#  58] SDL binheap: 
--------------------------------------------------------------------------------
  12:     '''
  13:     
  14:     def __init__(self, data=None):
  15:         '''Initialize bin heap.'''
- 16:         self.container = [None]
+ 16:         pass
  17:         if data:
  18:             for val in data:
  19:                 self.push(val)
  20:     
--------------------------------------------------------------------------------
[0.20282 s] killed by ts-3-5/test_3-5_0-7_223.py::test_push

binheap = <binheap.Binheap object at 0x74ec12827100>

    def test_push(binheap):
>       binheap.push(5)

ts-3-5/test_3-5_0-7_223.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec12827100>, val = 5

>   ???
E   AttributeError: 'Binheap' object has no attribute 'container'

binheap:33: AttributeError

   - [#  60] SDL binheap: 
--------------------------------------------------------------------------------
  19:                 self.push(val)
  20:     
  21:     def _balance(self):
  22:         '''Helper function to balance heap.'''
- 23:         size = len(self.container) - 1
+ 23:         pass
  24:         while size // 2 > 0:
  25:             if self.container[size] > self.container[size // 2]:
  26:                 tmp = self.container[size // 2]
  27:                 self.container[size // 2] = self.container[size]
--------------------------------------------------------------------------------
[0.19781 s] killed by ts-3-5/test_3-5_0-7_223.py::test_push

binheap = <binheap.Binheap object at 0x74ec12a1cb20>

    def test_push(binheap):
>       binheap.push(5)

ts-3-5/test_3-5_0-7_223.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binheap:34: in push
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec12a1cb20>

>   ???
E   UnboundLocalError: local variable 'size' referenced before assignment

binheap:24: UnboundLocalError

   - [#  61] SDL binheap: 
--------------------------------------------------------------------------------
  22:         '''Helper function to balance heap.'''
  23:         size = len(self.container) - 1
  24:         while size // 2 > 0:
  25:             if self.container[size] > self.container[size // 2]:
- 26:                 tmp = self.container[size // 2]
+ 26:                 pass
  27:                 self.container[size // 2] = self.container[size]
  28:                 self.container[size] = tmp
  29:             size = size // 2
  30:     
--------------------------------------------------------------------------------
[0.20673 s] killed by ts-3-5/test_3-5_0-7_223.py::test_push

binheap = <binheap.Binheap object at 0x74ec128607f0>

    def test_push(binheap):
        binheap.push(5)
        assert binheap.container == [None, 5]
    
>       binheap.push(10)

ts-3-5/test_3-5_0-7_223.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binheap:34: in push
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec128607f0>

>   ???
E   NameError: name 'tmp' is not defined

binheap:28: NameError

   - [#  62] SDL binheap: 
--------------------------------------------------------------------------------
  23:         size = len(self.container) - 1
  24:         while size // 2 > 0:
  25:             if self.container[size] > self.container[size // 2]:
  26:                 tmp = self.container[size // 2]
- 27:                 self.container[size // 2] = self.container[size]
+ 27:                 pass
  28:                 self.container[size] = tmp
  29:             size = size // 2
  30:     
  31:     def push(self, val):
--------------------------------------------------------------------------------
[0.20975 s] killed by ts-3-5/test_3-5_0-7_223.py::test_push

binheap = <binheap.Binheap object at 0x74ec12ae6cb0>

    def test_push(binheap):
        binheap.push(5)
        assert binheap.container == [None, 5]
    
        binheap.push(10)
>       assert binheap.container == [None, 10, 5]
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:20: AssertionError

   - [#  63] SDL binheap: 
--------------------------------------------------------------------------------
  24:         while size // 2 > 0:
  25:             if self.container[size] > self.container[size // 2]:
  26:                 tmp = self.container[size // 2]
  27:                 self.container[size // 2] = self.container[size]
- 28:                 self.container[size] = tmp
+ 28:                 pass
  29:             size = size // 2
  30:     
  31:     def push(self, val):
  32:         '''Put a new value into the heap.'''
--------------------------------------------------------------------------------
[0.20197 s] killed by ts-3-5/test_3-5_0-7_223.py::test_push

binheap = <binheap.Binheap object at 0x74ec12ae4d00>

    def test_push(binheap):
        binheap.push(5)
        assert binheap.container == [None, 5]
    
        binheap.push(10)
>       assert binheap.container == [None, 10, 5]
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:20: AssertionError

   - [#  64] SDL binheap: 
--------------------------------------------------------------------------------
  25:             if self.container[size] > self.container[size // 2]:
  26:                 tmp = self.container[size // 2]
  27:                 self.container[size // 2] = self.container[size]
  28:                 self.container[size] = tmp
- 29:             size = size // 2
+ 29:             pass
  30:     
  31:     def push(self, val):
  32:         '''Put a new value into the heap.'''
  33:         self.container.append(val)
--------------------------------------------------------------------------------
[5.00666 s] timeout

   - [#  65] SDL binheap: 
--------------------------------------------------------------------------------
  29:             size = size // 2
  30:     
  31:     def push(self, val):
  32:         '''Put a new value into the heap.'''
- 33:         self.container.append(val)
+ 33:         pass
  34:         self._balance()
  35:     
  36:     def pop(self):
  37:         '''Remove the top value of the heap.'''
--------------------------------------------------------------------------------
[0.19889 s] killed by ts-3-5/test_3-5_0-7_223.py::test_push

binheap = <binheap.Binheap object at 0x74ec1270dde0>

    def test_push(binheap):
        binheap.push(5)
>       assert binheap.container == [None, 5]
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:17: AssertionError
