   - [#  66] SDL binheap: 
--------------------------------------------------------------------------------
  30:     
  31:     def push(self, val):
  32:         '''Put a new value into the heap.'''
  33:         self.container.append(val)
- 34:         self._balance()
+ 34:         pass
  35:     
  36:     def pop(self):
  37:         '''Remove the top value of the heap.'''
  38:         if not (self.container):
--------------------------------------------------------------------------------
[0.20124 s] killed by ts-3-5/test_3-5_0-7_223.py::test_push

binheap = <binheap.Binheap object at 0x74ec1286b700>

    def test_push(binheap):
        binheap.push(5)
        assert binheap.container == [None, 5]
    
        binheap.push(10)
>       assert binheap.container == [None, 10, 5]
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:20: AssertionError

   - [#  67] SDL binheap: 
--------------------------------------------------------------------------------
  36:     def pop(self):
  37:         '''Remove the top value of the heap.'''
  38:         if not (self.container):
  39:             raise IndexError("Can't pop from and empty heap")
- 40:         self.container.pop(1)
+ 40:         pass
  41:         self._balance()
  42:     
  43:     def display(self):
  44:         '''Display the heap as a tree.'''
--------------------------------------------------------------------------------
[0.21509 s] killed by ts-3-5/test_3-5_0-7_223.py::test_pop

binheap = <binheap.Binheap object at 0x74ec1270e4d0>

    def test_pop(binheap):
        binheap.push(5)
        binheap.push(10)
        binheap.pop()
>       assert binheap.container == [None, 5]
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:26: AssertionError

   - [#  68] SDL binheap: 
--------------------------------------------------------------------------------
  37:         '''Remove the top value of the heap.'''
  38:         if not (self.container):
  39:             raise IndexError("Can't pop from and empty heap")
  40:         self.container.pop(1)
- 41:         self._balance()
+ 41:         pass
  42:     
  43:     def display(self):
  44:         '''Display the heap as a tree.'''
  45:         cols = []
--------------------------------------------------------------------------------
[0.17729 s] survived

   - [#  69] SDL binheap: 
--------------------------------------------------------------------------------
  41:         self._balance()
  42:     
  43:     def display(self):
  44:         '''Display the heap as a tree.'''
- 45:         cols = []
+ 45:         pass
  46:         col = 1
  47:         to_show = ''
  48:         l = self.container[1:]
  49:         
--------------------------------------------------------------------------------
[0.20511 s] killed by ts-3-5/test_3-5_0-7_223.py::test_display

binheap = <binheap.Binheap object at 0x74ec12a9e1d0>

    def test_display(binheap):
        binheap.push(5)
        binheap.push(10)
        binheap.push(15)
>       assert binheap.display() == ' 15 \n5 10 \n'

ts-3-5/test_3-5_0-7_223.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec12a9e1d0>

>   ???
E   NameError: name 'cols' is not defined

binheap:51: NameError

   - [#  70] SDL binheap: 
--------------------------------------------------------------------------------
  42:     
  43:     def display(self):
  44:         '''Display the heap as a tree.'''
  45:         cols = []
- 46:         col = 1
+ 46:         pass
  47:         to_show = ''
  48:         l = self.container[1:]
  49:         
  50:         while len(self.container) > col:
--------------------------------------------------------------------------------
[0.20976 s] killed by ts-3-5/test_3-5_0-7_223.py::test_display

binheap = <binheap.Binheap object at 0x74ec1284c9d0>

    def test_display(binheap):
        binheap.push(5)
        binheap.push(10)
        binheap.push(15)
>       assert binheap.display() == ' 15 \n5 10 \n'

ts-3-5/test_3-5_0-7_223.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec1284c9d0>

>   ???
E   UnboundLocalError: local variable 'col' referenced before assignment

binheap:50: UnboundLocalError

   - [#  71] SDL binheap: 
--------------------------------------------------------------------------------
  43:     def display(self):
  44:         '''Display the heap as a tree.'''
  45:         cols = []
  46:         col = 1
- 47:         to_show = ''
+ 47:         pass
  48:         l = self.container[1:]
  49:         
  50:         while len(self.container) > col:
  51:             cols.append(col)
--------------------------------------------------------------------------------
[0.19777 s] killed by ts-3-5/test_3-5_0-7_223.py::test_display

binheap = <binheap.Binheap object at 0x74ec1286b040>

    def test_display(binheap):
        binheap.push(5)
        binheap.push(10)
        binheap.push(15)
>       assert binheap.display() == ' 15 \n5 10 \n'

ts-3-5/test_3-5_0-7_223.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec1286b040>

>   ???
E   UnboundLocalError: local variable 'to_show' referenced before assignment

binheap:56: UnboundLocalError

   - [#  72] SDL binheap: 
--------------------------------------------------------------------------------
  44:         '''Display the heap as a tree.'''
  45:         cols = []
  46:         col = 1
  47:         to_show = ''
- 48:         l = self.container[1:]
+ 48:         pass
  49:         
  50:         while len(self.container) > col:
  51:             cols.append(col)
  52:             col *= 2
--------------------------------------------------------------------------------
[0.22051 s] killed by ts-3-5/test_3-5_0-7_223.py::test_display

binheap = <binheap.Binheap object at 0x74ec12b57c40>

    def test_display(binheap):
        binheap.push(5)
        binheap.push(10)
        binheap.push(15)
>       assert binheap.display() == ' 15 \n5 10 \n'

ts-3-5/test_3-5_0-7_223.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec12b57c40>

>   ???
E   NameError: name 'l' is not defined

binheap:58: NameError

   - [#  73] SDL binheap: 
--------------------------------------------------------------------------------
  47:         to_show = ''
  48:         l = self.container[1:]
  49:         
  50:         while len(self.container) > col:
- 51:             cols.append(col)
+ 51:             pass
  52:             col *= 2
  53:         
  54:         for (i, v) in enumerate(cols):
  55:             buff = cols[(-1) - i] // 2
--------------------------------------------------------------------------------
[0.20582 s] killed by ts-3-5/test_3-5_0-7_223.py::test_display

binheap = <binheap.Binheap object at 0x74ec1282d4b0>

    def test_display(binheap):
        binheap.push(5)
        binheap.push(10)
        binheap.push(15)
>       assert binheap.display() == ' 15 \n5 10 \n'
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:32: AssertionError

   - [#  74] SDL binheap: 
--------------------------------------------------------------------------------
  51:             cols.append(col)
  52:             col *= 2
  53:         
  54:         for (i, v) in enumerate(cols):
- 55:             buff = cols[(-1) - i] // 2
+ 55:             pass
  56:             to_show += buff * ' '
  57:             for idx in range(v):
  58:                 if l:
  59:                     to_show += str(l.pop(0)) + ' '
--------------------------------------------------------------------------------
[0.19841 s] killed by ts-3-5/test_3-5_0-7_223.py::test_display

binheap = <binheap.Binheap object at 0x74ec1274c400>

    def test_display(binheap):
        binheap.push(5)
        binheap.push(10)
        binheap.push(15)
>       assert binheap.display() == ' 15 \n5 10 \n'

ts-3-5/test_3-5_0-7_223.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec1274c400>

>   ???
E   NameError: name 'buff' is not defined

binheap:56: NameError

   - [#  75] SDL binheap: 
--------------------------------------------------------------------------------
  58:                 if l:
  59:                     to_show += str(l.pop(0)) + ' '
  60:             to_show += '\n'
  61:         
- 62:         return to_show
+ 62:         pass
--------------------------------------------------------------------------------
[0.20344 s] killed by ts-3-5/test_3-5_0-7_223.py::test_display

binheap = <binheap.Binheap object at 0x74ec12be0d90>

    def test_display(binheap):
        binheap.push(5)
        binheap.push(10)
        binheap.push(15)
>       assert binheap.display() == ' 15 \n5 10 \n'
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:32: AssertionError

   - [#  76] SIR binheap: 
--------------------------------------------------------------------------------
  44:         '''Display the heap as a tree.'''
  45:         cols = []
  46:         col = 1
  47:         to_show = ''
- 48:         l = self.container[1:]
+ 48:         l = self.container[:]
  49:         
  50:         while len(self.container) > col:
  51:             cols.append(col)
  52:             col *= 2
--------------------------------------------------------------------------------
[0.20936 s] killed by ts-3-5/test_3-5_0-7_223.py::test_display

binheap = <binheap.Binheap object at 0x74ec12824250>

    def test_display(binheap):
        binheap.push(5)
        binheap.push(10)
        binheap.push(15)
>       assert binheap.display() == ' 15 \n5 10 \n'
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:32: AssertionError

   - [#  79] SVD binheap: 
--------------------------------------------------------------------------------
  19:                 self.push(val)
  20:     
  21:     def _balance(self):
  22:         '''Helper function to balance heap.'''
- 23:         size = len(self.container) - 1
+ 23:         size = len(container) - 1
  24:         while size // 2 > 0:
  25:             if self.container[size] > self.container[size // 2]:
  26:                 tmp = self.container[size // 2]
  27:                 self.container[size // 2] = self.container[size]
--------------------------------------------------------------------------------
[0.20472 s] killed by ts-3-5/test_3-5_0-7_223.py::test_push

binheap = <binheap.Binheap object at 0x74ec12aa2a70>

    def test_push(binheap):
>       binheap.push(5)

ts-3-5/test_3-5_0-7_223.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binheap:34: in push
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec12aa2a70>

>   ???
E   NameError: name 'container' is not defined

binheap:23: NameError

   - [#  80] SVD binheap: 
--------------------------------------------------------------------------------
  21:     def _balance(self):
  22:         '''Helper function to balance heap.'''
  23:         size = len(self.container) - 1
  24:         while size // 2 > 0:
- 25:             if self.container[size] > self.container[size // 2]:
+ 25:             if container[size] > self.container[size // 2]:
  26:                 tmp = self.container[size // 2]
  27:                 self.container[size // 2] = self.container[size]
  28:                 self.container[size] = tmp
  29:             size = size // 2
--------------------------------------------------------------------------------
[0.20834 s] killed by ts-3-5/test_3-5_0-7_223.py::test_push

binheap = <binheap.Binheap object at 0x74ec1282de40>

    def test_push(binheap):
        binheap.push(5)
        assert binheap.container == [None, 5]
    
>       binheap.push(10)

ts-3-5/test_3-5_0-7_223.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binheap:34: in push
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec1282de40>

>   ???
E   NameError: name 'container' is not defined

binheap:25: NameError

   - [#  81] SVD binheap: 
--------------------------------------------------------------------------------
  21:     def _balance(self):
  22:         '''Helper function to balance heap.'''
  23:         size = len(self.container) - 1
  24:         while size // 2 > 0:
- 25:             if self.container[size] > self.container[size // 2]:
+ 25:             if self.container[size] > container[size // 2]:
  26:                 tmp = self.container[size // 2]
  27:                 self.container[size // 2] = self.container[size]
  28:                 self.container[size] = tmp
  29:             size = size // 2
--------------------------------------------------------------------------------
[0.20249 s] killed by ts-3-5/test_3-5_0-7_223.py::test_push

binheap = <binheap.Binheap object at 0x74ec1282c220>

    def test_push(binheap):
        binheap.push(5)
        assert binheap.container == [None, 5]
    
>       binheap.push(10)

ts-3-5/test_3-5_0-7_223.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binheap:34: in push
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec1282c220>

>   ???
E   NameError: name 'container' is not defined

binheap:25: NameError

   - [#  82] SVD binheap: 
--------------------------------------------------------------------------------
  22:         '''Helper function to balance heap.'''
  23:         size = len(self.container) - 1
  24:         while size // 2 > 0:
  25:             if self.container[size] > self.container[size // 2]:
- 26:                 tmp = self.container[size // 2]
+ 26:                 tmp = container[size // 2]
  27:                 self.container[size // 2] = self.container[size]
  28:                 self.container[size] = tmp
  29:             size = size // 2
  30:     
--------------------------------------------------------------------------------
[0.20455 s] killed by ts-3-5/test_3-5_0-7_223.py::test_push

binheap = <binheap.Binheap object at 0x74ec127b0f40>

    def test_push(binheap):
        binheap.push(5)
        assert binheap.container == [None, 5]
    
>       binheap.push(10)

ts-3-5/test_3-5_0-7_223.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binheap:34: in push
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec127b0f40>

>   ???
E   NameError: name 'container' is not defined

binheap:26: NameError

   - [#  83] SVD binheap: 
--------------------------------------------------------------------------------
  23:         size = len(self.container) - 1
  24:         while size // 2 > 0:
  25:             if self.container[size] > self.container[size // 2]:
  26:                 tmp = self.container[size // 2]
- 27:                 self.container[size // 2] = self.container[size]
+ 27:                 container[size // 2] = self.container[size]
  28:                 self.container[size] = tmp
  29:             size = size // 2
  30:     
  31:     def push(self, val):
--------------------------------------------------------------------------------
[0.20688 s] killed by ts-3-5/test_3-5_0-7_223.py::test_push

binheap = <binheap.Binheap object at 0x74ec12aa1960>

    def test_push(binheap):
        binheap.push(5)
        assert binheap.container == [None, 5]
    
>       binheap.push(10)

ts-3-5/test_3-5_0-7_223.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binheap:34: in push
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec12aa1960>

>   ???
E   NameError: name 'container' is not defined

binheap:27: NameError

   - [#  84] SVD binheap: 
--------------------------------------------------------------------------------
  23:         size = len(self.container) - 1
  24:         while size // 2 > 0:
  25:             if self.container[size] > self.container[size // 2]:
  26:                 tmp = self.container[size // 2]
- 27:                 self.container[size // 2] = self.container[size]
+ 27:                 self.container[size // 2] = container[size]
  28:                 self.container[size] = tmp
  29:             size = size // 2
  30:     
  31:     def push(self, val):
--------------------------------------------------------------------------------
[0.20348 s] killed by ts-3-5/test_3-5_0-7_223.py::test_push

binheap = <binheap.Binheap object at 0x74ec12ae5c00>

    def test_push(binheap):
        binheap.push(5)
        assert binheap.container == [None, 5]
    
>       binheap.push(10)

ts-3-5/test_3-5_0-7_223.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binheap:34: in push
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec12ae5c00>

>   ???
E   NameError: name 'container' is not defined

binheap:27: NameError

   - [#  85] SVD binheap: 
--------------------------------------------------------------------------------
  24:         while size // 2 > 0:
  25:             if self.container[size] > self.container[size // 2]:
  26:                 tmp = self.container[size // 2]
  27:                 self.container[size // 2] = self.container[size]
- 28:                 self.container[size] = tmp
+ 28:                 container[size] = tmp
  29:             size = size // 2
  30:     
  31:     def push(self, val):
  32:         '''Put a new value into the heap.'''
--------------------------------------------------------------------------------
[0.20338 s] killed by ts-3-5/test_3-5_0-7_223.py::test_push

binheap = <binheap.Binheap object at 0x74ec12aa30a0>

    def test_push(binheap):
        binheap.push(5)
        assert binheap.container == [None, 5]
    
>       binheap.push(10)

ts-3-5/test_3-5_0-7_223.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binheap:34: in push
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec12aa30a0>

>   ???
E   NameError: name 'container' is not defined

binheap:28: NameError

   - [#  86] SVD binheap: 
--------------------------------------------------------------------------------
  29:             size = size // 2
  30:     
  31:     def push(self, val):
  32:         '''Put a new value into the heap.'''
- 33:         self.container.append(val)
+ 33:         container.append(val)
  34:         self._balance()
  35:     
  36:     def pop(self):
  37:         '''Remove the top value of the heap.'''
--------------------------------------------------------------------------------
[0.21138 s] killed by ts-3-5/test_3-5_0-7_223.py::test_push

binheap = <binheap.Binheap object at 0x74ec12a9e950>

    def test_push(binheap):
>       binheap.push(5)

ts-3-5/test_3-5_0-7_223.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec12a9e950>, val = 5

>   ???
E   NameError: name 'container' is not defined

binheap:33: NameError

   - [#  87] SVD binheap: 
--------------------------------------------------------------------------------
  30:     
  31:     def push(self, val):
  32:         '''Put a new value into the heap.'''
  33:         self.container.append(val)
- 34:         self._balance()
+ 34:         _balance()
  35:     
  36:     def pop(self):
  37:         '''Remove the top value of the heap.'''
  38:         if not (self.container):
--------------------------------------------------------------------------------
[0.20278 s] killed by ts-3-5/test_3-5_0-7_223.py::test_push

binheap = <binheap.Binheap object at 0x74ec1282fee0>

    def test_push(binheap):
>       binheap.push(5)

ts-3-5/test_3-5_0-7_223.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec1282fee0>, val = 5

>   ???
E   NameError: name '_balance' is not defined

binheap:34: NameError

   - [#  88] SVD binheap: 
--------------------------------------------------------------------------------
  34:         self._balance()
  35:     
  36:     def pop(self):
  37:         '''Remove the top value of the heap.'''
- 38:         if not (self.container):
+ 38:         if not container:
  39:             raise IndexError("Can't pop from and empty heap")
  40:         self.container.pop(1)
  41:         self._balance()
  42:     
--------------------------------------------------------------------------------
[0.20596 s] killed by ts-3-5/test_3-5_0-7_223.py::test_pop

binheap = <binheap.Binheap object at 0x74ec128253c0>

    def test_pop(binheap):
        binheap.push(5)
        binheap.push(10)
>       binheap.pop()

ts-3-5/test_3-5_0-7_223.py:25: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec128253c0>

>   ???
E   NameError: name 'container' is not defined

binheap:38: NameError

   - [#  89] SVD binheap: 
--------------------------------------------------------------------------------
  36:     def pop(self):
  37:         '''Remove the top value of the heap.'''
  38:         if not (self.container):
  39:             raise IndexError("Can't pop from and empty heap")
- 40:         self.container.pop(1)
+ 40:         container.pop(1)
  41:         self._balance()
  42:     
  43:     def display(self):
  44:         '''Display the heap as a tree.'''
--------------------------------------------------------------------------------
[0.20495 s] killed by ts-3-5/test_3-5_0-7_223.py::test_pop

binheap = <binheap.Binheap object at 0x74ec128a0040>

    def test_pop(binheap):
        binheap.push(5)
        binheap.push(10)
>       binheap.pop()

ts-3-5/test_3-5_0-7_223.py:25: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec128a0040>

>   ???
E   NameError: name 'container' is not defined

binheap:40: NameError

   - [#  90] SVD binheap: 
--------------------------------------------------------------------------------
  37:         '''Remove the top value of the heap.'''
  38:         if not (self.container):
  39:             raise IndexError("Can't pop from and empty heap")
  40:         self.container.pop(1)
- 41:         self._balance()
+ 41:         _balance()
  42:     
  43:     def display(self):
  44:         '''Display the heap as a tree.'''
  45:         cols = []
--------------------------------------------------------------------------------
[0.20805 s] killed by ts-3-5/test_3-5_0-7_223.py::test_pop

binheap = <binheap.Binheap object at 0x74ec12aa2830>

    def test_pop(binheap):
        binheap.push(5)
        binheap.push(10)
>       binheap.pop()

ts-3-5/test_3-5_0-7_223.py:25: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec12aa2830>

>   ???
E   NameError: name '_balance' is not defined

binheap:41: NameError

   - [#  91] SVD binheap: 
--------------------------------------------------------------------------------
  44:         '''Display the heap as a tree.'''
  45:         cols = []
  46:         col = 1
  47:         to_show = ''
- 48:         l = self.container[1:]
+ 48:         l = container[1:]
  49:         
  50:         while len(self.container) > col:
  51:             cols.append(col)
  52:             col *= 2
--------------------------------------------------------------------------------
[0.22232 s] killed by ts-3-5/test_3-5_0-7_223.py::test_display

binheap = <binheap.Binheap object at 0x74ec1284d1b0>

    def test_display(binheap):
        binheap.push(5)
        binheap.push(10)
        binheap.push(15)
>       assert binheap.display() == ' 15 \n5 10 \n'

ts-3-5/test_3-5_0-7_223.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec1284d1b0>

>   ???
E   NameError: name 'container' is not defined

binheap:48: NameError

   - [#  92] SVD binheap: 
--------------------------------------------------------------------------------
  46:         col = 1
  47:         to_show = ''
  48:         l = self.container[1:]
  49:         
- 50:         while len(self.container) > col:
+ 50:         while len(container) > col:
  51:             cols.append(col)
  52:             col *= 2
  53:         
  54:         for (i, v) in enumerate(cols):
--------------------------------------------------------------------------------
[0.20728 s] killed by ts-3-5/test_3-5_0-7_223.py::test_display

binheap = <binheap.Binheap object at 0x74ec1274de70>

    def test_display(binheap):
        binheap.push(5)
        binheap.push(10)
        binheap.push(15)
>       assert binheap.display() == ' 15 \n5 10 \n'

ts-3-5/test_3-5_0-7_223.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binheap.Binheap object at 0x74ec1274de70>

>   ???
E   NameError: name 'container' is not defined

binheap:50: NameError

   - [#  94] ZIL binheap: 
--------------------------------------------------------------------------------
  21:     def _balance(self):
  22:         '''Helper function to balance heap.'''
  23:         size = len(self.container) - 1
  24:         while size // 2 > 0:
- 25:             if self.container[size] > self.container[size // 2]:
- 26:                 tmp = self.container[size // 2]
- 27:                 self.container[size // 2] = self.container[size]
- 28:                 self.container[size] = tmp
- 29:             size = size // 2
+ 25:             break
+ 26:     
+ 27:     
+ 28:     
+ 29:     
  30:     
  31:     def push(self, val):
  32:         '''Put a new value into the heap.'''
  33:         self.container.append(val)
--------------------------------------------------------------------------------
[0.22420 s] killed by ts-3-5/test_3-5_0-7_223.py::test_push

binheap = <binheap.Binheap object at 0x74ec12a49a50>

    def test_push(binheap):
        binheap.push(5)
        assert binheap.container == [None, 5]
    
        binheap.push(10)
>       assert binheap.container == [None, 10, 5]
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:20: AssertionError

   - [#  95] ZIL binheap: 
--------------------------------------------------------------------------------
  47:         to_show = ''
  48:         l = self.container[1:]
  49:         
  50:         while len(self.container) > col:
- 51:             cols.append(col)
- 52:             col *= 2
+ 51:             break
+ 52:         
  53:         
  54:         for (i, v) in enumerate(cols):
  55:             buff = cols[(-1) - i] // 2
  56:             to_show += buff * ' '
--------------------------------------------------------------------------------
[0.20593 s] killed by ts-3-5/test_3-5_0-7_223.py::test_display

binheap = <binheap.Binheap object at 0x74ec12ae4d00>

    def test_display(binheap):
        binheap.push(5)
        binheap.push(10)
        binheap.push(15)
>       assert binheap.display() == ' 15 \n5 10 \n'
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:32: AssertionError

   - [#  96] ZIL binheap: 
--------------------------------------------------------------------------------
  51:             cols.append(col)
  52:             col *= 2
  53:         
  54:         for (i, v) in enumerate(cols):
- 55:             buff = cols[(-1) - i] // 2
- 56:             to_show += buff * ' '
- 57:             for idx in range(v):
- 58:                 if l:
- 59:                     to_show += str(l.pop(0)) + ' '
- 60:             to_show += '\n'
+ 55:             break
+ 56:         
+ 57:         
+ 58:         
+ 59:         
+ 60:         
  61:         
  62:         return to_show
--------------------------------------------------------------------------------
[0.20363 s] killed by ts-3-5/test_3-5_0-7_223.py::test_display

binheap = <binheap.Binheap object at 0x74ec12cd15d0>

    def test_display(binheap):
        binheap.push(5)
        binheap.push(10)
        binheap.push(15)
>       assert binheap.display() == ' 15 \n5 10 \n'
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:32: AssertionError

   - [#  97] ZIL binheap: 
--------------------------------------------------------------------------------
  54:         for (i, v) in enumerate(cols):
  55:             buff = cols[(-1) - i] // 2
  56:             to_show += buff * ' '
  57:             for idx in range(v):
- 58:                 if l:
- 59:                     to_show += str(l.pop(0)) + ' '
+ 58:                 break
+ 59:             
  60:             to_show += '\n'
  61:         
  62:         return to_show
--------------------------------------------------------------------------------
[0.20684 s] killed by ts-3-5/test_3-5_0-7_223.py::test_display

binheap = <binheap.Binheap object at 0x74ec12a1dea0>

    def test_display(binheap):
        binheap.push(5)
        binheap.push(10)
        binheap.push(15)
>       assert binheap.display() == ' 15 \n5 10 \n'
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:32: AssertionError
