   - [#   1] ASR binary_search_tree: 
--------------------------------------------------------------------------------
  57:                 return t2
  58:             if not t2:
  59:                 return t1
  60:             
- 61:             t1.value += t2.value
+ 61:             t1.value -= t2.value
  62:             
  63:             
  64:             t1.left = mergeOntoT1(t1.left, t2.left)
  65:             
--------------------------------------------------------------------------------
[0.09901 s] survived

   - [#   3] CDI binary_search_tree: 
--------------------------------------------------------------------------------
   4:     
   5:     def __init__(self):
   6:         self.head = None
   7:     
-  8:     def insert(self, val):
-  9:         if not (self.head):
- 10:             self.head = BinaryTreeNode(val, None)
- 11:             return
- 12:         def add_node_recursive(node):
- 13:             if val < node.value:
- 14:                 if node.left:
- 15:                     add_node_recursive(node.left)
- 16:                 else:
- 17:                     node.left = BinaryTreeNode(val, node)
- 18:             
- 19:             elif node.right:
- 20:                 add_node_recursive(node.right)
- 21:             else:
- 22:                 node.right = BinaryTreeNode(val, node)
- 23:         add_node_recursive(self.head)
- 24:     
+  8:     @classmethod
+  9:     def insert(self, val):
+ 10:         if not (self.head):
+ 11:             self.head = BinaryTreeNode(val, None)
+ 12:             return
+ 13:         def add_node_recursive(node):
+ 14:             if val < node.value:
+ 15:                 if node.left:
+ 16:                     add_node_recursive(node.left)
+ 17:                 else:
+ 18:                     node.left = BinaryTreeNode(val, node)
+ 19:             
+ 20:             elif node.right:
+ 21:                 add_node_recursive(node.right)
+ 22:             else:
+ 23:                 node.right = BinaryTreeNode(val, node)
+ 24:         add_node_recursive(self.head)
  25:     def min(self):
  26:         return self.head.min().value
  27:     
  28:     def delete(self, value):
--------------------------------------------------------------------------------

   - [#   4] CDI binary_search_tree: 
--------------------------------------------------------------------------------
  21:             else:
  22:                 node.right = BinaryTreeNode(val, node)
  23:         add_node_recursive(self.head)
  24:     
- 25:     def min(self):
- 26:         return self.head.min().value
- 27:     
+ 25:     @classmethod
+ 26:     def min(self):
+ 27:         return self.head.min().value
  28:     def delete(self, value):
  29:         self.head.delete(value)
  30:     
  31:     def search(self, value):
--------------------------------------------------------------------------------
[0.08933 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_5

def test_case_5():
        list_0 = []
        binary_search_tree_0 = module_0.BinarySearchTree()
        var_0 = binary_search_tree_0.insert(list_0)
        assert f'{type(binary_search_tree_0.head).__module__}.{type(binary_search_tree_0.head).__qualname__}' == 'tree_node.BinaryTreeNode'
>       var_1 = binary_search_tree_0.min()

ALL-SMART/test_binary_search_tree_MOSA.py:37: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'binary_search_tree.BinarySearchTree'>

>   ???
E   AttributeError: type object 'BinarySearchTree' has no attribute 'head'

binary_search_tree:27: AttributeError

   - [#   5] CDI binary_search_tree: 
--------------------------------------------------------------------------------
  24:     
  25:     def min(self):
  26:         return self.head.min().value
  27:     
- 28:     def delete(self, value):
- 29:         self.head.delete(value)
- 30:     
+ 28:     @classmethod
+ 29:     def delete(self, value):
+ 30:         self.head.delete(value)
  31:     def search(self, value):
  32:         node = self.head
  33:         while node:
  34:             if value == node.value:
--------------------------------------------------------------------------------
[0.09116 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_5

def test_case_5():
        list_0 = []
        binary_search_tree_0 = module_0.BinarySearchTree()
        var_0 = binary_search_tree_0.insert(list_0)
        assert f'{type(binary_search_tree_0.head).__module__}.{type(binary_search_tree_0.head).__qualname__}' == 'tree_node.BinaryTreeNode'
        var_1 = binary_search_tree_0.min()
        var_2 = binary_search_tree_0.insert(var_1)
        var_3 = binary_search_tree_0.insert(list_0)
>       var_4 = binary_search_tree_0.delete(var_1)

ALL-SMART/test_binary_search_tree_MOSA.py:40: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'binary_search_tree.BinarySearchTree'>, value = []

>   ???
E   AttributeError: type object 'BinarySearchTree' has no attribute 'head'

binary_search_tree:30: AttributeError

   - [#   6] CDI binary_search_tree: 
--------------------------------------------------------------------------------
  27:     
  28:     def delete(self, value):
  29:         self.head.delete(value)
  30:     
- 31:     def search(self, value):
- 32:         node = self.head
- 33:         while node:
- 34:             if value == node.value:
- 35:                 return node
- 36:             if value > node.value:
- 37:                 node = node.right
- 38:             else:
- 39:                 node = node.left
- 40:         
- 41:         return node
- 42:     
+ 31:     @classmethod
+ 32:     def search(self, value):
+ 33:         node = self.head
+ 34:         while node:
+ 35:             if value == node.value:
+ 36:                 return node
+ 37:             if value > node.value:
+ 38:                 node = node.right
+ 39:             else:
+ 40:                 node = node.left
+ 41:         
+ 42:         return node
  43:     def in_order_traversal(self):
  44:         output = []
  45:         def recur(node):
  46:             if node:
--------------------------------------------------------------------------------
[0.08905 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_1

def test_case_1():
        list_0 = []
        binary_search_tree_0 = module_0.BinarySearchTree()
        var_0 = binary_search_tree_0.insert(list_0)
        assert f'{type(binary_search_tree_0.head).__module__}.{type(binary_search_tree_0.head).__qualname__}' == 'tree_node.BinaryTreeNode'
        var_1 = binary_search_tree_0.in_order_traversal()
>       var_2 = binary_search_tree_0.search(var_1)

   - [#   8] CDI binary_search_tree: 
--------------------------------------------------------------------------------
  49:                 recur(node.right)
  50:         recur(self.head)
  51:         return output
  52:     
- 53:     def merge(self, tree):
- 54:         
- 55:         def mergeOntoT1(t1, t2):
- 56:             if not t1:
- 57:                 return t2
- 58:             if not t2:
- 59:                 return t1
- 60:             
- 61:             t1.value += t2.value
- 62:             
+ 53:     @classmethod
+ 54:     def merge(self, tree):
+ 55:         
+ 56:         def mergeOntoT1(t1, t2):
+ 57:             if not t1:
+ 58:                 return t2
+ 59:             if not t2:
+ 60:                 return t1
+ 61:             
+ 62:             t1.value += t2.value
  63:             
- 64:             t1.left = mergeOntoT1(t1.left, t2.left)
- 65:             
+ 64:             
+ 65:             t1.left = mergeOntoT1(t1.left, t2.left)
  66:             
- 67:             t1.right = mergeOntoT1(t1.right, t2.right)
- 68:             
- 69:             return t1
- 70:         
- 71:         mergeOntoT1(self.head, tree.head)
+ 67:             
+ 68:             t1.right = mergeOntoT1(t1.right, t2.right)
+ 69:             
+ 70:             return t1
+ 71:         
+ 72:         mergeOntoT1(self.head, tree.head)
--------------------------------------------------------------------------------
[0.11089 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_7

   - [#   9] COD binary_search_tree: 
--------------------------------------------------------------------------------
   5:     def __init__(self):
   6:         self.head = None
   7:     
   8:     def insert(self, val):
-  9:         if not (self.head):
+  9:         if self.head:
  10:             self.head = BinaryTreeNode(val, None)
  11:             return
  12:         def add_node_recursive(node):
  13:             if val < node.value:
--------------------------------------------------------------------------------
[0.08534 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_0

def test_case_0():
        binary_search_tree_0 = module_0.BinarySearchTree()
>       var_0 = binary_search_tree_0.insert(binary_search_tree_0)

ALL-SMART/test_binary_search_tree_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binary_search_tree:23: in insert
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

node = None

>   ???
E   AttributeError: 'NoneType' object has no attribute 'value'

binary_search_tree:13: AttributeError

   - [#  12] COI binary_search_tree: 
--------------------------------------------------------------------------------
   5:     def __init__(self):
   6:         self.head = None
   7:     
   8:     def insert(self, val):
-  9:         if not (self.head):
+  9:         if not ((not (self.head))):
  10:             self.head = BinaryTreeNode(val, None)
  11:             return
  12:         def add_node_recursive(node):
  13:             if val < node.value:
--------------------------------------------------------------------------------
[0.08537 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_0

def test_case_0():
        binary_search_tree_0 = module_0.BinarySearchTree()
>       var_0 = binary_search_tree_0.insert(binary_search_tree_0)

ALL-SMART/test_binary_search_tree_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binary_search_tree:23: in insert
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

node = None

>   ???
E   AttributeError: 'NoneType' object has no attribute 'value'

binary_search_tree:13: AttributeError

   - [#  13] COI binary_search_tree: 
--------------------------------------------------------------------------------
   9:         if not (self.head):
  10:             self.head = BinaryTreeNode(val, None)
  11:             return
  12:         def add_node_recursive(node):
- 13:             if val < node.value:
+ 13:             if not (val < node.value):
  14:                 if node.left:
  15:                     add_node_recursive(node.left)
  16:                 else:
  17:                     node.left = BinaryTreeNode(val, node)
--------------------------------------------------------------------------------
[0.09135 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_13

def test_case_13():
        list_0 = []
        binary_search_tree_0 = module_0.BinarySearchTree()
        var_0 = binary_search_tree_0.insert(list_0)
        assert f'{type(binary_search_tree_0.head).__module__}.{type(binary_search_tree_0.head).__qualname__}' == 'tree_node.BinaryTreeNode'
        var_1 = binary_search_tree_0.in_order_traversal()
        var_2 = binary_search_tree_0.insert(var_1)
        var_3 = binary_search_tree_0.search(var_1)
>       assert f'{type(var_3).__module__}.{type(var_3).__qualname__}' == 'tree_node.BinaryTreeNode'
E       AssertionError

ALL-SMART/test_binary_search_tree_MOSA.py:114: AssertionError

   - [#  14] COI binary_search_tree: 
--------------------------------------------------------------------------------
  10:             self.head = BinaryTreeNode(val, None)
  11:             return
  12:         def add_node_recursive(node):
  13:             if val < node.value:
- 14:                 if node.left:
+ 14:                 if not (node.left):
  15:                     add_node_recursive(node.left)
  16:                 else:
  17:                     node.left = BinaryTreeNode(val, node)
  18:             
--------------------------------------------------------------------------------
[0.09538 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_11

def test_case_11():
        list_0 = []
        binary_search_tree_0 = module_0.BinarySearchTree()
        var_0 = binary_search_tree_0.insert(list_0)
        assert f'{type(binary_search_tree_0.head).__module__}.{type(binary_search_tree_0.head).__qualname__}' == 'tree_node.BinaryTreeNode'
        var_1 = binary_search_tree_0.in_order_traversal()
        var_2 = binary_search_tree_0.insert(var_1)
>       var_3 = binary_search_tree_0.insert(list_0)

ALL-SMART/test_binary_search_tree_MOSA.py:93: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binary_search_tree:23: in insert
    ???
binary_search_tree:20: in add_node_recursive
    ???
binary_search_tree:15: in add_node_recursive
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

node = None

>   ???
E   AttributeError: 'NoneType' object has no attribute 'value'

binary_search_tree:13: AttributeError

   - [#  15] COI binary_search_tree: 
--------------------------------------------------------------------------------
  15:                     add_node_recursive(node.left)
  16:                 else:
  17:                     node.left = BinaryTreeNode(val, node)
  18:             
- 19:             elif node.right:
+ 19:             elif not (node.right):
  20:                 add_node_recursive(node.right)
  21:             else:
  22:                 node.right = BinaryTreeNode(val, node)
  23:         add_node_recursive(self.head)
--------------------------------------------------------------------------------
[0.10558 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_5

def test_case_5():
        list_0 = []
        binary_search_tree_0 = module_0.BinarySearchTree()
        var_0 = binary_search_tree_0.insert(list_0)
        assert f'{type(binary_search_tree_0.head).__module__}.{type(binary_search_tree_0.head).__qualname__}' == 'tree_node.BinaryTreeNode'
        var_1 = binary_search_tree_0.min()
>       var_2 = binary_search_tree_0.insert(var_1)

ALL-SMART/test_binary_search_tree_MOSA.py:38: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binary_search_tree:23: in insert
    ???
binary_search_tree:20: in add_node_recursive
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

node = None

>   ???
E   AttributeError: 'NoneType' object has no attribute 'value'

binary_search_tree:13: AttributeError

   - [#  18] COI binary_search_tree: 
--------------------------------------------------------------------------------
  32:         node = self.head
  33:         while node:
  34:             if value == node.value:
  35:                 return node
- 36:             if value > node.value:
+ 36:             if not (value > node.value):
  37:                 node = node.right
  38:             else:
  39:                 node = node.left
  40:         
--------------------------------------------------------------------------------
[0.09175 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_13

def test_case_13():
        list_0 = []
        binary_search_tree_0 = module_0.BinarySearchTree()
        var_0 = binary_search_tree_0.insert(list_0)
        assert f'{type(binary_search_tree_0.head).__module__}.{type(binary_search_tree_0.head).__qualname__}' == 'tree_node.BinaryTreeNode'
        var_1 = binary_search_tree_0.in_order_traversal()
        var_2 = binary_search_tree_0.insert(var_1)
        var_3 = binary_search_tree_0.search(var_1)
>       assert f'{type(var_3).__module__}.{type(var_3).__qualname__}' == 'tree_node.BinaryTreeNode'
E       AssertionError

ALL-SMART/test_binary_search_tree_MOSA.py:114: AssertionError

   - [#  20] COI binary_search_tree: 
--------------------------------------------------------------------------------
  52:     
  53:     def merge(self, tree):
  54:         
  55:         def mergeOntoT1(t1, t2):
- 56:             if not t1:
+ 56:             if not ((not t1)):
  57:                 return t2
  58:             if not t2:
  59:                 return t1
  60:             
--------------------------------------------------------------------------------
[0.09982 s] survived

   - [#  21] COI binary_search_tree: 
--------------------------------------------------------------------------------
  54:         
  55:         def mergeOntoT1(t1, t2):
  56:             if not t1:
  57:                 return t2
- 58:             if not t2:
+ 58:             if not ((not t2)):
  59:                 return t1
  60:             
  61:             t1.value += t2.value
  62:             
--------------------------------------------------------------------------------
[0.09206 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_10

def test_case_10():
        binary_search_tree_0 = module_0.BinarySearchTree()
        binary_search_tree_1 = module_0.BinarySearchTree()
        var_0 = binary_search_tree_1.merge(binary_search_tree_1)
        var_1 = binary_search_tree_1.insert(binary_search_tree_1)
        assert f'{type(binary_search_tree_1.head).__module__}.{type(binary_search_tree_1.head).__qualname__}' == 'tree_node.BinaryTreeNode'
>       var_2 = binary_search_tree_1.merge(binary_search_tree_0)

ALL-SMART/test_binary_search_tree_MOSA.py:76: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binary_search_tree:71: in merge
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

t1 = <tree_node.BinaryTreeNode object at 0x7035a686c6a0>, t2 = None

>   ???
E   AttributeError: 'NoneType' object has no attribute 'value'

binary_search_tree:61: AttributeError

   - [#  22] OIL binary_search_tree: 
--------------------------------------------------------------------------------
  35:                 return node
  36:             if value > node.value:
  37:                 node = node.right
  38:             else:
- 39:                 node = node.left
+ 39:                 node = node.leftbreak
  40:         
  41:         return node
  42:     
  43:     def in_order_traversal(self):
--------------------------------------------------------------------------------
[0.09930 s] survived

   - [#  36] SDL binary_search_tree: 
--------------------------------------------------------------------------------
   6:         self.head = None
   7:     
   8:     def insert(self, val):
   9:         if not (self.head):
- 10:             self.head = BinaryTreeNode(val, None)
+ 10:             pass
  11:             return
  12:         def add_node_recursive(node):
  13:             if val < node.value:
  14:                 if node.left:
--------------------------------------------------------------------------------
[0.08797 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_0

def test_case_0():
        binary_search_tree_0 = module_0.BinarySearchTree()
        var_0 = binary_search_tree_0.insert(binary_search_tree_0)
>       assert f'{type(binary_search_tree_0.head).__module__}.{type(binary_search_tree_0.head).__qualname__}' == 'tree_node.BinaryTreeNode'
E       AssertionError

ALL-SMART/test_binary_search_tree_MOSA.py:8: AssertionError

   - [#  38] SDL binary_search_tree: 
--------------------------------------------------------------------------------
  11:             return
  12:         def add_node_recursive(node):
  13:             if val < node.value:
  14:                 if node.left:
- 15:                     add_node_recursive(node.left)
+ 15:                     pass
  16:                 else:
  17:                     node.left = BinaryTreeNode(val, node)
  18:             
  19:             elif node.right:
--------------------------------------------------------------------------------
[0.10027 s] survived

   - [#  39] SDL binary_search_tree: 
--------------------------------------------------------------------------------
  13:             if val < node.value:
  14:                 if node.left:
  15:                     add_node_recursive(node.left)
  16:                 else:
- 17:                     node.left = BinaryTreeNode(val, node)
+ 17:                     pass
  18:             
  19:             elif node.right:
  20:                 add_node_recursive(node.right)
  21:             else:
--------------------------------------------------------------------------------
[0.09666 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_13

def test_case_13():
        list_0 = []
        binary_search_tree_0 = module_0.BinarySearchTree()
        var_0 = binary_search_tree_0.insert(list_0)
        assert f'{type(binary_search_tree_0.head).__module__}.{type(binary_search_tree_0.head).__qualname__}' == 'tree_node.BinaryTreeNode'
        var_1 = binary_search_tree_0.in_order_traversal()
        var_2 = binary_search_tree_0.insert(var_1)
        var_3 = binary_search_tree_0.search(var_1)
        assert f'{type(var_3).__module__}.{type(var_3).__qualname__}' == 'tree_node.BinaryTreeNode'
        assert var_3.left is None
        assert var_3.right is None
        assert var_3.value == [[]]
        assert f'{type(var_3.parent).__module__}.{type(var_3.parent).__qualname__}' == 'tree_node.BinaryTreeNode'
        var_4 = binary_search_tree_0.insert(list_0)
>       assert f'{type(var_3.left).__module__}.{type(var_3.left).__qualname__}' == 'tree_node.BinaryTreeNode'
E       AssertionError

ALL-SMART/test_binary_search_tree_MOSA.py:120: AssertionError

   - [#  40] SDL binary_search_tree: 
--------------------------------------------------------------------------------
  16:                 else:
  17:                     node.left = BinaryTreeNode(val, node)
  18:             
  19:             elif node.right:
- 20:                 add_node_recursive(node.right)
+ 20:                 pass
  21:             else:
  22:                 node.right = BinaryTreeNode(val, node)
  23:         add_node_recursive(self.head)
  24:     
--------------------------------------------------------------------------------
[0.09685 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_13

def test_case_13():
        list_0 = []
        binary_search_tree_0 = module_0.BinarySearchTree()
        var_0 = binary_search_tree_0.insert(list_0)
        assert f'{type(binary_search_tree_0.head).__module__}.{type(binary_search_tree_0.head).__qualname__}' == 'tree_node.BinaryTreeNode'
        var_1 = binary_search_tree_0.in_order_traversal()
        var_2 = binary_search_tree_0.insert(var_1)
        var_3 = binary_search_tree_0.search(var_1)
        assert f'{type(var_3).__module__}.{type(var_3).__qualname__}' == 'tree_node.BinaryTreeNode'
        assert var_3.left is None
        assert var_3.right is None
        assert var_3.value == [[]]
        assert f'{type(var_3.parent).__module__}.{type(var_3.parent).__qualname__}' == 'tree_node.BinaryTreeNode'
        var_4 = binary_search_tree_0.insert(list_0)
>       assert f'{type(var_3.left).__module__}.{type(var_3.left).__qualname__}' == 'tree_node.BinaryTreeNode'
E       AssertionError

ALL-SMART/test_binary_search_tree_MOSA.py:120: AssertionError

   - [#  41] SDL binary_search_tree: 
--------------------------------------------------------------------------------
  18:             
  19:             elif node.right:
  20:                 add_node_recursive(node.right)
  21:             else:
- 22:                 node.right = BinaryTreeNode(val, node)
+ 22:                 pass
  23:         add_node_recursive(self.head)
  24:     
  25:     def min(self):
  26:         return self.head.min().value
--------------------------------------------------------------------------------
[0.09278 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_13

def test_case_13():
        list_0 = []
        binary_search_tree_0 = module_0.BinarySearchTree()
        var_0 = binary_search_tree_0.insert(list_0)
        assert f'{type(binary_search_tree_0.head).__module__}.{type(binary_search_tree_0.head).__qualname__}' == 'tree_node.BinaryTreeNode'
        var_1 = binary_search_tree_0.in_order_traversal()
        var_2 = binary_search_tree_0.insert(var_1)
        var_3 = binary_search_tree_0.search(var_1)
>       assert f'{type(var_3).__module__}.{type(var_3).__qualname__}' == 'tree_node.BinaryTreeNode'
E       AssertionError

ALL-SMART/test_binary_search_tree_MOSA.py:114: AssertionError

   - [#  42] SDL binary_search_tree: 
--------------------------------------------------------------------------------
  19:             elif node.right:
  20:                 add_node_recursive(node.right)
  21:             else:
  22:                 node.right = BinaryTreeNode(val, node)
- 23:         add_node_recursive(self.head)
+ 23:         pass
  24:     
  25:     def min(self):
  26:         return self.head.min().value
  27:     
--------------------------------------------------------------------------------
[0.09430 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_13

def test_case_13():
        list_0 = []
        binary_search_tree_0 = module_0.BinarySearchTree()
        var_0 = binary_search_tree_0.insert(list_0)
        assert f'{type(binary_search_tree_0.head).__module__}.{type(binary_search_tree_0.head).__qualname__}' == 'tree_node.BinaryTreeNode'
        var_1 = binary_search_tree_0.in_order_traversal()
        var_2 = binary_search_tree_0.insert(var_1)
        var_3 = binary_search_tree_0.search(var_1)
>       assert f'{type(var_3).__module__}.{type(var_3).__qualname__}' == 'tree_node.BinaryTreeNode'
E       AssertionError

ALL-SMART/test_binary_search_tree_MOSA.py:114: AssertionError

   - [#  44] SDL binary_search_tree: 
--------------------------------------------------------------------------------
  25:     def min(self):
  26:         return self.head.min().value
  27:     
  28:     def delete(self, value):
- 29:         self.head.delete(value)
+ 29:         pass
  30:     
  31:     def search(self, value):
  32:         node = self.head
  33:         while node:
--------------------------------------------------------------------------------
[0.10018 s] survived

   - [#  45] SDL binary_search_tree: 
--------------------------------------------------------------------------------
  28:     def delete(self, value):
  29:         self.head.delete(value)
  30:     
  31:     def search(self, value):
- 32:         node = self.head
+ 32:         pass
  33:         while node:
  34:             if value == node.value:
  35:                 return node
  36:             if value > node.value:
--------------------------------------------------------------------------------
[0.08763 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_1

def test_case_1():
        list_0 = []
        binary_search_tree_0 = module_0.BinarySearchTree()
        var_0 = binary_search_tree_0.insert(list_0)
        assert f'{type(binary_search_tree_0.head).__module__}.{type(binary_search_tree_0.head).__qualname__}' == 'tree_node.BinaryTreeNode'
        var_1 = binary_search_tree_0.in_order_traversal()
>       var_2 = binary_search_tree_0.search(var_1)

ALL-SMART/test_binary_search_tree_MOSA.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binary_search_tree.BinarySearchTree object at 0x7035a66da560>
value = [[]]

>   ???
E   UnboundLocalError: local variable 'node' referenced before assignment

binary_search_tree:33: UnboundLocalError

   - [#  47] SDL binary_search_tree: 
--------------------------------------------------------------------------------
  33:         while node:
  34:             if value == node.value:
  35:                 return node
  36:             if value > node.value:
- 37:                 node = node.right
+ 37:                 pass
  38:             else:
  39:                 node = node.left
  40:         
  41:         return node
--------------------------------------------------------------------------------
[5.00689 s] timeout

   - [#  48] SDL binary_search_tree: 
--------------------------------------------------------------------------------
  35:                 return node
  36:             if value > node.value:
  37:                 node = node.right
  38:             else:
- 39:                 node = node.left
+ 39:                 pass
  40:         
  41:         return node
  42:     
  43:     def in_order_traversal(self):
--------------------------------------------------------------------------------
[5.00645 s] timeout

   - [#  49] SDL binary_search_tree: 
--------------------------------------------------------------------------------
  37:                 node = node.right
  38:             else:
  39:                 node = node.left
  40:         
- 41:         return node
+ 41:         pass
  42:     
  43:     def in_order_traversal(self):
  44:         output = []
  45:         def recur(node):
--------------------------------------------------------------------------------
[0.11175 s] survived
