   - [#  56] SDL binary_search_tree: 
--------------------------------------------------------------------------------
  53:     def merge(self, tree):
  54:         
  55:         def mergeOntoT1(t1, t2):
  56:             if not t1:
- 57:                 return t2
+ 57:                 pass
  58:             if not t2:
  59:                 return t1
  60:             
  61:             t1.value += t2.value
--------------------------------------------------------------------------------
[0.10088 s] survived

   - [#  57] SDL binary_search_tree: 
--------------------------------------------------------------------------------
  55:         def mergeOntoT1(t1, t2):
  56:             if not t1:
  57:                 return t2
  58:             if not t2:
- 59:                 return t1
+ 59:                 pass
  60:             
  61:             t1.value += t2.value
  62:             
  63:             
--------------------------------------------------------------------------------
[0.09140 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_10

def test_case_10():
        binary_search_tree_0 = module_0.BinarySearchTree()
        binary_search_tree_1 = module_0.BinarySearchTree()
        var_0 = binary_search_tree_1.merge(binary_search_tree_1)
        var_1 = binary_search_tree_1.insert(binary_search_tree_1)
        assert f'{type(binary_search_tree_1.head).__module__}.{type(binary_search_tree_1.head).__qualname__}' == 'tree_node.BinaryTreeNode'
>       var_2 = binary_search_tree_1.merge(binary_search_tree_0)

ALL-SMART/test_binary_search_tree_MOSA.py:76: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binary_search_tree:71: in merge
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

t1 = <tree_node.BinaryTreeNode object at 0x7035a66db9a0>, t2 = None

>   ???
E   AttributeError: 'NoneType' object has no attribute 'value'

binary_search_tree:61: AttributeError

   - [#  58] SDL binary_search_tree: 
--------------------------------------------------------------------------------
  60:             
  61:             t1.value += t2.value
  62:             
  63:             
- 64:             t1.left = mergeOntoT1(t1.left, t2.left)
+ 64:             pass
  65:             
  66:             
  67:             t1.right = mergeOntoT1(t1.right, t2.right)
  68:             
--------------------------------------------------------------------------------
[0.09992 s] survived

   - [#  59] SDL binary_search_tree: 
--------------------------------------------------------------------------------
  63:             
  64:             t1.left = mergeOntoT1(t1.left, t2.left)
  65:             
  66:             
- 67:             t1.right = mergeOntoT1(t1.right, t2.right)
+ 67:             pass
  68:             
  69:             return t1
  70:         
  71:         mergeOntoT1(self.head, tree.head)
--------------------------------------------------------------------------------
[0.09927 s] survived

   - [#  60] SDL binary_search_tree: 
--------------------------------------------------------------------------------
  65:             
  66:             
  67:             t1.right = mergeOntoT1(t1.right, t2.right)
  68:             
- 69:             return t1
+ 69:             pass
  70:         
  71:         mergeOntoT1(self.head, tree.head)
--------------------------------------------------------------------------------
[0.09863 s] survived

   - [#  61] SDL binary_search_tree: 
--------------------------------------------------------------------------------
  67:             t1.right = mergeOntoT1(t1.right, t2.right)
  68:             
  69:             return t1
  70:         
- 71:         mergeOntoT1(self.head, tree.head)
+ 71:         pass
--------------------------------------------------------------------------------
[0.10058 s] survived

   - [#  63] SVD binary_search_tree: 
--------------------------------------------------------------------------------
   5:     def __init__(self):
   6:         self.head = None
   7:     
   8:     def insert(self, val):
-  9:         if not (self.head):
+  9:         if not head:
  10:             self.head = BinaryTreeNode(val, None)
  11:             return
  12:         def add_node_recursive(node):
  13:             if val < node.value:
--------------------------------------------------------------------------------
[0.08894 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_0

def test_case_0():
        binary_search_tree_0 = module_0.BinarySearchTree()
>       var_0 = binary_search_tree_0.insert(binary_search_tree_0)

ALL-SMART/test_binary_search_tree_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binary_search_tree.BinarySearchTree object at 0x7035a69b90f0>
val = <binary_search_tree.BinarySearchTree object at 0x7035a69b90f0>

>   ???
E   NameError: name 'head' is not defined

binary_search_tree:9: NameError

   - [#  65] SVD binary_search_tree: 
--------------------------------------------------------------------------------
  19:             elif node.right:
  20:                 add_node_recursive(node.right)
  21:             else:
  22:                 node.right = BinaryTreeNode(val, node)
- 23:         add_node_recursive(self.head)
+ 23:         add_node_recursive(head)
  24:     
  25:     def min(self):
  26:         return self.head.min().value
  27:     
--------------------------------------------------------------------------------
[0.08979 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_5

def test_case_5():
        list_0 = []
        binary_search_tree_0 = module_0.BinarySearchTree()
        var_0 = binary_search_tree_0.insert(list_0)
        assert f'{type(binary_search_tree_0.head).__module__}.{type(binary_search_tree_0.head).__qualname__}' == 'tree_node.BinaryTreeNode'
        var_1 = binary_search_tree_0.min()
>       var_2 = binary_search_tree_0.insert(var_1)

ALL-SMART/test_binary_search_tree_MOSA.py:38: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binary_search_tree.BinarySearchTree object at 0x7035a6745120>, val = []

>   ???
E   NameError: name 'head' is not defined

binary_search_tree:23: NameError

   - [#  66] SVD binary_search_tree: 
--------------------------------------------------------------------------------
  22:                 node.right = BinaryTreeNode(val, node)
  23:         add_node_recursive(self.head)
  24:     
  25:     def min(self):
- 26:         return self.head.min().value
+ 26:         return head.min().value
  27:     
  28:     def delete(self, value):
  29:         self.head.delete(value)
  30:     
--------------------------------------------------------------------------------
[0.09160 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_5

def test_case_5():
        list_0 = []
        binary_search_tree_0 = module_0.BinarySearchTree()
        var_0 = binary_search_tree_0.insert(list_0)
        assert f'{type(binary_search_tree_0.head).__module__}.{type(binary_search_tree_0.head).__qualname__}' == 'tree_node.BinaryTreeNode'
>       var_1 = binary_search_tree_0.min()

ALL-SMART/test_binary_search_tree_MOSA.py:37: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binary_search_tree.BinarySearchTree object at 0x7035a69b8550>

>   ???
E   NameError: name 'head' is not defined

binary_search_tree:26: NameError

   - [#  67] SVD binary_search_tree: 
--------------------------------------------------------------------------------
  25:     def min(self):
  26:         return self.head.min().value
  27:     
  28:     def delete(self, value):
- 29:         self.head.delete(value)
+ 29:         head.delete(value)
  30:     
  31:     def search(self, value):
  32:         node = self.head
  33:         while node:
--------------------------------------------------------------------------------
[0.10721 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_5

def test_case_5():
        list_0 = []
        binary_search_tree_0 = module_0.BinarySearchTree()
        var_0 = binary_search_tree_0.insert(list_0)
        assert f'{type(binary_search_tree_0.head).__module__}.{type(binary_search_tree_0.head).__qualname__}' == 'tree_node.BinaryTreeNode'
        var_1 = binary_search_tree_0.min()
        var_2 = binary_search_tree_0.insert(var_1)
        var_3 = binary_search_tree_0.insert(list_0)
>       var_4 = binary_search_tree_0.delete(var_1)

ALL-SMART/test_binary_search_tree_MOSA.py:40: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binary_search_tree.BinarySearchTree object at 0x7035a6764040>
value = []

>   ???
E   NameError: name 'head' is not defined

binary_search_tree:29: NameError

   - [#  68] SVD binary_search_tree: 
--------------------------------------------------------------------------------
  28:     def delete(self, value):
  29:         self.head.delete(value)
  30:     
  31:     def search(self, value):
- 32:         node = self.head
+ 32:         node = head
  33:         while node:
  34:             if value == node.value:
  35:                 return node
  36:             if value > node.value:
--------------------------------------------------------------------------------
[0.10314 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_1

def test_case_1():
        list_0 = []
        binary_search_tree_0 = module_0.BinarySearchTree()
        var_0 = binary_search_tree_0.insert(list_0)
        assert f'{type(binary_search_tree_0.head).__module__}.{type(binary_search_tree_0.head).__qualname__}' == 'tree_node.BinaryTreeNode'
        var_1 = binary_search_tree_0.in_order_traversal()
>       var_2 = binary_search_tree_0.search(var_1)

ALL-SMART/test_binary_search_tree_MOSA.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binary_search_tree.BinarySearchTree object at 0x7035a686ed40>
value = [[]]

>   ???
E   NameError: name 'head' is not defined

binary_search_tree:32: NameError

   - [#  70] SVD binary_search_tree: 
--------------------------------------------------------------------------------
  67:             t1.right = mergeOntoT1(t1.right, t2.right)
  68:             
  69:             return t1
  70:         
- 71:         mergeOntoT1(self.head, tree.head)
+ 71:         mergeOntoT1(head, tree.head)
--------------------------------------------------------------------------------
[0.09372 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_7

def test_case_7():
        binary_search_tree_0 = module_0.BinarySearchTree()
>       var_0 = binary_search_tree_0.merge(binary_search_tree_0)

ALL-SMART/test_binary_search_tree_MOSA.py:48: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <binary_search_tree.BinarySearchTree object at 0x7035a686ceb0>
tree = <binary_search_tree.BinarySearchTree object at 0x7035a686ceb0>

>   ???
E   NameError: name 'head' is not defined

binary_search_tree:71: NameError

   - [#  71] ZIL binary_search_tree: 
--------------------------------------------------------------------------------
  30:     
  31:     def search(self, value):
  32:         node = self.head
  33:         while node:
- 34:             if value == node.value:
- 35:                 return node
- 36:             if value > node.value:
- 37:                 node = node.right
- 38:             else:
- 39:                 node = node.left
+ 34:             break
+ 35:         
+ 36:         
+ 37:         
+ 38:         
+ 39:         
  40:         
  41:         return node
  42:     
  43:     def in_order_traversal(self):
--------------------------------------------------------------------------------
[0.09341 s] killed by ALL-SMART/test_binary_search_tree_MOSA.py::test_case_13

def test_case_13():
        list_0 = []
        binary_search_tree_0 = module_0.BinarySearchTree()
        var_0 = binary_search_tree_0.insert(list_0)
        assert f'{type(binary_search_tree_0.head).__module__}.{type(binary_search_tree_0.head).__qualname__}' == 'tree_node.BinaryTreeNode'
        var_1 = binary_search_tree_0.in_order_traversal()
        var_2 = binary_search_tree_0.insert(var_1)
        var_3 = binary_search_tree_0.search(var_1)
        assert f'{type(var_3).__module__}.{type(var_3).__qualname__}' == 'tree_node.BinaryTreeNode'
        assert var_3.left is None
>       assert var_3.right is None
E       AssertionError

ALL-SMART/test_binary_search_tree_MOSA.py:116: AssertionError
