1 : Job ID 903360ff95754b658374ac91435837f8
test outcome: killed
binary_search_tree.py, start pos: (34, 21), end pos: (34, 23)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -31,7 +31,7 @@
     def search(self, value):
         node = self.head
         while node:
-            if value == node.value:
+            if value != node.value:
                 return node
             if value > node.value:
                 node = node.right
ts-3-5/test_3-5_0-6_208.py ...F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - assert 5 == 3
========================= 1 failed, 5 passed in 0.15s ==========================

2 : Job ID 6c6d0639c3c34133a807ba6d872ac8c6
test outcome: killed
binary_search_tree.py, start pos: (34, 21), end pos: (34, 23)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -31,7 +31,7 @@
     def search(self, value):
         node = self.head
         while node:
-            if value == node.value:
+            if value < node.value:
                 return node
             if value > node.value:
                 node = node.right
ts-3-5/test_3-5_0-6_208.py ...F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - assert 5 == 3
========================= 1 failed, 5 passed in 0.15s ==========================

3 : Job ID 8820aa89c8ef4c3897f64a66c03c43c6
test outcome: killed
binary_search_tree.py, start pos: (34, 21), end pos: (34, 23)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -31,7 +31,7 @@
     def search(self, value):
         node = self.head
         while node:
-            if value == node.value:
+            if value <= node.value:
                 return node
             if value > node.value:
                 node = node.right
ts-3-5/test_3-5_0-6_208.py ...F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - assert 5 == 3
========================= 1 failed, 5 passed in 0.15s ==========================

4 : Job ID 779b45288d3c47d39b3fb7bbf8e6ec24
test outcome: killed
binary_search_tree.py, start pos: (34, 21), end pos: (34, 23)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -31,7 +31,7 @@
     def search(self, value):
         node = self.head
         while node:
-            if value == node.value:
+            if value > node.value:
                 return node
             if value > node.value:
                 node = node.right
ts-3-5/test_3-5_0-6_208.py ...F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - AttributeError: 'NoneType' o...
========================= 1 failed, 5 passed in 0.15s ==========================

5 : Job ID eeb5652470f24a74a4ca4111a038b01f
test outcome: killed
binary_search_tree.py, start pos: (34, 21), end pos: (34, 23)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -31,7 +31,7 @@
     def search(self, value):
         node = self.head
         while node:
-            if value == node.value:
+            if value >= node.value:
                 return node
             if value > node.value:
                 node = node.right
ts-3-5/test_3-5_0-6_208.py ...F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - assert 5 == 7
========================= 1 failed, 5 passed in 0.15s ==========================

6 : Job ID 456f491b51004cf5801550536db63738
SURVIVED
test outcome: survived
binary_search_tree.py, start pos: (34, 21), end pos: (34, 23)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -31,7 +31,7 @@
     def search(self, value):
         node = self.head
         while node:
-            if value == node.value:
+            if value is node.value:
                 return node
             if value > node.value:
                 node = node.right
ts-3-5/test_3-5_0-6_208.py ......                                        [100%]
============================== 6 passed in 0.15s ===============================

7 : Job ID 1ee016d79d414c688099244d9efd189d
test outcome: killed
binary_search_tree.py, start pos: (34, 21), end pos: (34, 23)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -31,7 +31,7 @@
     def search(self, value):
         node = self.head
         while node:
-            if value == node.value:
+            if value is not node.value:
                 return node
             if value > node.value:
                 node = node.right
ts-3-5/test_3-5_0-6_208.py ...F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - assert 5 == 3
========================= 1 failed, 5 passed in 0.15s ==========================

8 : Job ID 568a69b59b6a421f9c2f9a8f2beb8133
test outcome: killed
binary_search_tree.py, start pos: (13, 19), end pos: (13, 20)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 0
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -10,7 +10,7 @@
             self.head = BinaryTreeNode(val, None)
             return
         def add_node_recursive(node):
-            if val < node.value:
+            if val == node.value:
                 if node.left:
                     add_node_recursive(node.left)
                 else:
ts-3-5/test_3-5_0-6_208.py FF.FFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_insert - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_min - assert 5 == 3
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_in_order_traversal - assert [5, 3, 7]...
FAILED ts-3-5/test_3-5_0-6_208.py::test_merge - assert 12 == 9
========================= 5 failed, 1 passed in 0.15s ==========================

9 : Job ID 06080dd9f94f4f9e8f45e4efbd0ae869
test outcome: killed
binary_search_tree.py, start pos: (13, 19), end pos: (13, 20)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 0
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -10,7 +10,7 @@
             self.head = BinaryTreeNode(val, None)
             return
         def add_node_recursive(node):
-            if val < node.value:
+            if val != node.value:
                 if node.left:
                     add_node_recursive(node.left)
                 else:
ts-3-5/test_3-5_0-6_208.py FFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_insert - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_min - assert 7 == 3
FAILED ts-3-5/test_3-5_0-6_208.py::test_delete - assert <tree_node.BinaryTree...
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_in_order_traversal - assert [7, 3, 5]...
FAILED ts-3-5/test_3-5_0-6_208.py::test_merge - AttributeError: 'NoneType' ob...
============================== 6 failed in 0.15s ===============================

10 : Job ID ba4327c830ed4b919c996e90465a8c12
SURVIVED
test outcome: survived
binary_search_tree.py, start pos: (13, 19), end pos: (13, 20)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 0
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -10,7 +10,7 @@
             self.head = BinaryTreeNode(val, None)
             return
         def add_node_recursive(node):
-            if val < node.value:
+            if val <= node.value:
                 if node.left:
                     add_node_recursive(node.left)
                 else:
ts-3-5/test_3-5_0-6_208.py ......                                        [100%]
============================== 6 passed in 0.15s ===============================

11 : Job ID e1285e873d0f4b02acd04d4eb0518203
test outcome: killed
binary_search_tree.py, start pos: (13, 19), end pos: (13, 20)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 0
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -10,7 +10,7 @@
             self.head = BinaryTreeNode(val, None)
             return
         def add_node_recursive(node):
-            if val < node.value:
+            if val > node.value:
                 if node.left:
                     add_node_recursive(node.left)
                 else:
ts-3-5/test_3-5_0-6_208.py FFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_insert - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_min - assert 7 == 3
FAILED ts-3-5/test_3-5_0-6_208.py::test_delete - assert <tree_node.BinaryTree...
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_in_order_traversal - assert [7, 5, 3]...
FAILED ts-3-5/test_3-5_0-6_208.py::test_merge - assert 3 == 9
============================== 6 failed in 0.16s ===============================

12 : Job ID d2473e425f7c44adb3d9ff96509b1d43
test outcome: killed
binary_search_tree.py, start pos: (13, 19), end pos: (13, 20)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 0
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -10,7 +10,7 @@
             self.head = BinaryTreeNode(val, None)
             return
         def add_node_recursive(node):
-            if val < node.value:
+            if val >= node.value:
                 if node.left:
                     add_node_recursive(node.left)
                 else:
ts-3-5/test_3-5_0-6_208.py FFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_insert - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_min - assert 7 == 3
FAILED ts-3-5/test_3-5_0-6_208.py::test_delete - assert <tree_node.BinaryTree...
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_in_order_traversal - assert [7, 5, 3]...
FAILED ts-3-5/test_3-5_0-6_208.py::test_merge - assert 3 == 9
============================== 6 failed in 0.15s ===============================

13 : Job ID 12b29db38cd84d55b90f527371f90506
test outcome: killed
binary_search_tree.py, start pos: (13, 19), end pos: (13, 20)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 0
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -10,7 +10,7 @@
             self.head = BinaryTreeNode(val, None)
             return
         def add_node_recursive(node):
-            if val < node.value:
+            if val is node.value:
                 if node.left:
                     add_node_recursive(node.left)
                 else:
ts-3-5/test_3-5_0-6_208.py FF.FFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_insert - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_min - assert 5 == 3
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_in_order_traversal - assert [5, 3, 7]...
FAILED ts-3-5/test_3-5_0-6_208.py::test_merge - assert 12 == 9
========================= 5 failed, 1 passed in 0.16s ==========================

14 : Job ID ceafeb0f0cbb4dc28da3cd1429d8b66e
test outcome: killed
binary_search_tree.py, start pos: (13, 19), end pos: (13, 20)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 0
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -10,7 +10,7 @@
             self.head = BinaryTreeNode(val, None)
             return
         def add_node_recursive(node):
-            if val < node.value:
+            if val is not node.value:
                 if node.left:
                     add_node_recursive(node.left)
                 else:
ts-3-5/test_3-5_0-6_208.py FFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_insert - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_min - assert 7 == 3
FAILED ts-3-5/test_3-5_0-6_208.py::test_delete - assert <tree_node.BinaryTree...
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_in_order_traversal - assert [7, 3, 5]...
FAILED ts-3-5/test_3-5_0-6_208.py::test_merge - AttributeError: 'NoneType' ob...
============================== 6 failed in 0.16s ===============================

15 : Job ID cf4dac24749c4794975ac8b9398689b0
test outcome: killed
binary_search_tree.py, start pos: (36, 21), end pos: (36, 22)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 0
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -33,7 +33,7 @@
         while node:
             if value == node.value:
                 return node
-            if value > node.value:
+            if value == node.value:
                 node = node.right
             else:
                 node = node.left
ts-3-5/test_3-5_0-6_208.py ...F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - AttributeError: 'NoneType' o...
========================= 1 failed, 5 passed in 0.15s ==========================

16 : Job ID 76a74c644208459e8b4d81963dc7718d
test outcome: killed
binary_search_tree.py, start pos: (36, 21), end pos: (36, 22)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 0
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -33,7 +33,7 @@
         while node:
             if value == node.value:
                 return node
-            if value > node.value:
+            if value != node.value:
                 node = node.right
             else:
                 node = node.left
ts-3-5/test_3-5_0-6_208.py ...F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - AttributeError: 'NoneType' o...
========================= 1 failed, 5 passed in 0.15s ==========================

17 : Job ID 4c8875b5ce78460a8e1532298a439f9e
test outcome: killed
binary_search_tree.py, start pos: (36, 21), end pos: (36, 22)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 0
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -33,7 +33,7 @@
         while node:
             if value == node.value:
                 return node
-            if value > node.value:
+            if value < node.value:
                 node = node.right
             else:
                 node = node.left
ts-3-5/test_3-5_0-6_208.py ...F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - AttributeError: 'NoneType' o...
========================= 1 failed, 5 passed in 0.15s ==========================

18 : Job ID ad9ab847e48a4f5f843ca3871ac0d600
test outcome: killed
binary_search_tree.py, start pos: (36, 21), end pos: (36, 22)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 0
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -33,7 +33,7 @@
         while node:
             if value == node.value:
                 return node
-            if value > node.value:
+            if value <= node.value:
                 node = node.right
             else:
                 node = node.left
ts-3-5/test_3-5_0-6_208.py ...F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - AttributeError: 'NoneType' o...
========================= 1 failed, 5 passed in 0.15s ==========================

19 : Job ID 15ce8e3104dd4a6ebcccc55b6e417169
SURVIVED
test outcome: survived
binary_search_tree.py, start pos: (36, 21), end pos: (36, 22)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 0
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -33,7 +33,7 @@
         while node:
             if value == node.value:
                 return node
-            if value > node.value:
+            if value >= node.value:
                 node = node.right
             else:
                 node = node.left
ts-3-5/test_3-5_0-6_208.py ......                                        [100%]
============================== 6 passed in 0.15s ===============================

20 : Job ID 29c1954189ac4c88b0a4445ce24363aa
test outcome: killed
binary_search_tree.py, start pos: (36, 21), end pos: (36, 22)
operator: core/ReplaceComparisonOperator_Gt_Is, occurrence: 0
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -33,7 +33,7 @@
         while node:
             if value == node.value:
                 return node
-            if value > node.value:
+            if value is node.value:
                 node = node.right
             else:
                 node = node.left
ts-3-5/test_3-5_0-6_208.py ...F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - AttributeError: 'NoneType' o...
========================= 1 failed, 5 passed in 0.15s ==========================

21 : Job ID 93ab9578f26b46edabe447297a9b8270
test outcome: killed
binary_search_tree.py, start pos: (36, 21), end pos: (36, 22)
operator: core/ReplaceComparisonOperator_Gt_IsNot, occurrence: 0
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -33,7 +33,7 @@
         while node:
             if value == node.value:
                 return node
-            if value > node.value:
+            if value is not node.value:
                 node = node.right
             else:
                 node = node.left
ts-3-5/test_3-5_0-6_208.py ...F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - AttributeError: 'NoneType' o...
========================= 1 failed, 5 passed in 0.15s ==========================

22 : Job ID 79061a5bdd1041fd88cc81d33881b1e5
test outcome: killed
binary_search_tree.py, start pos: (9, 11), end pos: (9, 14)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 0
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -6,7 +6,7 @@
         self.head = None
     def insert(self, val):
-        if not self.head:
+        if  self.head:
             self.head = BinaryTreeNode(val, None)
             return
         def add_node_recursive(node):
ts-3-5/test_3-5_0-6_208.py FFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_insert - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_min - AttributeError: 'NoneType' obje...
FAILED ts-3-5/test_3-5_0-6_208.py::test_delete - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_in_order_traversal - AttributeError: ...
FAILED ts-3-5/test_3-5_0-6_208.py::test_merge - AttributeError: 'NoneType' ob...
============================== 6 failed in 0.16s ===============================

23 : Job ID 86fa620e2d864f6481060f16d9f6365c
test outcome: killed
binary_search_tree.py, start pos: (56, 15), end pos: (56, 18)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 1
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -53,7 +53,7 @@
     def merge(self, tree):
         def mergeOntoT1(t1, t2):
-            if not t1:
+            if  t1:
                 return t2
             if not t2:
                 return t1
ts-3-5/test_3-5_0-6_208.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_merge - assert 5 == 12
========================= 1 failed, 5 passed in 0.15s ==========================

24 : Job ID 3c0775c02fe446b0a827d26c4a6966cd
test outcome: killed
binary_search_tree.py, start pos: (58, 15), end pos: (58, 18)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 2
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -55,7 +55,7 @@
         def mergeOntoT1(t1, t2):
             if not t1:
                 return t2
-            if not t2:
+            if  t2:
                 return t1
             t1.value += t2.value
ts-3-5/test_3-5_0-6_208.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_merge - assert 5 == 12
========================= 1 failed, 5 passed in 0.15s ==========================

25 : Job ID 107b7768eb1b4bf9b5c489c9dd0f1ec8
test outcome: killed
binary_search_tree.py, start pos: (9, 11), end pos: (9, 24)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -6,7 +6,7 @@
         self.head = None
     def insert(self, val):
-        if not self.head:
+        if not not self.head:
             self.head = BinaryTreeNode(val, None)
             return
         def add_node_recursive(node):
ts-3-5/test_3-5_0-6_208.py FFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_insert - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_min - AttributeError: 'NoneType' obje...
FAILED ts-3-5/test_3-5_0-6_208.py::test_delete - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_in_order_traversal - AttributeError: ...
FAILED ts-3-5/test_3-5_0-6_208.py::test_merge - AttributeError: 'NoneType' ob...
============================== 6 failed in 0.15s ===============================

26 : Job ID a6c0a919fa9f4498bda41d1c594627cf
test outcome: killed
binary_search_tree.py, start pos: (13, 15), end pos: (13, 31)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -10,7 +10,7 @@
             self.head = BinaryTreeNode(val, None)
             return
         def add_node_recursive(node):
-            if val < node.value:
+            if not val < node.value:
                 if node.left:
                     add_node_recursive(node.left)
                 else:
ts-3-5/test_3-5_0-6_208.py FFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_insert - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_min - assert 7 == 3
FAILED ts-3-5/test_3-5_0-6_208.py::test_delete - assert <tree_node.BinaryTree...
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_in_order_traversal - assert [7, 5, 3]...
FAILED ts-3-5/test_3-5_0-6_208.py::test_merge - assert 3 == 9
============================== 6 failed in 0.16s ===============================

27 : Job ID 32e0dd0eccf642a3953dbbccdefdcff5
test outcome: killed
binary_search_tree.py, start pos: (14, 19), end pos: (14, 28)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -11,7 +11,7 @@
             return
         def add_node_recursive(node):
             if val < node.value:
-                if node.left:
+                if not node.left:
                     add_node_recursive(node.left)
                 else:
                     node.left = BinaryTreeNode(val, node)
ts-3-5/test_3-5_0-6_208.py FFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_insert - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_min - AttributeError: 'NoneType' obje...
FAILED ts-3-5/test_3-5_0-6_208.py::test_delete - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_in_order_traversal - AttributeError: ...
FAILED ts-3-5/test_3-5_0-6_208.py::test_merge - AttributeError: 'NoneType' ob...
============================== 6 failed in 0.16s ===============================

28 : Job ID 19c166ac5cbc44e6b3ac911904b2dd04
test outcome: killed
binary_search_tree.py, start pos: (19, 19), end pos: (19, 29)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -16,7 +16,7 @@
                 else:
                     node.left = BinaryTreeNode(val, node)
             else:
-                if node.right:
+                if not node.right:
                     add_node_recursive(node.right)
                 else:
                     node.right = BinaryTreeNode(val, node)
ts-3-5/test_3-5_0-6_208.py FFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_insert - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_min - AttributeError: 'NoneType' obje...
FAILED ts-3-5/test_3-5_0-6_208.py::test_delete - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - AttributeError: 'NoneType' o...
FAILED ts-3-5/test_3-5_0-6_208.py::test_in_order_traversal - AttributeError: ...
FAILED ts-3-5/test_3-5_0-6_208.py::test_merge - AttributeError: 'NoneType' ob...
============================== 6 failed in 0.16s ===============================

29 : Job ID d41f2fdbbd9b45d5bedcb35bbeed6ef4
test outcome: killed
binary_search_tree.py, start pos: (33, 14), end pos: (33, 18)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -30,7 +30,7 @@
     def search(self, value):
         node = self.head
-        while node:
+        while not node:
             if value == node.value:
                 return node
             if value > node.value:
ts-3-5/test_3-5_0-6_208.py ...F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - assert 5 == 3
========================= 1 failed, 5 passed in 0.15s ==========================

30 : Job ID bec2e97dac45486dade1e20e73d4a6ab
test outcome: killed
binary_search_tree.py, start pos: (34, 15), end pos: (34, 34)
operator: core/AddNot, occurrence: 5
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -31,7 +31,7 @@
     def search(self, value):
         node = self.head
         while node:
-            if value == node.value:
+            if not value == node.value:
                 return node
             if value > node.value:
                 node = node.right
ts-3-5/test_3-5_0-6_208.py ...F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - assert 5 == 3
========================= 1 failed, 5 passed in 0.15s ==========================
