31 : Job ID eff663fa4ea34266a3ad279885c0b746
test outcome: killed
binary_search_tree.py, start pos: (36, 15), end pos: (36, 33)
operator: core/AddNot, occurrence: 6
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -33,7 +33,7 @@
         while node:
             if value == node.value:
                 return node
-            if value > node.value:
+            if not value > node.value:
                 node = node.right
             else:
                 node = node.left
ts-3-5/test_3-5_0-6_208.py ...F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_search - AttributeError: 'NoneType' o...
========================= 1 failed, 5 passed in 0.15s ==========================

32 : Job ID 1603664140b745d48097fd3b66609cc0
test outcome: killed
binary_search_tree.py, start pos: (46, 15), end pos: (46, 19)
operator: core/AddNot, occurrence: 7
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -43,7 +43,7 @@
     def in_order_traversal(self):
         output = []
         def recur(node):
-            if node:
+            if not node:
                 recur(node.left)
                 output.append(node.value)
                 recur(node.right)
ts-3-5/test_3-5_0-6_208.py ....F.                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_in_order_traversal - assert [] == [3,...
========================= 1 failed, 5 passed in 0.15s ==========================

33 : Job ID 46fae7aef7024b5a832b9b1abceb0ea3
test outcome: killed
binary_search_tree.py, start pos: (56, 15), end pos: (56, 21)
operator: core/AddNot, occurrence: 8
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -53,7 +53,7 @@
     def merge(self, tree):
         def mergeOntoT1(t1, t2):
-            if not t1:
+            if not not t1:
                 return t2
             if not t2:
                 return t1
ts-3-5/test_3-5_0-6_208.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_merge - assert 5 == 12
========================= 1 failed, 5 passed in 0.15s ==========================

34 : Job ID 849f765d5c3847c6b037878c8ee65537
test outcome: killed
binary_search_tree.py, start pos: (58, 15), end pos: (58, 21)
operator: core/AddNot, occurrence: 9
--- mutation diff ---
--- abinary_search_tree.py
+++ bbinary_search_tree.py
@@ -55,7 +55,7 @@
         def mergeOntoT1(t1, t2):
             if not t1:
                 return t2
-            if not t2:
+            if not not t2:
                 return t1
             t1.value += t2.value
ts-3-5/test_3-5_0-6_208.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_208.py::test_merge - assert 5 == 12
========================= 1 failed, 5 passed in 0.15s ==========================
