   - [#  17] COI binary_search_tree: 
--------------------------------------------------------------------------------
  30:     
  31:     def search(self, value):
  32:         node = self.head
  33:         while node:
- 34:             if value == node.value:
+ 34:             if not (value == node.value):
  35:                 return node
  36:             if value > node.value:
  37:                 node = node.right
  38:             else:
--------------------------------------------------------------------------------
[0.19775 s] killed by ts-3-5/test_3-5_0-5_169.py::test_search

bst = <binary_search_tree.BinarySearchTree object at 0x7ca093df1990>

    def test_search(bst):
        bst.insert(5)
        bst.insert(3)
        bst.insert(7)
>       assert bst.search(3).value == 3
E       AssertionError

ts-3-5/test_3-5_0-5_169.py:41: AssertionError

   - [#  37] SDL binary_search_tree: 
--------------------------------------------------------------------------------
   7:     
   8:     def insert(self, val):
   9:         if not (self.head):
  10:             self.head = BinaryTreeNode(val, None)
- 11:             return
+ 11:             pass
  12:         def add_node_recursive(node):
  13:             if val < node.value:
  14:                 if node.left:
  15:                     add_node_recursive(node.left)
--------------------------------------------------------------------------------
[0.19813 s] killed by ts-3-5/test_3-5_0-5_169.py::test_insert

bst = <binary_search_tree.BinarySearchTree object at 0x7ca0942818d0>

    def test_insert(bst):
        bst.insert(5)
        assert bst.head.value == 5
        bst.insert(3)
        assert bst.head.left.value == 3
        bst.insert(7)
>       assert bst.head.right.value == 7
E       AssertionError

ts-3-5/test_3-5_0-5_169.py:22: AssertionError

   - [#  43] SDL binary_search_tree: 
--------------------------------------------------------------------------------
  22:                 node.right = BinaryTreeNode(val, node)
  23:         add_node_recursive(self.head)
  24:     
  25:     def min(self):
- 26:         return self.head.min().value
+ 26:         pass
  27:     
  28:     def delete(self, value):
  29:         self.head.delete(value)
  30:     
--------------------------------------------------------------------------------
[0.22359 s] killed by ts-3-5/test_3-5_0-5_169.py::test_min

bst = <binary_search_tree.BinarySearchTree object at 0x7ca093b8d630>

    def test_min(bst):
        bst.insert(5)
        bst.insert(3)
        bst.insert(7)
>       assert bst.min() == 3
E       AssertionError

ts-3-5/test_3-5_0-5_169.py:28: AssertionError

   - [#  46] SDL binary_search_tree: 
--------------------------------------------------------------------------------
  31:     def search(self, value):
  32:         node = self.head
  33:         while node:
  34:             if value == node.value:
- 35:                 return node
+ 35:                 pass
  36:             if value > node.value:
  37:                 node = node.right
  38:             else:
  39:                 node = node.left
--------------------------------------------------------------------------------
[0.19556 s] killed by ts-3-5/test_3-5_0-5_169.py::test_search

bst = <binary_search_tree.BinarySearchTree object at 0x7ca093d5fca0>

    def test_search(bst):
        bst.insert(5)
        bst.insert(3)
        bst.insert(7)
>       assert bst.search(3).value == 3
E       AttributeError: 'NoneType' object has no attribute 'value'

ts-3-5/test_3-5_0-5_169.py:41: AttributeError
