1 : Job ID f97e13fe59f343faab66e5f403f93972
test outcome: killed
bst2.py, start pos: (156, 26), end pos: (156, 27)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -153,7 +153,7 @@
         leftbranch = 0 if not tree.left else tree.left.height
         rightbranch = 0 if not tree.right else tree.right.height
-        return leftbranch - rightbranch
+        return leftbranch + rightbranch
     def pre_order(self, node='root'):
         """Depth first pre-order traversal of tree."""
ts-3-5/test_3-5_0-4_143.py .........F.....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - assert 4 == 0
========================= 1 failed, 14 passed in 0.10s =========================

2 : Job ID afef1572ceae46a3b8ead78091dc0b9e
test outcome: killed
bst2.py, start pos: (156, 26), end pos: (156, 27)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -153,7 +153,7 @@
         leftbranch = 0 if not tree.left else tree.left.height
         rightbranch = 0 if not tree.right else tree.right.height
-        return leftbranch - rightbranch
+        return leftbranch * rightbranch
     def pre_order(self, node='root'):
         """Depth first pre-order traversal of tree."""
ts-3-5/test_3-5_0-4_143.py .........F.....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - assert 4 == 0
========================= 1 failed, 14 passed in 0.10s =========================

3 : Job ID a79b427a60594c05933638060e111df7
test outcome: killed
bst2.py, start pos: (156, 26), end pos: (156, 27)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -153,7 +153,7 @@
         leftbranch = 0 if not tree.left else tree.left.height
         rightbranch = 0 if not tree.right else tree.right.height
-        return leftbranch - rightbranch
+        return leftbranch / rightbranch
     def pre_order(self, node='root'):
         """Depth first pre-order traversal of tree."""
ts-3-5/test_3-5_0-4_143.py .........F.....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - assert 1.0 == 0
========================= 1 failed, 14 passed in 0.10s =========================

4 : Job ID 10f94f2f81604a989725213df49c17d0
test outcome: killed
bst2.py, start pos: (156, 26), end pos: (156, 27)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -153,7 +153,7 @@
         leftbranch = 0 if not tree.left else tree.left.height
         rightbranch = 0 if not tree.right else tree.right.height
-        return leftbranch - rightbranch
+        return leftbranch // rightbranch
     def pre_order(self, node='root'):
         """Depth first pre-order traversal of tree."""
ts-3-5/test_3-5_0-4_143.py .........F.....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - assert 1 == 0
========================= 1 failed, 14 passed in 0.10s =========================

5 : Job ID 58200d037e814f48b9b0de080d96b523
SURVIVED
test outcome: survived
bst2.py, start pos: (156, 26), end pos: (156, 27)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -153,7 +153,7 @@
         leftbranch = 0 if not tree.left else tree.left.height
         rightbranch = 0 if not tree.right else tree.right.height
-        return leftbranch - rightbranch
+        return leftbranch % rightbranch
     def pre_order(self, node='root'):
         """Depth first pre-order traversal of tree."""
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

6 : Job ID 1646665814e24524a3710cde65a9cdbe
test outcome: killed
bst2.py, start pos: (156, 26), end pos: (156, 27)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -153,7 +153,7 @@
         leftbranch = 0 if not tree.left else tree.left.height
         rightbranch = 0 if not tree.right else tree.right.height
-        return leftbranch - rightbranch
+        return leftbranch ** rightbranch
     def pre_order(self, node='root'):
         """Depth first pre-order traversal of tree."""
ts-3-5/test_3-5_0-4_143.py .........F.....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - assert 4 == 0
========================= 1 failed, 14 passed in 0.10s =========================

7 : Job ID ee73bb986422417f94ee1865c279ec7b
SURVIVED
test outcome: survived
bst2.py, start pos: (156, 26), end pos: (156, 27)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -153,7 +153,7 @@
         leftbranch = 0 if not tree.left else tree.left.height
         rightbranch = 0 if not tree.right else tree.right.height
-        return leftbranch - rightbranch
+        return leftbranch >> rightbranch
     def pre_order(self, node='root'):
         """Depth first pre-order traversal of tree."""
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

8 : Job ID f0f9f8b5ebae4015a6b21419cb1b1d71
test outcome: killed
bst2.py, start pos: (156, 26), end pos: (156, 27)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -153,7 +153,7 @@
         leftbranch = 0 if not tree.left else tree.left.height
         rightbranch = 0 if not tree.right else tree.right.height
-        return leftbranch - rightbranch
+        return leftbranch << rightbranch
     def pre_order(self, node='root'):
         """Depth first pre-order traversal of tree."""
ts-3-5/test_3-5_0-4_143.py .........F.....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - assert 8 == 0
========================= 1 failed, 14 passed in 0.10s =========================

9 : Job ID b825eb88fe8b4b7b82955aa010cf2354
test outcome: killed
bst2.py, start pos: (156, 26), end pos: (156, 27)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -153,7 +153,7 @@
         leftbranch = 0 if not tree.left else tree.left.height
         rightbranch = 0 if not tree.right else tree.right.height
-        return leftbranch - rightbranch
+        return leftbranch | rightbranch
     def pre_order(self, node='root'):
         """Depth first pre-order traversal of tree."""
ts-3-5/test_3-5_0-4_143.py .........F.....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - assert 2 == 0
========================= 1 failed, 14 passed in 0.10s =========================

10 : Job ID 2375d33c6261426b986cfc47d8d64af8
test outcome: killed
bst2.py, start pos: (156, 26), end pos: (156, 27)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -153,7 +153,7 @@
         leftbranch = 0 if not tree.left else tree.left.height
         rightbranch = 0 if not tree.right else tree.right.height
-        return leftbranch - rightbranch
+        return leftbranch & rightbranch
     def pre_order(self, node='root'):
         """Depth first pre-order traversal of tree."""
ts-3-5/test_3-5_0-4_143.py .........F.....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - assert 2 == 0
========================= 1 failed, 14 passed in 0.10s =========================

11 : Job ID 005af646204d4282bbd62d5f79be2fab
SURVIVED
test outcome: survived
bst2.py, start pos: (156, 26), end pos: (156, 27)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -153,7 +153,7 @@
         leftbranch = 0 if not tree.left else tree.left.height
         rightbranch = 0 if not tree.right else tree.right.height
-        return leftbranch - rightbranch
+        return leftbranch ^ rightbranch
     def pre_order(self, node='root'):
         """Depth first pre-order traversal of tree."""
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

12 : Job ID 7e2699e13957406cb4c7e720ec0b6f10
test outcome: killed
bst2.py, start pos: (35, 46), end pos: (35, 48)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -32,7 +32,7 @@
     def _side(self):
         """Return if left or right child of parent."""
         if self.parent:
-            return 'left' if self.parent.left == self else 'right'
+            return 'left' if self.parent.left != self else 'right'
 class Bst(object):
ts-3-5/test_3-5_0-4_143.py ...F...........                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_node_side - AssertionError: assert 'r...
========================= 1 failed, 14 passed in 0.10s =========================

13 : Job ID 13616e67a9de436082427d2f4634bbde
test outcome: killed
bst2.py, start pos: (113, 27), end pos: (113, 29)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 1
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -110,7 +110,7 @@
         else:
             setattr(curr, side, Node(val, curr))
             self._size += 1
-            if curr.height == 1:
+            if curr.height != 1:
                 curr.height += 1
         return curr
ts-3-5/test_3-5_0-4_143.py .......F.......                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 2 == 3
========================= 1 failed, 14 passed in 0.10s =========================

14 : Job ID 5d4ebd811f7b4e818f154100e3bec78d
test outcome: killed
bst2.py, start pos: (121, 24), end pos: (121, 26)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 2
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -118,7 +118,7 @@
         """Return the node containing val."""
         curr = self.root
         while curr:
-            if curr.val == val:
+            if curr.val != val:
                 return curr
             elif val < curr.val:
                 curr = curr.left
ts-3-5/test_3-5_0-4_143.py .....F........F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_search - assert 5 == 7
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - RecursionError: maximum ...
========================= 2 failed, 13 passed in 0.11s =========================

15 : Job ID 172ff0a392ff4e089c9997ff0e2d7452
test outcome: killed
bst2.py, start pos: (160, 16), end pos: (160, 18)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 3
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -157,7 +157,7 @@
     def pre_order(self, node='root'):
         """Depth first pre-order traversal of tree."""
-        if node == 'root':
+        if node != 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ..........F....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - AttributeError: 'str'...
========================= 1 failed, 14 passed in 0.10s =========================

16 : Job ID 85a1c8f9faac4fabb24bb87d13c9daf5
test outcome: killed
bst2.py, start pos: (175, 16), end pos: (175, 18)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 4
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -172,7 +172,7 @@
     def in_order(self, node='root'):
         """Depth first in-order traversal of tree."""
-        if node == 'root':
+        if node != 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ...........F...                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - AttributeError: 'str' ...
========================= 1 failed, 14 passed in 0.10s =========================

17 : Job ID 9ad07e22c74b4ee2a4a75f6172901986
test outcome: killed
bst2.py, start pos: (189, 16), end pos: (189, 18)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 5
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -186,7 +186,7 @@
     def post_order(self, node='root'):
         """Depth frist post_order traversal of tree."""
-        if node == 'root':
+        if node != 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ............F..                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - AttributeError: 'str...
========================= 1 failed, 14 passed in 0.10s =========================

18 : Job ID 6648f68fd486401aa216acb26142c347
SURVIVED
test outcome: survived
bst2.py, start pos: (248, 32), end pos: (248, 34)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 6
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -245,7 +245,7 @@
             return self._findmin(node.right)
         else:
             if node.parent:
-                if node._side() == 'left':
+                if node._side() != 'left':
                     return self.parent
                 else:
                     node.parent.right = None
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

19 : Job ID 85a4c9e0d55249a98f0e6b8057c5cef2
test outcome: killed
bst2.py, start pos: (35, 46), end pos: (35, 48)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -32,7 +32,7 @@
     def _side(self):
         """Return if left or right child of parent."""
         if self.parent:
-            return 'left' if self.parent.left == self else 'right'
+            return 'left' if self.parent.left < self else 'right'
 class Bst(object):
ts-3-5/test_3-5_0-4_143.py ...F..........F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_node_side - TypeError: '<' not suppor...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - TypeError: '<' not suppo...
========================= 2 failed, 13 passed in 0.10s =========================

20 : Job ID 8a74b2ec528d4a3e9fe19a96df10939a
test outcome: killed
bst2.py, start pos: (113, 27), end pos: (113, 29)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 1
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -110,7 +110,7 @@
         else:
             setattr(curr, side, Node(val, curr))
             self._size += 1
-            if curr.height == 1:
+            if curr.height < 1:
                 curr.height += 1
         return curr
ts-3-5/test_3-5_0-4_143.py .......F.......                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 2 == 3
========================= 1 failed, 14 passed in 0.11s =========================

21 : Job ID ef8d6de3dfda4fe1aa34e56b7bdc34cf
test outcome: killed
bst2.py, start pos: (121, 24), end pos: (121, 26)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 2
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -118,7 +118,7 @@
         """Return the node containing val."""
         curr = self.root
         while curr:
-            if curr.val == val:
+            if curr.val < val:
                 return curr
             elif val < curr.val:
                 curr = curr.left
ts-3-5/test_3-5_0-4_143.py .....F........F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_search - assert 5 == 7
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 7 == 6
========================= 2 failed, 13 passed in 0.10s =========================

22 : Job ID 7fbc8963f60e433ea71afa7ed275d3c6
test outcome: killed
bst2.py, start pos: (160, 16), end pos: (160, 18)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 3
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -157,7 +157,7 @@
     def pre_order(self, node='root'):
         """Depth first pre-order traversal of tree."""
-        if node == 'root':
+        if node < 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ..........F....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - AttributeError: 'str'...
========================= 1 failed, 14 passed in 0.10s =========================

23 : Job ID c1476516bf874f07bf363f91d65d1fb2
test outcome: killed
bst2.py, start pos: (175, 16), end pos: (175, 18)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 4
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -172,7 +172,7 @@
     def in_order(self, node='root'):
         """Depth first in-order traversal of tree."""
-        if node == 'root':
+        if node < 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ...........F...                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - AttributeError: 'str' ...
========================= 1 failed, 14 passed in 0.10s =========================

24 : Job ID 9ccc9d95b64b46c5b5f9f68ce677ad8e
test outcome: killed
bst2.py, start pos: (189, 16), end pos: (189, 18)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 5
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -186,7 +186,7 @@
     def post_order(self, node='root'):
         """Depth frist post_order traversal of tree."""
-        if node == 'root':
+        if node < 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ............F..                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - AttributeError: 'str...
========================= 1 failed, 14 passed in 0.10s =========================

25 : Job ID 2086f1ae38494cd094cb163aabeb8ad2
SURVIVED
test outcome: survived
bst2.py, start pos: (248, 32), end pos: (248, 34)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 6
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -245,7 +245,7 @@
             return self._findmin(node.right)
         else:
             if node.parent:
-                if node._side() == 'left':
+                if node._side() < 'left':
                     return self.parent
                 else:
                     node.parent.right = None
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

26 : Job ID a5c1c1a98f764f21a7c506c919b33c66
test outcome: killed
bst2.py, start pos: (35, 46), end pos: (35, 48)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -32,7 +32,7 @@
     def _side(self):
         """Return if left or right child of parent."""
         if self.parent:
-            return 'left' if self.parent.left == self else 'right'
+            return 'left' if self.parent.left <= self else 'right'
 class Bst(object):
ts-3-5/test_3-5_0-4_143.py ...F..........F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_node_side - TypeError: '<=' not suppo...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - TypeError: '<=' not supp...
========================= 2 failed, 13 passed in 0.10s =========================

27 : Job ID fee5422e25dd439d9f756821218614c8
SURVIVED
test outcome: survived
bst2.py, start pos: (113, 27), end pos: (113, 29)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 1
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -110,7 +110,7 @@
         else:
             setattr(curr, side, Node(val, curr))
             self._size += 1
-            if curr.height == 1:
+            if curr.height <= 1:
                 curr.height += 1
         return curr
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

28 : Job ID 77d7e419cd5143d88997800ad69741bf
test outcome: killed
bst2.py, start pos: (121, 24), end pos: (121, 26)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 2
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -118,7 +118,7 @@
         """Return the node containing val."""
         curr = self.root
         while curr:
-            if curr.val == val:
+            if curr.val <= val:
                 return curr
             elif val < curr.val:
                 curr = curr.left
ts-3-5/test_3-5_0-4_143.py .....F........F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_search - assert 5 == 7
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - RecursionError: maximum ...
========================= 2 failed, 13 passed in 0.11s =========================

29 : Job ID 769188412c88420d810b04237a22fca0
test outcome: killed
bst2.py, start pos: (160, 16), end pos: (160, 18)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 3
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -157,7 +157,7 @@
     def pre_order(self, node='root'):
         """Depth first pre-order traversal of tree."""
-        if node == 'root':
+        if node <= 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ..........F....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - TypeError: '<=' not s...
========================= 1 failed, 14 passed in 0.10s =========================

30 : Job ID 30cb0c8fd2fc432b86962102169d7592
test outcome: killed
bst2.py, start pos: (175, 16), end pos: (175, 18)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 4
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -172,7 +172,7 @@
     def in_order(self, node='root'):
         """Depth first in-order traversal of tree."""
-        if node == 'root':
+        if node <= 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ...........F...                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - TypeError: '<=' not su...
========================= 1 failed, 14 passed in 0.10s =========================

31 : Job ID 646545e01419483aa639726bc047aca8
test outcome: killed
bst2.py, start pos: (189, 16), end pos: (189, 18)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 5
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -186,7 +186,7 @@
     def post_order(self, node='root'):
         """Depth frist post_order traversal of tree."""
-        if node == 'root':
+        if node <= 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ............F..                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - TypeError: '<=' not ...
========================= 1 failed, 14 passed in 0.10s =========================

32 : Job ID 422849c4cd6347d9a377421feed33d1d
SURVIVED
test outcome: survived
bst2.py, start pos: (248, 32), end pos: (248, 34)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 6
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -245,7 +245,7 @@
             return self._findmin(node.right)
         else:
             if node.parent:
-                if node._side() == 'left':
+                if node._side() <= 'left':
                     return self.parent
                 else:
                     node.parent.right = None
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

33 : Job ID 0070e18fcc9944c5a5e01c081500035e
test outcome: killed
bst2.py, start pos: (35, 46), end pos: (35, 48)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -32,7 +32,7 @@
     def _side(self):
         """Return if left or right child of parent."""
         if self.parent:
-            return 'left' if self.parent.left == self else 'right'
+            return 'left' if self.parent.left > self else 'right'
 class Bst(object):
ts-3-5/test_3-5_0-4_143.py ...F..........F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_node_side - TypeError: '>' not suppor...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - TypeError: '>' not suppo...
========================= 2 failed, 13 passed in 0.10s =========================

34 : Job ID 36ce8d2c642e459f8d5134e78a3d8187
test outcome: killed
bst2.py, start pos: (113, 27), end pos: (113, 29)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 1
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -110,7 +110,7 @@
         else:
             setattr(curr, side, Node(val, curr))
             self._size += 1
-            if curr.height == 1:
+            if curr.height > 1:
                 curr.height += 1
         return curr
ts-3-5/test_3-5_0-4_143.py .......F.......                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 2 == 3
========================= 1 failed, 14 passed in 0.10s =========================

35 : Job ID d63cb7c4a47a4904b0981544a1dbc596
test outcome: killed
bst2.py, start pos: (121, 24), end pos: (121, 26)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 2
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -118,7 +118,7 @@
         """Return the node containing val."""
         curr = self.root
         while curr:
-            if curr.val == val:
+            if curr.val > val:
                 return curr
             elif val < curr.val:
                 curr = curr.left
ts-3-5/test_3-5_0-4_143.py .....F........F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_search - assert 8 == 7
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 7 == 6
========================= 2 failed, 13 passed in 0.10s =========================

36 : Job ID 3b7072f19ce14908ad7447839b8ae5f6
test outcome: killed
bst2.py, start pos: (160, 16), end pos: (160, 18)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 3
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -157,7 +157,7 @@
     def pre_order(self, node='root'):
         """Depth first pre-order traversal of tree."""
-        if node == 'root':
+        if node > 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ..........F....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - AttributeError: 'str'...
========================= 1 failed, 14 passed in 0.10s =========================

37 : Job ID aec9f69a981449f0ab024eb340e7be08
test outcome: killed
bst2.py, start pos: (175, 16), end pos: (175, 18)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 4
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -172,7 +172,7 @@
     def in_order(self, node='root'):
         """Depth first in-order traversal of tree."""
-        if node == 'root':
+        if node > 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ...........F...                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - AttributeError: 'str' ...
========================= 1 failed, 14 passed in 0.10s =========================
