38 : Job ID 198c52e4aed949f294bbd1cbc68edeba
test outcome: killed
bst2.py, start pos: (189, 16), end pos: (189, 18)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 5
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -186,7 +186,7 @@
     def post_order(self, node='root'):
         """Depth frist post_order traversal of tree."""
-        if node == 'root':
+        if node > 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ............F..                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - AttributeError: 'str...
========================= 1 failed, 14 passed in 0.11s =========================

39 : Job ID 5959e0a2605a49f28cab77a98fed4f56
SURVIVED
test outcome: survived
bst2.py, start pos: (248, 32), end pos: (248, 34)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 6
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -245,7 +245,7 @@
             return self._findmin(node.right)
         else:
             if node.parent:
-                if node._side() == 'left':
+                if node._side() > 'left':
                     return self.parent
                 else:
                     node.parent.right = None
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

40 : Job ID 5dc08631c5f54abb8d11214546c1f0bb
test outcome: killed
bst2.py, start pos: (35, 46), end pos: (35, 48)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -32,7 +32,7 @@
     def _side(self):
         """Return if left or right child of parent."""
         if self.parent:
-            return 'left' if self.parent.left == self else 'right'
+            return 'left' if self.parent.left >= self else 'right'
 class Bst(object):
ts-3-5/test_3-5_0-4_143.py ...F..........F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_node_side - TypeError: '>=' not suppo...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - TypeError: '>=' not supp...
========================= 2 failed, 13 passed in 0.10s =========================

41 : Job ID 2f1b2677731c40bbb0fb48dc281bde5f
test outcome: killed
bst2.py, start pos: (113, 27), end pos: (113, 29)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 1
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -110,7 +110,7 @@
         else:
             setattr(curr, side, Node(val, curr))
             self._size += 1
-            if curr.height == 1:
+            if curr.height >= 1:
                 curr.height += 1
         return curr
ts-3-5/test_3-5_0-4_143.py .......F.......                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 4 == 3
========================= 1 failed, 14 passed in 0.10s =========================

42 : Job ID 56f0fdc5471b49de98bb3798d3338bfc
SURVIVED
test outcome: survived
bst2.py, start pos: (121, 24), end pos: (121, 26)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 2
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -118,7 +118,7 @@
         """Return the node containing val."""
         curr = self.root
         while curr:
-            if curr.val == val:
+            if curr.val >= val:
                 return curr
             elif val < curr.val:
                 curr = curr.left
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

43 : Job ID b1da054a28904282b8a353215b1e54d6
test outcome: killed
bst2.py, start pos: (160, 16), end pos: (160, 18)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 3
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -157,7 +157,7 @@
     def pre_order(self, node='root'):
         """Depth first pre-order traversal of tree."""
-        if node == 'root':
+        if node >= 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ..........F....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - TypeError: '>=' not s...
========================= 1 failed, 14 passed in 0.10s =========================

44 : Job ID e0d70cec5a3c46ffb2910bc4af5435bd
test outcome: killed
bst2.py, start pos: (175, 16), end pos: (175, 18)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 4
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -172,7 +172,7 @@
     def in_order(self, node='root'):
         """Depth first in-order traversal of tree."""
-        if node == 'root':
+        if node >= 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ...........F...                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - TypeError: '>=' not su...
========================= 1 failed, 14 passed in 0.10s =========================

45 : Job ID bb6b6e7f433f41a581f9e84ce1449a32
test outcome: killed
bst2.py, start pos: (189, 16), end pos: (189, 18)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 5
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -186,7 +186,7 @@
     def post_order(self, node='root'):
         """Depth frist post_order traversal of tree."""
-        if node == 'root':
+        if node >= 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ............F..                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - TypeError: '>=' not ...
========================= 1 failed, 14 passed in 0.10s =========================

46 : Job ID 3033e06752de4c19b44aa833a9e097d1
SURVIVED
test outcome: survived
bst2.py, start pos: (248, 32), end pos: (248, 34)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 6
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -245,7 +245,7 @@
             return self._findmin(node.right)
         else:
             if node.parent:
-                if node._side() == 'left':
+                if node._side() >= 'left':
                     return self.parent
                 else:
                     node.parent.right = None
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

47 : Job ID b7057678ef374b33b14189c0b1442770
SURVIVED
test outcome: survived
bst2.py, start pos: (35, 46), end pos: (35, 48)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -32,7 +32,7 @@
     def _side(self):
         """Return if left or right child of parent."""
         if self.parent:
-            return 'left' if self.parent.left == self else 'right'
+            return 'left' if self.parent.left is self else 'right'
 class Bst(object):
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

48 : Job ID cbc8fe1ebcde4496861fd743c5d72d89
SURVIVED
test outcome: survived
bst2.py, start pos: (121, 24), end pos: (121, 26)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 1
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -118,7 +118,7 @@
         """Return the node containing val."""
         curr = self.root
         while curr:
-            if curr.val == val:
+            if curr.val is val:
                 return curr
             elif val < curr.val:
                 curr = curr.left
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

49 : Job ID cded9262a44e417aad479c2ed68967b7
SURVIVED
test outcome: survived
bst2.py, start pos: (160, 16), end pos: (160, 18)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 2
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -157,7 +157,7 @@
     def pre_order(self, node='root'):
         """Depth first pre-order traversal of tree."""
-        if node == 'root':
+        if node is 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
=============================== warnings summary ===============================
bst2.py:160
  /home/lucca/teste/python_experiments2/bst2/bst2.py:160: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if node is 'root':
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
======================== 15 passed, 1 warning in 0.10s =========================

50 : Job ID 7d8015b5b6dc4ccd96da81b567035268
SURVIVED
test outcome: survived
bst2.py, start pos: (175, 16), end pos: (175, 18)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 3
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -172,7 +172,7 @@
     def in_order(self, node='root'):
         """Depth first in-order traversal of tree."""
-        if node == 'root':
+        if node is 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
=============================== warnings summary ===============================
bst2.py:175
  /home/lucca/teste/python_experiments2/bst2/bst2.py:175: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if node is 'root':
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
======================== 15 passed, 1 warning in 0.10s =========================

51 : Job ID 7e5d59329e764dc8af4784fc45b65693
SURVIVED
test outcome: survived
bst2.py, start pos: (189, 16), end pos: (189, 18)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 4
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -186,7 +186,7 @@
     def post_order(self, node='root'):
         """Depth frist post_order traversal of tree."""
-        if node == 'root':
+        if node is 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
=============================== warnings summary ===============================
bst2.py:189
  /home/lucca/teste/python_experiments2/bst2/bst2.py:189: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if node is 'root':
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
======================== 15 passed, 1 warning in 0.10s =========================

52 : Job ID 96506dbb4c004a5e8a6f13596b796880
SURVIVED
test outcome: survived
bst2.py, start pos: (248, 32), end pos: (248, 34)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 5
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -245,7 +245,7 @@
             return self._findmin(node.right)
         else:
             if node.parent:
-                if node._side() == 'left':
+                if node._side() is 'left':
                     return self.parent
                 else:
                     node.parent.right = None
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
=============================== warnings summary ===============================
bst2.py:248
  /home/lucca/teste/python_experiments2/bst2/bst2.py:248: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if node._side() is 'left':
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
======================== 15 passed, 1 warning in 0.10s =========================

53 : Job ID 755ea423a68d43848b092bc131f9f5e9
test outcome: killed
bst2.py, start pos: (35, 46), end pos: (35, 48)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -32,7 +32,7 @@
     def _side(self):
         """Return if left or right child of parent."""
         if self.parent:
-            return 'left' if self.parent.left == self else 'right'
+            return 'left' if self.parent.left is not self else 'right'
 class Bst(object):
ts-3-5/test_3-5_0-4_143.py ...F...........                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_node_side - AssertionError: assert 'r...
========================= 1 failed, 14 passed in 0.10s =========================

54 : Job ID 96b1b698775c47c182e2aa814a1db4ea
test outcome: killed
bst2.py, start pos: (121, 24), end pos: (121, 26)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 1
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -118,7 +118,7 @@
         """Return the node containing val."""
         curr = self.root
         while curr:
-            if curr.val == val:
+            if curr.val is not val:
                 return curr
             elif val < curr.val:
                 curr = curr.left
ts-3-5/test_3-5_0-4_143.py .....F........F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_search - assert 5 == 7
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - RecursionError: maximum ...
========================= 2 failed, 13 passed in 0.10s =========================

55 : Job ID a33013e1fab749c99b0aa3b4676d516e
test outcome: killed
bst2.py, start pos: (160, 16), end pos: (160, 18)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 2
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -157,7 +157,7 @@
     def pre_order(self, node='root'):
         """Depth first pre-order traversal of tree."""
-        if node == 'root':
+        if node is not 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ..........F....                               [100%]
=============================== warnings summary ===============================
bst2.py:160
  /home/lucca/teste/python_experiments2/bst2/bst2.py:160: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if node is not 'root':
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - AttributeError: 'str'...
=================== 1 failed, 14 passed, 1 warning in 0.10s ====================

56 : Job ID fc3c552c4f424bf780eab9612d957068
test outcome: killed
bst2.py, start pos: (175, 16), end pos: (175, 18)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 3
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -172,7 +172,7 @@
     def in_order(self, node='root'):
         """Depth first in-order traversal of tree."""
-        if node == 'root':
+        if node is not 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ...........F...                               [100%]
=============================== warnings summary ===============================
bst2.py:175
  /home/lucca/teste/python_experiments2/bst2/bst2.py:175: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if node is not 'root':
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - AttributeError: 'str' ...
=================== 1 failed, 14 passed, 1 warning in 0.10s ====================

57 : Job ID 574013d6125f45c3b424bd6802626b2a
test outcome: killed
bst2.py, start pos: (189, 16), end pos: (189, 18)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 4
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -186,7 +186,7 @@
     def post_order(self, node='root'):
         """Depth frist post_order traversal of tree."""
-        if node == 'root':
+        if node is not 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ............F..                               [100%]
=============================== warnings summary ===============================
bst2.py:189
  /home/lucca/teste/python_experiments2/bst2/bst2.py:189: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if node is not 'root':
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - AttributeError: 'str...
=================== 1 failed, 14 passed, 1 warning in 0.10s ====================

58 : Job ID eca432db3b3a415f84c34c3cef1411c3
SURVIVED
test outcome: survived
bst2.py, start pos: (248, 32), end pos: (248, 34)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 5
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -245,7 +245,7 @@
             return self._findmin(node.right)
         else:
             if node.parent:
-                if node._side() == 'left':
+                if node._side() is not 'left':
                     return self.parent
                 else:
                     node.parent.right = None
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
=============================== warnings summary ===============================
bst2.py:248
  /home/lucca/teste/python_experiments2/bst2/bst2.py:248: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if node._side() is not 'left':
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
======================== 15 passed, 1 warning in 0.10s =========================

59 : Job ID a58f8c8a13bf4c23b79e2aff3e23d76c
test outcome: killed
bst2.py, start pos: (97, 15), end pos: (97, 16)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -94,7 +94,7 @@
     def _step(self, val, curr):
         """Decide left or right and returns height."""
-        if val < curr.val:
+        if val == curr.val:
             curr = self._set_child(curr, 'left', val)
         elif val > curr.val:
             curr = self._set_child(curr, 'right', val)
ts-3-5/test_3-5_0-4_143.py ....F.F.FFFFFFF                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_insert - assert 4 == 8
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_size - assert 3 == 7
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_contains - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - assert -2 == 0
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - assert [5, 7, 8] == [...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - assert [5, 7, 8] == [2...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - assert [8, 7, 5] == ...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_breadth_first - assert [5, 7, 8] ...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 3 == 6
========================= 9 failed, 6 passed in 0.11s ==========================

60 : Job ID b41322f3eea84c20abed6f1bacf82288
test outcome: killed
bst2.py, start pos: (123, 21), end pos: (123, 22)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 1
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -120,7 +120,7 @@
         while curr:
             if curr.val == val:
                 return curr
-            elif val < curr.val:
+            elif val == curr.val:
                 curr = curr.left
             else:
                 curr = curr.right
ts-3-5/test_3-5_0-4_143.py ........F.....F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_contains - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 7 == 6
========================= 2 failed, 13 passed in 0.11s =========================

61 : Job ID c1dfac2409834f748978b6c08f9f9137
SURVIVED
test outcome: survived
bst2.py, start pos: (215, 22), end pos: (215, 23)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 2
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -212,7 +212,7 @@
     def delete(self, val):
         """Remove a node from the tree."""
-        if self._size < 1 or not self.contains(val):
+        if self._size == 1 or not self.contains(val):
             return
         node = self.search(val)
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.09s ==============================

62 : Job ID a452908e20684fec8781e373f518e48a
test outcome: killed
bst2.py, start pos: (97, 15), end pos: (97, 16)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -94,7 +94,7 @@
     def _step(self, val, curr):
         """Decide left or right and returns height."""
-        if val < curr.val:
+        if val != curr.val:
             curr = self._set_child(curr, 'left', val)
         elif val > curr.val:
             curr = self._set_child(curr, 'right', val)
ts-3-5/test_3-5_0-4_143.py .....F.FFFFFF..                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_search - AttributeError: 'NoneTyp...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 7 == 3
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_contains - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - assert 6 == 0
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - assert [5, 3, 7, 2, 4...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - assert [8, 6, 4, 2, 7,...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - assert [8, 6, 4, 2, ...
========================= 7 failed, 8 passed in 0.11s ==========================

63 : Job ID 21b7b2b54cfc4cf7a8019117e65149f2
test outcome: killed
bst2.py, start pos: (123, 21), end pos: (123, 22)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 1
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -120,7 +120,7 @@
         while curr:
             if curr.val == val:
                 return curr
-            elif val < curr.val:
+            elif val != curr.val:
                 curr = curr.left
             else:
                 curr = curr.right
ts-3-5/test_3-5_0-4_143.py .....F..F.....F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_search - AttributeError: 'NoneTyp...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_contains - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 7 == 6
========================= 3 failed, 12 passed in 0.10s =========================

64 : Job ID 3b128218684d4ddb8d35a4def8b2b03c
test outcome: killed
bst2.py, start pos: (215, 22), end pos: (215, 23)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 2
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -212,7 +212,7 @@
     def delete(self, val):
         """Remove a node from the tree."""
-        if self._size < 1 or not self.contains(val):
+        if self._size != 1 or not self.contains(val):
             return
         node = self.search(val)
ts-3-5/test_3-5_0-4_143.py ..............F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 7 == 6
========================= 1 failed, 14 passed in 0.10s =========================

65 : Job ID ab42f565d2894c45906c8fd9d1dd1af9
SURVIVED
test outcome: survived
bst2.py, start pos: (97, 15), end pos: (97, 16)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -94,7 +94,7 @@
     def _step(self, val, curr):
         """Decide left or right and returns height."""
-        if val < curr.val:
+        if val <= curr.val:
             curr = self._set_child(curr, 'left', val)
         elif val > curr.val:
             curr = self._set_child(curr, 'right', val)
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

66 : Job ID 1c47798d41d441348d54607a3187a06d
SURVIVED
test outcome: survived
bst2.py, start pos: (123, 21), end pos: (123, 22)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 1
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -120,7 +120,7 @@
         while curr:
             if curr.val == val:
                 return curr
-            elif val < curr.val:
+            elif val <= curr.val:
                 curr = curr.left
             else:
                 curr = curr.right
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

67 : Job ID f8b4d2d44f934b97afaa15a335e2ac12
SURVIVED
test outcome: survived
bst2.py, start pos: (215, 22), end pos: (215, 23)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 2
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -212,7 +212,7 @@
     def delete(self, val):
         """Remove a node from the tree."""
-        if self._size < 1 or not self.contains(val):
+        if self._size <= 1 or not self.contains(val):
             return
         node = self.search(val)
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

68 : Job ID 738e9909672346d9a65eefcd4e7d31db
test outcome: killed
bst2.py, start pos: (97, 15), end pos: (97, 16)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -94,7 +94,7 @@
     def _step(self, val, curr):
         """Decide left or right and returns height."""
-        if val < curr.val:
+        if val > curr.val:
             curr = self._set_child(curr, 'left', val)
         elif val > curr.val:
             curr = self._set_child(curr, 'right', val)
ts-3-5/test_3-5_0-4_143.py ....FFF.FFFFFFF                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_insert - assert 4 == 8
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_search - AttributeError: 'NoneTyp...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_size - assert 3 == 7
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_contains - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - assert 2 == 0
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - assert [5, 7, 8] == [...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - assert [8, 7, 5] == [2...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - assert [8, 7, 5] == ...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_breadth_first - assert [5, 7, 8] ...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 3 == 6
========================= 10 failed, 5 passed in 0.11s ========

69 : Job ID 3c6a6f424c764896b1cc77ac1a8f7537
test outcome: killed
bst2.py, start pos: (123, 21), end pos: (123, 22)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 1
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -120,7 +120,7 @@
         while curr:
             if curr.val == val:
                 return curr
-            elif val < curr.val:
+            elif val > curr.val:
                 curr = curr.left
             else:
                 curr = curr.right
ts-3-5/test_3-5_0-4_143.py .....F..F.....F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_search - AttributeError: 'NoneTyp...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_contains - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 7 == 6
========================= 3 failed, 12 passed in 0.10s =========================

70 : Job ID 46d94c7b6805481eb8ab9ed219bf8aa2
test outcome: killed
bst2.py, start pos: (215, 22), end pos: (215, 23)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 2
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -212,7 +212,7 @@
     def delete(self, val):
         """Remove a node from the tree."""
-        if self._size < 1 or not self.contains(val):
+        if self._size > 1 or not self.contains(val):
             return
         node = self.search(val)
ts-3-5/test_3-5_0-4_143.py ..............F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 7 == 6
========================= 1 failed, 14 passed in 0.10s =========================
