71 : Job ID 3c42956e235d4c06a7b0cbbb66e32452
test outcome: killed
bst2.py, start pos: (97, 15), end pos: (97, 16)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -94,7 +94,7 @@
     def _step(self, val, curr):
         """Decide left or right and returns height."""
-        if val < curr.val:
+        if val >= curr.val:
             curr = self._set_child(curr, 'left', val)
         elif val > curr.val:
             curr = self._set_child(curr, 'right', val)
ts-3-5/test_3-5_0-4_143.py ....FFF.FFFFFFF                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_insert - assert 4 == 8
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_search - AttributeError: 'NoneTyp...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_size - assert 3 == 7
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_contains - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - assert 2 == 0
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - assert [5, 7, 8] == [...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - assert [8, 7, 5] == [2...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - assert [8, 7, 5] == ...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_breadth_first - assert [5, 7, 8] ...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 3 == 6
========================= 10 failed, 5 passed in 0.11s ======

72 : Job ID 148611e83e23444685583f0f6895bde6
test outcome: killed
bst2.py, start pos: (123, 21), end pos: (123, 22)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 1
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -120,7 +120,7 @@
         while curr:
             if curr.val == val:
                 return curr
-            elif val < curr.val:
+            elif val >= curr.val:
                 curr = curr.left
             else:
                 curr = curr.right
ts-3-5/test_3-5_0-4_143.py .....F..F.....F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_search - AttributeError: 'NoneTyp...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_contains - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 7 == 6
========================= 3 failed, 12 passed in 0.10s =========================

73 : Job ID 35e270e4877a4d94b80d68f61e441b24
test outcome: killed
bst2.py, start pos: (215, 22), end pos: (215, 23)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 2
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -212,7 +212,7 @@
     def delete(self, val):
         """Remove a node from the tree."""
-        if self._size < 1 or not self.contains(val):
+        if self._size >= 1 or not self.contains(val):
             return
         node = self.search(val)
ts-3-5/test_3-5_0-4_143.py ..............F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 7 == 6
========================= 1 failed, 14 passed in 0.10s =========================

74 : Job ID 428d023a22ef445fb06e71073a5d1303
test outcome: killed
bst2.py, start pos: (97, 15), end pos: (97, 16)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -94,7 +94,7 @@
     def _step(self, val, curr):
         """Decide left or right and returns height."""
-        if val < curr.val:
+        if val is curr.val:
             curr = self._set_child(curr, 'left', val)
         elif val > curr.val:
             curr = self._set_child(curr, 'right', val)
ts-3-5/test_3-5_0-4_143.py ....F.F.FFFFFFF                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_insert - assert 4 == 8
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_size - assert 3 == 7
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_contains - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - assert -2 == 0
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - assert [5, 7, 8] == [...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - assert [5, 7, 8] == [2...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - assert [8, 7, 5] == ...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_breadth_first - assert [5, 7, 8] ...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 3 == 6
========================= 9 failed, 6 passed in 0.11s ==========================

75 : Job ID 49d8aaf99cfc47cdb5d470e83e38e204
test outcome: killed
bst2.py, start pos: (123, 21), end pos: (123, 22)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 1
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -120,7 +120,7 @@
         while curr:
             if curr.val == val:
                 return curr
-            elif val < curr.val:
+            elif val is curr.val:
                 curr = curr.left
             else:
                 curr = curr.right
ts-3-5/test_3-5_0-4_143.py ........F.....F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_contains - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 7 == 6
========================= 2 failed, 13 passed in 0.10s =========================

76 : Job ID 37ff36fa92214122ba1e989239becc56
test outcome: killed
bst2.py, start pos: (97, 15), end pos: (97, 16)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -94,7 +94,7 @@
     def _step(self, val, curr):
         """Decide left or right and returns height."""
-        if val < curr.val:
+        if val is not curr.val:
             curr = self._set_child(curr, 'left', val)
         elif val > curr.val:
             curr = self._set_child(curr, 'right', val)
ts-3-5/test_3-5_0-4_143.py .....F.FFFFFF..                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_search - AttributeError: 'NoneTyp...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 7 == 3
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_contains - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - assert 6 == 0
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - assert [5, 3, 7, 2, 4...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - assert [8, 6, 4, 2, 7,...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - assert [8, 6, 4, 2, ...
========================= 7 failed, 8 passed in 0.11s ==========================

77 : Job ID 5b14203b132443258ff031e0c40f6b08
test outcome: killed
bst2.py, start pos: (123, 21), end pos: (123, 22)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 1
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -120,7 +120,7 @@
         while curr:
             if curr.val == val:
                 return curr
-            elif val < curr.val:
+            elif val is not curr.val:
                 curr = curr.left
             else:
                 curr = curr.right
ts-3-5/test_3-5_0-4_143.py .....F..F.....F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_search - AttributeError: 'NoneTyp...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_contains - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 7 == 6
========================= 3 failed, 12 passed in 0.10s =========================

78 : Job ID e7c73e19497f4b2782aa2515c1736fe0
SURVIVED
test outcome: survived
bst2.py, start pos: (108, 27), end pos: (108, 29)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -105,7 +105,7 @@
         child = getattr(curr, side)
         if child:
             count = self._step(val, child)
-            if curr.height <= count:
+            if curr.height == count:
                 curr.height += 1
         else:
             setattr(curr, side, Node(val, curr))
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.09s ==============================

79 : Job ID fc9e31d13aeb49a2b28f33c9905c09a8
test outcome: killed
bst2.py, start pos: (108, 27), end pos: (108, 29)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -105,7 +105,7 @@
         child = getattr(curr, side)
         if child:
             count = self._step(val, child)
-            if curr.height <= count:
+            if curr.height != count:
                 curr.height += 1
         else:
             setattr(curr, side, Node(val, curr))
ts-3-5/test_3-5_0-4_143.py .......F.......                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 2 == 3
========================= 1 failed, 14 passed in 0.11s =========================

80 : Job ID e6e93a025ac04b3ea2ab40a0062c3464
test outcome: killed
bst2.py, start pos: (108, 27), end pos: (108, 29)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -105,7 +105,7 @@
         child = getattr(curr, side)
         if child:
             count = self._step(val, child)
-            if curr.height <= count:
+            if curr.height < count:
                 curr.height += 1
         else:
             setattr(curr, side, Node(val, curr))
ts-3-5/test_3-5_0-4_143.py .......F.......                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 2 == 3
========================= 1 failed, 14 passed in 0.11s =========================

81 : Job ID d8cfbe9f64a8423aab7bab081de11556
test outcome: killed
bst2.py, start pos: (108, 27), end pos: (108, 29)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -105,7 +105,7 @@
         child = getattr(curr, side)
         if child:
             count = self._step(val, child)
-            if curr.height <= count:
+            if curr.height > count:
                 curr.height += 1
         else:
             setattr(curr, side, Node(val, curr))
ts-3-5/test_3-5_0-4_143.py .......F.......                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 2 == 3
========================= 1 failed, 14 passed in 0.10s =========================

82 : Job ID 59487ae8542f4b178f46514e9ec1f6b1
test outcome: killed
bst2.py, start pos: (108, 27), end pos: (108, 29)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -105,7 +105,7 @@
         child = getattr(curr, side)
         if child:
             count = self._step(val, child)
-            if curr.height <= count:
+            if curr.height >= count:
                 curr.height += 1
         else:
             setattr(curr, side, Node(val, curr))
ts-3-5/test_3-5_0-4_143.py .......F.......                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 6 == 3
========================= 1 failed, 14 passed in 0.10s =========================

83 : Job ID 3873cb721db347299985cc7e14f8e7ca
SURVIVED
test outcome: survived
bst2.py, start pos: (108, 27), end pos: (108, 29)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -105,7 +105,7 @@
         child = getattr(curr, side)
         if child:
             count = self._step(val, child)
-            if curr.height <= count:
+            if curr.height is count:
                 curr.height += 1
         else:
             setattr(curr, side, Node(val, curr))
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

84 : Job ID f4399238bde948ecb63b4c73e1260150
test outcome: killed
bst2.py, start pos: (108, 27), end pos: (108, 29)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -105,7 +105,7 @@
         child = getattr(curr, side)
         if child:
             count = self._step(val, child)
-            if curr.height <= count:
+            if curr.height is not count:
                 curr.height += 1
         else:
             setattr(curr, side, Node(val, curr))
ts-3-5/test_3-5_0-4_143.py .......F.......                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 2 == 3
========================= 1 failed, 14 passed in 0.10s =========================

85 : Job ID 34ca52f6e53247c7b17da598e0e4966f
test outcome: killed
bst2.py, start pos: (99, 17), end pos: (99, 18)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -96,7 +96,7 @@
         """Decide left or right and returns height."""
         if val < curr.val:
             curr = self._set_child(curr, 'left', val)
-        elif val > curr.val:
+        elif val == curr.val:
             curr = self._set_child(curr, 'right', val)
         return curr.height
ts-3-5/test_3-5_0-4_143.py ....FFF.FFFFFFF                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_insert - assert 3 == 8
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_search - AttributeError: 'NoneTyp...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_size - assert 3 == 7
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_contains - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - assert 2 == 0
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - assert [5, 3, 2] == [...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - assert [2, 3, 5] == [2...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - assert [2, 3, 5] == ...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_breadth_first - assert [5, 3, 2] ...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 2 == 6
========================= 10 failed, 5 passed in 0.11s ==========

86 : Job ID 1d6b7039dcc04522965855b396ffc2a2
SURVIVED
test outcome: survived
bst2.py, start pos: (99, 17), end pos: (99, 18)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -96,7 +96,7 @@
         """Decide left or right and returns height."""
         if val < curr.val:
             curr = self._set_child(curr, 'left', val)
-        elif val > curr.val:
+        elif val != curr.val:
             curr = self._set_child(curr, 'right', val)
         return curr.height
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

87 : Job ID df802ecca16f4303aa55b8048c6aed18
test outcome: killed
bst2.py, start pos: (99, 17), end pos: (99, 18)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -96,7 +96,7 @@
         """Decide left or right and returns height."""
         if val < curr.val:
             curr = self._set_child(curr, 'left', val)
-        elif val > curr.val:
+        elif val < curr.val:
             curr = self._set_child(curr, 'right', val)
         return curr.height
ts-3-5/test_3-5_0-4_143.py ....FFF.FFFFFFF                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_insert - assert 3 == 8
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_search - AttributeError: 'NoneTyp...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_size - assert 3 == 7
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_contains - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - assert 2 == 0
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - assert [5, 3, 2] == [...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - assert [2, 3, 5] == [2...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - assert [2, 3, 5] == ...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_breadth_first - assert [5, 3, 2] ...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 2 == 6
========================= 10 failed, 5 passed in 0.11s ===========

88 : Job ID 8345cf24a97c43fcb554965279c10908
test outcome: killed
bst2.py, start pos: (99, 17), end pos: (99, 18)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -96,7 +96,7 @@
         """Decide left or right and returns height."""
         if val < curr.val:
             curr = self._set_child(curr, 'left', val)
-        elif val > curr.val:
+        elif val <= curr.val:
             curr = self._set_child(curr, 'right', val)
         return curr.height
ts-3-5/test_3-5_0-4_143.py ....FFF.FFFFFFF                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_insert - assert 3 == 8
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_search - AttributeError: 'NoneTyp...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_size - assert 3 == 7
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_contains - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - assert 2 == 0
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - assert [5, 3, 2] == [...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - assert [2, 3, 5] == [2...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - assert [2, 3, 5] == ...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_breadth_first - assert [5, 3, 2] ...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 2 == 6
========================= 10 failed, 5 passed in 0.11s =========

89 : Job ID d8cbd59499ab4e86be5d87f52c27dfd4
SURVIVED
test outcome: survived
bst2.py, start pos: (99, 17), end pos: (99, 18)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -96,7 +96,7 @@
         """Decide left or right and returns height."""
         if val < curr.val:
             curr = self._set_child(curr, 'left', val)
-        elif val > curr.val:
+        elif val >= curr.val:
             curr = self._set_child(curr, 'right', val)
         return curr.height
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

90 : Job ID 2526ad086fc64352846b953e53026297
test outcome: killed
bst2.py, start pos: (99, 17), end pos: (99, 18)
operator: core/ReplaceComparisonOperator_Gt_Is, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -96,7 +96,7 @@
         """Decide left or right and returns height."""
         if val < curr.val:
             curr = self._set_child(curr, 'left', val)
-        elif val > curr.val:
+        elif val is curr.val:
             curr = self._set_child(curr, 'right', val)
         return curr.height
ts-3-5/test_3-5_0-4_143.py ....FFF.FFFFFFF                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_insert - assert 3 == 8
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_search - AttributeError: 'NoneTyp...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_size - assert 3 == 7
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_contains - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - assert 2 == 0
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - assert [5, 3, 2] == [...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - assert [2, 3, 5] == [2...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - assert [2, 3, 5] == ...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_breadth_first - assert [5, 3, 2] ...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 2 == 6
========================= 10 failed, 5 passed in 0.11s ==========

91 : Job ID f47679c856084ef0a443b7d38e3afca5
SURVIVED
test outcome: survived
bst2.py, start pos: (99, 17), end pos: (99, 18)
operator: core/ReplaceComparisonOperator_Gt_IsNot, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -96,7 +96,7 @@
         """Decide left or right and returns height."""
         if val < curr.val:
             curr = self._set_child(curr, 'left', val)
-        elif val > curr.val:
+        elif val is not curr.val:
             curr = self._set_child(curr, 'right', val)
         return curr.height
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

92 : Job ID 91d5afdd97fe4d769ae49494274d2430
test outcome: killed
bst2.py, start pos: (19, 27), end pos: (19, 29)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -16,7 +16,7 @@
     def _is_leaf(self):
         """Return true if a leaf."""
-        return (self.right is None and self.left is None)
+        return (self.right is not None and self.left is None)
     def _is_interior(self):
         """Return true if a interior node."""
ts-3-5/test_3-5_0-4_143.py F.............F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_node_is_leaf - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - TypeError: getattr(): at...
========================= 2 failed, 13 passed in 0.10s =========================

93 : Job ID c24b34cf943b413b8be17b903fcb2d55
test outcome: killed
bst2.py, start pos: (19, 49), end pos: (19, 51)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 1
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -16,7 +16,7 @@
     def _is_leaf(self):
         """Return true if a leaf."""
-        return (self.right is None and self.left is None)
+        return (self.right is None and self.left is not None)
     def _is_interior(self):
         """Return true if a interior node."""
ts-3-5/test_3-5_0-4_143.py F.............F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_node_is_leaf - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - TypeError: getattr(): at...
========================= 2 failed, 13 passed in 0.10s =========================

94 : Job ID dabe4f0f48f64e0b9a91ec743facf103
test outcome: killed
bst2.py, start pos: (23, 27), end pos: (23, 33)
operator: core/ReplaceComparisonOperator_IsNot_Is, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -20,7 +20,7 @@
     def _is_interior(self):
         """Return true if a interior node."""
-        return (self.right is not None) and (self.left is not None)
+        return (self.right is None) and (self.left is not None)
     def _onlychild(self):
         """Return string depending on children."""
ts-3-5/test_3-5_0-4_143.py .F............F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_node_is_interior - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - TypeError: getattr(): at...
========================= 2 failed, 13 passed in 0.10s =========================

95 : Job ID 5e85e53bef104ecdbc679503cf38efc2
test outcome: killed
bst2.py, start pos: (23, 55), end pos: (23, 61)
operator: core/ReplaceComparisonOperator_IsNot_Is, occurrence: 1
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -20,7 +20,7 @@
     def _is_interior(self):
         """Return true if a interior node."""
-        return (self.right is not None) and (self.left is not None)
+        return (self.right is not None) and (self.left is None)
     def _onlychild(self):
         """Return string depending on children."""
ts-3-5/test_3-5_0-4_143.py .F............F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_node_is_interior - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - TypeError: getattr(): at...
========================= 2 failed, 13 passed in 0.10s =========================

96 : Job ID ff6e2ac7f417481491d73ab03737a74e
test outcome: killed
bst2.py, start pos: (138, 32), end pos: (138, 38)
operator: core/ReplaceComparisonOperator_IsNot_Is, occurrence: 2
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -135,7 +135,7 @@
     def contains(self, val):
         """Return true if val is in the bst."""
-        return self.search(val) is not None
+        return self.search(val) is None
     def balance(self, tree=None):
         """Return an integer of how well the tree is balanced.
ts-3-5/test_3-5_0-4_143.py ........F.....F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_contains - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 7 == 6
========================= 2 failed, 13 passed in 0.11s =========================

97 : Job ID 911e5e7b31d840f9be4daca9391354a1
test outcome: killed
bst2.py, start pos: (27, 25), end pos: (27, 28)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -24,7 +24,7 @@
     def _onlychild(self):
         """Return string depending on children."""
-        if self.left and not self.right:
+        if self.left and  self.right:
             return 'left'
         if self.right and not self.left:
             return 'right'
ts-3-5/test_3-5_0-4_143.py ..F............                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_node_onlychild - AssertionError: asse...
========================= 1 failed, 14 passed in 0.10s =========================

98 : Job ID 39ec707b222e4a5e82e79a4b75345462
SURVIVED
test outcome: survived
bst2.py, start pos: (29, 26), end pos: (29, 29)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 1
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -26,7 +26,7 @@
         """Return string depending on children."""
         if self.left and not self.right:
             return 'left'
-        if self.right and not self.left:
+        if self.right and  self.left:
             return 'right'
     def _side(self):
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

99 : Job ID 757aa8bc3f6e47f89d47af9bd1deaed6
test outcome: killed
bst2.py, start pos: (89, 11), end pos: (89, 14)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 2
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -86,7 +86,7 @@
     def insert(self, val):
         """Insert val into BST. If val is already present will be ignored."""
-        if not self.root:
+        if  self.root:
             self.root = Node(val)
             self._size += 1
         else:
ts-3-5/test_3-5_0-4_143.py ....EEEEEEEEEEE                               [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_insert - AttributeError: 'NoneType...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_search - AttributeError: 'NoneType...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_size - AttributeError: 'NoneType' ...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_depth - AttributeError: 'NoneType'...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_contains - AttributeError: 'NoneTy...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_balance - AttributeError: 'NoneTyp...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - AttributeError: 'NoneT...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - AttributeError: 'NoneTy...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - AttributeError: 'None...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_breadth_first - AttributeError: 'N...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_delete

100 : Job ID 51d5db32e4cf43c0b9bf5e2a889a5adc
test outcome: killed
bst2.py, start pos: (134, 20), end pos: (134, 23)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 3
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -131,7 +131,7 @@
     def depth(self):
         """Return depth of the BST, representing total levels."""
-        return 0 if not self.root else self.root.height
+        return 0 if  self.root else self.root.height
     def contains(self, val):
         """Return true if val is in the bst."""
ts-3-5/test_3-5_0-4_143.py .......F.......                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 0 == 3
========================= 1 failed, 14 passed in 0.10s =========================
