101 : Job ID 36bcd49af54d41ef81d0d2236c6a4468
test outcome: killed
bst2.py, start pos: (148, 11), end pos: (148, 14)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 4
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -145,7 +145,7 @@
         should return a negative value. An ideally-balanced tree should
         return 0.
         """
-        if not tree:
+        if  tree:
             tree = self.root
             if not tree:
                 return 0
ts-3-5/test_3-5_0-4_143.py .........F.....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - AttributeError: 'NoneTy...
========================= 1 failed, 14 passed in 0.10s =========================

102 : Job ID 1d58b269d193422eaebf0c07e899d929
SURVIVED
test outcome: survived
bst2.py, start pos: (150, 15), end pos: (150, 18)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 5
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -147,7 +147,7 @@
         """
         if not tree:
             tree = self.root
-            if not tree:
+            if  tree:
                 return 0
         leftbranch = 0 if not tree.left else tree.left.height
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

103 : Job ID 6ec03d5579514d7ab98a67f9d12b0fb3
test outcome: killed
bst2.py, start pos: (153, 26), end pos: (153, 29)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 6
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -150,7 +150,7 @@
             if not tree:
                 return 0
-        leftbranch = 0 if not tree.left else tree.left.height
+        leftbranch = 0 if  tree.left else tree.left.height
         rightbranch = 0 if not tree.right else tree.right.height
         return leftbranch - rightbranch
ts-3-5/test_3-5_0-4_143.py .........F.....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - assert -2 == 0
========================= 1 failed, 14 passed in 0.12s =========================

104 : Job ID f0300fbd29ec49d3b8147c7b3191711b
test outcome: killed
bst2.py, start pos: (154, 27), end pos: (154, 30)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 7
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -151,7 +151,7 @@
                 return 0
         leftbranch = 0 if not tree.left else tree.left.height
-        rightbranch = 0 if not tree.right else tree.right.height
+        rightbranch = 0 if  tree.right else tree.right.height
         return leftbranch - rightbranch
ts-3-5/test_3-5_0-4_143.py .........F.....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - assert 2 == 0
========================= 1 failed, 14 passed in 0.10s =========================

105 : Job ID 2b648b127e784dacb09fdd8b93171063
test outcome: killed
bst2.py, start pos: (163, 11), end pos: (163, 14)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 8
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -160,7 +160,7 @@
         if node == 'root':
             node = self.root
-        if not node:
+        if  node:
             return
         yield node.val
ts-3-5/test_3-5_0-4_143.py ..........F....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - assert [] == [5, 3, 2...
========================= 1 failed, 14 passed in 0.10s =========================

108 : Job ID 3626461060e0411e8fd91e884ed02b96
test outcome: killed
bst2.py, start pos: (215, 29), end pos: (215, 32)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 11
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -212,7 +212,7 @@
     def delete(self, val):
         """Remove a node from the tree."""
-        if self._size < 1 or not self.contains(val):
+        if self._size < 1 or  self.contains(val):
             return
         node = self.search(val)
ts-3-5/test_3-5_0-4_143.py ..............F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 7 == 6
========================= 1 failed, 14 passed in 0.10s =========================

109 : Job ID 11e60b5b352d4d83ab109da669ad9696
test outcome: killed
bst2.py, start pos: (27, 11), end pos: (27, 39)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -24,7 +24,7 @@
     def _onlychild(self):
         """Return string depending on children."""
-        if self.left and not self.right:
+        if not self.left and not self.right:
             return 'left'
         if self.right and not self.left:
             return 'right'
ts-3-5/test_3-5_0-4_143.py ..F............                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_node_onlychild - AssertionError: asse...
========================= 1 failed, 14 passed in 0.10s =========================

110 : Job ID 7ddefcd7de3442ad817833e32cf33985
SURVIVED
test outcome: survived
bst2.py, start pos: (29, 11), end pos: (29, 39)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -26,7 +26,7 @@
         """Return string depending on children."""
         if self.left and not self.right:
             return 'left'
-        if self.right and not self.left:
+        if not self.right and not self.left:
             return 'right'
     def _side(self):
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.11s ==============================

111 : Job ID 1071a4da17c14f3d9c7e14d81d91da6d
test outcome: killed
bst2.py, start pos: (34, 11), end pos: (34, 22)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -31,7 +31,7 @@
     def _side(self):
         """Return if left or right child of parent."""
-        if self.parent:
+        if not self.parent:
             return 'left' if self.parent.left == self else 'right'
ts-3-5/test_3-5_0-4_143.py ...F..........F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_node_side - AssertionError: assert No...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - TypeError: attribute nam...
========================= 2 failed, 13 passed in 0.10s =========================

112 : Job ID 83330ef31f34489fa536c73e96997ac1
test outcome: killed
bst2.py, start pos: (35, 29), end pos: (35, 53)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -32,7 +32,7 @@
     def _side(self):
         """Return if left or right child of parent."""
         if self.parent:
-            return 'left' if self.parent.left == self else 'right'
+            return 'left' if not self.parent.left == self else 'right'
 class Bst(object):
ts-3-5/test_3-5_0-4_143.py ...F...........                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_node_side - AssertionError: assert 'r...
========================= 1 failed, 14 passed in 0.10s =========================

113 : Job ID 379e8be103104172b91a0e79e307ca77
test outcome: killed
bst2.py, start pos: (83, 11), end pos: (83, 15)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -80,7 +80,7 @@
         self._size = 0
         self.root = None
-        if data:
+        if not data:
             for i in data:
                 self.insert(i)
ts-3-5/test_3-5_0-4_143.py ....FFFFF.FFFFF                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_insert - assert 1 == 8
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_search - AttributeError: 'NoneTyp...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_size - assert 0 == 7
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 0 == 3
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_contains - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - assert [] == [5, 3, 2...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - assert [] == [2, 3, 4,...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - assert [] == [2, 4, ...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_breadth_first - assert [] == [5, ...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 0 == 6
========================= 10 failed, 5 passed in 0.11s =========================

114 : Job ID c9a692fd94ff425bae65031fbeaf0fcd
test outcome: killed
bst2.py, start pos: (89, 11), end pos: (89, 24)
operator: core/AddNot, occurrence: 5
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -86,7 +86,7 @@
     def insert(self, val):
         """Insert val into BST. If val is already present will be ignored."""
-        if not self.root:
+        if not not self.root:
             self.root = Node(val)
             self._size += 1
         else:
ts-3-5/test_3-5_0-4_143.py ....EEEEEEEEEEE                               [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_insert - AttributeError: 'NoneType...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_search - AttributeError: 'NoneType...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_size - AttributeError: 'NoneType' ...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_depth - AttributeError: 'NoneType'...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_contains - AttributeError: 'NoneTy...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_balance - AttributeError: 'NoneTyp...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - AttributeError: 'NoneT...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - AttributeError: 'NoneTy...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - AttributeError: 'None...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_breadth_first - AttributeError: 'N...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_delete - AttributeError:

115 : Job ID 16dbe2aa9b4a4e479df8ecbe6e6ed261
test outcome: killed
bst2.py, start pos: (97, 11), end pos: (97, 25)
operator: core/AddNot, occurrence: 6
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -94,7 +94,7 @@
     def _step(self, val, curr):
         """Decide left or right and returns height."""
-        if val < curr.val:
+        if not val < curr.val:
             curr = self._set_child(curr, 'left', val)
         elif val > curr.val:
             curr = self._set_child(curr, 'right', val)
ts-3-5/test_3-5_0-4_143.py ....FFF.FFFFFFF                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_insert - assert 4 == 8
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_search - AttributeError: 'NoneTyp...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_size - assert 3 == 7
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_contains - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - assert 2 == 0
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - assert [5, 7, 8] == [...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - assert [8, 7, 5] == [2...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - assert [8, 7, 5] == ...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_breadth_first - assert [5, 7, 8] ...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 3 == 6
========================= 10 failed, 5 passed in 0.11s =========================

116 : Job ID a0bcd0dc19e344899b360c650899e142
test outcome: killed
bst2.py, start pos: (106, 11), end pos: (106, 16)
operator: core/AddNot, occurrence: 7
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -103,7 +103,7 @@
     def _set_child(self, curr, side, val):
         """Helping."""
         child = getattr(curr, side)
-        if child:
+        if not child:
             count = self._step(val, child)
             if curr.height <= count:
                 curr.height += 1
ts-3-5/test_3-5_0-4_143.py ....EEEEEEEEEEE                               [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_insert - AttributeError: 'NoneType...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_search - AttributeError: 'NoneType...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_size - AttributeError: 'NoneType' ...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_depth - AttributeError: 'NoneType'...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_contains - AttributeError: 'NoneTy...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_balance - AttributeError: 'NoneTyp...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - AttributeError: 'NoneT...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - AttributeError: 'NoneTy...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - AttributeError: 'None...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_breadth_first - AttributeError: 'N...
ERROR ts-3-5/test_3-5_0-4_143.py::test_bst_d

117 : Job ID 736c6c9c1adc479a954161a04c461eea
test outcome: killed
bst2.py, start pos: (108, 15), end pos: (108, 35)
operator: core/AddNot, occurrence: 8
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -105,7 +105,7 @@
         child = getattr(curr, side)
         if child:
             count = self._step(val, child)
-            if curr.height <= count:
+            if not curr.height <= count:
                 curr.height += 1
         else:
             setattr(curr, side, Node(val, curr))
ts-3-5/test_3-5_0-4_143.py .......F.......                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 2 == 3
========================= 1 failed, 14 passed in 0.10s =========================

118 : Job ID c8a174c65b5a455ea85b6319cd775127
test outcome: killed
bst2.py, start pos: (113, 15), end pos: (113, 31)
operator: core/AddNot, occurrence: 9
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -110,7 +110,7 @@
         else:
             setattr(curr, side, Node(val, curr))
             self._size += 1
-            if curr.height == 1:
+            if not curr.height == 1:
                 curr.height += 1
         return curr
ts-3-5/test_3-5_0-4_143.py .......F.......                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 2 == 3
========================= 1 failed, 14 passed in 0.10s =========================

119 : Job ID 125f3d5c0fd54a62aa1d27510512cc68
test outcome: killed
bst2.py, start pos: (120, 14), end pos: (120, 18)
operator: core/AddNot, occurrence: 10
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -117,7 +117,7 @@
     def search(self, val):
         """Return the node containing val."""
         curr = self.root
-        while curr:
+        while not curr:
             if curr.val == val:
                 return curr
             elif val < curr.val:
ts-3-5/test_3-5_0-4_143.py .....F..F.....F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_search - AttributeError: 'NoneTyp...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_contains - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 7 == 6
========================= 3 failed, 12 passed in 0.10s =========================

120 : Job ID d4e8870716964ab1ae0173242f115325
test outcome: killed
bst2.py, start pos: (121, 15), end pos: (121, 30)
operator: core/AddNot, occurrence: 11
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -118,7 +118,7 @@
         """Return the node containing val."""
         curr = self.root
         while curr:
-            if curr.val == val:
+            if not curr.val == val:
                 return curr
             elif val < curr.val:
                 curr = curr.left
ts-3-5/test_3-5_0-4_143.py .....F........F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_search - assert 5 == 7
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - RecursionError: maximum ...
========================= 2 failed, 13 passed in 0.11s =========================

121 : Job ID 2789e191c6234adabe0a0ce98d8a5b54
test outcome: killed
bst2.py, start pos: (134, 20), end pos: (134, 33)
operator: core/AddNot, occurrence: 12
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -131,7 +131,7 @@
     def depth(self):
         """Return depth of the BST, representing total levels."""
-        return 0 if not self.root else self.root.height
+        return 0 if not not self.root else self.root.height
     def contains(self, val):
         """Return true if val is in the bst."""
ts-3-5/test_3-5_0-4_143.py .......F.......                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 0 == 3
========================= 1 failed, 14 passed in 0.10s =========================

122 : Job ID 2b33588d7506417c8819779cba80ce8a
test outcome: killed
bst2.py, start pos: (148, 11), end pos: (148, 19)
operator: core/AddNot, occurrence: 13
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -145,7 +145,7 @@
         should return a negative value. An ideally-balanced tree should
         return 0.
         """
-        if not tree:
+        if not not tree:
             tree = self.root
             if not tree:
                 return 0
ts-3-5/test_3-5_0-4_143.py .........F.....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - AttributeError: 'NoneTy...
========================= 1 failed, 14 passed in 0.10s =========================

123 : Job ID a14ff580784b4154b756a7a97792b45e
SURVIVED
test outcome: survived
bst2.py, start pos: (150, 15), end pos: (150, 23)
operator: core/AddNot, occurrence: 14
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -147,7 +147,7 @@
         """
         if not tree:
             tree = self.root
-            if not tree:
+            if not not tree:
                 return 0
         leftbranch = 0 if not tree.left else tree.left.height
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

124 : Job ID 3a2653367eff4f129decf6173fc27704
test outcome: killed
bst2.py, start pos: (153, 26), end pos: (153, 39)
operator: core/AddNot, occurrence: 15
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -150,7 +150,7 @@
             if not tree:
                 return 0
-        leftbranch = 0 if not tree.left else tree.left.height
+        leftbranch = 0 if not not tree.left else tree.left.height
         rightbranch = 0 if not tree.right else tree.right.height
         return leftbranch - rightbranch
ts-3-5/test_3-5_0-4_143.py .........F.....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - assert -2 == 0
========================= 1 failed, 14 passed in 0.10s =========================

125 : Job ID 6a0074f301e74fd3a3112823f3eaa599
test outcome: killed
bst2.py, start pos: (154, 27), end pos: (154, 41)
operator: core/AddNot, occurrence: 16
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -151,7 +151,7 @@
                 return 0
         leftbranch = 0 if not tree.left else tree.left.height
-        rightbranch = 0 if not tree.right else tree.right.height
+        rightbranch = 0 if not not tree.right else tree.right.height
         return leftbranch - rightbranch
ts-3-5/test_3-5_0-4_143.py .........F.....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_balance - assert 2 == 0
========================= 1 failed, 14 passed in 0.10s =========================

126 : Job ID 3873206e43f247f0a07ceb6c94ab00e0
test outcome: killed
bst2.py, start pos: (160, 11), end pos: (160, 25)
operator: core/AddNot, occurrence: 17
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -157,7 +157,7 @@
     def pre_order(self, node='root'):
         """Depth first pre-order traversal of tree."""
-        if node == 'root':
+        if not node == 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ..........F....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - AttributeError: 'str'...
========================= 1 failed, 14 passed in 0.10s =========================

127 : Job ID 46b7e3c8b7054f819acf1d5242767033
test outcome: killed
bst2.py, start pos: (163, 11), end pos: (163, 19)
operator: core/AddNot, occurrence: 18
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -160,7 +160,7 @@
         if node == 'root':
             node = self.root
-        if not node:
+        if not not node:
             return
         yield node.val
ts-3-5/test_3-5_0-4_143.py ..........F....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - assert [] == [5, 3, 2...
========================= 1 failed, 14 passed in 0.10s =========================

128 : Job ID cb2d5412e5cf4b1386bfd8c72d69dd2e
test outcome: killed
bst2.py, start pos: (175, 11), end pos: (175, 25)
operator: core/AddNot, occurrence: 19
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -172,7 +172,7 @@
     def in_order(self, node='root'):
         """Depth first in-order traversal of tree."""
-        if node == 'root':
+        if not node == 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ...........F...                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - AttributeError: 'str' ...
========================= 1 failed, 14 passed in 0.10s =========================

130 : Job ID 72cc05546bb2402f9830084c01b58359
test outcome: killed
bst2.py, start pos: (189, 11), end pos: (189, 25)
operator: core/AddNot, occurrence: 21
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -186,7 +186,7 @@
     def post_order(self, node='root'):
         """Depth frist post_order traversal of tree."""
-        if node == 'root':
+        if not node == 'root':
             node = self.root
         if not node:
ts-3-5/test_3-5_0-4_143.py ............F..                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - AttributeError: 'str...
========================= 1 failed, 14 passed in 0.10s =========================

132 : Job ID 508675a83f744d80b3a8ed89b8b6ac4d
test outcome: killed
bst2.py, start pos: (205, 14), end pos: (205, 22)
operator: core/AddNot, occurrence: 23
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -202,7 +202,7 @@
         """Breadth first traversal of tree."""
         q = Queue()
         q.enqueue(self.root)
-        while q.peek():
+        while not q.peek():
             node = q.dequeue()
             yield node.val
             if node.left:
ts-3-5/test_3-5_0-4_143.py .............F.                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_breadth_first - assert [] == [5, ...
========================= 1 failed, 14 passed in 0.10s =========================

133 : Job ID 6b497b9b32994f718609bdcfb8d997b4
test outcome: killed
bst2.py, start pos: (208, 15), end pos: (208, 24)
operator: core/AddNot, occurrence: 24
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -205,7 +205,7 @@
         while q.peek():
             node = q.dequeue()
             yield node.val
-            if node.left:
+            if not node.left:
                 q.enqueue(node.left)
             if node.right:
                 q.enqueue(node.right)
ts-3-5/test_3-5_0-4_143.py .............F.                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_breadth_first - assert [5, 7, 8] ...
========================= 1 failed, 14 passed in 0.10s =========================

134 : Job ID 05b247dc2e3e44ecbc2d5520527f0999
test outcome: killed
bst2.py, start pos: (210, 15), end pos: (210, 25)
operator: core/AddNot, occurrence: 25
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -207,7 +207,7 @@
             yield node.val
             if node.left:
                 q.enqueue(node.left)
-            if node.right:
+            if not node.right:
                 q.enqueue(node.right)
     def delete(self, val):
ts-3-5/test_3-5_0-4_143.py .............F.                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_breadth_first - assert [5, 3, 2] ...
========================= 1 failed, 14 passed in 0.10s =========================

135 : Job ID 502361d4bec949f3b13275153d441e2e
test outcome: killed
bst2.py, start pos: (215, 11), end pos: (215, 51)
operator: core/AddNot, occurrence: 26
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -212,7 +212,7 @@
     def delete(self, val):
         """Remove a node from the tree."""
-        if self._size < 1 or not self.contains(val):
+        if not self._size < 1 or not self.contains(val):
             return
         node = self.search(val)
ts-3-5/test_3-5_0-4_143.py ..............F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 7 == 6
========================= 1 failed, 14 passed in 0.10s =========================

136 : Job ID b76a56a0023e4c6a933738e338abfaac
SURVIVED
test outcome: survived
bst2.py, start pos: (220, 11), end pos: (220, 26)
operator: core/AddNot, occurrence: 27
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -217,7 +217,7 @@
         node = self.search(val)
-        if node._is_leaf():  # no children
+        if not node._is_leaf():  # no children
             if node.parent:
                 setattr(node.parent, node._side(), None)
             else:
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

137 : Job ID 54cf922badfd414f92b68e197ce7d826
SURVIVED
test outcome: survived
bst2.py, start pos: (221, 15), end pos: (221, 26)
operator: core/AddNot, occurrence: 28
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -218,7 +218,7 @@
         node = self.search(val)
         if node._is_leaf():  # no children
-            if node.parent:
+            if not node.parent:
                 setattr(node.parent, node._side(), None)
             else:
                 self.root = None
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

138 : Job ID bb49d56b4e804129a5a4312216592a2d
SURVIVED
test outcome: survived
bst2.py, start pos: (234, 15), end pos: (234, 26)
operator: core/AddNot, occurrence: 29
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -231,7 +231,7 @@
         else:  # one children
             child = getattr(node, node._onlychild())
-            if node.parent:
+            if not node.parent:
                 child.parent = node.parent
                 setattr(node.parent, node._side(), child)
             else:
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

139 : Job ID 6f2ae01dfaf84b388199fd2cc21d41ac
test outcome: killed
bst2.py, start pos: (244, 11), end pos: (244, 21)
operator: core/AddNot, occurrence: 30
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -241,7 +241,7 @@
     def _find_replacement(self, node):
         """Find left most node of right subtree."""
-        if node.right:
+        if not node.right:
             return self._findmin(node.right)
         else:
             if node.parent:
ts-3-5/test_3-5_0-4_143.py ..............F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - AttributeError: 'Bst' ob...
========================= 1 failed, 14 passed in 0.10s =========================
