140 : Job ID 352b582d68fc4b12bb1eadba9ca98c23
SURVIVED
test outcome: survived
bst2.py, start pos: (247, 15), end pos: (247, 26)
operator: core/AddNot, occurrence: 31
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -244,7 +244,7 @@
         if node.right:
             return self._findmin(node.right)
         else:
-            if node.parent:
+            if not node.parent:
                 if node._side() == 'left':
                     return self.parent
                 else:
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

141 : Job ID 6ec98d04db0c48a089e23e518eb5a188
SURVIVED
test outcome: survived
bst2.py, start pos: (248, 19), end pos: (248, 41)
operator: core/AddNot, occurrence: 32
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -245,7 +245,7 @@
             return self._findmin(node.right)
         else:
             if node.parent:
-                if node._side() == 'left':
+                if not node._side() == 'left':
                     return self.parent
                 else:
                     node.parent.right = None
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

142 : Job ID 0f942197c0f648f2abb559b17f7ee3b8
test outcome: killed
bst2.py, start pos: (258, 14), end pos: (258, 23)
operator: core/AddNot, occurrence: 33
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -255,7 +255,7 @@
     def _findmin(self, node):
         """Find min of subtree, Min is always left most node."""
-        while node.left:
+        while not node.left:
             node = node.left
         return node
ts-3-5/test_3-5_0-4_143.py ..............F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - AttributeError: 'NoneTyp...
========================= 1 failed, 14 passed in 0.11s =========================

143 : Job ID bc6cfce8a01046a6b7102b228c02e784
SURVIVED
test outcome: survived
bst2.py, start pos: (19, 35), end pos: (19, 38)
operator: core/ReplaceAndWithOr, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -16,7 +16,7 @@
     def _is_leaf(self):
         """Return true if a leaf."""
-        return (self.right is None and self.left is None)
+        return (self.right is None or self.left is None)
     def _is_interior(self):
         """Return true if a interior node."""
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

144 : Job ID 54066fa8b9374355bcf680b3b34ea03e
SURVIVED
test outcome: survived
bst2.py, start pos: (23, 40), end pos: (23, 43)
operator: core/ReplaceAndWithOr, occurrence: 1
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -20,7 +20,7 @@
     def _is_interior(self):
         """Return true if a interior node."""
-        return (self.right is not None) and (self.left is not None)
+        return (self.right is not None) or (self.left is not None)
     def _onlychild(self):
         """Return string depending on children."""
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

145 : Job ID eaf80960c9d34df0baaef703aa2de740
SURVIVED
test outcome: survived
bst2.py, start pos: (27, 21), end pos: (27, 24)
operator: core/ReplaceAndWithOr, occurrence: 2
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -24,7 +24,7 @@
     def _onlychild(self):
         """Return string depending on children."""
-        if self.left and not self.right:
+        if self.left or not self.right:
             return 'left'
         if self.right and not self.left:
             return 'right'
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

146 : Job ID bf7f2c04b8044cf28921073663b1e2ec
SURVIVED
test outcome: survived
bst2.py, start pos: (29, 22), end pos: (29, 25)
operator: core/ReplaceAndWithOr, occurrence: 3
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -26,7 +26,7 @@
         """Return string depending on children."""
         if self.left and not self.right:
             return 'left'
-        if self.right and not self.left:
+        if self.right or not self.left:
             return 'right'
     def _side(self):
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

147 : Job ID f929cbfa9aeb4f2ea763319636384974
SURVIVED
test outcome: survived
bst2.py, start pos: (215, 26), end pos: (215, 28)
operator: core/ReplaceOrWithAnd, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -212,7 +212,7 @@
     def delete(self, val):
         """Remove a node from the tree."""
-        if self._size < 1 or not self.contains(val):
+        if self._size < 1 and not self.contains(val):
             return
         node = self.search(val)
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

148 : Job ID 2f1a1bac19d545f9a390d2c475c4233b
SURVIVED
test outcome: survived
bst2.py, start pos: (15, 22), end pos: (15, 23)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -12,7 +12,7 @@
         self.right = None
         self.left = None
         self.parent = parent
-        self.height = 1
+        self.height = 2
     def _is_leaf(self):
         """Return true if a leaf."""
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

149 : Job ID 7a98ddf664f6497e80909cd2086ccac0
test outcome: killed
bst2.py, start pos: (15, 22), end pos: (15, 23)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -12,7 +12,7 @@
         self.right = None
         self.left = None
         self.parent = parent
-        self.height = 1
+        self.height = 0
     def _is_leaf(self):
         """Return true if a leaf."""
ts-3-5/test_3-5_0-4_143.py .......F.......                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 1 == 3
========================= 1 failed, 14 passed in 0.10s =========================

150 : Job ID f2442f8429dd441c99fd9dd26b8f3da6
test outcome: killed
bst2.py, start pos: (80, 21), end pos: (80, 22)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -77,7 +77,7 @@
     def __init__(self, data=None):
         """Initialize tree."""
-        self._size = 0
+        self._size = 1
         self.root = None
         if data:
ts-3-5/test_3-5_0-4_143.py ....F.F.......F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_insert - assert 9 == 8
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_size - assert 8 == 7
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 7 == 6
========================= 3 failed, 12 passed in 0.10s =========================

151 : Job ID 29a514d9dc7d46e5a0cbbc450b810854
test outcome: killed
bst2.py, start pos: (80, 21), end pos: (80, 22)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -77,7 +77,7 @@
     def __init__(self, data=None):
         """Initialize tree."""
-        self._size = 0
+        self._size = -1
         self.root = None
         if data:
ts-3-5/test_3-5_0-4_143.py ....F.F.......F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_insert - assert 7 == 8
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_size - assert 6 == 7
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 5 == 6
========================= 3 failed, 12 passed in 0.10s =========================

152 : Job ID 88871cafb96f4c4fb65b3737475f70d3
test outcome: killed
bst2.py, start pos: (91, 26), end pos: (91, 27)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -88,7 +88,7 @@
         """Insert val into BST. If val is already present will be ignored."""
         if not self.root:
             self.root = Node(val)
-            self._size += 1
+            self._size += 2
         else:
             self._step(val, self.root)
ts-3-5/test_3-5_0-4_143.py ....F.F.......F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_insert - assert 9 == 8
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_size - assert 8 == 7
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 7 == 6
========================= 3 failed, 12 passed in 0.10s =========================

153 : Job ID 63ae06ef09194c74a192b713429e225c
test outcome: killed
bst2.py, start pos: (91, 26), end pos: (91, 27)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -88,7 +88,7 @@
         """Insert val into BST. If val is already present will be ignored."""
         if not self.root:
             self.root = Node(val)
-            self._size += 1
+            self._size += 0
         else:
             self._step(val, self.root)
ts-3-5/test_3-5_0-4_143.py ....F.F.......F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_insert - assert 7 == 8
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_size - assert 6 == 7
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 5 == 6
========================= 3 failed, 12 passed in 0.10s =========================

154 : Job ID 26374793b38e42d99731b651447dfecf
test outcome: killed
bst2.py, start pos: (109, 31), end pos: (109, 32)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -106,7 +106,7 @@
         if child:
             count = self._step(val, child)
             if curr.height <= count:
-                curr.height += 1
+                curr.height += 2
         else:
             setattr(curr, side, Node(val, curr))
             self._size += 1
ts-3-5/test_3-5_0-4_143.py .......F.......                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 4 == 3
========================= 1 failed, 14 passed in 0.10s =========================

155 : Job ID 0beff48cb1614d7784ae87ba78024701
test outcome: killed
bst2.py, start pos: (109, 31), end pos: (109, 32)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -106,7 +106,7 @@
         if child:
             count = self._step(val, child)
             if curr.height <= count:
-                curr.height += 1
+                curr.height += 0
         else:
             setattr(curr, side, Node(val, curr))
             self._size += 1
ts-3-5/test_3-5_0-4_143.py .......F.......                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 2 == 3
========================= 1 failed, 14 passed in 0.10s =========================

156 : Job ID 75acf5f838454592b5deb6a6d9fe1ad6
test outcome: killed
bst2.py, start pos: (112, 26), end pos: (112, 27)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -109,7 +109,7 @@
                 curr.height += 1
         else:
             setattr(curr, side, Node(val, curr))
-            self._size += 1
+            self._size += 2
             if curr.height == 1:
                 curr.height += 1
         return curr
ts-3-5/test_3-5_0-4_143.py ....F.F.......F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_insert - assert 15 == 8
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_size - assert 13 == 7
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 12 == 6
========================= 3 failed, 12 passed in 0.10s =========================

157 : Job ID 4d00d344e63d4adda86e1a394391f2fd
test outcome: killed
bst2.py, start pos: (112, 26), end pos: (112, 27)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -109,7 +109,7 @@
                 curr.height += 1
         else:
             setattr(curr, side, Node(val, curr))
-            self._size += 1
+            self._size += 0
             if curr.height == 1:
                 curr.height += 1
         return curr
ts-3-5/test_3-5_0-4_143.py ....F.F.......F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_insert - assert 1 == 8
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_size - assert 1 == 7
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 0 == 6
========================= 3 failed, 12 passed in 0.10s =========================

158 : Job ID 8bd37305348e48d29acb1078ab231f0a
test outcome: killed
bst2.py, start pos: (113, 30), end pos: (113, 31)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -110,7 +110,7 @@
         else:
             setattr(curr, side, Node(val, curr))
             self._size += 1
-            if curr.height == 1:
+            if curr.height == 2:
                 curr.height += 1
         return curr
ts-3-5/test_3-5_0-4_143.py .......F.......                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 2 == 3
========================= 1 failed, 14 passed in 0.10s =========================

159 : Job ID 4ca06c796a4f4d3d89219164587d60cb
test outcome: killed
bst2.py, start pos: (113, 30), end pos: (113, 31)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -110,7 +110,7 @@
         else:
             setattr(curr, side, Node(val, curr))
             self._size += 1
-            if curr.height == 1:
+            if curr.height == 0:
                 curr.height += 1
         return curr
ts-3-5/test_3-5_0-4_143.py .......F.......                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 2 == 3
========================= 1 failed, 14 passed in 0.11s =========================

160 : Job ID 88a6bb4f0582481db0f65d50be30484d
test outcome: killed
bst2.py, start pos: (114, 31), end pos: (114, 32)
operator: core/NumberReplacer, occurrence: 12
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -111,7 +111,7 @@
             setattr(curr, side, Node(val, curr))
             self._size += 1
             if curr.height == 1:
-                curr.height += 1
+                curr.height += 2
         return curr
     def search(self, val):
ts-3-5/test_3-5_0-4_143.py .......F.......                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 4 == 3
========================= 1 failed, 14 passed in 0.12s =========================

161 : Job ID b4464061ae1e40d1ad5acec5bb92b38a
test outcome: killed
bst2.py, start pos: (114, 31), end pos: (114, 32)
operator: core/NumberReplacer, occurrence: 13
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -111,7 +111,7 @@
             setattr(curr, side, Node(val, curr))
             self._size += 1
             if curr.height == 1:
-                curr.height += 1
+                curr.height += 0
         return curr
     def search(self, val):
ts-3-5/test_3-5_0-4_143.py .......F.......                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 2 == 3
========================= 1 failed, 14 passed in 0.10s =========================

162 : Job ID 7de7b4551b7c4932a36f422b24f62330
SURVIVED
test outcome: survived
bst2.py, start pos: (134, 15), end pos: (134, 16)
operator: core/NumberReplacer, occurrence: 14
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -131,7 +131,7 @@
     def depth(self):
         """Return depth of the BST, representing total levels."""
-        return 0 if not self.root else self.root.height
+        return 1 if not self.root else self.root.height
     def contains(self, val):
         """Return true if val is in the bst."""
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

163 : Job ID 1862ee271ccf4342b39900322c922036
SURVIVED
test outcome: survived
bst2.py, start pos: (134, 15), end pos: (134, 16)
operator: core/NumberReplacer, occurrence: 15
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -131,7 +131,7 @@
     def depth(self):
         """Return depth of the BST, representing total levels."""
-        return 0 if not self.root else self.root.height
+        return -1 if not self.root else self.root.height
     def contains(self, val):
         """Return true if val is in the bst."""
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

164 : Job ID 17174dfad54c4d04a95348452b40119f
SURVIVED
test outcome: survived
bst2.py, start pos: (151, 23), end pos: (151, 24)
operator: core/NumberReplacer, occurrence: 16
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -148,7 +148,7 @@
         if not tree:
             tree = self.root
             if not tree:
-                return 0
+                return 1
         leftbranch = 0 if not tree.left else tree.left.height
         rightbranch = 0 if not tree.right else tree.right.height
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

165 : Job ID 0286a9b68d5b471492ac1ae9223788f6
SURVIVED
test outcome: survived
bst2.py, start pos: (151, 23), end pos: (151, 24)
operator: core/NumberReplacer, occurrence: 17
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -148,7 +148,7 @@
         if not tree:
             tree = self.root
             if not tree:
-                return 0
+                return -1
         leftbranch = 0 if not tree.left else tree.left.height
         rightbranch = 0 if not tree.right else tree.right.height
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.09s ==============================

166 : Job ID a754b76ffa0c4cafa5bbc9643eb7bef3
SURVIVED
test outcome: survived
bst2.py, start pos: (153, 21), end pos: (153, 22)
operator: core/NumberReplacer, occurrence: 18
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -150,7 +150,7 @@
             if not tree:
                 return 0
-        leftbranch = 0 if not tree.left else tree.left.height
+        leftbranch = 1 if not tree.left else tree.left.height
         rightbranch = 0 if not tree.right else tree.right.height
         return leftbranch - rightbranch
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

167 : Job ID 09ba05271e734cd38da34696a6ea5ad9
SURVIVED
test outcome: survived
bst2.py, start pos: (153, 21), end pos: (153, 22)
operator: core/NumberReplacer, occurrence: 19
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -150,7 +150,7 @@
             if not tree:
                 return 0
-        leftbranch = 0 if not tree.left else tree.left.height
+        leftbranch = -1 if not tree.left else tree.left.height
         rightbranch = 0 if not tree.right else tree.right.height
         return leftbranch - rightbranch
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

168 : Job ID 8542040dc2774ab0b0d86e21e4531dd6
SURVIVED
test outcome: survived
bst2.py, start pos: (154, 22), end pos: (154, 23)
operator: core/NumberReplacer, occurrence: 20
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -151,7 +151,7 @@
                 return 0
         leftbranch = 0 if not tree.left else tree.left.height
-        rightbranch = 0 if not tree.right else tree.right.height
+        rightbranch = 1 if not tree.right else tree.right.height
         return leftbranch - rightbranch
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

169 : Job ID c9fe06b198bb4ce6aff0cedab0360649
SURVIVED
test outcome: survived
bst2.py, start pos: (154, 22), end pos: (154, 23)
operator: core/NumberReplacer, occurrence: 21
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -151,7 +151,7 @@
                 return 0
         leftbranch = 0 if not tree.left else tree.left.height
-        rightbranch = 0 if not tree.right else tree.right.height
+        rightbranch = -1 if not tree.right else tree.right.height
         return leftbranch - rightbranch
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

170 : Job ID fb01a05cdaba4a10aa60d49c1ec5bdef
SURVIVED
test outcome: survived
bst2.py, start pos: (215, 24), end pos: (215, 25)
operator: core/NumberReplacer, occurrence: 22
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -212,7 +212,7 @@
     def delete(self, val):
         """Remove a node from the tree."""
-        if self._size < 1 or not self.contains(val):
+        if self._size < 2 or not self.contains(val):
             return
         node = self.search(val)
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

171 : Job ID cc0c32358c474631af7b2ff492da9e21
SURVIVED
test outcome: survived
bst2.py, start pos: (215, 24), end pos: (215, 25)
operator: core/NumberReplacer, occurrence: 23
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -212,7 +212,7 @@
     def delete(self, val):
         """Remove a node from the tree."""
-        if self._size < 1 or not self.contains(val):
+        if self._size < 0 or not self.contains(val):
             return
         node = self.search(val)
ts-3-5/test_3-5_0-4_143.py ...............                               [100%]
============================== 15 passed in 0.10s ==============================

172 : Job ID ae4b0cf8c33a4af7a67c36b24f23482e
test outcome: killed
bst2.py, start pos: (228, 26), end pos: (228, 27)
operator: core/NumberReplacer, occurrence: 24
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -225,7 +225,7 @@
         elif node._is_interior():  # two children
             next_node = self._find_replacement(node)
-            self._size += 1
+            self._size += 2
             self.delete(next_node.val)
             node.val = next_node.val
ts-3-5/test_3-5_0-4_143.py ..............F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 7 == 6
========================= 1 failed, 14 passed in 0.10s =========================

173 : Job ID 5ad6c33153334241a84c0c656bf6a17b
test outcome: killed
bst2.py, start pos: (228, 26), end pos: (228, 27)
operator: core/NumberReplacer, occurrence: 25
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -225,7 +225,7 @@
         elif node._is_interior():  # two children
             next_node = self._find_replacement(node)
-            self._size += 1
+            self._size += 0
             self.delete(next_node.val)
             node.val = next_node.val
ts-3-5/test_3-5_0-4_143.py ..............F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 5 == 6
========================= 1 failed, 14 passed in 0.11s =========================

174 : Job ID 67c4d10f70144a8b9ecd17816ddd1d04
test outcome: killed
bst2.py, start pos: (240, 22), end pos: (240, 23)
operator: core/NumberReplacer, occurrence: 26
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -237,7 +237,7 @@
             else:
                 self.root = child
-        self._size -= 1
+        self._size -= 2
     def _find_replacement(self, node):
         """Find left most node of right subtree."""
ts-3-5/test_3-5_0-4_143.py ..............F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 4 == 6
========================= 1 failed, 14 passed in 0.10s =========================

175 : Job ID 3986183142254dcf9dfc1373ee6e7eab
test outcome: killed
bst2.py, start pos: (240, 22), end pos: (240, 23)
operator: core/NumberReplacer, occurrence: 27
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -237,7 +237,7 @@
             else:
                 self.root = child
-        self._size -= 1
+        self._size -= 0
     def _find_replacement(self, node):
         """Find left most node of right subtree."""
ts-3-5/test_3-5_0-4_143.py ..............F                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 8 == 6
========================= 1 failed, 14 passed in 0.10s =========================

176 : Job ID fd2df101ed664d7bb022eac948329168
test outcome: killed
bst2.py, start pos: (84, 21), end pos: (84, 25)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -81,7 +81,7 @@
         self.root = None
         if data:
-            for i in data:
+            for i in []:
                 self.insert(i)
     def insert(self, val):
ts-3-5/test_3-5_0-4_143.py ....FFFFF.FFFFF                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_insert - assert 1 == 8
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_search - AttributeError: 'NoneTyp...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_size - assert 0 == 7
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_depth - assert 0 == 3
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_contains - assert False == True
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - assert [] == [5, 3, 2...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - assert [] == [2, 3, 4,...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - assert [] == [2, 4, ...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_breadth_first - assert [] == [5, ...
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_delete - assert 0 == 6
========================= 10 failed, 5 passed in 0.11s =========================

177 : Job ID e8a01c995fd44eaf9bf366dde6d2e6b0
test outcome: killed
bst2.py, start pos: (168, 17), end pos: (168, 47)
operator: core/ZeroIterationForLoop, occurrence: 1
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -165,7 +165,7 @@
         yield node.val
-        for n in self.pre_order(node=node.left):
+        for n in []:
             yield n
         for n in self.pre_order(node=node.right):
             yield n
ts-3-5/test_3-5_0-4_143.py ..........F....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - assert [5, 7, 8] == [...
========================= 1 failed, 14 passed in 0.10s =========================

178 : Job ID c3237dec84d44d59abbec11b2aba4294
test outcome: killed
bst2.py, start pos: (170, 17), end pos: (170, 48)
operator: core/ZeroIterationForLoop, occurrence: 2
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -167,7 +167,7 @@
         for n in self.pre_order(node=node.left):
             yield n
-        for n in self.pre_order(node=node.right):
+        for n in []:
             yield n
     def in_order(self, node='root'):
ts-3-5/test_3-5_0-4_143.py ..........F....                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_pre_order - assert [5, 3, 2] == [...
========================= 1 failed, 14 passed in 0.10s =========================
