179 : Job ID d1405d7befdd4d80b5ee8983eb8670ee
test outcome: killed
bst2.py, start pos: (181, 17), end pos: (181, 46)
operator: core/ZeroIterationForLoop, occurrence: 3
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -178,7 +178,7 @@
         if not node:
             return
-        for n in self.in_order(node=node.left):
+        for n in []:
             yield n
         yield node.val
         for n in self.in_order(node=node.right):
ts-3-5/test_3-5_0-4_143.py ...........F...                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - assert [5, 7, 8] == [2...
========================= 1 failed, 14 passed in 0.10s =========================

180 : Job ID d00848f2c299463fb7924bb0385acc6c
test outcome: killed
bst2.py, start pos: (184, 17), end pos: (184, 47)
operator: core/ZeroIterationForLoop, occurrence: 4
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -181,7 +181,7 @@
         for n in self.in_order(node=node.left):
             yield n
         yield node.val
-        for n in self.in_order(node=node.right):
+        for n in []:
             yield n
     def post_order(self, node='root'):
ts-3-5/test_3-5_0-4_143.py ...........F...                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_in_order - assert [2, 3, 5] == [2...
========================= 1 failed, 14 passed in 0.10s =========================

181 : Job ID 9d58168dc857498ead71cb08fba95406
test outcome: killed
bst2.py, start pos: (195, 17), end pos: (195, 48)
operator: core/ZeroIterationForLoop, occurrence: 5
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -192,7 +192,7 @@
         if not node:
             return
-        for n in self.post_order(node=node.left):
+        for n in []:
             yield n
         for n in self.post_order(node=node.right):
             yield n
ts-3-5/test_3-5_0-4_143.py ............F..                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - assert [8, 7, 5] == ...
========================= 1 failed, 14 passed in 0.10s =========================

182 : Job ID 2719ba01e1e24bacaeefbea62dab7c4a
test outcome: killed
bst2.py, start pos: (197, 17), end pos: (197, 49)
operator: core/ZeroIterationForLoop, occurrence: 6
--- mutation diff ---
--- abst2.py
+++ bbst2.py
@@ -194,7 +194,7 @@
         for n in self.post_order(node=node.left):
             yield n
-        for n in self.post_order(node=node.right):
+        for n in []:
             yield n
         yield node.val
ts-3-5/test_3-5_0-4_143.py ............F..                               [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_143.py::test_bst_post_order - assert [2, 3, 5] == ...
========================= 1 failed, 14 passed in 0.10s =========================
