   - [# 115] SDI bst2: 
--------------------------------------------------------------------------------
   17:     def _is_leaf(self):
   18:         '''Return true if a leaf.'''
   19:         return (self.right is None and self.left is None)
   20:     
-  21:     def _is_interior(self):
-  22:         '''Return true if a interior node.'''
-  23:         return (self.right is not None and self.left is not None)
-  24:     
+  21:     @staticmethod
+  22:     def _is_interior(self):
+  23:         '''Return true if a interior node.'''
+  24:         return (self.right is not None and self.left is not None)
   25:     def _onlychild(self):
   26:         '''Return string depending on children.'''
   27:         if (self.left and not (self.right)):
   28:             return 'left'
--------------------------------------------------------------------------------
[0.12520 s] survived
