   - [# 114] SDI bst2: 
--------------------------------------------------------------------------------
   13:         self.left = None
   14:         self.parent = parent
   15:         self.height = 1
   16:     
-  17:     def _is_leaf(self):
-  18:         '''Return true if a leaf.'''
-  19:         return (self.right is None and self.left is None)
-  20:     
+  17:     @staticmethod
+  18:     def _is_leaf(self):
+  19:         '''Return true if a leaf.'''
+  20:         return (self.right is None and self.left is None)
   21:     def _is_interior(self):
   22:         '''Return true if a interior node.'''
   23:         return (self.right is not None and self.left is not None)
   24:     
--------------------------------------------------------------------------------
[0.11817 s] survived
