   - [#   9] CDI bst2: 
--------------------------------------------------------------------------------
   13:         self.left = None
   14:         self.parent = parent
   15:         self.height = 1
   16:     
-  17:     def _is_leaf(self):
-  18:         '''Return true if a leaf.'''
-  19:         return (self.right is None and self.left is None)
-  20:     
+  17:     @classmethod
+  18:     def _is_leaf(self):
+  19:         '''Return true if a leaf.'''
+  20:         return (self.right is None and self.left is None)
   21:     def _is_interior(self):
   22:         '''Return true if a interior node.'''
   23:         return (self.right is not None and self.left is not None)
   24:     
--------------------------------------------------------------------------------
[0.15173 s] killed by ts-3-5/test_3-5_0-7_223.py::test_node_is_leaf

def test_node_is_leaf():
        node = Node(5)
>       assert node._is_leaf() is True

ts-3-5/test_3-5_0-7_223.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'bst2.Node'>

>   ???
E   AttributeError: type object 'Node' has no attribute 'right'

bst2:20: AttributeError

   - [#  10] CDI bst2: 
--------------------------------------------------------------------------------
   17:     def _is_leaf(self):
   18:         '''Return true if a leaf.'''
   19:         return (self.right is None and self.left is None)
   20:     
-  21:     def _is_interior(self):
-  22:         '''Return true if a interior node.'''
-  23:         return (self.right is not None and self.left is not None)
-  24:     
+  21:     @classmethod
+  22:     def _is_interior(self):
+  23:         '''Return true if a interior node.'''
+  24:         return (self.right is not None and self.left is not None)
   25:     def _onlychild(self):
   26:         '''Return string depending on children.'''
   27:         if (self.left and not (self.right)):
   28:             return 'left'
--------------------------------------------------------------------------------
[0.15546 s] killed by ts-3-5/test_3-5_0-7_223.py::test_node_is_interior

def test_node_is_interior():
        node = Node(5)
        node.left = Node(3)
        node.right = Node(7)
>       assert node._is_interior() is True

ts-3-5/test_3-5_0-7_223.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'bst2.Node'>

>   ???
E   AttributeError: type object 'Node' has no attribute 'right'

bst2:24: AttributeError

   - [#  21] CDI bst2: 
--------------------------------------------------------------------------------
  136:     def contains(self, val):
  137:         '''Return true if val is in the bst.'''
  138:         return self.search(val) is not None
  139:     
- 140:     def balance(self, tree=None):
- 141:         '''Return an integer of how well the tree is balanced.
- 142: 
- 143:         Trees which are higher on the left than the right should return a
- 144:         positive value, trees which are higher on the right than the left
- 145:         should return a negative value. An ideally-balanced tree should
- 146:         return 0.
- 147:         '''
- 148:         if not tree:
- 149:             tree = self.root
- 150:             if not tree:
- 151:                 return 0
- 152:         
- 153:         leftbranch = 0 if not (tree.left) else tree.left.height
- 154:         rightbranch = 0 if not (tree.right) else tree.right.height
- 155:         
- 156:         return leftbranch - rightbranch
- 157:     
+ 140:     @classmethod
+ 141:     def balance(self, tree=None):
+ 142:         '''Return an integer of how well the tree is balanced.
+ 143: 
+ 144:         Trees which are higher on the left than the right should return a
+ 145:         positive value, trees which are higher on the right than the left
+ 146:         should return a negative value. An ideally-balanced tree should
+ 147:         return 0.
+ 148:         '''
+ 149:         if not tree:
+ 150:             tree = self.root
+ 151:             if not tree:
+ 152:                 return 0
+ 153:         
+ 154:         leftbranch = 0 if not (tree.left) else tree.left.height
+ 155:         rightbranch = 0 if not (tree.right) else tree.right.height
+ 156:         
+ 157:         return leftbranch - right

   - [#  43] COI bst2: 
--------------------------------------------------------------------------------
   30:             return 'right'
   31:     
   32:     def _side(self):
   33:         '''Return if left or right child of parent.'''
-  34:         if self.parent:
+  34:         if not (self.parent):
   35:             return 'left' if self.parent.left == self else 'right'
   36: 
   37: 
   38: class Bst(object):
--------------------------------------------------------------------------------
[0.14583 s] killed by ts-3-5/test_3-5_0-7_223.py::test_node_side

def test_node_side():
        parent = Node(5)
        child = Node(3, parent)
        parent.left = child
>       assert child._side() == 'left'
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:34: AssertionError

   - [#  44] COI bst2: 
--------------------------------------------------------------------------------
   79:         '''Initialize tree.'''
   80:         self._size = 0
   81:         self.root = None
   82:         
-  83:         if data:
+  83:         if not data:
   84:             for i in data:
   85:                 self.insert(i)
   86:     
   87:     def insert(self, val):
--------------------------------------------------------------------------------
[0.14341 s] killed by ts-3-5/test_3-5_0-7_223.py::test_bst_insert

sample_bst = <bst2.Bst object at 0x728f626a6830>

    def test_bst_insert(sample_bst):
        sample_bst.insert(9)
>       assert sample_bst.size() == 8
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:38: AssertionError

   - [#  52] COI bst2: 
--------------------------------------------------------------------------------
  117:     def search(self, val):
  118:         '''Return the node containing val.'''
  119:         curr = self.root
  120:         while curr:
- 121:             if curr.val == val:
+ 121:             if not (curr.val == val):
  122:                 return curr
  123:             elif val < curr.val:
  124:                 curr = curr.left
  125:             else:
--------------------------------------------------------------------------------
[0.14549 s] killed by ts-3-5/test_3-5_0-7_223.py::test_bst_search

sample_bst = <bst2.Bst object at 0x728f622ca8f0>

    def test_bst_search(sample_bst):
>       assert sample_bst.search(4).val == 4
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:41: AssertionError

   - [#  66] COI bst2: 
--------------------------------------------------------------------------------
  216:             return
  217:         
  218:         node = self.search(val)
  219:         
- 220:         if node._is_leaf():
+ 220:         if not (node._is_leaf()):
  221:             if node.parent:
  222:                 setattr(node.parent, node._side(), None)
  223:             else:
  224:                 self.root = None
--------------------------------------------------------------------------------
[0.12145 s] survived

   - [#  67] COI bst2: 
--------------------------------------------------------------------------------
  217:         
  218:         node = self.search(val)
  219:         
  220:         if node._is_leaf():
- 221:             if node.parent:
+ 221:             if not (node.parent):
  222:                 setattr(node.parent, node._side(), None)
  223:             else:
  224:                 self.root = None
  225:         
--------------------------------------------------------------------------------
[0.15672 s] survived

   - [#  74] LCR bst2: 
--------------------------------------------------------------------------------
   15:         self.height = 1
   16:     
   17:     def _is_leaf(self):
   18:         '''Return true if a leaf.'''
-  19:         return (self.right is None and self.left is None)
+  19:         return (self.right is None or self.left is None)
   20:     
   21:     def _is_interior(self):
   22:         '''Return true if a interior node.'''
   23:         return (self.right is not None and self.left is not None)
--------------------------------------------------------------------------------
[0.12433 s] survived

   - [#  75] LCR bst2: 
--------------------------------------------------------------------------------
   19:         return (self.right is None and self.left is None)
   20:     
   21:     def _is_interior(self):
   22:         '''Return true if a interior node.'''
-  23:         return (self.right is not None and self.left is not None)
+  23:         return (self.right is not None or self.left is not None)
   24:     
   25:     def _onlychild(self):
   26:         '''Return string depending on children.'''
   27:         if (self.left and not (self.right)):
--------------------------------------------------------------------------------
[0.12741 s] survived

   - [# 118] SDI bst2: 
--------------------------------------------------------------------------------
   74:     using breadth frist traversal, one at a time.
   75: 
   76:     '''
   77:     
-  78:     def __init__(self, data=None):
-  79:         '''Initialize tree.'''
-  80:         self._size = 0
-  81:         self.root = None
-  82:         
-  83:         if data:
-  84:             for i in data:
-  85:                 self.insert(i)
-  86:     
+  78:     @staticmethod
+  79:     def __init__(self, data=None):
+  80:         '''Initialize tree.'''
+  81:         self._size = 0
+  82:         self.root = None
+  83:         
+  84:         if data:
+  85:             for i in data:
+  86:                 self.insert(i)
   87:     def insert(self, val):
   88:         '''Insert val into BST. If val is already present will be ignored.'''
   89:         if not (self.root):
   90:             self.root = Node(val)
--------------------------------------------------------------------------------
[0.14532 s] killed by ts-3-5/test_3-5_0-7_223.py::test_bst_insert

@pytest.fixture
    def sample_bst():
>       return Bst([5, 3, 7, 2, 4, 6, 8])

ts-3-5/test_3-5_0-7_223.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = [5, 3, 7, 2, 4, 6, ...], data = None

>   ???
E   AttributeError: 'list' object has no attribute '_size'

bst2:81: AttributeError

   - [# 139] SDL bst2: 
--------------------------------------------------------------------------------
   15:         self.height = 1
   16:     
   17:     def _is_leaf(self):
   18:         '''Return true if a leaf.'''
-  19:         return (self.right is None and self.left is None)
+  19:         pass
   20:     
   21:     def _is_interior(self):
   22:         '''Return true if a interior node.'''
   23:         return (self.right is not None and self.left is not None)
--------------------------------------------------------------------------------
[0.14203 s] killed by ts-3-5/test_3-5_0-7_223.py::test_node_is_leaf

def test_node_is_leaf():
        node = Node(5)
>       assert node._is_leaf() is True
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:17: AssertionError

   - [# 140] SDL bst2: 
--------------------------------------------------------------------------------
   19:         return (self.right is None and self.left is None)
   20:     
   21:     def _is_interior(self):
   22:         '''Return true if a interior node.'''
-  23:         return (self.right is not None and self.left is not None)
+  23:         pass
   24:     
   25:     def _onlychild(self):
   26:         '''Return string depending on children.'''
   27:         if (self.left and not (self.right)):
--------------------------------------------------------------------------------
[0.14396 s] killed by ts-3-5/test_3-5_0-7_223.py::test_node_is_interior

def test_node_is_interior():
        node = Node(5)
        node.left = Node(3)
        node.right = Node(7)
>       assert node._is_interior() is True
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:23: AssertionError

   - [# 143] SDL bst2: 
--------------------------------------------------------------------------------
   31:     
   32:     def _side(self):
   33:         '''Return if left or right child of parent.'''
   34:         if self.parent:
-  35:             return 'left' if self.parent.left == self else 'right'
+  35:             pass
   36: 
   37: 
   38: class Bst(object):
   39:     '''Binary Search Tree.
--------------------------------------------------------------------------------
[0.14334 s] killed by ts-3-5/test_3-5_0-7_223.py::test_node_side

def test_node_side():
        parent = Node(5)
        child = Node(3, parent)
        parent.left = child
>       assert child._side() == 'left'
E       AssertionError

ts-3-5/test_3-5_0-7_223.py:34: AssertionError

   - [# 213] SVD bst2: 
--------------------------------------------------------------------------------
   15:         self.height = 1
   16:     
   17:     def _is_leaf(self):
   18:         '''Return true if a leaf.'''
-  19:         return (self.right is None and self.left is None)
+  19:         return (right is None and self.left is None)
   20:     
   21:     def _is_interior(self):
   22:         '''Return true if a interior node.'''
   23:         return (self.right is not None and self.left is not None)
--------------------------------------------------------------------------------
[0.15888 s] killed by ts-3-5/test_3-5_0-7_223.py::test_node_is_leaf

def test_node_is_leaf():
        node = Node(5)
>       assert node._is_leaf() is True

ts-3-5/test_3-5_0-7_223.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <bst2.Node object at 0x728f62661a50>

>   ???
E   NameError: name 'right' is not defined

bst2:19: NameError

   - [# 214] SVD bst2: 
--------------------------------------------------------------------------------
   15:         self.height = 1
   16:     
   17:     def _is_leaf(self):
   18:         '''Return true if a leaf.'''
-  19:         return (self.right is None and self.left is None)
+  19:         return (self.right is None and left is None)
   20:     
   21:     def _is_interior(self):
   22:         '''Return true if a interior node.'''
   23:         return (self.right is not None and self.left is not None)
--------------------------------------------------------------------------------
[0.13556 s] killed by ts-3-5/test_3-5_0-7_223.py::test_node_is_leaf

def test_node_is_leaf():
        node = Node(5)
>       assert node._is_leaf() is True

ts-3-5/test_3-5_0-7_223.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <bst2.Node object at 0x728f62440190>

>   ???
E   NameError: name 'left' is not defined

bst2:19: NameError

   - [# 215] SVD bst2: 
--------------------------------------------------------------------------------
   19:         return (self.right is None and self.left is None)
   20:     
   21:     def _is_interior(self):
   22:         '''Return true if a interior node.'''
-  23:         return (self.right is not None and self.left is not None)
+  23:         return (right is not None and self.left is not None)
   24:     
   25:     def _onlychild(self):
   26:         '''Return string depending on children.'''
   27:         if (self.left and not (self.right)):
--------------------------------------------------------------------------------
[0.15534 s] killed by ts-3-5/test_3-5_0-7_223.py::test_node_is_interior

def test_node_is_interior():
        node = Node(5)
        node.left = Node(3)
        node.right = Node(7)
>       assert node._is_interior() is True

ts-3-5/test_3-5_0-7_223.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <bst2.Node object at 0x728f624d7d60>

>   ???
E   NameError: name 'right' is not defined

bst2:23: NameError

   - [# 216] SVD bst2: 
--------------------------------------------------------------------------------
   19:         return (self.right is None and self.left is None)
   20:     
   21:     def _is_interior(self):
   22:         '''Return true if a interior node.'''
-  23:         return (self.right is not None and self.left is not None)
+  23:         return (self.right is not None and left is not None)
   24:     
   25:     def _onlychild(self):
   26:         '''Return string depending on children.'''
   27:         if (self.left and not (self.right)):
--------------------------------------------------------------------------------
[0.17079 s] killed by ts-3-5/test_3-5_0-7_223.py::test_node_is_interior

def test_node_is_interior():
        node = Node(5)
        node.left = Node(3)
        node.right = Node(7)
>       assert node._is_interior() is True

ts-3-5/test_3-5_0-7_223.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <bst2.Node object at 0x728f6288ebc0>

>   ???
E   NameError: name 'left' is not defined

bst2:23: NameError
