   - [# 131] SDI bst2: 
--------------------------------------------------------------------------------
  209:                 q.enqueue(node.left)
  210:             if node.right:
  211:                 q.enqueue(node.right)
  212:     
- 213:     def delete(self, val):
- 214:         '''Remove a node from the tree.'''
- 215:         if (self._size < 1 or not (self.contains(val))):
- 216:             return
- 217:         
- 218:         node = self.search(val)
- 219:         
- 220:         if node._is_leaf():
- 221:             if node.parent:
- 222:                 setattr(node.parent, node._side(), None)
- 223:             else:
- 224:                 self.root = None
- 225:         
- 226:         elif node._is_interior():
- 227:             next_node = self._find_replacement(node)
- 228:             self._size += 1
- 229:             self.delete(next_node.val)
- 230:             node.val = next_node.val
- 231:         else:
- 232:             
- 233:             child = getattr(node, node._onlychild())
- 234:             if node.parent:
- 235:                 child.parent = node.parent
- 236:                 setattr(node.parent, node._side(), child)
- 237:             else:
- 238:                 self.root = child
- 239:         
- 240:         self._size -= 1
- 241:     
+ 213:     @staticmethod
+ 214:     def delete(self, val):
+ 215:         '''Remove a node from the tree.'''
+ 216:         if (self._size < 1 or not (self.contains(val))):
+ 217:             return
+ 218:         
+ 219:         node = self.search(val)
+ 220:         
+ 221:         if node._is_leaf():
+ 222:             if node.parent:
