   - [#  94] RIL bst2: 
--------------------------------------------------------------------------------
  191:         
  192:         if not node:
  193:             return
  194:         
- 195:         for n in self.post_order(node=node.left):
+ 195:         for n in reversed(self.post_order(node=node.left)):
  196:             yield n
  197:         for n in self.post_order(node=node.right):
  198:             yield n
  199:         yield node.val
--------------------------------------------------------------------------------
[0.12761 s] survived

   - [#  95] RIL bst2: 
--------------------------------------------------------------------------------
  193:             return
  194:         
  195:         for n in self.post_order(node=node.left):
  196:             yield n
- 197:         for n in self.post_order(node=node.right):
+ 197:         for n in reversed(self.post_order(node=node.right)):
  198:             yield n
  199:         yield node.val
  200:     
  201:     def breadth_first(self):
--------------------------------------------------------------------------------
[0.13097 s] survived

   - [# 127] SDI bst2: 
--------------------------------------------------------------------------------
  154:         rightbranch = 0 if not (tree.right) else tree.right.height
  155:         
  156:         return leftbranch - rightbranch
  157:     
- 158:     def pre_order(self, node='root'):
- 159:         '''Depth first pre-order traversal of tree.'''
- 160:         if node == 'root':
- 161:             node = self.root
- 162:         
- 163:         if not node:
- 164:             return
- 165:         
- 166:         yield node.val
- 167:         
- 168:         for n in self.pre_order(node=node.left):
- 169:             yield n
- 170:         for n in self.pre_order(node=node.right):
- 171:             yield n
- 172:     
+ 158:     @staticmethod
+ 159:     def pre_order(self, node='root'):
+ 160:         '''Depth first pre-order traversal of tree.'''
+ 161:         if node == 'root':
+ 162:             node = self.root
+ 163:         
+ 164:         if not node:
+ 165:             return
+ 166:         
+ 167:         yield node.val
+ 168:         
+ 169:         for n in self.pre_order(node=node.left):
+ 170:             yield n
+ 171:         for n in self.pre_order(node=node.right):
+ 172:             yield n
  173:     def in_order(self, node='root'):
  174:         '''Depth first in-order traversal of tree.'''
  175:         if node == 'root':
  176:             node = self.root
--------------------------------------------------------------------------------
[0.13116 s] survived

   - [# 128] SDI bst2: 
--------------------------------------------------------------------------------
  169:             yield n
  170:         for n in self.pre_order(node=node.right):
  171:             yield n
  172:     
- 173:     def in_order(self, node='root'):
- 174:         '''Depth first in-order traversal of tree.'''
- 175:         if node == 'root':
- 176:             node = self.root
- 177:         
- 178:         if not node:
- 179:             return
- 180:         
- 181:         for n in self.in_order(node=node.left):
- 182:             yield n
- 183:         yield node.val
- 184:         for n in self.in_order(node=node.right):
- 185:             yield n
- 186:     
+ 173:     @staticmethod
+ 174:     def in_order(self, node='root'):
+ 175:         '''Depth first in-order traversal of tree.'''
+ 176:         if node == 'root':
+ 177:             node = self.root
+ 178:         
+ 179:         if not node:
+ 180:             return
+ 181:         
+ 182:         for n in self.in_order(node=node.left):
+ 183:             yield n
+ 184:         yield node.val
+ 185:         for n in self.in_order(node=node.right):
+ 186:             yield n
  187:     def post_order(self, node='root'):
  188:         '''Depth frist post_order traversal of tree.'''
  189:         if node == 'root':
  190:             node = self.root
--------------------------------------------------------------------------------
[0.13371 s] survived

   - [# 129] SDI bst2: 
--------------------------------------------------------------------------------
  183:         yield node.val
  184:         for n in self.in_order(node=node.right):
  185:             yield n
  186:     
- 187:     def post_order(self, node='root'):
- 188:         '''Depth frist post_order traversal of tree.'''
- 189:         if node == 'root':
- 190:             node = self.root
- 191:         
- 192:         if not node:
- 193:             return
- 194:         
- 195:         for n in self.post_order(node=node.left):
- 196:             yield n
- 197:         for n in self.post_order(node=node.right):
- 198:             yield n
- 199:         yield node.val
- 200:     
+ 187:     @staticmethod
+ 188:     def post_order(self, node='root'):
+ 189:         '''Depth frist post_order traversal of tree.'''
+ 190:         if node == 'root':
+ 191:             node = self.root
+ 192:         
+ 193:         if not node:
+ 194:             return
+ 195:         
+ 196:         for n in self.post_order(node=node.left):
+ 197:             yield n
+ 198:         for n in self.post_order(node=node.right):
+ 199:             yield n
+ 200:         yield node.val
  201:     def breadth_first(self):
  202:         '''Breadth first traversal of tree.'''
  203:         q = Queue()
  204:         q.enqueue(self.root)
--------------------------------------------------------------------------------
[0.16372 s] survived

   - [# 130] SDI bst2: 
--------------------------------------------------------------------------------
  197:         for n in self.post_order(node=node.right):
  198:             yield n
  199:         yield node.val
  200:     
- 201:     def breadth_first(self):
- 202:         '''Breadth first traversal of tree.'''
- 203:         q = Queue()
- 204:         q.enqueue(self.root)
- 205:         while q.peek():
- 206:             node = q.dequeue()
- 207:             yield node.val
- 208:             if node.left:
- 209:                 q.enqueue(node.left)
- 210:             if node.right:
- 211:                 q.enqueue(node.right)
- 212:     
+ 201:     @staticmethod
+ 202:     def breadth_first(self):
+ 203:         '''Breadth first traversal of tree.'''
+ 204:         q = Queue()
+ 205:         q.enqueue(self.root)
+ 206:         while q.peek():
+ 207:             node = q.dequeue()
+ 208:             yield node.val
+ 209:             if node.left:
+ 210:                 q.enqueue(node.left)
+ 211:             if node.right:
+ 212:                 q.enqueue(node.right)
  213:     def delete(self, val):
  214:         '''Remove a node from the tree.'''
  215:         if (self._size < 1 or not (self.contains(val))):
  216:             return
--------------------------------------------------------------------------------
[0.12915 s] survived
