1 : Job ID f7923cffe4a84b9ab682161889b2d962
test outcome: killed
combinations.py, start pos: (9, 24), end pos: (9, 25)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -6,7 +6,7 @@
     output = []
     for i in range(0,len(string)):
         output.append(string[i])
-        for j in range(i+1, len(string)):
+        for j in range(i-1, len(string)):
             output.append(string[i:j+1])
     return output
ts-3-5/test_3-5_0-5_162.py .FFF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_single_letter - ...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 3 failed, 4 passed in 0.11s ==========================

2 : Job ID 335c718ba24d47cd86d858abd2b0c070
test outcome: killed
combinations.py, start pos: (10, 36), end pos: (10, 37)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 1
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -7,7 +7,7 @@
     for i in range(0,len(string)):
         output.append(string[i])
         for j in range(i+1, len(string)):
-            output.append(string[i:j+1])
+            output.append(string[i:j-1])
     return output
ts-3-5/test_3-5_0-5_162.py ..FF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 2 failed, 5 passed in 0.11s ==========================

3 : Job ID 45afe914d58841be8d74ffe1c88406db
test outcome: killed
combinations.py, start pos: (41, 24), end pos: (41, 25)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 2
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -38,7 +38,7 @@
     for i in range(1,len(string)):
         temp = []
         for output in outputs:
-            temp = temp + [output + letter for letter in phone_mapper[string[i]]]
+            temp = temp - [output + letter for letter in phone_mapper[string[i]]]
         outputs = temp
     return outputs    
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================

4 : Job ID f7cab6bc83a0466f951156a2b01d888f
test outcome: killed
combinations.py, start pos: (41, 34), end pos: (41, 35)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 3
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -38,7 +38,7 @@
     for i in range(1,len(string)):
         temp = []
         for output in outputs:
-            temp = temp + [output + letter for letter in phone_mapper[string[i]]]
+            temp = temp + [output - letter for letter in phone_mapper[string[i]]]
         outputs = temp
     return outputs    
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================

5 : Job ID 4025bb169b014c18ba70a03a581c26ac
test outcome: killed
combinations.py, start pos: (9, 24), end pos: (9, 25)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -6,7 +6,7 @@
     output = []
     for i in range(0,len(string)):
         output.append(string[i])
-        for j in range(i+1, len(string)):
+        for j in range(i*1, len(string)):
             output.append(string[i:j+1])
     return output
ts-3-5/test_3-5_0-5_162.py .FFF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_single_letter - ...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 3 failed, 4 passed in 0.11s ==========================

6 : Job ID 5982d02907204256b99dbf41e924d6b2
test outcome: killed
combinations.py, start pos: (10, 36), end pos: (10, 37)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 1
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -7,7 +7,7 @@
     for i in range(0,len(string)):
         output.append(string[i])
         for j in range(i+1, len(string)):
-            output.append(string[i:j+1])
+            output.append(string[i:j*1])
     return output
ts-3-5/test_3-5_0-5_162.py ..FF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 2 failed, 5 passed in 0.11s ==========================

7 : Job ID cc6d487ebb2842f2b8560094b0c2465b
test outcome: killed
combinations.py, start pos: (41, 24), end pos: (41, 25)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 2
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -38,7 +38,7 @@
     for i in range(1,len(string)):
         temp = []
         for output in outputs:
-            temp = temp + [output + letter for letter in phone_mapper[string[i]]]
+            temp = temp * [output + letter for letter in phone_mapper[string[i]]]
         outputs = temp
     return outputs    
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================

8 : Job ID 577c19112254402483d4a4c04c9de9ef
test outcome: killed
combinations.py, start pos: (41, 34), end pos: (41, 35)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 3
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -38,7 +38,7 @@
     for i in range(1,len(string)):
         temp = []
         for output in outputs:
-            temp = temp + [output + letter for letter in phone_mapper[string[i]]]
+            temp = temp + [output * letter for letter in phone_mapper[string[i]]]
         outputs = temp
     return outputs    
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================

9 : Job ID 8ffda16f834840d7bec6f228c297ac26
test outcome: killed
combinations.py, start pos: (9, 24), end pos: (9, 25)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -6,7 +6,7 @@
     output = []
     for i in range(0,len(string)):
         output.append(string[i])
-        for j in range(i+1, len(string)):
+        for j in range(i/1, len(string)):
             output.append(string[i:j+1])
     return output
ts-3-5/test_3-5_0-5_162.py .FFF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_single_letter - ...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - Ty...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 3 failed, 4 passed in 0.11s ==========================

10 : Job ID a6932adc11294996b19b8c76a5bf1113
test outcome: killed
combinations.py, start pos: (10, 36), end pos: (10, 37)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 1
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -7,7 +7,7 @@
     for i in range(0,len(string)):
         output.append(string[i])
         for j in range(i+1, len(string)):
-            output.append(string[i:j+1])
+            output.append(string[i:j/1])
     return output
ts-3-5/test_3-5_0-5_162.py ..FF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - Ty...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 2 failed, 5 passed in 0.11s ==========================

11 : Job ID d902736c417a4cba905131a17f8482a3
test outcome: killed
combinations.py, start pos: (41, 24), end pos: (41, 25)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 2
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -38,7 +38,7 @@
     for i in range(1,len(string)):
         temp = []
         for output in outputs:
-            temp = temp + [output + letter for letter in phone_mapper[string[i]]]
+            temp = temp / [output + letter for letter in phone_mapper[string[i]]]
         outputs = temp
     return outputs    
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================

12 : Job ID be3656eab72545b9bb4c1e4cd1e2b94d
test outcome: killed
combinations.py, start pos: (41, 34), end pos: (41, 35)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 3
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -38,7 +38,7 @@
     for i in range(1,len(string)):
         temp = []
         for output in outputs:
-            temp = temp + [output + letter for letter in phone_mapper[string[i]]]
+            temp = temp + [output / letter for letter in phone_mapper[string[i]]]
         outputs = temp
     return outputs    
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================

13 : Job ID 8c1ad50ec8f64923aff1ad4eb02cba0e
test outcome: killed
combinations.py, start pos: (9, 24), end pos: (9, 25)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -6,7 +6,7 @@
     output = []
     for i in range(0,len(string)):
         output.append(string[i])
-        for j in range(i+1, len(string)):
+        for j in range(i//1, len(string)):
             output.append(string[i:j+1])
     return output
ts-3-5/test_3-5_0-5_162.py .FFF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_single_letter - ...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 3 failed, 4 passed in 0.11s ==========================

14 : Job ID 137bf3ad8bbe46fc81d36b3c9e5801b1
test outcome: killed
combinations.py, start pos: (10, 36), end pos: (10, 37)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 1
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -7,7 +7,7 @@
     for i in range(0,len(string)):
         output.append(string[i])
         for j in range(i+1, len(string)):
-            output.append(string[i:j+1])
+            output.append(string[i:j//1])
     return output
ts-3-5/test_3-5_0-5_162.py ..FF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 2 failed, 5 passed in 0.11s ==========================

15 : Job ID 040e1583e4e943f296e55dca1ff9be36
test outcome: killed
combinations.py, start pos: (41, 24), end pos: (41, 25)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 2
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -38,7 +38,7 @@
     for i in range(1,len(string)):
         temp = []
         for output in outputs:
-            temp = temp + [output + letter for letter in phone_mapper[string[i]]]
+            temp = temp // [output + letter for letter in phone_mapper[string[i]]]
         outputs = temp
     return outputs    
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================

16 : Job ID 4d239795692a42c787ec4354fa417988
test outcome: killed
combinations.py, start pos: (41, 34), end pos: (41, 35)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 3
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -38,7 +38,7 @@
     for i in range(1,len(string)):
         temp = []
         for output in outputs:
-            temp = temp + [output + letter for letter in phone_mapper[string[i]]]
+            temp = temp + [output // letter for letter in phone_mapper[string[i]]]
         outputs = temp
     return outputs    
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================

17 : Job ID 985839f95fc5400c928007f31fc8186b
test outcome: killed
combinations.py, start pos: (9, 24), end pos: (9, 25)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -6,7 +6,7 @@
     output = []
     for i in range(0,len(string)):
         output.append(string[i])
-        for j in range(i+1, len(string)):
+        for j in range(i%1, len(string)):
             output.append(string[i:j+1])
     return output
ts-3-5/test_3-5_0-5_162.py .FFF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_single_letter - ...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 3 failed, 4 passed in 0.13s ==========================

18 : Job ID 94c619ac52764a6fad924818ed5f45b6
test outcome: killed
combinations.py, start pos: (10, 36), end pos: (10, 37)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 1
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -7,7 +7,7 @@
     for i in range(0,len(string)):
         output.append(string[i])
         for j in range(i+1, len(string)):
-            output.append(string[i:j+1])
+            output.append(string[i:j%1])
     return output
ts-3-5/test_3-5_0-5_162.py ..FF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 2 failed, 5 passed in 0.11s ==========================

19 : Job ID a497601846444d0b82d15c26adabc326
test outcome: killed
combinations.py, start pos: (41, 24), end pos: (41, 25)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 2
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -38,7 +38,7 @@
     for i in range(1,len(string)):
         temp = []
         for output in outputs:
-            temp = temp + [output + letter for letter in phone_mapper[string[i]]]
+            temp = temp % [output + letter for letter in phone_mapper[string[i]]]
         outputs = temp
     return outputs    
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================

20 : Job ID 3d4db5663afc43edb41575cb2e03dd0b
test outcome: killed
combinations.py, start pos: (41, 34), end pos: (41, 35)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 3
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -38,7 +38,7 @@
     for i in range(1,len(string)):
         temp = []
         for output in outputs:
-            temp = temp + [output + letter for letter in phone_mapper[string[i]]]
+            temp = temp + [output % letter for letter in phone_mapper[string[i]]]
         outputs = temp
     return outputs    
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================

21 : Job ID bfcce1d394c44356a46de805679002e7
test outcome: killed
combinations.py, start pos: (9, 24), end pos: (9, 25)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -6,7 +6,7 @@
     output = []
     for i in range(0,len(string)):
         output.append(string[i])
-        for j in range(i+1, len(string)):
+        for j in range(i**1, len(string)):
             output.append(string[i:j+1])
     return output
ts-3-5/test_3-5_0-5_162.py .FFF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_single_letter - ...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 3 failed, 4 passed in 0.11s ==========================

22 : Job ID 16eb6aa43d6c424186045795688e77ba
test outcome: killed
combinations.py, start pos: (10, 36), end pos: (10, 37)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 1
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -7,7 +7,7 @@
     for i in range(0,len(string)):
         output.append(string[i])
         for j in range(i+1, len(string)):
-            output.append(string[i:j+1])
+            output.append(string[i:j**1])
     return output
ts-3-5/test_3-5_0-5_162.py ..FF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 2 failed, 5 passed in 0.11s ==========================

23 : Job ID 669a78e4f8364e38afc086f9e8d87dba
test outcome: killed
combinations.py, start pos: (41, 24), end pos: (41, 25)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 2
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -38,7 +38,7 @@
     for i in range(1,len(string)):
         temp = []
         for output in outputs:
-            temp = temp + [output + letter for letter in phone_mapper[string[i]]]
+            temp = temp ** [output + letter for letter in phone_mapper[string[i]]]
         outputs = temp
     return outputs    
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================

24 : Job ID 67830b472fd742ddaf7edba53a6257ec
test outcome: killed
combinations.py, start pos: (41, 34), end pos: (41, 35)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 3
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -38,7 +38,7 @@
     for i in range(1,len(string)):
         temp = []
         for output in outputs:
-            temp = temp + [output + letter for letter in phone_mapper[string[i]]]
+            temp = temp + [output ** letter for letter in phone_mapper[string[i]]]
         outputs = temp
     return outputs    
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================

25 : Job ID db37f002f1c5422e87c4124a3334961e
test outcome: killed
combinations.py, start pos: (9, 24), end pos: (9, 25)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -6,7 +6,7 @@
     output = []
     for i in range(0,len(string)):
         output.append(string[i])
-        for j in range(i+1, len(string)):
+        for j in range(i>>1, len(string)):
             output.append(string[i:j+1])
     return output
ts-3-5/test_3-5_0-5_162.py .FFF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_single_letter - ...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 3 failed, 4 passed in 0.11s ==========================

26 : Job ID 9ab30dd37dec40abb174e495488ccf1c
test outcome: killed
combinations.py, start pos: (10, 36), end pos: (10, 37)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 1
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -7,7 +7,7 @@
     for i in range(0,len(string)):
         output.append(string[i])
         for j in range(i+1, len(string)):
-            output.append(string[i:j+1])
+            output.append(string[i:j>>1])
     return output
ts-3-5/test_3-5_0-5_162.py ..FF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 2 failed, 5 passed in 0.11s ==========================

27 : Job ID 92b10c7b56d745009e15d54ecd8626fb
test outcome: killed
combinations.py, start pos: (41, 24), end pos: (41, 25)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 2
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -38,7 +38,7 @@
     for i in range(1,len(string)):
         temp = []
         for output in outputs:
-            temp = temp + [output + letter for letter in phone_mapper[string[i]]]
+            temp = temp >> [output + letter for letter in phone_mapper[string[i]]]
         outputs = temp
     return outputs    
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================

28 : Job ID 59edc52e3ff8449081b0b739e29128ed
test outcome: killed
combinations.py, start pos: (41, 34), end pos: (41, 35)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 3
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -38,7 +38,7 @@
     for i in range(1,len(string)):
         temp = []
         for output in outputs:
-            temp = temp + [output + letter for letter in phone_mapper[string[i]]]
+            temp = temp + [output >> letter for letter in phone_mapper[string[i]]]
         outputs = temp
     return outputs    
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================

29 : Job ID eaf3ae7913af412284c38aa9f832a926
test outcome: killed
combinations.py, start pos: (9, 24), end pos: (9, 25)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -6,7 +6,7 @@
     output = []
     for i in range(0,len(string)):
         output.append(string[i])
-        for j in range(i+1, len(string)):
+        for j in range(i<<1, len(string)):
             output.append(string[i:j+1])
     return output
ts-3-5/test_3-5_0-5_162.py .FFF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_single_letter - ...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 3 failed, 4 passed in 0.11s ==========================

30 : Job ID 99c76ab61d654bb8953cd74aac3d03d4
SURVIVED
test outcome: survived
combinations.py, start pos: (10, 36), end pos: (10, 37)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 1
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -7,7 +7,7 @@
     for i in range(0,len(string)):
         output.append(string[i])
         for j in range(i+1, len(string)):
-            output.append(string[i:j+1])
+            output.append(string[i:j<<1])
     return output
ts-3-5/test_3-5_0-5_162.py .......                                       [100%]
============================== 7 passed in 0.10s ===============================

31 : Job ID 7781b1ce612c4b3f8ea57d2b4d9a5bb0
test outcome: killed
combinations.py, start pos: (41, 24), end pos: (41, 25)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 2
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -38,7 +38,7 @@
     for i in range(1,len(string)):
         temp = []
         for output in outputs:
-            temp = temp + [output + letter for letter in phone_mapper[string[i]]]
+            temp = temp << [output + letter for letter in phone_mapper[string[i]]]
         outputs = temp
     return outputs    
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================
