32 : Job ID 9990a36672104c1582b4c521c2193c61
test outcome: killed
combinations.py, start pos: (41, 34), end pos: (41, 35)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 3
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -38,7 +38,7 @@
     for i in range(1,len(string)):
         temp = []
         for output in outputs:
-            temp = temp + [output + letter for letter in phone_mapper[string[i]]]
+            temp = temp + [output << letter for letter in phone_mapper[string[i]]]
         outputs = temp
     return outputs    
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================

33 : Job ID de88bf87ce1349c89770f717f80cb6b7
test outcome: killed
combinations.py, start pos: (9, 24), end pos: (9, 25)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -6,7 +6,7 @@
     output = []
     for i in range(0,len(string)):
         output.append(string[i])
-        for j in range(i+1, len(string)):
+        for j in range(i|1, len(string)):
             output.append(string[i:j+1])
     return output
ts-3-5/test_3-5_0-5_162.py ..FF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 2 failed, 5 passed in 0.11s ==========================

34 : Job ID 9652ee64522946eba75e027f688dc550
test outcome: killed
combinations.py, start pos: (10, 36), end pos: (10, 37)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 1
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -7,7 +7,7 @@
     for i in range(0,len(string)):
         output.append(string[i])
         for j in range(i+1, len(string)):
-            output.append(string[i:j+1])
+            output.append(string[i:j|1])
     return output
ts-3-5/test_3-5_0-5_162.py ..FF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 2 failed, 5 passed in 0.13s ==========================

35 : Job ID 65198e359176463b85986d79a179503a
test outcome: killed
combinations.py, start pos: (41, 24), end pos: (41, 25)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 2
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -38,7 +38,7 @@
     for i in range(1,len(string)):
         temp = []
         for output in outputs:
-            temp = temp + [output + letter for letter in phone_mapper[string[i]]]
+            temp = temp | [output + letter for letter in phone_mapper[string[i]]]
         outputs = temp
     return outputs    
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================

36 : Job ID 16c65f9819744035b464b3d4458983c5
test outcome: killed
combinations.py, start pos: (41, 34), end pos: (41, 35)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 3
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -38,7 +38,7 @@
     for i in range(1,len(string)):
         temp = []
         for output in outputs:
-            temp = temp + [output + letter for letter in phone_mapper[string[i]]]
+            temp = temp + [output | letter for letter in phone_mapper[string[i]]]
         outputs = temp
     return outputs    
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================

37 : Job ID 449b6bd4eedd44c0ad851de9cae12d9f
test outcome: killed
combinations.py, start pos: (9, 24), end pos: (9, 25)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -6,7 +6,7 @@
     output = []
     for i in range(0,len(string)):
         output.append(string[i])
-        for j in range(i+1, len(string)):
+        for j in range(i&1, len(string)):
             output.append(string[i:j+1])
     return output
ts-3-5/test_3-5_0-5_162.py .FFF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_single_letter - ...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 3 failed, 4 passed in 0.11s ==========================

38 : Job ID a6fc0799ef284c4993c84ba3d2d00838
test outcome: killed
combinations.py, start pos: (10, 36), end pos: (10, 37)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 1
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -7,7 +7,7 @@
     for i in range(0,len(string)):
         output.append(string[i])
         for j in range(i+1, len(string)):
-            output.append(string[i:j+1])
+            output.append(string[i:j&1])
     return output
ts-3-5/test_3-5_0-5_162.py ..FF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 2 failed, 5 passed in 0.11s ==========================

39 : Job ID 9c92199bcc154f7898ec8a3bbbd5d53a
test outcome: killed
combinations.py, start pos: (41, 24), end pos: (41, 25)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 2
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -38,7 +38,7 @@
     for i in range(1,len(string)):
         temp = []
         for output in outputs:
-            temp = temp + [output + letter for letter in phone_mapper[string[i]]]
+            temp = temp & [output + letter for letter in phone_mapper[string[i]]]
         outputs = temp
     return outputs    
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.14s ==========================

40 : Job ID c4d0f4bccd134a0fa0c3776b4cab35be
test outcome: killed
combinations.py, start pos: (41, 34), end pos: (41, 35)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 3
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -38,7 +38,7 @@
     for i in range(1,len(string)):
         temp = []
         for output in outputs:
-            temp = temp + [output + letter for letter in phone_mapper[string[i]]]
+            temp = temp + [output & letter for letter in phone_mapper[string[i]]]
         outputs = temp
     return outputs    
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================

41 : Job ID 8e0cbac257b84702aa0922fcc3ef4403
test outcome: killed
combinations.py, start pos: (9, 24), end pos: (9, 25)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -6,7 +6,7 @@
     output = []
     for i in range(0,len(string)):
         output.append(string[i])
-        for j in range(i+1, len(string)):
+        for j in range(i^1, len(string)):
             output.append(string[i:j+1])
     return output
ts-3-5/test_3-5_0-5_162.py ..FF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 2 failed, 5 passed in 0.11s ==========================

42 : Job ID 2e66d729126a491b9d1f315527e4b1d6
test outcome: killed
combinations.py, start pos: (10, 36), end pos: (10, 37)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 1
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -7,7 +7,7 @@
     for i in range(0,len(string)):
         output.append(string[i])
         for j in range(i+1, len(string)):
-            output.append(string[i:j+1])
+            output.append(string[i:j^1])
     return output
ts-3-5/test_3-5_0-5_162.py ..FF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 2 failed, 5 passed in 0.11s ==========================

43 : Job ID 6910be43c1044ad98178f89e8072ac9e
test outcome: killed
combinations.py, start pos: (41, 24), end pos: (41, 25)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 2
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -38,7 +38,7 @@
     for i in range(1,len(string)):
         temp = []
         for output in outputs:
-            temp = temp + [output + letter for letter in phone_mapper[string[i]]]
+            temp = temp ^ [output + letter for letter in phone_mapper[string[i]]]
         outputs = temp
     return outputs    
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================

44 : Job ID 2c3bac812fb849da9198a1702e419705
test outcome: killed
combinations.py, start pos: (41, 34), end pos: (41, 35)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 3
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -38,7 +38,7 @@
     for i in range(1,len(string)):
         temp = []
         for output in outputs:
-            temp = temp + [output + letter for letter in phone_mapper[string[i]]]
+            temp = temp + [output ^ letter for letter in phone_mapper[string[i]]]
         outputs = temp
     return outputs    
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================

45 : Job ID 0b9483a3b6c2401f8444fa36b9d8a579
test outcome: killed
combinations.py, start pos: (7, 19), end pos: (7, 20)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -4,7 +4,7 @@
     """
     output = []
-    for i in range(0,len(string)):
+    for i in range( 1,len(string)):
         output.append(string[i])
         for j in range(i+1, len(string)):
             output.append(string[i:j+1])
ts-3-5/test_3-5_0-5_162.py .FFF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_single_letter - ...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 3 failed, 4 passed in 0.11s ==========================

46 : Job ID 83abf741c6ab4ec3ba2971eb8839e2b0
test outcome: killed
combinations.py, start pos: (7, 19), end pos: (7, 20)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -4,7 +4,7 @@
     """
     output = []
-    for i in range(0,len(string)):
+    for i in range( -1,len(string)):
         output.append(string[i])
         for j in range(i+1, len(string)):
             output.append(string[i:j+1])
ts-3-5/test_3-5_0-5_162.py FFFF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_empty_string - I...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_single_letter - ...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 4 failed, 3 passed in 0.11s ==========================

47 : Job ID d1ad9ccf63eb4485908c93e036cfa9f5
test outcome: killed
combinations.py, start pos: (9, 25), end pos: (9, 26)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -6,7 +6,7 @@
     output = []
     for i in range(0,len(string)):
         output.append(string[i])
-        for j in range(i+1, len(string)):
+        for j in range(i+ 2, len(string)):
             output.append(string[i:j+1])
     return output
ts-3-5/test_3-5_0-5_162.py ..FF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 2 failed, 5 passed in 0.11s ==========================

48 : Job ID 54e49e476e0341ae979c4e8cc1742cee
test outcome: killed
combinations.py, start pos: (9, 25), end pos: (9, 26)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -6,7 +6,7 @@
     output = []
     for i in range(0,len(string)):
         output.append(string[i])
-        for j in range(i+1, len(string)):
+        for j in range(i+ 0, len(string)):
             output.append(string[i:j+1])
     return output
ts-3-5/test_3-5_0-5_162.py .FFF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_single_letter - ...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 3 failed, 4 passed in 0.11s ==========================

49 : Job ID 221b341cfa374f4b915a525ac803e3b4
test outcome: killed
combinations.py, start pos: (10, 37), end pos: (10, 38)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -7,7 +7,7 @@
     for i in range(0,len(string)):
         output.append(string[i])
         for j in range(i+1, len(string)):
-            output.append(string[i:j+1])
+            output.append(string[i:j+ 2])
     return output
ts-3-5/test_3-5_0-5_162.py ...F...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 1 failed, 6 passed in 0.11s ==========================

50 : Job ID bf2ff48579d54445b48123d62f62c648
test outcome: killed
combinations.py, start pos: (10, 37), end pos: (10, 38)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -7,7 +7,7 @@
     for i in range(0,len(string)):
         output.append(string[i])
         for j in range(i+1, len(string)):
-            output.append(string[i:j+1])
+            output.append(string[i:j+ 0])
     return output
ts-3-5/test_3-5_0-5_162.py ..FF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 2 failed, 5 passed in 0.11s ==========================

51 : Job ID ac6c3b662c3e4fc1b4ebc513e7cfcadf
test outcome: killed
combinations.py, start pos: (36, 56), end pos: (36, 57)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -33,7 +33,7 @@
             '9' : ['w','x','y','z'],
         }
-    outputs = [letter for letter in phone_mapper[string[0]]]
+    outputs = [letter for letter in phone_mapper[string[ 1]]]
     for i in range(1,len(string)):
         temp = []
ts-3-5/test_3-5_0-5_162.py ....FFF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_single_digit
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 3 failed, 4 passed in 0.11s ==========================

52 : Job ID 7e3edc74dd65460eb6f7cdc8bb0ddc70
test outcome: killed
combinations.py, start pos: (36, 56), end pos: (36, 57)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -33,7 +33,7 @@
             '9' : ['w','x','y','z'],
         }
-    outputs = [letter for letter in phone_mapper[string[0]]]
+    outputs = [letter for letter in phone_mapper[string[ -1]]]
     for i in range(1,len(string)):
         temp = []
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================

53 : Job ID 5e29a0c539d448bebfdab41015f4c8ee
test outcome: killed
combinations.py, start pos: (38, 19), end pos: (38, 20)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -35,7 +35,7 @@
     outputs = [letter for letter in phone_mapper[string[0]]]
-    for i in range(1,len(string)):
+    for i in range( 2,len(string)):
         temp = []
         for output in outputs:
             temp = temp + [output + letter for letter in phone_mapper[string[i]]]
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================

54 : Job ID da8c97a69139471ebe178a9b22b684f6
test outcome: killed
combinations.py, start pos: (38, 19), end pos: (38, 20)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -35,7 +35,7 @@
     outputs = [letter for letter in phone_mapper[string[0]]]
-    for i in range(1,len(string)):
+    for i in range( 0,len(string)):
         temp = []
         for output in outputs:
             temp = temp + [output + letter for letter in phone_mapper[string[i]]]
ts-3-5/test_3-5_0-5_162.py ....FFF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_single_digit
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 3 failed, 4 passed in 0.11s ==========================

55 : Job ID c90f4d2a6a474558a680409c5163070e
test outcome: killed
combinations.py, start pos: (7, 13), end pos: (7, 33)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -4,7 +4,7 @@
     """
     output = []
-    for i in range(0,len(string)):
+    for i in []:
         output.append(string[i])
         for j in range(i+1, len(string)):
             output.append(string[i:j+1])
ts-3-5/test_3-5_0-5_162.py .FFF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_single_letter - ...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 3 failed, 4 passed in 0.11s ==========================

56 : Job ID 2d95897f73634943b1e594575f3001f8
test outcome: killed
combinations.py, start pos: (9, 17), end pos: (9, 40)
operator: core/ZeroIterationForLoop, occurrence: 1
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -6,7 +6,7 @@
     output = []
     for i in range(0,len(string)):
         output.append(string[i])
-        for j in range(i+1, len(string)):
+        for j in []:
             output.append(string[i:j+1])
     return output
ts-3-5/test_3-5_0-5_162.py ..FF...                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_two_letters - As...
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_word_three_letters - ...
========================= 2 failed, 5 passed in 0.11s ==========================

57 : Job ID 7fa81a69bc3d4c049d47c0ba964613a8
test outcome: killed
combinations.py, start pos: (38, 13), end pos: (38, 33)
operator: core/ZeroIterationForLoop, occurrence: 2
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -35,7 +35,7 @@
     outputs = [letter for letter in phone_mapper[string[0]]]
-    for i in range(1,len(string)):
+    for i in []:
         temp = []
         for output in outputs:
             temp = temp + [output + letter for letter in phone_mapper[string[i]]]
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================

58 : Job ID 512bec16b01345d4a3b1dfd6fa67050f
test outcome: killed
combinations.py, start pos: (40, 22), end pos: (40, 29)
operator: core/ZeroIterationForLoop, occurrence: 3
--- mutation diff ---
--- acombinations.py
+++ bcombinations.py
@@ -37,7 +37,7 @@
     for i in range(1,len(string)):
         temp = []
-        for output in outputs:
+        for output in []:
             temp = temp + [output + letter for letter in phone_mapper[string[i]]]
         outputs = temp
ts-3-5/test_3-5_0-5_162.py .....FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_two_digits
FAILED ts-3-5/test_3-5_0-5_162.py::test_combinations_of_phone_input_three_digits
========================= 2 failed, 5 passed in 0.11s ==========================
