1 : Job ID 4818926f838c49a283fd09e8c0a31711
test outcome: killed
complement.py, start pos: (11, 14), end pos: (11, 16)
operator: core/ReplaceBinaryOperator_LShift_Add, occurrence: 0
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -8,6 +8,6 @@
     i = 1
     while i <= num:
         num ^= i
-        i = i << 1
+        i = i + 1
     return num
ts-3-5/test_3-5_0-2_62.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_positive_input - assert 1 == 2
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_large_input - assert 36 == 27
========================= 2 failed, 2 passed in 0.12s ==========================

2 : Job ID ad83bbada4c84fb8bef298e8be4ec8d9
test outcome: killed
complement.py, start pos: (11, 14), end pos: (11, 16)
operator: core/ReplaceBinaryOperator_LShift_Sub, occurrence: 0
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -8,6 +8,6 @@
     i = 1
     while i <= num:
         num ^= i
-        i = i << 1
+        i = i - 1
     return num
ts-3-5/test_3-5_0-2_62.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_positive_input - assert -5 ...
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_large_input - assert -102 =...
========================= 2 failed, 2 passed in 0.12s ==========================

3 : Job ID e8275560464545228777dd08d19509dc
test outcome: killed
complement.py, start pos: (11, 14), end pos: (11, 16)
operator: core/ReplaceBinaryOperator_LShift_Mul, occurrence: 0
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -8,6 +8,6 @@
     i = 1
     while i <= num:
         num ^= i
-        i = i << 1
+        i = i * 1
     return num
timeout

4 : Job ID 098e57cea55c46fc8403abcdad18ce4b
test outcome: killed
complement.py, start pos: (11, 14), end pos: (11, 16)
operator: core/ReplaceBinaryOperator_LShift_Div, occurrence: 0
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -8,6 +8,6 @@
     i = 1
     while i <= num:
         num ^= i
-        i = i << 1
+        i = i / 1
     return num
ts-3-5/test_3-5_0-2_62.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_positive_input - TypeError:...
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_large_input - TypeError: un...
========================= 2 failed, 2 passed in 0.12s ==========================

5 : Job ID 4dfb0e8a5b444f01b2574390fccd42a4
test outcome: killed
complement.py, start pos: (11, 14), end pos: (11, 16)
operator: core/ReplaceBinaryOperator_LShift_FloorDiv, occurrence: 0
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -8,6 +8,6 @@
     i = 1
     while i <= num:
         num ^= i
-        i = i << 1
+        i = i // 1
     return num
timeout

6 : Job ID 611cc67e0d8c47958bf6fde9670afe5c
test outcome: killed
complement.py, start pos: (11, 14), end pos: (11, 16)
operator: core/ReplaceBinaryOperator_LShift_Mod, occurrence: 0
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -8,6 +8,6 @@
     i = 1
     while i <= num:
         num ^= i
-        i = i << 1
+        i = i % 1
     return num
timeout

7 : Job ID 2f160f134b82456dbb6e3279e0865835
test outcome: killed
complement.py, start pos: (11, 14), end pos: (11, 16)
operator: core/ReplaceBinaryOperator_LShift_Pow, occurrence: 0
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -8,6 +8,6 @@
     i = 1
     while i <= num:
         num ^= i
-        i = i << 1
+        i = i ** 1
     return num
timeout

8 : Job ID 59c042656f13473e8c004cf33dab8a40
test outcome: killed
complement.py, start pos: (11, 14), end pos: (11, 16)
operator: core/ReplaceBinaryOperator_LShift_RShift, occurrence: 0
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -8,6 +8,6 @@
     i = 1
     while i <= num:
         num ^= i
-        i = i << 1
+        i = i >> 1
     return num
timeout

9 : Job ID 9e624cc620b144d09ec59388ef2ee3f0
test outcome: killed
complement.py, start pos: (11, 14), end pos: (11, 16)
operator: core/ReplaceBinaryOperator_LShift_BitOr, occurrence: 0
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -8,6 +8,6 @@
     i = 1
     while i <= num:
         num ^= i
-        i = i << 1
+        i = i | 1
     return num
timeout

10 : Job ID 824c4c6baaf0436fb2cc5535bb6812d8
test outcome: killed
complement.py, start pos: (11, 14), end pos: (11, 16)
operator: core/ReplaceBinaryOperator_LShift_BitAnd, occurrence: 0
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -8,6 +8,6 @@
     i = 1
     while i <= num:
         num ^= i
-        i = i << 1
+        i = i & 1
     return num
timeout

11 : Job ID 1756ec114b3d4c65a0f7b5a3c11d700a
test outcome: killed
complement.py, start pos: (11, 14), end pos: (11, 16)
operator: core/ReplaceBinaryOperator_LShift_BitXor, occurrence: 0
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -8,6 +8,6 @@
     i = 1
     while i <= num:
         num ^= i
-        i = i << 1
+        i = i ^ 1
     return num
timeout

12 : Job ID e7c0a4caed944bc19108741dc8336e8f
test outcome: killed
complement.py, start pos: (9, 12), end pos: (9, 14)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 0
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -6,7 +6,7 @@
     if not num:
         return 1
     i = 1
-    while i <= num:
+    while i == num:
         num ^= i
         i = i << 1
     return num
ts-3-5/test_3-5_0-2_62.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_positive_input - assert 5 == 2
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_large_input - assert 100 == 27
========================= 2 failed, 2 passed in 0.12s ==========================

13 : Job ID f9241dbc4fa5430f922fda9fb8552c08
test outcome: killed
complement.py, start pos: (9, 12), end pos: (9, 14)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 0
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -6,7 +6,7 @@
     if not num:
         return 1
     i = 1
-    while i <= num:
+    while i != num:
         num ^= i
         i = i << 1
     return num
timeout

14 : Job ID 4ee100b5f62b4d6aa90b753cd51daae2
SURVIVED
test outcome: survived
complement.py, start pos: (9, 12), end pos: (9, 14)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 0
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -6,7 +6,7 @@
     if not num:
         return 1
     i = 1
-    while i <= num:
+    while i < num:
         num ^= i
         i = i << 1
     return num
ts-3-5/test_3-5_0-2_62.py ....                                           [100%]
============================== 4 passed in 0.12s ===============================

15 : Job ID 5545e9b1967f4d77942dd776b10c37ec
test outcome: killed
complement.py, start pos: (9, 12), end pos: (9, 14)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 0
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -6,7 +6,7 @@
     if not num:
         return 1
     i = 1
-    while i <= num:
+    while i > num:
         num ^= i
         i = i << 1
     return num
timeout

16 : Job ID 6b49eea15ed046668791309a51e1d2a6
test outcome: killed
complement.py, start pos: (9, 12), end pos: (9, 14)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 0
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -6,7 +6,7 @@
     if not num:
         return 1
     i = 1
-    while i <= num:
+    while i >= num:
         num ^= i
         i = i << 1
     return num
timeout

17 : Job ID 71240e21f3054a61beaaa77de805646f
test outcome: killed
complement.py, start pos: (9, 12), end pos: (9, 14)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 0
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -6,7 +6,7 @@
     if not num:
         return 1
     i = 1
-    while i <= num:
+    while i is num:
         num ^= i
         i = i << 1
     return num
ts-3-5/test_3-5_0-2_62.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_positive_input - assert 5 == 2
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_large_input - assert 100 == 27
========================= 2 failed, 2 passed in 0.13s ==========================

18 : Job ID 4256e42700c14d289d39cd11fe9f447b
test outcome: killed
complement.py, start pos: (9, 12), end pos: (9, 14)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 0
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -6,7 +6,7 @@
     if not num:
         return 1
     i = 1
-    while i <= num:
+    while i is not num:
         num ^= i
         i = i << 1
     return num
timeout

19 : Job ID db4b21b0d11841d287889eca2e205347
test outcome: killed
complement.py, start pos: (6, 7), end pos: (6, 10)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 0
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -3,7 +3,7 @@
     Find the non-zero padded binary compelement.
     """
-    if not num:
+    if  num:
         return 1
     i = 1
     while i <= num:
ts-3-5/test_3-5_0-2_62.py FFFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_zero_input - assert 0 == 1
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_positive_input - assert 1 == 2
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_negative_input - assert 1 =...
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_large_input - assert 1 == 27
============================== 4 failed in 0.13s ===============================

20 : Job ID 0a41371e0dd547ee96d8936946516a2d
test outcome: killed
complement.py, start pos: (6, 7), end pos: (6, 14)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -3,7 +3,7 @@
     Find the non-zero padded binary compelement.
     """
-    if not num:
+    if not not num:
         return 1
     i = 1
     while i <= num:
ts-3-5/test_3-5_0-2_62.py FFFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_zero_input - assert 0 == 1
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_positive_input - assert 1 == 2
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_negative_input - assert 1 =...
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_large_input - assert 1 == 27
============================== 4 failed in 0.12s ===============================

21 : Job ID 6705726fa6284c88bcb292830ce8d571
test outcome: killed
complement.py, start pos: (9, 10), end pos: (9, 18)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -6,7 +6,7 @@
     if not num:
         return 1
     i = 1
-    while i <= num:
+    while not i <= num:
         num ^= i
         i = i << 1
     return num
timeout

22 : Job ID 629d54963e34441a90bc5967c1397ee7
test outcome: killed
complement.py, start pos: (7, 15), end pos: (7, 16)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -4,7 +4,7 @@
     """
     if not num:
-        return 1
+        return 2
     i = 1
     while i <= num:
         num ^= i
ts-3-5/test_3-5_0-2_62.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_zero_input - assert 2 == 1
========================= 1 failed, 3 passed in 0.13s ==========================

23 : Job ID d2d8a6c52eba4f0d8de22ef334bf0c76
test outcome: killed
complement.py, start pos: (7, 15), end pos: (7, 16)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -4,7 +4,7 @@
     """
     if not num:
-        return 1
+        return 0
     i = 1
     while i <= num:
         num ^= i
ts-3-5/test_3-5_0-2_62.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_zero_input - assert 0 == 1
========================= 1 failed, 3 passed in 0.13s ==========================

24 : Job ID b6bb4a45edd44caeacc3a17d00a2da07
test outcome: killed
complement.py, start pos: (8, 8), end pos: (8, 9)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -5,7 +5,7 @@
     """
     if not num:
         return 1
-    i = 1
+    i = 2
     while i <= num:
         num ^= i
         i = i << 1
ts-3-5/test_3-5_0-2_62.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_positive_input - assert 3 == 2
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_large_input - assert 26 == 27
========================= 2 failed, 2 passed in 0.12s ==========================

25 : Job ID a2e9f0ce70104594a3beae5a43cf3ac6
test outcome: killed
complement.py, start pos: (8, 8), end pos: (8, 9)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -5,7 +5,7 @@
     """
     if not num:
         return 1
-    i = 1
+    i = 0
     while i <= num:
         num ^= i
         i = i << 1
timeout

26 : Job ID f4f16bafe114479198c1f9535cf8bb03
test outcome: killed
complement.py, start pos: (11, 17), end pos: (11, 18)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -8,6 +8,6 @@
     i = 1
     while i <= num:
         num ^= i
-        i = i << 1
+        i = i << 2
     return num
ts-3-5/test_3-5_0-2_62.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_positive_input - assert 0 == 2
FAILED ts-3-5/test_3-5_0-2_62.py::test_complement_large_input - assert 49 == 27
========================= 2 failed, 2 passed in 0.12s ==========================

27 : Job ID 1a7f1e0a2b13401bad5f88b7cfcd1c13
test outcome: killed
complement.py, start pos: (11, 17), end pos: (11, 18)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- acomplement.py
+++ bcomplement.py
@@ -8,6 +8,6 @@
     i = 1
     while i <= num:
         num ^= i
-        i = i << 1
+        i = i << 0
     return num
timeout
