   - [#   1] COD complement: 
--------------------------------------------------------------------------------
   2:     '''
   3:     Find the non-zero padded binary compelement.
   4: 
   5:     '''
-  6:     if not num:
+  6:     if num:
   7:         return 1
   8:     i = 1
   9:     while i <= num:
  10:         num ^= i
--------------------------------------------------------------------------------
[0.18818 s] killed by ts-3-5/test_3-5_0-2_72.py::test_complement_zero_input

def test_complement_zero_input():
>       assert complement(0) == 1
E       AssertionError

ts-3-5/test_3-5_0-2_72.py:10: AssertionError

   - [#   2] COI complement: 
--------------------------------------------------------------------------------
   2:     '''
   3:     Find the non-zero padded binary compelement.
   4: 
   5:     '''
-  6:     if not num:
+  6:     if not ((not num)):
   7:         return 1
   8:     i = 1
   9:     while i <= num:
  10:         num ^= i
--------------------------------------------------------------------------------
[0.17714 s] killed by ts-3-5/test_3-5_0-2_72.py::test_complement_zero_input

def test_complement_zero_input():
>       assert complement(0) == 1
E       AssertionError

ts-3-5/test_3-5_0-2_72.py:10: AssertionError

   - [#   3] COI complement: 
--------------------------------------------------------------------------------
   5:     '''
   6:     if not num:
   7:         return 1
   8:     i = 1
-  9:     while i <= num:
+  9:     while not (i <= num):
  10:         num ^= i
  11:         i = i << 1
  12:     return num
--------------------------------------------------------------------------------
[0.18548 s] killed by ts-3-5/test_3-5_0-2_72.py::test_complement_positive_input

def test_complement_positive_input():
>       assert complement(5) == 2
E       AssertionError

ts-3-5/test_3-5_0-2_72.py:13: AssertionError

   - [#   4] LOR complement: 
--------------------------------------------------------------------------------
   6:     if not num:
   7:         return 1
   8:     i = 1
   9:     while i <= num:
- 10:         num ^= i
+ 10:         num &= i
  11:         i = i << 1
  12:     return num
--------------------------------------------------------------------------------
[0.19782 s] killed by ts-3-5/test_3-5_0-2_72.py::test_complement_positive_input

def test_complement_positive_input():
>       assert complement(5) == 2
E       AssertionError

ts-3-5/test_3-5_0-2_72.py:13: AssertionError

   - [#   6] OIL complement: 
--------------------------------------------------------------------------------
   8:     i = 1
   9:     while i <= num:
  10:         num ^= i
  11:         i = i << 1
- 12:     return num
+ 12:         break
+ 13:     return num
--------------------------------------------------------------------------------
[0.20403 s] killed by ts-3-5/test_3-5_0-2_72.py::test_complement_positive_input

def test_complement_positive_input():
>       assert complement(5) == 2
E       AssertionError

ts-3-5/test_3-5_0-2_72.py:13: AssertionError

   - [#   9] SDL complement: 
--------------------------------------------------------------------------------
   3:     Find the non-zero padded binary compelement.
   4: 
   5:     '''
   6:     if not num:
-  7:         return 1
+  7:         pass
   8:     i = 1
   9:     while i <= num:
  10:         num ^= i
  11:         i = i << 1
--------------------------------------------------------------------------------
[0.19956 s] killed by ts-3-5/test_3-5_0-2_72.py::test_complement_zero_input

def test_complement_zero_input():
>       assert complement(0) == 1
E       AssertionError

ts-3-5/test_3-5_0-2_72.py:10: AssertionError

   - [#  10] SDL complement: 
--------------------------------------------------------------------------------
   4: 
   5:     '''
   6:     if not num:
   7:         return 1
-  8:     i = 1
+  8:     pass
   9:     while i <= num:
  10:         num ^= i
  11:         i = i << 1
  12:     return num
--------------------------------------------------------------------------------
[0.19811 s] killed by ts-3-5/test_3-5_0-2_72.py::test_complement_positive_input

def test_complement_positive_input():
>       assert complement(5) == 2

ts-3-5/test_3-5_0-2_72.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

num = 5

>   ???
E   UnboundLocalError: local variable 'i' referenced before assignment

complement:9: UnboundLocalError

   - [#  11] SDL complement: 
--------------------------------------------------------------------------------
   7:         return 1
   8:     i = 1
   9:     while i <= num:
  10:         num ^= i
- 11:         i = i << 1
+ 11:         pass
  12:     return num
--------------------------------------------------------------------------------
[5.00602 s] timeout

   - [#  12] SDL complement: 
--------------------------------------------------------------------------------
   8:     i = 1
   9:     while i <= num:
  10:         num ^= i
  11:         i = i << 1
- 12:     return num
+ 12:     pass
--------------------------------------------------------------------------------
[0.18363 s] killed by ts-3-5/test_3-5_0-2_72.py::test_complement_positive_input

def test_complement_positive_input():
>       assert complement(5) == 2
E       AssertionError

ts-3-5/test_3-5_0-2_72.py:13: AssertionError

   - [#  13] ZIL complement: 
--------------------------------------------------------------------------------
   6:     if not num:
   7:         return 1
   8:     i = 1
   9:     while i <= num:
- 10:         num ^= i
- 11:         i = i << 1
+ 10:         break
+ 11:     
  12:     return num
--------------------------------------------------------------------------------
[0.19989 s] killed by ts-3-5/test_3-5_0-2_72.py::test_complement_positive_input

def test_complement_positive_input():
>       assert complement(5) == 2
E       AssertionError

ts-3-5/test_3-5_0-2_72.py:13: AssertionError
