1 : Job ID 43a7c358258b412f9ea8aa1a0b3c336a
test outcome: killed
convert_base.py, start pos: (10, 47), end pos: (10, 48)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)+i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

2 : Job ID f778013614a24720a25f96c0fe3e1ed7
test outcome: killed
convert_base.py, start pos: (10, 49), end pos: (10, 50)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)-i+1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

3 : Job ID da627092f967473c8219096a1354d2c9
test outcome: killed
convert_base.py, start pos: (10, 47), end pos: (10, 48)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)*i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

4 : Job ID f54cd0dffba64a5b8f0eddc9020b38be
test outcome: killed
convert_base.py, start pos: (10, 49), end pos: (10, 50)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)-i*1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

5 : Job ID 400c054b08ed47089a65e6a0412e40bf
test outcome: killed
convert_base.py, start pos: (10, 47), end pos: (10, 48)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)/i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F.F..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - ZeroDivisionError: div...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_digit - ZeroDivi...
========================= 2 failed, 3 passed in 0.15s ==========================

6 : Job ID 468f0aeb662544809a2fcf8722f30131
test outcome: killed
convert_base.py, start pos: (10, 49), end pos: (10, 50)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)-i/1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

7 : Job ID c3331a6f7cb44e25bb8cd7fa6332df71
test outcome: killed
convert_base.py, start pos: (10, 47), end pos: (10, 48)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)//i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F.F..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - ZeroDivisionError: int...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_digit - ZeroDivi...
========================= 2 failed, 3 passed in 0.16s ==========================

8 : Job ID 6078dba5e1b248a799185ee6ddbc3f5a
test outcome: killed
convert_base.py, start pos: (10, 49), end pos: (10, 50)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)-i//1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.16s ==========================

9 : Job ID dd283a2ac9fa4c259ced5f16581439a4
test outcome: killed
convert_base.py, start pos: (10, 47), end pos: (10, 48)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)%i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F.F..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - ZeroDivisionError: int...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_digit - ZeroDivi...
========================= 2 failed, 3 passed in 0.15s ==========================

10 : Job ID 6769b9773a5b44b0abd47b9dfe1b922b
test outcome: killed
convert_base.py, start pos: (10, 49), end pos: (10, 50)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)-i%1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

11 : Job ID 54a87b6afa7148579e40b91986f7aeeb
test outcome: killed
convert_base.py, start pos: (10, 47), end pos: (10, 48)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)**i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.14s ==========================

12 : Job ID 6a31cd1847ed4747aaaf2f997aa28799
test outcome: killed
convert_base.py, start pos: (10, 49), end pos: (10, 50)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)-i**1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

13 : Job ID bf6e639ea95643558ac5996a1e75227a
test outcome: killed
convert_base.py, start pos: (10, 47), end pos: (10, 48)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)>>i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F.F..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - ValueError: negative s...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_digit - ValueErr...
========================= 2 failed, 3 passed in 0.15s ==========================

14 : Job ID 3e0e80f27fcd48f2bfee895461631367
test outcome: killed
convert_base.py, start pos: (10, 49), end pos: (10, 50)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)-i>>1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

15 : Job ID 3a65c77058a142fb9ded22fd080da77a
test outcome: killed
convert_base.py, start pos: (10, 47), end pos: (10, 48)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)<<i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F.F..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - ValueError: negative s...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_digit - ValueErr...
========================= 2 failed, 3 passed in 0.15s ==========================

16 : Job ID 94792de78b694eb19e070acd2dad886b
test outcome: killed
convert_base.py, start pos: (10, 49), end pos: (10, 50)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)-i<<1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.14s ==========================

17 : Job ID 4ff84b9efd92475182959fd63b7981de
test outcome: killed
convert_base.py, start pos: (10, 47), end pos: (10, 48)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)|i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

18 : Job ID 9ce40a8457e14720abef9de91149d8c4
test outcome: killed
convert_base.py, start pos: (10, 49), end pos: (10, 50)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)-i|1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

19 : Job ID 39d87b919e5e47d0bbef2821f7a07e3c
test outcome: killed
convert_base.py, start pos: (10, 47), end pos: (10, 48)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)&i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

20 : Job ID 0ed8dde400ab4503ac689331506bd805
test outcome: killed
convert_base.py, start pos: (10, 49), end pos: (10, 50)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)-i&1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

21 : Job ID 867346d797ec4c77b284f495225a3240
test outcome: killed
convert_base.py, start pos: (10, 47), end pos: (10, 48)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)^i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

22 : Job ID cca8bd54c1ca4276906868b6f705a06b
test outcome: killed
convert_base.py, start pos: (10, 49), end pos: (10, 50)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)-i^1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.14s ==========================

23 : Job ID 1a93e2ee317f4d52940a587360191693
test outcome: killed
convert_base.py, start pos: (10, 27), end pos: (10, 28)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val + (base ** (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

24 : Job ID edc83abf224c4365b277a434766ab4ef
test outcome: killed
convert_base.py, start pos: (10, 27), end pos: (10, 28)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val - (base ** (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.14s ==========================

25 : Job ID 5f9f44864a1e425fb149aeee5f13e242
test outcome: killed
convert_base.py, start pos: (10, 27), end pos: (10, 28)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val / (base ** (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.14s ==========================

26 : Job ID 0338399a40af4589b703317856ac0208
test outcome: killed
convert_base.py, start pos: (10, 27), end pos: (10, 28)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val // (base ** (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.14s ==========================

27 : Job ID a853a98a13724a4894b9b9b528f1f0a7
test outcome: killed
convert_base.py, start pos: (10, 27), end pos: (10, 28)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val % (base ** (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

28 : Job ID cf38d09fdb0d484c999f4e9ea1595e2e
test outcome: killed
convert_base.py, start pos: (10, 27), end pos: (10, 28)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val ** (base ** (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

29 : Job ID 343a311900904e47bf6d0fe736ca6975
test outcome: killed
convert_base.py, start pos: (10, 27), end pos: (10, 28)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val >> (base ** (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

30 : Job ID 2f3b126b60054dec9ee055df9302e757
test outcome: killed
convert_base.py, start pos: (10, 27), end pos: (10, 28)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val << (base ** (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.18s ==========================

31 : Job ID 4223bbb406e94cc488ecc44695ac89a7
test outcome: killed
convert_base.py, start pos: (10, 27), end pos: (10, 28)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val | (base ** (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

32 : Job ID aa384e7b96574253a5043abea7f42edb
test outcome: killed
convert_base.py, start pos: (10, 27), end pos: (10, 28)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val & (base ** (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

33 : Job ID e88bb0d7cffc4e79adf77f1094c7ab48
test outcome: killed
convert_base.py, start pos: (10, 27), end pos: (10, 28)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val ^ (base ** (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

34 : Job ID 0251556bd68046f8bd9b4ae0152e1489
test outcome: killed
convert_base.py, start pos: (10, 35), end pos: (10, 37)
operator: core/ReplaceBinaryOperator_Pow_Add, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base + (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

35 : Job ID ef6f003a7bac47b7942abd745d4c32e5
test outcome: killed
convert_base.py, start pos: (10, 35), end pos: (10, 37)
operator: core/ReplaceBinaryOperator_Pow_Sub, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base - (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.16s ==========================
