36 : Job ID 1e22621a13684f379cbccb0c8f12c153
test outcome: killed
convert_base.py, start pos: (10, 35), end pos: (10, 37)
operator: core/ReplaceBinaryOperator_Pow_Mul, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base * (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

37 : Job ID a2d84e35d2064af5ad5bc207eba81331
test outcome: killed
convert_base.py, start pos: (10, 35), end pos: (10, 37)
operator: core/ReplaceBinaryOperator_Pow_Div, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base / (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - ZeroDivisionError: div...
========================= 1 failed, 4 passed in 0.14s ==========================

38 : Job ID 683b4c37365d4a19815b973ced7a35a9
test outcome: killed
convert_base.py, start pos: (10, 35), end pos: (10, 37)
operator: core/ReplaceBinaryOperator_Pow_FloorDiv, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base // (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - ZeroDivisionError: int...
========================= 1 failed, 4 passed in 0.15s ==========================

39 : Job ID 264767192dec4473aa35df8194ee70bf
test outcome: killed
convert_base.py, start pos: (10, 35), end pos: (10, 37)
operator: core/ReplaceBinaryOperator_Pow_Mod, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base % (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - ZeroDivisionError: int...
========================= 1 failed, 4 passed in 0.16s ==========================

40 : Job ID ee259e6d708b49ba8a8eb96360f0db43
test outcome: killed
convert_base.py, start pos: (10, 35), end pos: (10, 37)
operator: core/ReplaceBinaryOperator_Pow_RShift, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base >> (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.14s ==========================

41 : Job ID d17c905373ea45538ef18fed2ed124f9
test outcome: killed
convert_base.py, start pos: (10, 35), end pos: (10, 37)
operator: core/ReplaceBinaryOperator_Pow_LShift, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base << (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

42 : Job ID 09f19899de7649b1bf37a17c4018a5fb
test outcome: killed
convert_base.py, start pos: (10, 35), end pos: (10, 37)
operator: core/ReplaceBinaryOperator_Pow_BitOr, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base | (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

43 : Job ID 6d2dccf8932d43da80a4eabe05fb6c38
test outcome: killed
convert_base.py, start pos: (10, 35), end pos: (10, 37)
operator: core/ReplaceBinaryOperator_Pow_BitAnd, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base & (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

44 : Job ID f22b3097d88f4833b93deebdc7c29a6c
test outcome: killed
convert_base.py, start pos: (10, 35), end pos: (10, 37)
operator: core/ReplaceBinaryOperator_Pow_BitXor, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ^ (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

45 : Job ID cd1cce3b0b1f457e8d8ae52272552ebd
test outcome: killed
convert_base.py, start pos: (2, 39), end pos: (2, 41)
operator: core/ReplaceComparisonOperator_NotEq_Eq, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if base < 0 or (base > 10 and base ==16):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py FF...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_base - Assertion...
========================= 2 failed, 3 passed in 0.15s ==========================

46 : Job ID 1f2d4242af864adb997b830d16be4a62
test outcome: killed
convert_base.py, start pos: (15, 17), end pos: (15, 19)
operator: core/ReplaceComparisonOperator_NotEq_Eq, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -12,7 +12,7 @@
 def convert_digit_to_int(char: str):
-    if len(char) != 1 or ord(char) > ord('f'):
+    if len(char) == 1 or ord(char) > ord('f'):
         return -1
     return int(char,16)
ts-3-5/test_3-5_0-6_181.py F..F.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int - AssertionError...
========================= 2 failed, 3 passed in 0.15s ==========================

47 : Job ID cec9d74fdda2415aa4b57ae4147f8ffb
SURVIVED
test outcome: survived
convert_base.py, start pos: (2, 39), end pos: (2, 41)
operator: core/ReplaceComparisonOperator_NotEq_Lt, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if base < 0 or (base > 10 and base <16):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py .....                                         [100%]
============================== 5 passed in 0.16s ===============================

48 : Job ID 372e005b81c744888e437f5ca3609634
SURVIVED
test outcome: survived
convert_base.py, start pos: (15, 17), end pos: (15, 19)
operator: core/ReplaceComparisonOperator_NotEq_Lt, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -12,7 +12,7 @@
 def convert_digit_to_int(char: str):
-    if len(char) != 1 or ord(char) > ord('f'):
+    if len(char) < 1 or ord(char) > ord('f'):
         return -1
     return int(char,16)
ts-3-5/test_3-5_0-6_181.py .....                                         [100%]
============================== 5 passed in 0.15s ===============================

49 : Job ID ec57d0a575a5464199e11fb62184fd43
test outcome: killed
convert_base.py, start pos: (2, 39), end pos: (2, 41)
operator: core/ReplaceComparisonOperator_NotEq_LtE, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if base < 0 or (base > 10 and base <=16):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.16s ==========================

50 : Job ID 36e82ed73a534d7fb24bd5efa791ca66
test outcome: killed
convert_base.py, start pos: (15, 17), end pos: (15, 19)
operator: core/ReplaceComparisonOperator_NotEq_LtE, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -12,7 +12,7 @@
 def convert_digit_to_int(char: str):
-    if len(char) != 1 or ord(char) > ord('f'):
+    if len(char) <= 1 or ord(char) > ord('f'):
         return -1
     return int(char,16)
ts-3-5/test_3-5_0-6_181.py F..F.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int - AssertionError...
========================= 2 failed, 3 passed in 0.15s ==========================

51 : Job ID 07e36825b1fe4e34a418f764646d3a4c
test outcome: killed
convert_base.py, start pos: (2, 39), end pos: (2, 41)
operator: core/ReplaceComparisonOperator_NotEq_Gt, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if base < 0 or (base > 10 and base >16):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py .F...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_base - Assertion...
========================= 1 failed, 4 passed in 0.15s ==========================

52 : Job ID ddbdc107e92643b7bb3ba80eec90ea11
SURVIVED
test outcome: survived
convert_base.py, start pos: (15, 17), end pos: (15, 19)
operator: core/ReplaceComparisonOperator_NotEq_Gt, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -12,7 +12,7 @@
 def convert_digit_to_int(char: str):
-    if len(char) != 1 or ord(char) > ord('f'):
+    if len(char) > 1 or ord(char) > ord('f'):
         return -1
     return int(char,16)
ts-3-5/test_3-5_0-6_181.py .....                                         [100%]
============================== 5 passed in 0.15s ===============================

53 : Job ID 2309c9c55d804d4fa51b296db90afcdc
test outcome: killed
convert_base.py, start pos: (2, 39), end pos: (2, 41)
operator: core/ReplaceComparisonOperator_NotEq_GtE, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if base < 0 or (base > 10 and base >=16):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py FF...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_base - Assertion...
========================= 2 failed, 3 passed in 0.15s ==========================

54 : Job ID c53625fd4c2e448eb426b982f3b5dafd
test outcome: killed
convert_base.py, start pos: (15, 17), end pos: (15, 19)
operator: core/ReplaceComparisonOperator_NotEq_GtE, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -12,7 +12,7 @@
 def convert_digit_to_int(char: str):
-    if len(char) != 1 or ord(char) > ord('f'):
+    if len(char) >= 1 or ord(char) > ord('f'):
         return -1
     return int(char,16)
ts-3-5/test_3-5_0-6_181.py F..F.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int - AssertionError...
========================= 2 failed, 3 passed in 0.15s ==========================

55 : Job ID 0b08afd11ec04e50a44a79404682847c
SURVIVED
test outcome: survived
convert_base.py, start pos: (2, 12), end pos: (2, 13)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if base == 0 or (base > 10 and base !=16):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py .....                                         [100%]
============================== 5 passed in 0.15s ===============================

56 : Job ID d5d94857afb946da88fd11309a700d1f
test outcome: killed
convert_base.py, start pos: (7, 21), end pos: (7, 22)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -4,7 +4,7 @@
     value = 0
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
-        if digit_val < 0 or digit_val > base:
+        if digit_val == 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
         value += digit_val * (base ** (len(val)-i-1))
ts-3-5/test_3-5_0-6_181.py F.F..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_digit - Assertio...
========================= 2 failed, 3 passed in 0.15s ==========================

57 : Job ID 923cad1f05a64e26bd2a9c3e20398685
test outcome: killed
convert_base.py, start pos: (2, 12), end pos: (2, 13)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if base != 0 or (base > 10 and base !=16):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

58 : Job ID dc5fdd625ce9435e9f6995d98d5cd334
test outcome: killed
convert_base.py, start pos: (7, 21), end pos: (7, 22)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -4,7 +4,7 @@
     value = 0
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
-        if digit_val < 0 or digit_val > base:
+        if digit_val != 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
         value += digit_val * (base ** (len(val)-i-1))
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

59 : Job ID 5f4454701aba45b5b7be34dd2e53058a
SURVIVED
test outcome: survived
convert_base.py, start pos: (2, 12), end pos: (2, 13)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if base <= 0 or (base > 10 and base !=16):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py .....                                         [100%]
============================== 5 passed in 0.15s ===============================

60 : Job ID 3d4191e47435466387859b8155727ad3
test outcome: killed
convert_base.py, start pos: (7, 21), end pos: (7, 22)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -4,7 +4,7 @@
     value = 0
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
-        if digit_val < 0 or digit_val > base:
+        if digit_val <= 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
         value += digit_val * (base ** (len(val)-i-1))
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.14s ==========================

61 : Job ID 7b0c4f1cc515401c9caefe922511baf9
test outcome: killed
convert_base.py, start pos: (2, 12), end pos: (2, 13)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if base > 0 or (base > 10 and base !=16):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

62 : Job ID 127807f8449d4698af41ebb93a5234d5
test outcome: killed
convert_base.py, start pos: (7, 21), end pos: (7, 22)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -4,7 +4,7 @@
     value = 0
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
-        if digit_val < 0 or digit_val > base:
+        if digit_val > 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
         value += digit_val * (base ** (len(val)-i-1))
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

63 : Job ID 15ff587e975a47deb3d633cc076e284e
test outcome: killed
convert_base.py, start pos: (2, 12), end pos: (2, 13)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if base >= 0 or (base > 10 and base !=16):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

64 : Job ID f02025c2356340ec972b345184b5fe10
test outcome: killed
convert_base.py, start pos: (7, 21), end pos: (7, 22)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -4,7 +4,7 @@
     value = 0
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
-        if digit_val < 0 or digit_val > base:
+        if digit_val >= 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
         value += digit_val * (base ** (len(val)-i-1))
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

65 : Job ID 6b41adc976a24eafb6ed508b5707365e
test outcome: killed
convert_base.py, start pos: (2, 25), end pos: (2, 26)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if base < 0 or (base == 10 and base !=16):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py FF...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_base - Assertion...
========================= 2 failed, 3 passed in 0.15s ==========================

66 : Job ID becc9482ca394cbd89a8944e1c03bfbd
SURVIVED
test outcome: survived
convert_base.py, start pos: (7, 38), end pos: (7, 39)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -4,7 +4,7 @@
     value = 0
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
-        if digit_val < 0 or digit_val > base:
+        if digit_val < 0 or digit_val == base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
         value += digit_val * (base ** (len(val)-i-1))
ts-3-5/test_3-5_0-6_181.py .....                                         [100%]
============================== 5 passed in 0.14s ===============================

67 : Job ID 6ee7aec9e1ba48cfbd672856f839bf11
test outcome: killed
convert_base.py, start pos: (15, 35), end pos: (15, 36)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 2
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -12,7 +12,7 @@
 def convert_digit_to_int(char: str):
-    if len(char) != 1 or ord(char) > ord('f'):
+    if len(char) != 1 or ord(char) == ord('f'):
         return -1
     return int(char,16)
ts-3-5/test_3-5_0-6_181.py F.FFF                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_digit - ValueErr...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int - AssertionError...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int_invalid - ValueE...
========================= 4 failed, 1 passed in 0.16s ==========================

68 : Job ID 27a542891f0a422ea9a1a6e82f19cbf0
test outcome: killed
convert_base.py, start pos: (2, 25), end pos: (2, 26)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if base < 0 or (base != 10 and base !=16):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.16s ==========================

69 : Job ID 79ef5cd15dad4d858585afb1b21a4029
test outcome: killed
convert_base.py, start pos: (7, 38), end pos: (7, 39)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -4,7 +4,7 @@
     value = 0
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
-        if digit_val < 0 or digit_val > base:
+        if digit_val < 0 or digit_val != base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
         value += digit_val * (base ** (len(val)-i-1))
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

70 : Job ID 7cd7feebdaf540648563d209a667491a
test outcome: killed
convert_base.py, start pos: (15, 35), end pos: (15, 36)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 2
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -12,7 +12,7 @@
 def convert_digit_to_int(char: str):
-    if len(char) != 1 or ord(char) > ord('f'):
+    if len(char) != 1 or ord(char) != ord('f'):
         return -1
     return int(char,16)
ts-3-5/test_3-5_0-6_181.py F..F.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int - AssertionError...
========================= 2 failed, 3 passed in 0.14s ==========================

71 : Job ID 4d9ed89247ce4429bbb3bf4d943ee71d
test outcome: killed
convert_base.py, start pos: (2, 25), end pos: (2, 26)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if base < 0 or (base < 10 and base !=16):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py FF...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_base - Assertion...
========================= 2 failed, 3 passed in 0.15s ==========================
