72 : Job ID 8bc1ecf2a73d48d88d48f9862737ce7c
test outcome: killed
convert_base.py, start pos: (7, 38), end pos: (7, 39)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -4,7 +4,7 @@
     value = 0
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
-        if digit_val < 0 or digit_val > base:
+        if digit_val < 0 or digit_val < base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
         value += digit_val * (base ** (len(val)-i-1))
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

73 : Job ID 80c713426ba64aee8c658e19f8f47d27
test outcome: killed
convert_base.py, start pos: (15, 35), end pos: (15, 36)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 2
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -12,7 +12,7 @@
 def convert_digit_to_int(char: str):
-    if len(char) != 1 or ord(char) > ord('f'):
+    if len(char) != 1 or ord(char) < ord('f'):
         return -1
     return int(char,16)
ts-3-5/test_3-5_0-6_181.py F..FF                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int - AssertionError...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int_invalid - ValueE...
========================= 3 failed, 2 passed in 0.15s ==========================

74 : Job ID 86122001d01a4e36964334bf172a7f99
test outcome: killed
convert_base.py, start pos: (2, 25), end pos: (2, 26)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if base < 0 or (base <= 10 and base !=16):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py FF...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_base - Assertion...
========================= 2 failed, 3 passed in 0.15s ==========================

75 : Job ID 00c356b01f0047cfb02a4af7e9a9eb2c
test outcome: killed
convert_base.py, start pos: (7, 38), end pos: (7, 39)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -4,7 +4,7 @@
     value = 0
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
-        if digit_val < 0 or digit_val > base:
+        if digit_val < 0 or digit_val <= base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
         value += digit_val * (base ** (len(val)-i-1))
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.14s ==========================

76 : Job ID 5addb21afd1c45ed928f7994605a0f9d
test outcome: killed
convert_base.py, start pos: (15, 35), end pos: (15, 36)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 2
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -12,7 +12,7 @@
 def convert_digit_to_int(char: str):
-    if len(char) != 1 or ord(char) > ord('f'):
+    if len(char) != 1 or ord(char) <= ord('f'):
         return -1
     return int(char,16)
ts-3-5/test_3-5_0-6_181.py F..FF                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int - AssertionError...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int_invalid - ValueE...
========================= 3 failed, 2 passed in 0.15s ==========================

77 : Job ID 3bd466d18eab448095cab172c3c62a54
test outcome: killed
convert_base.py, start pos: (2, 25), end pos: (2, 26)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if base < 0 or (base >= 10 and base !=16):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

78 : Job ID e70fd5d69fd84845a643b6edd6ded1a3
SURVIVED
test outcome: survived
convert_base.py, start pos: (7, 38), end pos: (7, 39)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -4,7 +4,7 @@
     value = 0
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
-        if digit_val < 0 or digit_val > base:
+        if digit_val < 0 or digit_val >= base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
         value += digit_val * (base ** (len(val)-i-1))
ts-3-5/test_3-5_0-6_181.py .....                                         [100%]
============================== 5 passed in 0.15s ===============================

79 : Job ID 34b17d8552fb46369213c4aaaf961dbc
test outcome: killed
convert_base.py, start pos: (15, 35), end pos: (15, 36)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 2
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -12,7 +12,7 @@
 def convert_digit_to_int(char: str):
-    if len(char) != 1 or ord(char) > ord('f'):
+    if len(char) != 1 or ord(char) >= ord('f'):
         return -1
     return int(char,16)
ts-3-5/test_3-5_0-6_181.py F..F.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int - AssertionError...
========================= 2 failed, 3 passed in 0.15s ==========================

80 : Job ID e6cf57183feb4f40842964d3acfcb1e9
SURVIVED
test outcome: survived
convert_base.py, start pos: (7, 38), end pos: (7, 39)
operator: core/ReplaceComparisonOperator_Gt_Is, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -4,7 +4,7 @@
     value = 0
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
-        if digit_val < 0 or digit_val > base:
+        if digit_val < 0 or digit_val is base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
         value += digit_val * (base ** (len(val)-i-1))
ts-3-5/test_3-5_0-6_181.py .....                                         [100%]
============================== 5 passed in 0.15s ===============================

81 : Job ID 767cf3cf12484e5db073f118e168378c
test outcome: killed
convert_base.py, start pos: (15, 35), end pos: (15, 36)
operator: core/ReplaceComparisonOperator_Gt_Is, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -12,7 +12,7 @@
 def convert_digit_to_int(char: str):
-    if len(char) != 1 or ord(char) > ord('f'):
+    if len(char) != 1 or ord(char) is ord('f'):
         return -1
     return int(char,16)
ts-3-5/test_3-5_0-6_181.py F.FFF                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_digit - ValueErr...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int - AssertionError...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int_invalid - ValueE...
========================= 4 failed, 1 passed in 0.15s ==========================

82 : Job ID a662167bb0794cdbbe31c9d09c2d06ad
test outcome: killed
convert_base.py, start pos: (7, 38), end pos: (7, 39)
operator: core/ReplaceComparisonOperator_Gt_IsNot, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -4,7 +4,7 @@
     value = 0
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
-        if digit_val < 0 or digit_val > base:
+        if digit_val < 0 or digit_val is not base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
         value += digit_val * (base ** (len(val)-i-1))
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

83 : Job ID 604c2207af564b19ad9c23e36ac5e4b9
test outcome: killed
convert_base.py, start pos: (15, 35), end pos: (15, 36)
operator: core/ReplaceComparisonOperator_Gt_IsNot, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -12,7 +12,7 @@
 def convert_digit_to_int(char: str):
-    if len(char) != 1 or ord(char) > ord('f'):
+    if len(char) != 1 or ord(char) is not ord('f'):
         return -1
     return int(char,16)
ts-3-5/test_3-5_0-6_181.py F..F.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int - AssertionError...
========================= 2 failed, 3 passed in 0.15s ==========================

84 : Job ID 31bfb545672940efbbf41f4f760bb6e4
test outcome: killed
convert_base.py, start pos: (3, 15), end pos: (3, 16)
operator: core/ReplaceUnaryOperator_USub_UAdd, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,6 +1,6 @@
 def convert_base(val: str, base: int):
     if base < 0 or (base > 10 and base !=16):
-        return -1
+        return +1
     value = 0
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
ts-3-5/test_3-5_0-6_181.py .F...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_base - Assertion...
========================= 1 failed, 4 passed in 0.15s ==========================

85 : Job ID c7e8d64d8f3e4b3e9b489e0159526ddf
test outcome: killed
convert_base.py, start pos: (8, 19), end pos: (8, 20)
operator: core/ReplaceUnaryOperator_USub_UAdd, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -5,7 +5,7 @@
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
         if digit_val < 0 or digit_val > base:
-            return -1
+            return +1
         # print(digit_val, base ** (len(val)-i-1))
         value += digit_val * (base ** (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py ..F..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_digit - Assertio...
========================= 1 failed, 4 passed in 0.16s ==========================

86 : Job ID 924fc86edc5540b1a37b0a48d3b9a324
test outcome: killed
convert_base.py, start pos: (16, 15), end pos: (16, 16)
operator: core/ReplaceUnaryOperator_USub_UAdd, occurrence: 2
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -13,6 +13,6 @@
 def convert_digit_to_int(char: str):
     if len(char) != 1 or ord(char) > ord('f'):
-        return -1
+        return +1
     return int(char,16)
ts-3-5/test_3-5_0-6_181.py ..F.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_digit - Assertio...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int_invalid - Assert...
========================= 2 failed, 3 passed in 0.15s ==========================

87 : Job ID e0523652ce164e158e6d1d7097e188a1
test outcome: killed
convert_base.py, start pos: (3, 15), end pos: (3, 16)
operator: core/ReplaceUnaryOperator_USub_Invert, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,6 +1,6 @@
 def convert_base(val: str, base: int):
     if base < 0 or (base > 10 and base !=16):
-        return -1
+        return ~1
     value = 0
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
ts-3-5/test_3-5_0-6_181.py .F...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_base - Assertion...
========================= 1 failed, 4 passed in 0.16s ==========================

88 : Job ID 9f586ce4bfa2471a9d300a8224336bc3
test outcome: killed
convert_base.py, start pos: (8, 19), end pos: (8, 20)
operator: core/ReplaceUnaryOperator_USub_Invert, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -5,7 +5,7 @@
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
         if digit_val < 0 or digit_val > base:
-            return -1
+            return ~1
         # print(digit_val, base ** (len(val)-i-1))
         value += digit_val * (base ** (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py ..F..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_digit - Assertio...
========================= 1 failed, 4 passed in 0.16s ==========================

89 : Job ID c954ee39cdc945edbbdd98407bda44f7
test outcome: killed
convert_base.py, start pos: (16, 15), end pos: (16, 16)
operator: core/ReplaceUnaryOperator_USub_Invert, occurrence: 2
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -13,6 +13,6 @@
 def convert_digit_to_int(char: str):
     if len(char) != 1 or ord(char) > ord('f'):
-        return -1
+        return ~1
     return int(char,16)
ts-3-5/test_3-5_0-6_181.py ....F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int_invalid - Assert...
========================= 1 failed, 4 passed in 0.14s ==========================

90 : Job ID c50bffd7f277408098763828d2ca46bc
test outcome: killed
convert_base.py, start pos: (3, 15), end pos: (3, 16)
operator: core/ReplaceUnaryOperator_USub_Not, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,6 +1,6 @@
 def convert_base(val: str, base: int):
     if base < 0 or (base > 10 and base !=16):
-        return -1
+        return not 1
     value = 0
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
ts-3-5/test_3-5_0-6_181.py .F...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_base - Assertion...
========================= 1 failed, 4 passed in 0.14s ==========================

91 : Job ID ea59229d9c6d42a5a97f34fe36d9cc8d
test outcome: killed
convert_base.py, start pos: (8, 19), end pos: (8, 20)
operator: core/ReplaceUnaryOperator_USub_Not, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -5,7 +5,7 @@
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
         if digit_val < 0 or digit_val > base:
-            return -1
+            return not 1
         # print(digit_val, base ** (len(val)-i-1))
         value += digit_val * (base ** (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py ..F..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_digit - Assertio...
========================= 1 failed, 4 passed in 0.15s ==========================

92 : Job ID 0f776adec2ae4cb687f791a814a2810e
test outcome: killed
convert_base.py, start pos: (16, 15), end pos: (16, 16)
operator: core/ReplaceUnaryOperator_USub_Not, occurrence: 2
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -13,6 +13,6 @@
 def convert_digit_to_int(char: str):
     if len(char) != 1 or ord(char) > ord('f'):
-        return -1
+        return not 1
     return int(char,16)
ts-3-5/test_3-5_0-6_181.py ..F.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_digit - Assertio...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int_invalid - Assert...
========================= 2 failed, 3 passed in 0.15s ==========================

93 : Job ID a29d7292e2ca475b9fdc704e2e16baa0
test outcome: killed
convert_base.py, start pos: (3, 15), end pos: (3, 16)
operator: core/ReplaceUnaryOperator_Delete_USub, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,6 +1,6 @@
 def convert_base(val: str, base: int):
     if base < 0 or (base > 10 and base !=16):
-        return -1
+        return 1
     value = 0
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
ts-3-5/test_3-5_0-6_181.py .F...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_base - Assertion...
========================= 1 failed, 4 passed in 0.15s ==========================

94 : Job ID b5aa4f0167fb41b8a0a3e655a4312d51
test outcome: killed
convert_base.py, start pos: (8, 19), end pos: (8, 20)
operator: core/ReplaceUnaryOperator_Delete_USub, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -5,7 +5,7 @@
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
         if digit_val < 0 or digit_val > base:
-            return -1
+            return 1
         # print(digit_val, base ** (len(val)-i-1))
         value += digit_val * (base ** (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py ..F..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_digit - Assertio...
========================= 1 failed, 4 passed in 0.15s ==========================

95 : Job ID 2916d30826794c46adf41385b6e2305d
test outcome: killed
convert_base.py, start pos: (16, 15), end pos: (16, 16)
operator: core/ReplaceUnaryOperator_Delete_USub, occurrence: 2
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -13,6 +13,6 @@
 def convert_digit_to_int(char: str):
     if len(char) != 1 or ord(char) > ord('f'):
-        return -1
+        return 1
     return int(char,16)
ts-3-5/test_3-5_0-6_181.py ..F.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_digit - Assertio...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int_invalid - Assert...
========================= 2 failed, 3 passed in 0.14s ==========================

96 : Job ID 693ded524ffd444bb6445133a8d6baa6
test outcome: killed
convert_base.py, start pos: (2, 7), end pos: (2, 44)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if not base < 0 or (base > 10 and base !=16):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.14s ==========================

97 : Job ID 3a6c7e0878134139aa9b5d0ede0c801b
test outcome: killed
convert_base.py, start pos: (7, 11), end pos: (7, 44)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -4,7 +4,7 @@
     value = 0
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
-        if digit_val < 0 or digit_val > base:
+        if not digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
         value += digit_val * (base ** (len(val)-i-1))
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

98 : Job ID cccc12b17a3744c4a14548eb50d7d238
test outcome: killed
convert_base.py, start pos: (15, 7), end pos: (15, 45)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -12,7 +12,7 @@
 def convert_digit_to_int(char: str):
-    if len(char) != 1 or ord(char) > ord('f'):
+    if not len(char) != 1 or ord(char) > ord('f'):
         return -1
     return int(char,16)
ts-3-5/test_3-5_0-6_181.py F..F.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int - AssertionError...
========================= 2 failed, 3 passed in 0.15s ==========================

99 : Job ID ec3b03ec063d4f288d4e5cdd69dc5352
test outcome: killed
convert_base.py, start pos: (2, 30), end pos: (2, 33)
operator: core/ReplaceAndWithOr, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if base < 0 or (base > 10 or base !=16):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

100 : Job ID a563a04ec62b43c2876430c666e18af3
test outcome: killed
convert_base.py, start pos: (2, 16), end pos: (2, 18)
operator: core/ReplaceOrWithAnd, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if base < 0 and (base > 10 and base !=16):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py .F...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_base - Assertion...
========================= 1 failed, 4 passed in 0.17s ==========================

101 : Job ID 8c059b7c984142f9943dc29b7b683d06
test outcome: killed
convert_base.py, start pos: (7, 25), end pos: (7, 27)
operator: core/ReplaceOrWithAnd, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -4,7 +4,7 @@
     value = 0
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
-        if digit_val < 0 or digit_val > base:
+        if digit_val < 0 and digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
         value += digit_val * (base ** (len(val)-i-1))
ts-3-5/test_3-5_0-6_181.py ..F..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_digit - Assertio...
========================= 1 failed, 4 passed in 0.15s ==========================

102 : Job ID 8fae6fcabbc1474eaa8912a293676f0f
test outcome: killed
convert_base.py, start pos: (15, 22), end pos: (15, 24)
operator: core/ReplaceOrWithAnd, occurrence: 2
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -12,7 +12,7 @@
 def convert_digit_to_int(char: str):
-    if len(char) != 1 or ord(char) > ord('f'):
+    if len(char) != 1 and ord(char) > ord('f'):
         return -1
     return int(char,16)
ts-3-5/test_3-5_0-6_181.py ..F.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_digit - ValueErr...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int_invalid - ValueE...
========================= 2 failed, 3 passed in 0.16s ==========================

103 : Job ID 50b5f00ffb404b33b85eed091adb73cd
SURVIVED
test outcome: survived
convert_base.py, start pos: (2, 14), end pos: (2, 15)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if base < 1 or (base > 10 and base !=16):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py .....                                         [100%]
============================== 5 passed in 0.15s ===============================

104 : Job ID 6078785be740400c95ef232cd64a7ade
SURVIVED
test outcome: survived
convert_base.py, start pos: (2, 14), end pos: (2, 15)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if base < -1 or (base > 10 and base !=16):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py .....                                         [100%]
============================== 5 passed in 0.14s ===============================

105 : Job ID 169a96c22238444b81857edd9ec01310
test outcome: killed
convert_base.py, start pos: (2, 27), end pos: (2, 29)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if base < 0 or (base > 11 and base !=16):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py .F...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_base - Assertion...
========================= 1 failed, 4 passed in 0.15s ==========================

106 : Job ID 9bbf7dda89d54af18327d80e61c37cf6
test outcome: killed
convert_base.py, start pos: (2, 27), end pos: (2, 29)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if base < 0 or (base > 9 and base !=16):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.16s ==========================

107 : Job ID 94b46c245b0e407b9010e2943998fbb1
test outcome: killed
convert_base.py, start pos: (2, 41), end pos: (2, 43)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if base < 0 or (base > 10 and base != 17):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================
