108 : Job ID 094298602ac64d378dcef0017e144740
test outcome: killed
convert_base.py, start pos: (2, 41), end pos: (2, 43)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,5 +1,5 @@
 def convert_base(val: str, base: int):
-    if base < 0 or (base > 10 and base !=16):
+    if base < 0 or (base > 10 and base != 15):
         return -1
     value = 0
     for i, digit in enumerate(val):
ts-3-5/test_3-5_0-6_181.py FF...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_base - Assertion...
========================= 2 failed, 3 passed in 0.15s ==========================

109 : Job ID b0dbfa8fa0104f08901151ab417d86a6
test outcome: killed
convert_base.py, start pos: (3, 16), end pos: (3, 17)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,6 +1,6 @@
 def convert_base(val: str, base: int):
     if base < 0 or (base > 10 and base !=16):
-        return -1
+        return - 2
     value = 0
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
ts-3-5/test_3-5_0-6_181.py .F...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_base - Assertion...
========================= 1 failed, 4 passed in 0.15s ==========================

110 : Job ID 421bbeb003dd42f5a2ede8774615ed0d
test outcome: killed
convert_base.py, start pos: (3, 16), end pos: (3, 17)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,6 +1,6 @@
 def convert_base(val: str, base: int):
     if base < 0 or (base > 10 and base !=16):
-        return -1
+        return - 0
     value = 0
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
ts-3-5/test_3-5_0-6_181.py .F...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_base - Assertion...
========================= 1 failed, 4 passed in 0.15s ==========================

111 : Job ID 5dccb6c446a646a3a438cdb656d669a8
test outcome: killed
convert_base.py, start pos: (4, 12), end pos: (4, 13)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,7 +1,7 @@
 def convert_base(val: str, base: int):
     if base < 0 or (base > 10 and base !=16):
         return -1
-    value = 0
+    value = 1
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
         if digit_val < 0 or digit_val > base:
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.16s ==========================

112 : Job ID 5156b8c5ff784975baa896a591334eea
test outcome: killed
convert_base.py, start pos: (4, 12), end pos: (4, 13)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -1,7 +1,7 @@
 def convert_base(val: str, base: int):
     if base < 0 or (base > 10 and base !=16):
         return -1
-    value = 0
+    value = -1
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
         if digit_val < 0 or digit_val > base:
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

113 : Job ID 90e3af8db1df4dad80aeb1c49fd805de
test outcome: killed
convert_base.py, start pos: (7, 23), end pos: (7, 24)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -4,7 +4,7 @@
     value = 0
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
-        if digit_val < 0 or digit_val > base:
+        if digit_val < 1 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
         value += digit_val * (base ** (len(val)-i-1))
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

114 : Job ID ead1916f85824c56aaa1188692fcee45
test outcome: killed
convert_base.py, start pos: (7, 23), end pos: (7, 24)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -4,7 +4,7 @@
     value = 0
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
-        if digit_val < 0 or digit_val > base:
+        if digit_val < -1 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
         value += digit_val * (base ** (len(val)-i-1))
ts-3-5/test_3-5_0-6_181.py ..F..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_digit - Assertio...
========================= 1 failed, 4 passed in 0.15s ==========================

115 : Job ID 3f87bbe6d5844ff98b14f654beccc11b
test outcome: killed
convert_base.py, start pos: (8, 20), end pos: (8, 21)
operator: core/NumberReplacer, occurrence: 12
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -5,7 +5,7 @@
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
         if digit_val < 0 or digit_val > base:
-            return -1
+            return - 2
         # print(digit_val, base ** (len(val)-i-1))
         value += digit_val * (base ** (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py ..F..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_digit - Assertio...
========================= 1 failed, 4 passed in 0.15s ==========================

116 : Job ID 798bfe2dbfe74f72a1b59b4007a525d9
test outcome: killed
convert_base.py, start pos: (8, 20), end pos: (8, 21)
operator: core/NumberReplacer, occurrence: 13
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -5,7 +5,7 @@
     for i, digit in enumerate(val):
         digit_val = convert_digit_to_int(digit)
         if digit_val < 0 or digit_val > base:
-            return -1
+            return - 0
         # print(digit_val, base ** (len(val)-i-1))
         value += digit_val * (base ** (len(val)-i-1))
     return value
ts-3-5/test_3-5_0-6_181.py ..F..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_digit - Assertio...
========================= 1 failed, 4 passed in 0.15s ==========================

117 : Job ID 25f12952da794845bad6eea47930de89
test outcome: killed
convert_base.py, start pos: (10, 50), end pos: (10, 51)
operator: core/NumberReplacer, occurrence: 14
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)-i- 2))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

118 : Job ID c6332091c3914f15942b3a72d3ecf79e
test outcome: killed
convert_base.py, start pos: (10, 50), end pos: (10, 51)
operator: core/NumberReplacer, occurrence: 15
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -7,7 +7,7 @@
         if digit_val < 0 or digit_val > base:
             return -1
         # print(digit_val, base ** (len(val)-i-1))
-        value += digit_val * (base ** (len(val)-i-1))
+        value += digit_val * (base ** (len(val)-i- 0))
     return value
ts-3-5/test_3-5_0-6_181.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
========================= 1 failed, 4 passed in 0.15s ==========================

119 : Job ID bd6460655a3a499d9332b62b9447fc0f
test outcome: killed
convert_base.py, start pos: (15, 20), end pos: (15, 21)
operator: core/NumberReplacer, occurrence: 16
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -12,7 +12,7 @@
 def convert_digit_to_int(char: str):
-    if len(char) != 1 or ord(char) > ord('f'):
+    if len(char) != 2 or ord(char) > ord('f'):
         return -1
     return int(char,16)
ts-3-5/test_3-5_0-6_181.py F..F.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int - AssertionError...
========================= 2 failed, 3 passed in 0.16s ==========================

120 : Job ID 140ba49d31a344dd839b2287a57b2d18
test outcome: killed
convert_base.py, start pos: (15, 20), end pos: (15, 21)
operator: core/NumberReplacer, occurrence: 17
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -12,7 +12,7 @@
 def convert_digit_to_int(char: str):
-    if len(char) != 1 or ord(char) > ord('f'):
+    if len(char) != 0 or ord(char) > ord('f'):
         return -1
     return int(char,16)
ts-3-5/test_3-5_0-6_181.py F..F.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int - AssertionError...
========================= 2 failed, 3 passed in 0.15s ==========================

121 : Job ID 8d07571f898548b0939ed7b5048ee933
test outcome: killed
convert_base.py, start pos: (16, 16), end pos: (16, 17)
operator: core/NumberReplacer, occurrence: 18
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -13,6 +13,6 @@
 def convert_digit_to_int(char: str):
     if len(char) != 1 or ord(char) > ord('f'):
-        return -1
+        return - 2
     return int(char,16)
ts-3-5/test_3-5_0-6_181.py ....F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int_invalid - Assert...
========================= 1 failed, 4 passed in 0.14s ==========================

122 : Job ID 9bce1e8099ee4ecdb32186a0fc7d8bb4
test outcome: killed
convert_base.py, start pos: (16, 16), end pos: (16, 17)
operator: core/NumberReplacer, occurrence: 19
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -13,6 +13,6 @@
 def convert_digit_to_int(char: str):
     if len(char) != 1 or ord(char) > ord('f'):
-        return -1
+        return - 0
     return int(char,16)
ts-3-5/test_3-5_0-6_181.py ..F.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_digit - Assertio...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int_invalid - Assert...
========================= 2 failed, 3 passed in 0.16s ==========================

123 : Job ID 58eb8199712f427a9cb7b40ef760f790
SURVIVED
test outcome: survived
convert_base.py, start pos: (17, 20), end pos: (17, 22)
operator: core/NumberReplacer, occurrence: 20
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -14,5 +14,5 @@
 def convert_digit_to_int(char: str):
     if len(char) != 1 or ord(char) > ord('f'):
         return -1
-    return int(char,16)
+    return int(char, 17)
ts-3-5/test_3-5_0-6_181.py .....                                         [100%]
============================== 5 passed in 0.15s ===============================

124 : Job ID 04115c294a89429b84cc294d99a0f04b
test outcome: killed
convert_base.py, start pos: (17, 20), end pos: (17, 22)
operator: core/NumberReplacer, occurrence: 21
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -14,5 +14,5 @@
 def convert_digit_to_int(char: str):
     if len(char) != 1 or ord(char) > ord('f'):
         return -1
-    return int(char,16)
+    return int(char, 15)
ts-3-5/test_3-5_0-6_181.py F..F.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - ValueError: invalid li...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_digit_to_int - ValueError: in...
========================= 2 failed, 3 passed in 0.15s ==========================

125 : Job ID bb61120380e542b9a2944f9ab02d859a
test outcome: killed
convert_base.py, start pos: (5, 20), end pos: (5, 34)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- aconvert_base.py
+++ bconvert_base.py
@@ -2,7 +2,7 @@
     if base < 0 or (base > 10 and base !=16):
         return -1
     value = 0
-    for i, digit in enumerate(val):
+    for i, digit in []:
         digit_val = convert_digit_to_int(digit)
         if digit_val < 0 or digit_val > base:
             return -1
ts-3-5/test_3-5_0-6_181.py F.F..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base - AssertionError: assert...
FAILED ts-3-5/test_3-5_0-6_181.py::test_convert_base_invalid_digit - Assertio...
========================= 2 failed, 3 passed in 0.15s ==========================
