   - [#   1] AOD convert_base: 
--------------------------------------------------------------------------------
   1: def convert_base(val: str, base: int):
   2:     if (base < 0 or (base > 10 and base != 16)):
-  3:         return -1
+  3:         return 1
   4:     value = 0
   5:     for (i, digit) in enumerate(val):
   6:         digit_val = convert_digit_to_int(digit)
   7:         if (digit_val < 0 or digit_val > base):
--------------------------------------------------------------------------------
[0.19956 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base_invalid_base

def test_convert_base_invalid_base():
>       assert convert_base("1010", -1) == -1
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:16: AssertionError

   - [#   2] AOD convert_base: 
--------------------------------------------------------------------------------
   4:     value = 0
   5:     for (i, digit) in enumerate(val):
   6:         digit_val = convert_digit_to_int(digit)
   7:         if (digit_val < 0 or digit_val > base):
-  8:             return -1
+  8:             return 1
   9:         
  10:         value += digit_val * (base ** ((len(val) - i) - 1))
  11:     return value
  12: 
--------------------------------------------------------------------------------
[0.19519 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base_invalid_digit

def test_convert_base_invalid_digit():
>       assert convert_base("12g", 16) == -1
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:21: AssertionError

   - [#   3] AOD convert_base: 
--------------------------------------------------------------------------------
  12: 
  13: 
  14: def convert_digit_to_int(char: str):
  15:     if (len(char) != 1 or ord(char) > ord('f')):
- 16:         return -1
+ 16:         return 1
  17:     return int(char, 16)
--------------------------------------------------------------------------------
[0.19647 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base_invalid_digit

def test_convert_base_invalid_digit():
>       assert convert_base("12g", 16) == -1
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:21: AssertionError

   - [#   4] AOR convert_base: 
--------------------------------------------------------------------------------
   1: def convert_base(val: str, base: int):
   2:     if (base < 0 or (base > 10 and base != 16)):
-  3:         return -1
+  3:         return +1
   4:     value = 0
   5:     for (i, digit) in enumerate(val):
   6:         digit_val = convert_digit_to_int(digit)
   7:         if (digit_val < 0 or digit_val > base):
--------------------------------------------------------------------------------
[0.20652 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base_invalid_base

def test_convert_base_invalid_base():
>       assert convert_base("1010", -1) == -1
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:16: AssertionError

   - [#   5] AOR convert_base: 
--------------------------------------------------------------------------------
   4:     value = 0
   5:     for (i, digit) in enumerate(val):
   6:         digit_val = convert_digit_to_int(digit)
   7:         if (digit_val < 0 or digit_val > base):
-  8:             return -1
+  8:             return +1
   9:         
  10:         value += digit_val * (base ** ((len(val) - i) - 1))
  11:     return value
  12: 
--------------------------------------------------------------------------------
[0.20345 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base_invalid_digit

def test_convert_base_invalid_digit():
>       assert convert_base("12g", 16) == -1
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:21: AssertionError

   - [#   6] AOR convert_base: 
--------------------------------------------------------------------------------
   6:         digit_val = convert_digit_to_int(digit)
   7:         if (digit_val < 0 or digit_val > base):
   8:             return -1
   9:         
- 10:         value += digit_val * (base ** ((len(val) - i) - 1))
+ 10:         value += digit_val / (base ** ((len(val) - i) - 1))
  11:     return value
  12: 
  13: 
  14: def convert_digit_to_int(char: str):
--------------------------------------------------------------------------------
[0.20660 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
>       assert convert_base("1010", 2) == 10
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:10: AssertionError

   - [#   7] AOR convert_base: 
--------------------------------------------------------------------------------
   6:         digit_val = convert_digit_to_int(digit)
   7:         if (digit_val < 0 or digit_val > base):
   8:             return -1
   9:         
- 10:         value += digit_val * (base ** ((len(val) - i) - 1))
+ 10:         value += digit_val // (base ** ((len(val) - i) - 1))
  11:     return value
  12: 
  13: 
  14: def convert_digit_to_int(char: str):
--------------------------------------------------------------------------------
[0.20174 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
>       assert convert_base("1010", 2) == 10
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:10: AssertionError

   - [#   8] AOR convert_base: 
--------------------------------------------------------------------------------
   6:         digit_val = convert_digit_to_int(digit)
   7:         if (digit_val < 0 or digit_val > base):
   8:             return -1
   9:         
- 10:         value += digit_val * (base ** ((len(val) - i) - 1))
+ 10:         value += digit_val ** (base ** ((len(val) - i) - 1))
  11:     return value
  12: 
  13: 
  14: def convert_digit_to_int(char: str):
--------------------------------------------------------------------------------
[0.20320 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
>       assert convert_base("1010", 2) == 10
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:10: AssertionError

   - [#   9] AOR convert_base: 
--------------------------------------------------------------------------------
   6:         digit_val = convert_digit_to_int(digit)
   7:         if (digit_val < 0 or digit_val > base):
   8:             return -1
   9:         
- 10:         value += digit_val * (base ** ((len(val) - i) - 1))
+ 10:         value += digit_val * (base * ((len(val) - i) - 1))
  11:     return value
  12: 
  13: 
  14: def convert_digit_to_int(char: str):
--------------------------------------------------------------------------------
[0.19162 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
>       assert convert_base("1010", 2) == 10
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:10: AssertionError

   - [#  10] AOR convert_base: 
--------------------------------------------------------------------------------
   6:         digit_val = convert_digit_to_int(digit)
   7:         if (digit_val < 0 or digit_val > base):
   8:             return -1
   9:         
- 10:         value += digit_val * (base ** ((len(val) - i) - 1))
+ 10:         value += digit_val * (base ** ((len(val) + i) - 1))
  11:     return value
  12: 
  13: 
  14: def convert_digit_to_int(char: str):
--------------------------------------------------------------------------------
[0.19056 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
>       assert convert_base("1010", 2) == 10
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:10: AssertionError

   - [#  11] AOR convert_base: 
--------------------------------------------------------------------------------
   6:         digit_val = convert_digit_to_int(digit)
   7:         if (digit_val < 0 or digit_val > base):
   8:             return -1
   9:         
- 10:         value += digit_val * (base ** ((len(val) - i) - 1))
+ 10:         value += digit_val * (base ** ((len(val) - i) + 1))
  11:     return value
  12: 
  13: 
  14: def convert_digit_to_int(char: str):
--------------------------------------------------------------------------------
[0.20968 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
>       assert convert_base("1010", 2) == 10
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:10: AssertionError

   - [#  12] AOR convert_base: 
--------------------------------------------------------------------------------
  12: 
  13: 
  14: def convert_digit_to_int(char: str):
  15:     if (len(char) != 1 or ord(char) > ord('f')):
- 16:         return -1
+ 16:         return +1
  17:     return int(char, 16)
--------------------------------------------------------------------------------
[0.20254 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base_invalid_digit

def test_convert_base_invalid_digit():
>       assert convert_base("12g", 16) == -1
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:21: AssertionError

   - [#  13] ASR convert_base: 
--------------------------------------------------------------------------------
   6:         digit_val = convert_digit_to_int(digit)
   7:         if (digit_val < 0 or digit_val > base):
   8:             return -1
   9:         
- 10:         value += digit_val * (base ** ((len(val) - i) - 1))
+ 10:         value -= digit_val * (base ** ((len(val) - i) - 1))
  11:     return value
  12: 
  13: 
  14: def convert_digit_to_int(char: str):
--------------------------------------------------------------------------------
[0.20182 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
>       assert convert_base("1010", 2) == 10
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:10: AssertionError

   - [#  14] COI convert_base: 
--------------------------------------------------------------------------------
   1: def convert_base(val: str, base: int):
-  2:     if (base < 0 or (base > 10 and base != 16)):
+  2:     if not ((base < 0 or (base > 10 and base != 16))):
   3:         return -1
   4:     value = 0
   5:     for (i, digit) in enumerate(val):
   6:         digit_val = convert_digit_to_int(digit)
--------------------------------------------------------------------------------
[0.20101 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
>       assert convert_base("1010", 2) == 10
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:10: AssertionError

   - [#  15] COI convert_base: 
--------------------------------------------------------------------------------
   3:         return -1
   4:     value = 0
   5:     for (i, digit) in enumerate(val):
   6:         digit_val = convert_digit_to_int(digit)
-  7:         if (digit_val < 0 or digit_val > base):
+  7:         if not ((digit_val < 0 or digit_val > base)):
   8:             return -1
   9:         
  10:         value += digit_val * (base ** ((len(val) - i) - 1))
  11:     return value
--------------------------------------------------------------------------------
[0.20397 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
>       assert convert_base("1010", 2) == 10
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:10: AssertionError

   - [#  16] COI convert_base: 
--------------------------------------------------------------------------------
  11:     return value
  12: 
  13: 
  14: def convert_digit_to_int(char: str):
- 15:     if (len(char) != 1 or ord(char) > ord('f')):
+ 15:     if not ((len(char) != 1 or ord(char) > ord('f'))):
  16:         return -1
  17:     return int(char, 16)
--------------------------------------------------------------------------------
[0.20737 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
>       assert convert_base("1010", 2) == 10
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:10: AssertionError

   - [#  17] LCR convert_base: 
--------------------------------------------------------------------------------
   1: def convert_base(val: str, base: int):
-  2:     if (base < 0 or (base > 10 and base != 16)):
+  2:     if (base < 0 and (base > 10 and base != 16)):
   3:         return -1
   4:     value = 0
   5:     for (i, digit) in enumerate(val):
   6:         digit_val = convert_digit_to_int(digit)
--------------------------------------------------------------------------------
[0.18948 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base_invalid_base

def test_convert_base_invalid_base():
        assert convert_base("1010", -1) == -1
>       assert convert_base("1010", 11) == -1
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:17: AssertionError

   - [#  18] LCR convert_base: 
--------------------------------------------------------------------------------
   1: def convert_base(val: str, base: int):
-  2:     if (base < 0 or (base > 10 and base != 16)):
+  2:     if (base < 0 or (base > 10 or base != 16)):
   3:         return -1
   4:     value = 0
   5:     for (i, digit) in enumerate(val):
   6:         digit_val = convert_digit_to_int(digit)
--------------------------------------------------------------------------------
[0.19908 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
>       assert convert_base("1010", 2) == 10
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:10: AssertionError

   - [#  19] LCR convert_base: 
--------------------------------------------------------------------------------
   3:         return -1
   4:     value = 0
   5:     for (i, digit) in enumerate(val):
   6:         digit_val = convert_digit_to_int(digit)
-  7:         if (digit_val < 0 or digit_val > base):
+  7:         if (digit_val < 0 and digit_val > base):
   8:             return -1
   9:         
  10:         value += digit_val * (base ** ((len(val) - i) - 1))
  11:     return value
--------------------------------------------------------------------------------
[0.19978 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base_invalid_digit

def test_convert_base_invalid_digit():
>       assert convert_base("12g", 16) == -1
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:21: AssertionError

   - [#  20] LCR convert_base: 
--------------------------------------------------------------------------------
  11:     return value
  12: 
  13: 
  14: def convert_digit_to_int(char: str):
- 15:     if (len(char) != 1 or ord(char) > ord('f')):
+ 15:     if (len(char) != 1 and ord(char) > ord('f')):
  16:         return -1
  17:     return int(char, 16)
--------------------------------------------------------------------------------
[0.19749 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base_invalid_digit

def test_convert_base_invalid_digit():
>       assert convert_base("12g", 16) == -1

ts-3-5/test_3-5_0-2_81.py:21: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
convert_base:6: in convert_base
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

char = 'g'

>   ???
E   ValueError: invalid literal for int() with base 16: 'g'

convert_base:17: ValueError

   - [#  21] OIL convert_base: 
--------------------------------------------------------------------------------
   7:         if (digit_val < 0 or digit_val > base):
   8:             return -1
   9:         
  10:         value += digit_val * (base ** ((len(val) - i) - 1))
- 11:     return value
- 12: 
+ 11:         break
+ 12:     return value
  13: 
  14: def convert_digit_to_int(char: str):
  15:     if (len(char) != 1 or ord(char) > ord('f')):
  16:         return -1
--------------------------------------------------------------------------------
[0.20290 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
>       assert convert_base("1010", 2) == 10
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:10: AssertionError

   - [#  23] ROR convert_base: 
--------------------------------------------------------------------------------
   1: def convert_base(val: str, base: int):
-  2:     if (base < 0 or (base > 10 and base != 16)):
+  2:     if (base > 0 or (base > 10 and base != 16)):
   3:         return -1
   4:     value = 0
   5:     for (i, digit) in enumerate(val):
   6:         digit_val = convert_digit_to_int(digit)
--------------------------------------------------------------------------------
[0.19535 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
>       assert convert_base("1010", 2) == 10
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:10: AssertionError

   - [#  24] ROR convert_base: 
--------------------------------------------------------------------------------
   1: def convert_base(val: str, base: int):
-  2:     if (base < 0 or (base > 10 and base != 16)):
+  2:     if (base <= 0 or (base > 10 and base != 16)):
   3:         return -1
   4:     value = 0
   5:     for (i, digit) in enumerate(val):
   6:         digit_val = convert_digit_to_int(digit)
--------------------------------------------------------------------------------
[0.17747 s] survived

   - [#  25] ROR convert_base: 
--------------------------------------------------------------------------------
   1: def convert_base(val: str, base: int):
-  2:     if (base < 0 or (base > 10 and base != 16)):
+  2:     if (base < 0 or (base < 10 and base != 16)):
   3:         return -1
   4:     value = 0
   5:     for (i, digit) in enumerate(val):
   6:         digit_val = convert_digit_to_int(digit)
--------------------------------------------------------------------------------
[0.19427 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
>       assert convert_base("1010", 2) == 10
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:10: AssertionError

   - [#  26] ROR convert_base: 
--------------------------------------------------------------------------------
   1: def convert_base(val: str, base: int):
-  2:     if (base < 0 or (base > 10 and base != 16)):
+  2:     if (base < 0 or (base >= 10 and base != 16)):
   3:         return -1
   4:     value = 0
   5:     for (i, digit) in enumerate(val):
   6:         digit_val = convert_digit_to_int(digit)
--------------------------------------------------------------------------------
[0.18782 s] survived

   - [#  27] ROR convert_base: 
--------------------------------------------------------------------------------
   1: def convert_base(val: str, base: int):
-  2:     if (base < 0 or (base > 10 and base != 16)):
+  2:     if (base < 0 or (base > 10 and base == 16)):
   3:         return -1
   4:     value = 0
   5:     for (i, digit) in enumerate(val):
   6:         digit_val = convert_digit_to_int(digit)
--------------------------------------------------------------------------------
[0.19349 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
        assert convert_base("1010", 2) == 10
>       assert convert_base("ff", 16) == 255
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:11: AssertionError

   - [#  28] ROR convert_base: 
--------------------------------------------------------------------------------
   3:         return -1
   4:     value = 0
   5:     for (i, digit) in enumerate(val):
   6:         digit_val = convert_digit_to_int(digit)
-  7:         if (digit_val < 0 or digit_val > base):
+  7:         if (digit_val > 0 or digit_val > base):
   8:             return -1
   9:         
  10:         value += digit_val * (base ** ((len(val) - i) - 1))
  11:     return value
--------------------------------------------------------------------------------
[0.19748 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
>       assert convert_base("1010", 2) == 10
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:10: AssertionError

   - [#  29] ROR convert_base: 
--------------------------------------------------------------------------------
   3:         return -1
   4:     value = 0
   5:     for (i, digit) in enumerate(val):
   6:         digit_val = convert_digit_to_int(digit)
-  7:         if (digit_val < 0 or digit_val > base):
+  7:         if (digit_val <= 0 or digit_val > base):
   8:             return -1
   9:         
  10:         value += digit_val * (base ** ((len(val) - i) - 1))
  11:     return value
--------------------------------------------------------------------------------
[0.19952 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
>       assert convert_base("1010", 2) == 10
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:10: AssertionError

   - [#  30] ROR convert_base: 
--------------------------------------------------------------------------------
   3:         return -1
   4:     value = 0
   5:     for (i, digit) in enumerate(val):
   6:         digit_val = convert_digit_to_int(digit)
-  7:         if (digit_val < 0 or digit_val > base):
+  7:         if (digit_val < 0 or digit_val < base):
   8:             return -1
   9:         
  10:         value += digit_val * (base ** ((len(val) - i) - 1))
  11:     return value
--------------------------------------------------------------------------------
[0.19470 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
>       assert convert_base("1010", 2) == 10
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:10: AssertionError

   - [#  31] ROR convert_base: 
--------------------------------------------------------------------------------
   3:         return -1
   4:     value = 0
   5:     for (i, digit) in enumerate(val):
   6:         digit_val = convert_digit_to_int(digit)
-  7:         if (digit_val < 0 or digit_val > base):
+  7:         if (digit_val < 0 or digit_val >= base):
   8:             return -1
   9:         
  10:         value += digit_val * (base ** ((len(val) - i) - 1))
  11:     return value
--------------------------------------------------------------------------------
[0.18271 s] survived

   - [#  32] ROR convert_base: 
--------------------------------------------------------------------------------
  11:     return value
  12: 
  13: 
  14: def convert_digit_to_int(char: str):
- 15:     if (len(char) != 1 or ord(char) > ord('f')):
+ 15:     if (len(char) == 1 or ord(char) > ord('f')):
  16:         return -1
  17:     return int(char, 16)
--------------------------------------------------------------------------------
[0.19334 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
>       assert convert_base("1010", 2) == 10
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:10: AssertionError

   - [#  33] ROR convert_base: 
--------------------------------------------------------------------------------
  11:     return value
  12: 
  13: 
  14: def convert_digit_to_int(char: str):
- 15:     if (len(char) != 1 or ord(char) > ord('f')):
+ 15:     if (len(char) != 1 or ord(char) < ord('f')):
  16:         return -1
  17:     return int(char, 16)
--------------------------------------------------------------------------------
[0.19771 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
>       assert convert_base("1010", 2) == 10
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:10: AssertionError

   - [#  34] ROR convert_base: 
--------------------------------------------------------------------------------
  11:     return value
  12: 
  13: 
  14: def convert_digit_to_int(char: str):
- 15:     if (len(char) != 1 or ord(char) > ord('f')):
+ 15:     if (len(char) != 1 or ord(char) >= ord('f')):
  16:         return -1
  17:     return int(char, 16)
--------------------------------------------------------------------------------
[0.19894 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
        assert convert_base("1010", 2) == 10
>       assert convert_base("ff", 16) == 255
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:11: AssertionError

   - [#  35] SDL convert_base: 
--------------------------------------------------------------------------------
   1: def convert_base(val: str, base: int):
   2:     if (base < 0 or (base > 10 and base != 16)):
-  3:         return -1
+  3:         pass
   4:     value = 0
   5:     for (i, digit) in enumerate(val):
   6:         digit_val = convert_digit_to_int(digit)
   7:         if (digit_val < 0 or digit_val > base):
--------------------------------------------------------------------------------
[0.19717 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base_invalid_base

def test_convert_base_invalid_base():
        assert convert_base("1010", -1) == -1
>       assert convert_base("1010", 11) == -1
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:17: AssertionError

   - [#  36] SDL convert_base: 
--------------------------------------------------------------------------------
   1: def convert_base(val: str, base: int):
   2:     if (base < 0 or (base > 10 and base != 16)):
   3:         return -1
-  4:     value = 0
+  4:     pass
   5:     for (i, digit) in enumerate(val):
   6:         digit_val = convert_digit_to_int(digit)
   7:         if (digit_val < 0 or digit_val > base):
   8:             return -1
--------------------------------------------------------------------------------
[0.20089 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
>       assert convert_base("1010", 2) == 10

ts-3-5/test_3-5_0-2_81.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

val = '1010', base = 2

>   ???
E   UnboundLocalError: local variable 'value' referenced before assignment

convert_base:10: UnboundLocalError

   - [#  37] SDL convert_base: 
--------------------------------------------------------------------------------
   2:     if (base < 0 or (base > 10 and base != 16)):
   3:         return -1
   4:     value = 0
   5:     for (i, digit) in enumerate(val):
-  6:         digit_val = convert_digit_to_int(digit)
+  6:         pass
   7:         if (digit_val < 0 or digit_val > base):
   8:             return -1
   9:         
  10:         value += digit_val * (base ** ((len(val) - i) - 1))
--------------------------------------------------------------------------------
[0.19162 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
>       assert convert_base("1010", 2) == 10

ts-3-5/test_3-5_0-2_81.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

val = '1010', base = 2

>   ???
E   NameError: name 'digit_val' is not defined

convert_base:7: NameError

   - [#  38] SDL convert_base: 
--------------------------------------------------------------------------------
   4:     value = 0
   5:     for (i, digit) in enumerate(val):
   6:         digit_val = convert_digit_to_int(digit)
   7:         if (digit_val < 0 or digit_val > base):
-  8:             return -1
+  8:             pass
   9:         
  10:         value += digit_val * (base ** ((len(val) - i) - 1))
  11:     return value
  12: 
--------------------------------------------------------------------------------
[0.19789 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base_invalid_digit

def test_convert_base_invalid_digit():
>       assert convert_base("12g", 16) == -1
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:21: AssertionError

   - [#  39] SDL convert_base: 
--------------------------------------------------------------------------------
   7:         if (digit_val < 0 or digit_val > base):
   8:             return -1
   9:         
  10:         value += digit_val * (base ** ((len(val) - i) - 1))
- 11:     return value
+ 11:     pass
  12: 
  13: 
  14: def convert_digit_to_int(char: str):
  15:     if (len(char) != 1 or ord(char) > ord('f')):
--------------------------------------------------------------------------------
[0.19558 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
>       assert convert_base("1010", 2) == 10
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:10: AssertionError

   - [#  40] SDL convert_base: 
--------------------------------------------------------------------------------
  12: 
  13: 
  14: def convert_digit_to_int(char: str):
  15:     if (len(char) != 1 or ord(char) > ord('f')):
- 16:         return -1
+ 16:         pass
  17:     return int(char, 16)
--------------------------------------------------------------------------------
[0.19278 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base_invalid_digit

def test_convert_base_invalid_digit():
>       assert convert_base("12g", 16) == -1

ts-3-5/test_3-5_0-2_81.py:21: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
convert_base:6: in convert_base
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

char = 'g'

>   ???
E   ValueError: invalid literal for int() with base 16: 'g'

convert_base:17: ValueError

   - [#  42] ZIL convert_base: 
--------------------------------------------------------------------------------
   2:     if (base < 0 or (base > 10 and base != 16)):
   3:         return -1
   4:     value = 0
   5:     for (i, digit) in enumerate(val):
-  6:         digit_val = convert_digit_to_int(digit)
-  7:         if (digit_val < 0 or digit_val > base):
-  8:             return -1
-  9:         
- 10:         value += digit_val * (base ** ((len(val) - i) - 1))
+  6:         break
+  7:     
+  8:     
+  9:     
+ 10:     
  11:     return value
  12: 
  13: 
  14: def convert_digit_to_int(char: str):
--------------------------------------------------------------------------------
[0.19209 s] killed by ts-3-5/test_3-5_0-2_81.py::test_convert_base

def test_convert_base():
>       assert convert_base("1010", 2) == 10
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:10: AssertionError
