   - [#  38] SVD deque: 
--------------------------------------------------------------------------------
  54:         return None
  55:     
  56:     def size(self):
  57:         '''Return the count of items in the queue.'''
- 58:         return self._container._length
+ 58:         return _container._length
--------------------------------------------------------------------------------
[0.08363 s] killed by ALL-SMART/test_deque_MOSA.py::test_case_0

def test_case_0():
        deque_0 = module_0.Deque()
        var_0 = deque_0.peekleft()
        var_1 = deque_0.append(deque_0)
        var_2 = deque_0.peek()
        assert f'{type(var_2).__module__}.{type(var_2).__qualname__}' == 'deque.Deque'
        var_3 = var_2.popleft()
        assert f'{type(var_3).__module__}.{type(var_3).__qualname__}' == 'deque.Deque'
>       var_4 = deque_0.size()

ALL-SMART/test_deque_MOSA.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <deque.Deque object at 0x771b3785a560>

>   ???
E   NameError: name '_container' is not defined

deque:58: NameError
