1 : Job ID 94509db581ca43c6bc713f1c31383dce
test outcome: killed
deque.py, start pos: (46, 11), end pos: (46, 31)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- adeque.py
+++ bdeque.py
@@ -43,7 +43,7 @@
     def peek(self):
         """Return the next value that would be returned by pop."""
-        if self._container.head:
+        if not self._container.head:
             return self._container.head.data
         return None
ts-3-5/test_3-5_0-7_231.py ........FF....                                [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_231.py::test_peek - assert None == 1
FAILED ts-3-5/test_3-5_0-7_231.py::test_peek_empty - AttributeError: 'NoneTyp...
========================= 2 failed, 12 passed in 0.16s =========================

2 : Job ID 9c19ebb9dd75442fbdf23d173eadb1f7
test outcome: killed
deque.py, start pos: (52, 11), end pos: (52, 31)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- adeque.py
+++ bdeque.py
@@ -49,7 +49,7 @@
     def peekleft(self):
         """Return the next value from the front of the deque."""
-        if self._container.tail:
+        if not self._container.tail:
             return self._container.tail.data
         return None
ts-3-5/test_3-5_0-7_231.py ..........FF..                                [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_231.py::test_peekleft - assert None == 1
FAILED ts-3-5/test_3-5_0-7_231.py::test_peekleft_empty - AttributeError: 'Non...
========================= 2 failed, 12 passed in 0.16s =========================
