1 : Job ID 76af87aace7d4b81b73f768ffab7008c
test outcome: killed
depth_first_search.py, start pos: (32, 86), end pos: (32, 87)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]-1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py F...F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - assert Non...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 2 failed, 3 passed in 0.08s ==========================

2 : Job ID 504cdeb62bf740e0a32682646628a4cb
test outcome: killed
depth_first_search.py, start pos: (32, 125), end pos: (32, 126)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 1
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]-1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py F...F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - assert Non...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 2 failed, 3 passed in 0.09s ==========================

3 : Job ID a2b96457217a40f39ee28b50a2b57597
test outcome: killed
depth_first_search.py, start pos: (32, 86), end pos: (32, 87)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]*1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py F...F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - assert Non...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 2 failed, 3 passed in 0.09s ==========================

4 : Job ID 21eea3b62e7648ab94b176db5dbe6162
test outcome: killed
depth_first_search.py, start pos: (32, 125), end pos: (32, 126)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 1
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]*1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py F...F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - assert Non...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 2 failed, 3 passed in 0.10s ==========================

5 : Job ID 4da04e5674324693a3a60df812dca261
test outcome: killed
depth_first_search.py, start pos: (32, 86), end pos: (32, 87)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]/1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py FF..F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - TypeError:...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_not_found - TypeEr...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - TypeE...
========================= 3 failed, 2 passed in 0.09s ==========================

6 : Job ID e278ca0f2c21481fb600eb55133fdbd6
test outcome: killed
depth_first_search.py, start pos: (32, 125), end pos: (32, 126)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 1
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]/1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py FF..F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - TypeError:...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_not_found - TypeEr...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - TypeE...
========================= 3 failed, 2 passed in 0.08s ==========================

7 : Job ID d9f0a48d3d2245eab39f392d1b4f7973
test outcome: killed
depth_first_search.py, start pos: (32, 86), end pos: (32, 87)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]//1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py F...F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - assert Non...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 2 failed, 3 passed in 0.09s ==========================

8 : Job ID 15e86a7703fd41479aa2b7e9de521f31
test outcome: killed
depth_first_search.py, start pos: (32, 125), end pos: (32, 126)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 1
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]//1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py F...F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - assert Non...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 2 failed, 3 passed in 0.09s ==========================

9 : Job ID 907880dc611348f39a8a84863f222763
test outcome: killed
depth_first_search.py, start pos: (32, 86), end pos: (32, 87)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]%1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py F...F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - assert Non...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 2 failed, 3 passed in 0.09s ==========================

10 : Job ID d1159fe61aaa4094885f54329fea7bb0
test outcome: killed
depth_first_search.py, start pos: (32, 125), end pos: (32, 126)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 1
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]%1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py F...F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - assert Non...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 2 failed, 3 passed in 0.09s ==========================

11 : Job ID ea4c039356c74b2fa4e544a12aeea0a8
test outcome: killed
depth_first_search.py, start pos: (32, 86), end pos: (32, 87)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]**1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py F...F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - assert Non...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 2 failed, 3 passed in 0.09s ==========================

12 : Job ID 3ef5a2454c384e29abecbe7821fced14
test outcome: killed
depth_first_search.py, start pos: (32, 125), end pos: (32, 126)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 1
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]**1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py F...F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - assert Non...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 2 failed, 3 passed in 0.09s ==========================

13 : Job ID 4c436a18c2f94a21a954f1d7c59db1b7
test outcome: killed
depth_first_search.py, start pos: (32, 86), end pos: (32, 87)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]>>1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py F...F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - assert Non...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 2 failed, 3 passed in 0.09s ==========================

14 : Job ID c585409294d14e52ac2eae0bd36d67fc
test outcome: killed
depth_first_search.py, start pos: (32, 125), end pos: (32, 126)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 1
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]>>1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py F...F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - assert Non...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 2 failed, 3 passed in 0.09s ==========================

15 : Job ID f552e3e65c994a38ab2b8f17652e3314
test outcome: killed
depth_first_search.py, start pos: (32, 86), end pos: (32, 87)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]<<1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py F...F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - assert Non...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 2 failed, 3 passed in 0.09s ==========================

16 : Job ID f273d9ef09e14082b998554a3d611f0b
test outcome: killed
depth_first_search.py, start pos: (32, 125), end pos: (32, 126)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 1
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]<<1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py F...F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - assert Non...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 2 failed, 3 passed in 0.09s ==========================

17 : Job ID e11b36d5d5634885832d07d6142a23a1
test outcome: killed
depth_first_search.py, start pos: (32, 86), end pos: (32, 87)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]|1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py ....F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 1 failed, 4 passed in 0.09s ==========================

18 : Job ID 88cc378682454147a72b6781d4f0bdd8
test outcome: killed
depth_first_search.py, start pos: (32, 125), end pos: (32, 126)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 1
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]|1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py ....F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 1 failed, 4 passed in 0.11s ==========================

19 : Job ID d4113a6132054b46a557a9c3932a67e5
test outcome: killed
depth_first_search.py, start pos: (32, 86), end pos: (32, 87)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]&1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py F...F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - assert Non...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 2 failed, 3 passed in 0.09s ==========================

20 : Job ID 55a49fcd77944a0dae03af157044ae8d
test outcome: killed
depth_first_search.py, start pos: (32, 125), end pos: (32, 126)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 1
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]&1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py F...F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - assert Non...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 2 failed, 3 passed in 0.09s ==========================

21 : Job ID e14a5fad779f4b72b6fd0fb0c38167af
test outcome: killed
depth_first_search.py, start pos: (32, 86), end pos: (32, 87)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]^1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py ....F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 1 failed, 4 passed in 0.08s ==========================

22 : Job ID 04309d0dffb8496197b6118065ef902e
test outcome: killed
depth_first_search.py, start pos: (32, 125), end pos: (32, 126)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 1
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]^1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py ....F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 1 failed, 4 passed in 0.08s ==========================

23 : Job ID 16aa075da33047118e61f29e1f985a26
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 44), end pos: (32, 45)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 0
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]+1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

24 : Job ID 7e5dac520f654b88a3d8686acdf978e5
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 59), end pos: (32, 60)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 1
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]+1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

27 : Job ID 09c0f938f76b412e9dcb3f838db9194a
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 44), end pos: (32, 45)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 0
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]*1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

28 : Job ID 42bf3856d1ec416298515748b122b0ec
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 59), end pos: (32, 60)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 1
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]*1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.08s ===============================
