31 : Job ID 3f00f426313548f4be4ef1d080b41058
test outcome: killed
depth_first_search.py, start pos: (32, 44), end pos: (32, 45)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 0
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]/1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py FF..F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - TypeError:...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_not_found - TypeEr...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - TypeE...
========================= 3 failed, 2 passed in 0.09s ==========================

32 : Job ID c2cb9305654b463aae621aa6eae7a60c
test outcome: killed
depth_first_search.py, start pos: (32, 59), end pos: (32, 60)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 1
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]/1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py FF..F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - TypeError:...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_not_found - TypeEr...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - TypeE...
========================= 3 failed, 2 passed in 0.09s ==========================

35 : Job ID cf5e3e9c5d7a45bf8026141540b085aa
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 44), end pos: (32, 45)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 0
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]//1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

36 : Job ID f574ef9368514e8598859ce416b3d2b7
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 59), end pos: (32, 60)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 1
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]//1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

39 : Job ID 29f7b8f3ccb94b0eb316a2341b2933ce
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 44), end pos: (32, 45)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 0
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]%1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

40 : Job ID 50a4ac17196c47dab41e12c73b7c11aa
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 59), end pos: (32, 60)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 1
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]%1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

43 : Job ID 0c7229f9aee3480b880414325c9c9855
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 44), end pos: (32, 45)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 0
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]**1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

44 : Job ID db3c37625dbe40269bed6b1eca087923
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 59), end pos: (32, 60)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 1
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]**1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.08s ===============================

47 : Job ID c6ccfd77ef62488a8a61f70fa5f490bc
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 44), end pos: (32, 45)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 0
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]>>1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

48 : Job ID 596d2ad90caf45ee9f57b48e3d751ddf
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 59), end pos: (32, 60)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 1
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]>>1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.08s ===============================

51 : Job ID cffe31d6d19147feaf81a9181b851213
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 44), end pos: (32, 45)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 0
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]<<1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

52 : Job ID d30fe91b7b8e413a90edbea788d5740e
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 59), end pos: (32, 60)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 1
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]<<1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

55 : Job ID c0e13dfd7fe34ab7a1cb807a2a70e6d7
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 44), end pos: (32, 45)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 0
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]|1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.08s ===============================

56 : Job ID b0fac3dc6757490ea919b614ee211a24
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 59), end pos: (32, 60)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 1
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]|1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.08s ===============================

59 : Job ID 7ade2abc71894380b9ea3e79b580fd9d
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 44), end pos: (32, 45)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 0
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]&1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

60 : Job ID 2fd414d110ac48e5a3403029ff8eafc1
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 59), end pos: (32, 60)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 1
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]&1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

63 : Job ID 86c6a48a97734583bef075d9f9b3984c
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 44), end pos: (32, 45)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 0
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]^1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.08s ===============================

64 : Job ID 39ba1a2bc6da4de399bfda64dcaff6f4
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 59), end pos: (32, 60)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 1
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]^1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

108 : Job ID e5e194664aee49f0a44dcc515015c0ee
test outcome: killed
depth_first_search.py, start pos: (29, 10), end pos: (29, 15)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -26,7 +26,7 @@
     stack = [(x_start, y_start)]
     visited.add((x_start, y_start))
-    while stack:
+    while not stack:
         current = stack.pop()
         for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
ts-3-5/test_3-5_1-0_328.py F...F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - assert Non...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 2 failed, 3 passed in 0.09s ==========================

122 : Job ID 28aa8de93b3f41fe87f9a863613e79bc
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 30), end pos: (32, 31)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[ 1], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.08s ===============================

123 : Job ID 88d44d397c224bd09440dba6eb710563
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 30), end pos: (32, 31)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[ -1], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

124 : Job ID 3c1f62b81a6842e88a41195668c149d0
test outcome: killed
depth_first_search.py, start pos: (32, 42), end pos: (32, 43)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[ 2]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py FF..F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - IndexError...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_not_found - IndexE...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - Index...
========================= 3 failed, 2 passed in 0.09s ==========================

125 : Job ID 90f9eb108fc04e9099a79f461907936d
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 42), end pos: (32, 43)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[ 0]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

126 : Job ID b858aef20bbc4071bf32c1400fe8d493
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 45), end pos: (32, 46)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]- 2),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

127 : Job ID dad6d842477d4e81b79c7c8c0b043f48
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 45), end pos: (32, 46)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]- 0),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.08s ===============================

128 : Job ID bcfe8fd98207452d897d3a026dea4c1a
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 57), end pos: (32, 58)
operator: core/NumberReplacer, occurrence: 12
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[ 1]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.08s ===============================

129 : Job ID 17901feccf49438e8c42db9903c0b742
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 57), end pos: (32, 58)
operator: core/NumberReplacer, occurrence: 13
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[ -1]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

130 : Job ID 4486089f17b24308931cfc3243a18069
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 60), end pos: (32, 61)
operator: core/NumberReplacer, occurrence: 14
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]- 2, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.08s ===============================

131 : Job ID 8ef4d8ba64454834bbf5da8c9b37c560
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 60), end pos: (32, 61)
operator: core/NumberReplacer, occurrence: 15
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]- 0, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

132 : Job ID 54dbf5f29a7049a9a5cf1422acffb928
test outcome: killed
depth_first_search.py, start pos: (32, 71), end pos: (32, 72)
operator: core/NumberReplacer, occurrence: 16
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[ 2]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py FF..F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - IndexError...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_not_found - IndexE...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - Index...
========================= 3 failed, 2 passed in 0.09s ==========================
