133 : Job ID a1da7a260b6047c798ecd828020bd6ac
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 71), end pos: (32, 72)
operator: core/NumberReplacer, occurrence: 17
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[ 0]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.08s ===============================

134 : Job ID 4de8efcd99aa435dbb775d7a21a5b144
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 84), end pos: (32, 85)
operator: core/NumberReplacer, occurrence: 18
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[ 1]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

135 : Job ID 951c4d82953f492f96cd73141ea06764
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 84), end pos: (32, 85)
operator: core/NumberReplacer, occurrence: 19
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[ -1]+1, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

136 : Job ID edc38cb447064f899ad9c60d1d403f78
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 87), end pos: (32, 88)
operator: core/NumberReplacer, occurrence: 20
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+ 2, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

137 : Job ID 8fda8a49eff14c3b9a14328567372cfb
test outcome: killed
depth_first_search.py, start pos: (32, 87), end pos: (32, 88)
operator: core/NumberReplacer, occurrence: 21
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+ 0, current[1]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py F...F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - assert Non...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 2 failed, 3 passed in 0.09s ==========================

138 : Job ID ef5fe3997ea8408991729600a2f27764
test outcome: killed
depth_first_search.py, start pos: (32, 98), end pos: (32, 99)
operator: core/NumberReplacer, occurrence: 22
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[ 2]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py FF..F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - IndexError...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_not_found - IndexE...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - Index...
========================= 3 failed, 2 passed in 0.09s ==========================

139 : Job ID 9ec04995fa4948ea9b3992326aea9553
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 98), end pos: (32, 99)
operator: core/NumberReplacer, occurrence: 23
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[ 0]),(current[0], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.08s ===============================

140 : Job ID 3a885ec838d9480baee05abf7072576e
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 111), end pos: (32, 112)
operator: core/NumberReplacer, occurrence: 24
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[ 1], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

141 : Job ID 78f5f046b5c84c059eac0c760dfd2655
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 111), end pos: (32, 112)
operator: core/NumberReplacer, occurrence: 25
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[ -1], current[1]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.08s ===============================

142 : Job ID 1128df7c885541968a0aab3a0c920953
test outcome: killed
depth_first_search.py, start pos: (32, 123), end pos: (32, 124)
operator: core/NumberReplacer, occurrence: 26
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[ 2]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py FF..F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - IndexError...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_not_found - IndexE...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - Index...
========================= 3 failed, 2 passed in 0.09s ==========================

143 : Job ID 5745e82c74ba42aea3461a7362d1f276
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 123), end pos: (32, 124)
operator: core/NumberReplacer, occurrence: 27
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[ 0]+1)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

144 : Job ID 1d6f5892f1674bd7a1cdc3ec103175c0
SURVIVED
test outcome: survived
depth_first_search.py, start pos: (32, 126), end pos: (32, 127)
operator: core/NumberReplacer, occurrence: 28
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+ 2)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py .....                                         [100%]
============================== 5 passed in 0.09s ===============================

145 : Job ID 025f451286554b148075b2e940e3dcc9
test outcome: killed
depth_first_search.py, start pos: (32, 126), end pos: (32, 127)
operator: core/NumberReplacer, occurrence: 29
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+ 0)]:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py F...F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - assert Non...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 2 failed, 3 passed in 0.09s ==========================

166 : Job ID 4662fcbd1dce43af9ebf9a9882ffca26
test outcome: killed
depth_first_search.py, start pos: (32, 20), end pos: (32, 129)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- adepth_first_search.py
+++ bdepth_first_search.py
@@ -29,7 +29,7 @@
     while stack:
         current = stack.pop()
-        for coor in [(current[0], current[1]-1),(current[0]-1, current[1]),(current[0]+1, current[1]),(current[0], current[1]+1)]:
+        for coor in []:
             if coor[0] < 0 or coor[0] > width-1 or coor[1] < 0 or coor[1] > height-1:
                 continue
             if grid[coor[1]][coor[0]] == target:
ts-3-5/test_3-5_1-0_328.py F...F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_found - assert Non...
FAILED ts-3-5/test_3-5_1-0_328.py::test_depth_first_search_large_grid - asser...
========================= 2 failed, 3 passed in 0.09s ==========================
