   - [#  12] COI depth_first_search: 
--------------------------------------------------------------------------------
  25:     
  26:     stack = [(x_start, y_start)]
  27:     visited.add((x_start, y_start))
  28:     
- 29:     while stack:
+ 29:     while not stack:
  30:         current = stack.pop()
  31:         
  32:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
  33:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
--------------------------------------------------------------------------------
[0.15016 s] killed by ts-3-5/test_3-5_0-5_151.py::test_depth_first_search_found

def test_depth_first_search_found():
        grid = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
        start = (0, 0)
        target = 5
>       assert depth_first_search(grid, start, target) == (1, 1)
E       AssertionError

ts-3-5/test_3-5_0-5_151.py:14: AssertionError

   - [#  17] OIL depth_first_search: 
--------------------------------------------------------------------------------
  36:                 return coor
  37:             
  38:             elif coor not in visited:
  39:                 stack.append(coor)
- 40:                 visited.add(current)
+ 40:                 visited.add(current)break
  41:     return None
--------------------------------------------------------------------------------
[0.15054 s] killed by ts-3-5/test_3-5_0-5_151.py::test_depth_first_search_found

def test_depth_first_search_found():
        grid = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
        start = (0, 0)
        target = 5
>       assert depth_first_search(grid, start, target) == (1, 1)
E       AssertionError

ts-3-5/test_3-5_0-5_151.py:14: AssertionError

   - [#  37] SDL depth_first_search: 
--------------------------------------------------------------------------------
  22:         return (x_start, y_start)
  23:     
  24:     visited = set()
  25:     
- 26:     stack = [(x_start, y_start)]
+ 26:     pass
  27:     visited.add((x_start, y_start))
  28:     
  29:     while stack:
  30:         current = stack.pop()
--------------------------------------------------------------------------------
[0.15256 s] killed by ts-3-5/test_3-5_0-5_151.py::test_depth_first_search_found

def test_depth_first_search_found():
        grid = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
        start = (0, 0)
        target = 5
>       assert depth_first_search(grid, start, target) == (1, 1)

ts-3-5/test_3-5_0-5_151.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

grid = [[1, 2, 3], [4, 5, 6], [7, 8, 9]], start = (0, 0), target = 5

>   ???
E   NameError: name 'stack' is not defined

depth_first_search:29: NameError

   - [#  38] SDL depth_first_search: 
--------------------------------------------------------------------------------
  23:     
  24:     visited = set()
  25:     
  26:     stack = [(x_start, y_start)]
- 27:     visited.add((x_start, y_start))
+ 27:     pass
  28:     
  29:     while stack:
  30:         current = stack.pop()
  31:         
--------------------------------------------------------------------------------
[0.12644 s] survived

   - [#  39] SDL depth_first_search: 
--------------------------------------------------------------------------------
  26:     stack = [(x_start, y_start)]
  27:     visited.add((x_start, y_start))
  28:     
  29:     while stack:
- 30:         current = stack.pop()
+ 30:         pass
  31:         
  32:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
  33:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
  34:                 continue
--------------------------------------------------------------------------------
[0.14854 s] killed by ts-3-5/test_3-5_0-5_151.py::test_depth_first_search_found

def test_depth_first_search_found():
        grid = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
        start = (0, 0)
        target = 5
>       assert depth_first_search(grid, start, target) == (1, 1)

ts-3-5/test_3-5_0-5_151.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

grid = [[1, 2, 3], [4, 5, 6], [7, 8, 9]], start = (0, 0), target = 5

>   ???
E   NameError: name 'current' is not defined

depth_first_search:32: NameError

   - [#  41] SDL depth_first_search: 
--------------------------------------------------------------------------------
  35:             if grid[coor[1]][coor[0]] == target:
  36:                 return coor
  37:             
  38:             elif coor not in visited:
- 39:                 stack.append(coor)
+ 39:                 pass
  40:                 visited.add(current)
  41:     return None
--------------------------------------------------------------------------------
[0.14947 s] killed by ts-3-5/test_3-5_0-5_151.py::test_depth_first_search_found

def test_depth_first_search_found():
        grid = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
        start = (0, 0)
        target = 5
>       assert depth_first_search(grid, start, target) == (1, 1)
E       AssertionError

ts-3-5/test_3-5_0-5_151.py:14: AssertionError

   - [#  42] SDL depth_first_search: 
--------------------------------------------------------------------------------
  36:                 return coor
  37:             
  38:             elif coor not in visited:
  39:                 stack.append(coor)
- 40:                 visited.add(current)
+ 40:                 pass
  41:     return None
--------------------------------------------------------------------------------
[5.00675 s] timeout

   - [#  44] ZIL depth_first_search: 
--------------------------------------------------------------------------------
  26:     stack = [(x_start, y_start)]
  27:     visited.add((x_start, y_start))
  28:     
  29:     while stack:
- 30:         current = stack.pop()
- 31:         
- 32:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
- 33:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
- 34:                 continue
- 35:             if grid[coor[1]][coor[0]] == target:
- 36:                 return coor
- 37:             
- 38:             elif coor not in visited:
- 39:                 stack.append(coor)
- 40:                 visited.add(current)
+ 30:         break
+ 31:     
+ 32:     
+ 33:     
+ 34:     
+ 35:     
+ 36:     
+ 37:     
+ 38:     
+ 39:     
+ 40:     
  41:     return None
--------------------------------------------------------------------------------
[0.14569 s] killed by ts-3-5/test_3-5_0-5_151.py::test_depth_first_search_found

def test_depth_first_search_found():
        grid = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
        start = (0, 0)
        target = 5
>       assert depth_first_search(grid, start, target) == (1, 1)
E       AssertionError

ts-3-5/test_3-5_0-5_151.py:14: AssertionError

   - [#  45] ZIL depth_first_search: 
--------------------------------------------------------------------------------
  29:     while stack:
  30:         current = stack.pop()
  31:         
  32:         for coor in [(current[0], current[1] - 1), (current[0] - 1, current[1]), (current[0] + 1, current[1]), (current[0], current[1] + 1)]:
- 33:             if (coor[0] < 0 or coor[0] > width - 1 or coor[1] < 0 or coor[1] > height - 1):
- 34:                 continue
- 35:             if grid[coor[1]][coor[0]] == target:
- 36:                 return coor
- 37:             
- 38:             elif coor not in visited:
- 39:                 stack.append(coor)
- 40:                 visited.add(current)
+ 33:             break
+ 34:     
+ 35:     
+ 36:     
+ 37:     
+ 38:     
+ 39:     
+ 40:     
  41:     return None
--------------------------------------------------------------------------------
[0.14877 s] killed by ts-3-5/test_3-5_0-5_151.py::test_depth_first_search_found

def test_depth_first_search_found():
        grid = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
        start = (0, 0)
        target = 5
>       assert depth_first_search(grid, start, target) == (1, 1)
E       AssertionError

ts-3-5/test_3-5_0-5_151.py:14: AssertionError
