1 : Job ID 8262e69c24d348b5a0f7300397cc0945
test outcome: killed
dijkstras.py, start pos: (20, 25), end pos: (20, 27)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -17,7 +17,7 @@
     while vertices:
         min_dist_node = min(list(filter(lambda x: x[0] in vertices,dist.items())),key=lambda x: x[1])[0]
-        if min_dist_node == dst:
+        if min_dist_node != dst:
             break
         vertices.remove(min_dist_node)
ts-3-5/test_3-5_0-7_216.py FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - As...
========================= 2 failed, 2 passed in 0.15s ==========================

2 : Job ID 71af524509d0420aaa607af4b50ccf6b
test outcome: killed
dijkstras.py, start pos: (20, 25), end pos: (20, 27)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -17,7 +17,7 @@
     while vertices:
         min_dist_node = min(list(filter(lambda x: x[0] in vertices,dist.items())),key=lambda x: x[1])[0]
-        if min_dist_node == dst:
+        if min_dist_node < dst:
             break
         vertices.remove(min_dist_node)
ts-3-5/test_3-5_0-7_216.py FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - As...
========================= 2 failed, 2 passed in 0.14s ==========================

3 : Job ID e5dd03f9c7cf43f180b0520025d48705
test outcome: killed
dijkstras.py, start pos: (20, 25), end pos: (20, 27)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -17,7 +17,7 @@
     while vertices:
         min_dist_node = min(list(filter(lambda x: x[0] in vertices,dist.items())),key=lambda x: x[1])[0]
-        if min_dist_node == dst:
+        if min_dist_node <= dst:
             break
         vertices.remove(min_dist_node)
ts-3-5/test_3-5_0-7_216.py FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - As...
========================= 2 failed, 2 passed in 0.17s ==========================

4 : Job ID a0ddebefaa3349ea860cfe5cade2494d
test outcome: killed
dijkstras.py, start pos: (20, 25), end pos: (20, 27)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -17,7 +17,7 @@
     while vertices:
         min_dist_node = min(list(filter(lambda x: x[0] in vertices,dist.items())),key=lambda x: x[1])[0]
-        if min_dist_node == dst:
+        if min_dist_node > dst:
             break
         vertices.remove(min_dist_node)
ts-3-5/test_3-5_0-7_216.py

5 : Job ID 651f64c72e654585a803dbf92f5a45f8
SURVIVED
test outcome: survived
dijkstras.py, start pos: (20, 25), end pos: (20, 27)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -17,7 +17,7 @@
     while vertices:
         min_dist_node = min(list(filter(lambda x: x[0] in vertices,dist.items())),key=lambda x: x[1])[0]
-        if min_dist_node == dst:
+        if min_dist_node >= dst:
             break
         vertices.remove(min_dist_node)
ts-3-5/test_3-5_0-7_216.py ....                                          [100%]
============================== 4 passed in 0.15s ===============================

6 : Job ID effaabba9fec4add91eb92429cf6c253
SURVIVED
test outcome: survived
dijkstras.py, start pos: (20, 25), end pos: (20, 27)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -17,7 +17,7 @@
     while vertices:
         min_dist_node = min(list(filter(lambda x: x[0] in vertices,dist.items())),key=lambda x: x[1])[0]
-        if min_dist_node == dst:
+        if min_dist_node is dst:
             break
         vertices.remove(min_dist_node)
ts-3-5/test_3-5_0-7_216.py ....                                          [100%]
============================== 4 passed in 0.16s ===============================

7 : Job ID dc1ca762ddeb4c4f9d6050952006dc8a
test outcome: killed
dijkstras.py, start pos: (20, 25), end pos: (20, 27)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -17,7 +17,7 @@
     while vertices:
         min_dist_node = min(list(filter(lambda x: x[0] in vertices,dist.items())),key=lambda x: x[1])[0]
-        if min_dist_node == dst:
+        if min_dist_node is not dst:
             break
         vertices.remove(min_dist_node)
ts-3-5/test_3-5_0-7_216.py FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - As...
========================= 2 failed, 2 passed in 0.16s ==========================

8 : Job ID 0ab23179f7fb49a0815c8648f6af37ec
test outcome: killed
dijkstras.py, start pos: (29, 24), end pos: (29, 25)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 0
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -26,7 +26,7 @@
             distance = weighted_graph.vertices[min_dist_node].adjacent[neighbor]
-            if distance < dist[neighbor]:
+            if distance == dist[neighbor]:
                 dist[neighbor] = distance
                 prev[neighbor] = min_dist_node
ts-3-5/test_3-5_0-7_216.py FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - As...
========================= 2 failed, 2 passed in 0.15s ==========================

9 : Job ID 48ad5f336c3246c5a803f3b30a7424d4
test outcome: killed
dijkstras.py, start pos: (29, 24), end pos: (29, 25)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 0
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -26,7 +26,7 @@
             distance = weighted_graph.vertices[min_dist_node].adjacent[neighbor]
-            if distance < dist[neighbor]:
+            if distance != dist[neighbor]:
                 dist[neighbor] = distance
                 prev[neighbor] = min_dist_node
ts-3-5/test_3-5_0-7_216.py

10 : Job ID 1dbb0b14288247fe88a5153daca73f7a
SURVIVED
test outcome: survived
dijkstras.py, start pos: (29, 24), end pos: (29, 25)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 0
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -26,7 +26,7 @@
             distance = weighted_graph.vertices[min_dist_node].adjacent[neighbor]
-            if distance < dist[neighbor]:
+            if distance <= dist[neighbor]:
                 dist[neighbor] = distance
                 prev[neighbor] = min_dist_node
ts-3-5/test_3-5_0-7_216.py ....                                          [100%]
============================== 4 passed in 0.14s ===============================

11 : Job ID 10cb90cb297142b18cea023aed61aabd
test outcome: killed
dijkstras.py, start pos: (29, 24), end pos: (29, 25)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 0
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -26,7 +26,7 @@
             distance = weighted_graph.vertices[min_dist_node].adjacent[neighbor]
-            if distance < dist[neighbor]:
+            if distance > dist[neighbor]:
                 dist[neighbor] = distance
                 prev[neighbor] = min_dist_node
ts-3-5/test_3-5_0-7_216.py FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - As...
========================= 2 failed, 2 passed in 0.16s ==========================

12 : Job ID 5105a707ac0b4bfcaa7c8b951f93681f
test outcome: killed
dijkstras.py, start pos: (29, 24), end pos: (29, 25)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 0
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -26,7 +26,7 @@
             distance = weighted_graph.vertices[min_dist_node].adjacent[neighbor]
-            if distance < dist[neighbor]:
+            if distance >= dist[neighbor]:
                 dist[neighbor] = distance
                 prev[neighbor] = min_dist_node
ts-3-5/test_3-5_0-7_216.py FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - As...
========================= 2 failed, 2 passed in 0.15s ==========================

13 : Job ID 4c168a0472a34ddaae65a7e1d0bed156
test outcome: killed
dijkstras.py, start pos: (29, 24), end pos: (29, 25)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 0
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -26,7 +26,7 @@
             distance = weighted_graph.vertices[min_dist_node].adjacent[neighbor]
-            if distance < dist[neighbor]:
+            if distance is dist[neighbor]:
                 dist[neighbor] = distance
                 prev[neighbor] = min_dist_node
ts-3-5/test_3-5_0-7_216.py FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - As...
========================= 2 failed, 2 passed in 0.15s ==========================

14 : Job ID 862dcb3b77ca41d9b8b5f2f4ee20d2c3
test outcome: killed
dijkstras.py, start pos: (29, 24), end pos: (29, 25)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 0
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -26,7 +26,7 @@
             distance = weighted_graph.vertices[min_dist_node].adjacent[neighbor]
-            if distance < dist[neighbor]:
+            if distance is not dist[neighbor]:
                 dist[neighbor] = distance
                 prev[neighbor] = min_dist_node
ts-3-5/test_3-5_0-7_216.py

15 : Job ID 5ab83be4d55b4ac1a6d8e55293ba2acc
test outcome: killed
dijkstras.py, start pos: (41, 18), end pos: (41, 19)
operator: core/ReplaceUnaryOperator_USub_UAdd, occurrence: 0
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -38,6 +38,6 @@
         current = prev[current]
     path.append(current)
-    return path[::-1]
+    return path[::+1]
ts-3-5/test_3-5_0-7_216.py FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - As...
========================= 2 failed, 2 passed in 0.16s ==========================

16 : Job ID 4c73d74263fd41d28556b13fcece0934
test outcome: killed
dijkstras.py, start pos: (41, 18), end pos: (41, 19)
operator: core/ReplaceUnaryOperator_USub_Invert, occurrence: 0
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -38,6 +38,6 @@
         current = prev[current]
     path.append(current)
-    return path[::-1]
+    return path[::~1]
ts-3-5/test_3-5_0-7_216.py FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - As...
========================= 2 failed, 2 passed in 0.15s ==========================

17 : Job ID 97de2a0533b54509bf6e15caa45c5905
test outcome: killed
dijkstras.py, start pos: (41, 18), end pos: (41, 19)
operator: core/ReplaceUnaryOperator_USub_Not, occurrence: 0
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -38,6 +38,6 @@
         current = prev[current]
     path.append(current)
-    return path[::-1]
+    return path[::not 1]
ts-3-5/test_3-5_0-7_216.py FFFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - Va...
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_single_node
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_same_source_dest
============================== 4 failed in 0.16s ===============================

18 : Job ID f008631667564ea5b6cf1cdacb884315
test outcome: killed
dijkstras.py, start pos: (41, 18), end pos: (41, 19)
operator: core/ReplaceUnaryOperator_Delete_USub, occurrence: 0
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -38,6 +38,6 @@
         current = prev[current]
     path.append(current)
-    return path[::-1]
+    return path[::1]
ts-3-5/test_3-5_0-7_216.py FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - As...
========================= 2 failed, 2 passed in 0.15s ==========================

19 : Job ID e63716c327ff41cfab95497802a03d15
test outcome: killed
dijkstras.py, start pos: (17, 10), end pos: (17, 18)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -14,7 +14,7 @@
     dist[src] = 0
-    while vertices:
+    while not vertices:
         min_dist_node = min(list(filter(lambda x: x[0] in vertices,dist.items())),key=lambda x: x[1])[0]
         if min_dist_node == dst:
ts-3-5/test_3-5_0-7_216.py FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - As...
========================= 2 failed, 2 passed in 0.15s ==========================

20 : Job ID 05796be1692b4240bd6edccf8e7ab571
test outcome: killed
dijkstras.py, start pos: (20, 11), end pos: (20, 31)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -17,7 +17,7 @@
     while vertices:
         min_dist_node = min(list(filter(lambda x: x[0] in vertices,dist.items())),key=lambda x: x[1])[0]
-        if min_dist_node == dst:
+        if not min_dist_node == dst:
             break
         vertices.remove(min_dist_node)
ts-3-5/test_3-5_0-7_216.py FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - As...
========================= 2 failed, 2 passed in 0.15s ==========================

21 : Job ID 2b5a8b70a0414fbc916950c9dd4905ea
test outcome: killed
dijkstras.py, start pos: (29, 15), end pos: (29, 40)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -26,7 +26,7 @@
             distance = weighted_graph.vertices[min_dist_node].adjacent[neighbor]
-            if distance < dist[neighbor]:
+            if not distance < dist[neighbor]:
                 dist[neighbor] = distance
                 prev[neighbor] = min_dist_node
ts-3-5/test_3-5_0-7_216.py FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - As...
========================= 2 failed, 2 passed in 0.15s ==========================

22 : Job ID 32266ccb617c440183758b0e46bc63d4
test outcome: killed
dijkstras.py, start pos: (36, 10), end pos: (36, 23)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -33,7 +33,7 @@
     # trace back from dst
     path = []
     current = dst
-    while prev[current]:
+    while not prev[current]:
         path.append(current)
         current = prev[current]
     path.append(current)
ts-3-5/test_3-5_0-7_216.py FFFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - As...
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_single_node
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_same_source_dest
============================== 4 failed in 0.15s ===============================

23 : Job ID 7fa50c435ddb455fbee22bb1275e26ae
test outcome: killed
dijkstras.py, start pos: (21, 12), end pos: (21, 17)
operator: core/ReplaceBreakWithContinue, occurrence: 0
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -18,7 +18,7 @@
         min_dist_node = min(list(filter(lambda x: x[0] in vertices,dist.items())),key=lambda x: x[1])[0]
         if min_dist_node == dst:
-            break
+            continue
         vertices.remove(min_dist_node)
timeout

24 : Job ID e74dffaf98cb439c90dcf3c77596eb86
SURVIVED
test outcome: survived
dijkstras.py, start pos: (15, 16), end pos: (15, 17)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -12,7 +12,7 @@
         dist[vertex] = float('inf')
         prev[vertex] = None
-    dist[src] = 0
+    dist[src] = 1
     while vertices:
         min_dist_node = min(list(filter(lambda x: x[0] in vertices,dist.items())),key=lambda x: x[1])[0]
ts-3-5/test_3-5_0-7_216.py ....                                          [100%]
============================== 4 passed in 0.14s ===============================

25 : Job ID 98a1add716d94e92be02bd7b0376db45
SURVIVED
test outcome: survived
dijkstras.py, start pos: (15, 16), end pos: (15, 17)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -12,7 +12,7 @@
         dist[vertex] = float('inf')
         prev[vertex] = None
-    dist[src] = 0
+    dist[src] = -1
     while vertices:
         min_dist_node = min(list(filter(lambda x: x[0] in vertices,dist.items())),key=lambda x: x[1])[0]
ts-3-5/test_3-5_0-7_216.py ....                                          [100%]
============================== 4 passed in 0.14s ===============================

26 : Job ID 811d5f4828464ac7ace88f6116bffdda
test outcome: killed
dijkstras.py, start pos: (18, 52), end pos: (18, 53)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -15,7 +15,7 @@
     dist[src] = 0
     while vertices:
-        min_dist_node = min(list(filter(lambda x: x[0] in vertices,dist.items())),key=lambda x: x[1])[0]
+        min_dist_node = min(list(filter(lambda x: x[ 1] in vertices,dist.items())),key=lambda x: x[1])[0]
         if min_dist_node == dst:
             break
ts-3-5/test_3-5_0-7_216.py FFFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - Va...
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_single_node
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_same_source_dest
============================== 4 failed in 0.15s ===============================

27 : Job ID bed5cbaf447340c681ec2698c6c6a0f9
test outcome: killed
dijkstras.py, start pos: (18, 52), end pos: (18, 53)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -15,7 +15,7 @@
     dist[src] = 0
     while vertices:
-        min_dist_node = min(list(filter(lambda x: x[0] in vertices,dist.items())),key=lambda x: x[1])[0]
+        min_dist_node = min(list(filter(lambda x: x[ -1] in vertices,dist.items())),key=lambda x: x[1])[0]
         if min_dist_node == dst:
             break
ts-3-5/test_3-5_0-7_216.py FFFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - Va...
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_single_node
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_same_source_dest
============================== 4 failed in 0.15s ===============================

28 : Job ID 6865be5043a54ea6a663c8a62aba814d
test outcome: killed
dijkstras.py, start pos: (18, 98), end pos: (18, 99)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -15,7 +15,7 @@
     dist[src] = 0
     while vertices:
-        min_dist_node = min(list(filter(lambda x: x[0] in vertices,dist.items())),key=lambda x: x[1])[0]
+        min_dist_node = min(list(filter(lambda x: x[0] in vertices,dist.items())),key=lambda x: x[ 2])[0]
         if min_dist_node == dst:
             break
ts-3-5/test_3-5_0-7_216.py FFFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - In...
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_single_node
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_same_source_dest
============================== 4 failed in 0.15s ===============================

29 : Job ID 6922c9e5a89a4f318577fd0d218037f5
SURVIVED
test outcome: survived
dijkstras.py, start pos: (18, 98), end pos: (18, 99)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -15,7 +15,7 @@
     dist[src] = 0
     while vertices:
-        min_dist_node = min(list(filter(lambda x: x[0] in vertices,dist.items())),key=lambda x: x[1])[0]
+        min_dist_node = min(list(filter(lambda x: x[0] in vertices,dist.items())),key=lambda x: x[ 0])[0]
         if min_dist_node == dst:
             break
ts-3-5/test_3-5_0-7_216.py ....                                          [100%]
============================== 4 passed in 0.16s ===============================

30 : Job ID 346cd0846f8547d19a2eb9274a5ee207
test outcome: killed
dijkstras.py, start pos: (18, 102), end pos: (18, 103)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -15,7 +15,7 @@
     dist[src] = 0
     while vertices:
-        min_dist_node = min(list(filter(lambda x: x[0] in vertices,dist.items())),key=lambda x: x[1])[0]
+        min_dist_node = min(list(filter(lambda x: x[0] in vertices,dist.items())),key=lambda x: x[1])[ 1]
         if min_dist_node == dst:
             break
ts-3-5/test_3-5_0-7_216.py FFFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - Ke...
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_single_node
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_same_source_dest
============================== 4 failed in 0.15s ===============================

31 : Job ID c583fe0807da40ef95baa8e43222180b
test outcome: killed
dijkstras.py, start pos: (18, 102), end pos: (18, 103)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -15,7 +15,7 @@
     dist[src] = 0
     while vertices:
-        min_dist_node = min(list(filter(lambda x: x[0] in vertices,dist.items())),key=lambda x: x[1])[0]
+        min_dist_node = min(list(filter(lambda x: x[0] in vertices,dist.items())),key=lambda x: x[1])[ -1]
         if min_dist_node == dst:
             break
ts-3-5/test_3-5_0-7_216.py FFFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - Ke...
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_single_node
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_same_source_dest
============================== 4 failed in 0.16s ===============================

32 : Job ID e17ff05bc17842cc815e399d4bdde55b
test outcome: killed
dijkstras.py, start pos: (41, 19), end pos: (41, 20)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -38,6 +38,6 @@
         current = prev[current]
     path.append(current)
-    return path[::-1]
+    return path[::- 2]
ts-3-5/test_3-5_0-7_216.py FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - As...
========================= 2 failed, 2 passed in 0.19s ==========================

33 : Job ID 73d3fe6f410b4523bfa080d1a385b338
test outcome: killed
dijkstras.py, start pos: (41, 19), end pos: (41, 20)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -38,6 +38,6 @@
         current = prev[current]
     path.append(current)
-    return path[::-1]
+    return path[::- 0]
ts-3-5/test_3-5_0-7_216.py FFFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - Va...
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_single_node
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_same_source_dest
============================== 4 failed in 0.16s ===============================

34 : Job ID 1aadc72ee0884dde8ce2bb7e74bfdef1
test outcome: killed
dijkstras.py, start pos: (10, 18), end pos: (10, 41)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -7,7 +7,7 @@
     prev = {}
     # add all vertices to set
-    for vertex in weighted_graph.vertices:
+    for vertex in []:
         vertices.add(vertex)
         dist[vertex] = float('inf')
         prev[vertex] = None
ts-3-5/test_3-5_0-7_216.py FFFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - Ke...
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_single_node
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_same_source_dest
============================== 4 failed in 0.15s ===============================

35 : Job ID 7af7c5c9144a46a9880e1b829c090a71
test outcome: killed
dijkstras.py, start pos: (25, 24), end pos: (25, 71)
operator: core/ZeroIterationForLoop, occurrence: 1
--- mutation diff ---
--- adijkstras.py
+++ bdijkstras.py
@@ -22,7 +22,7 @@
         vertices.remove(min_dist_node)
-        for neighbor in weighted_graph.vertices[min_dist_node].adjacent:
+        for neighbor in []:
             distance = weighted_graph.vertices[min_dist_node].adjacent[neighbor]
ts-3-5/test_3-5_0-7_216.py FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_shortest_path
FAILED ts-3-5/test_3-5_0-7_216.py::TestDijkstras::test_dijkstras_no_path - As...
========================= 2 failed, 2 passed in 0.14s ==========================
