   - [#   1] AOD dijkstras: 
--------------------------------------------------------------------------------
  37:         path.append(current)
  38:         current = prev[current]
  39:     path.append(current)
  40:     
- 41:     return path[::-1]
+ 41:     return path[::1]
--------------------------------------------------------------------------------
[0.20572 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]
E       AssertionError

ts-3-5/test_3-5_0-8_267.py:26: AssertionError

   - [#   2] AOR dijkstras: 
--------------------------------------------------------------------------------
  37:         path.append(current)
  38:         current = prev[current]
  39:     path.append(current)
  40:     
- 41:     return path[::-1]
+ 41:     return path[::+1]
--------------------------------------------------------------------------------
[0.20250 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]
E       AssertionError

ts-3-5/test_3-5_0-8_267.py:26: AssertionError

   - [#   4] COI dijkstras: 
--------------------------------------------------------------------------------
  13:         prev[vertex] = None
  14:     
  15:     dist[src] = 0
  16:     
- 17:     while vertices:
+ 17:     while not vertices:
  18:         min_dist_node = min(list(filter((lambda x: (x[0] in vertices)), dist.items())), key=lambda x: (x[1]))[0]
  19:         
  20:         if min_dist_node == dst:
  21:             break
--------------------------------------------------------------------------------
[0.20062 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]
E       AssertionError

ts-3-5/test_3-5_0-8_267.py:26: AssertionError

   - [#   5] COI dijkstras: 
--------------------------------------------------------------------------------
  14:     
  15:     dist[src] = 0
  16:     
  17:     while vertices:
- 18:         min_dist_node = min(list(filter((lambda x: (x[0] in vertices)), dist.items())), key=lambda x: (x[1]))[0]
+ 18:         min_dist_node = min(list(filter((lambda x: (x[0] not in vertices)), dist.items())), key=lambda x: (x[1]))[0]
  19:         
  20:         if min_dist_node == dst:
  21:             break
  22:         
--------------------------------------------------------------------------------
[0.20216 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]

ts-3-5/test_3-5_0-8_267.py:26: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

weighted_graph = <test_3-5_0-8_267.WeightedGraph object at 0x79a1de39cca0>
src = 'A', dst = 'B'

>   ???
E   ValueError: min() arg is an empty sequence

dijkstras:18: ValueError

   - [#   6] COI dijkstras: 
--------------------------------------------------------------------------------
  16:     
  17:     while vertices:
  18:         min_dist_node = min(list(filter((lambda x: (x[0] in vertices)), dist.items())), key=lambda x: (x[1]))[0]
  19:         
- 20:         if min_dist_node == dst:
+ 20:         if not (min_dist_node == dst):
  21:             break
  22:         
  23:         vertices.remove(min_dist_node)
  24:         
--------------------------------------------------------------------------------
[0.20704 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]
E       AssertionError

ts-3-5/test_3-5_0-8_267.py:26: AssertionError

   - [#   7] COI dijkstras: 
--------------------------------------------------------------------------------
  25:         for neighbor in weighted_graph.vertices[min_dist_node].adjacent:
  26:             
  27:             distance = weighted_graph.vertices[min_dist_node].adjacent[neighbor]
  28:             
- 29:             if distance < dist[neighbor]:
+ 29:             if not (distance < dist[neighbor]):
  30:                 dist[neighbor] = distance
  31:                 prev[neighbor] = min_dist_node
  32:     
  33:     
--------------------------------------------------------------------------------
[0.20387 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]
E       AssertionError

ts-3-5/test_3-5_0-8_267.py:26: AssertionError

   - [#   8] COI dijkstras: 
--------------------------------------------------------------------------------
  32:     
  33:     
  34:     path = []
  35:     current = dst
- 36:     while prev[current]:
+ 36:     while not (prev[current]):
  37:         path.append(current)
  38:         current = prev[current]
  39:     path.append(current)
  40:     
--------------------------------------------------------------------------------
[0.20198 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]
E       AssertionError

ts-3-5/test_3-5_0-8_267.py:26: AssertionError

   - [#   9] OIL dijkstras: 
--------------------------------------------------------------------------------
  10:     for vertex in weighted_graph.vertices:
  11:         vertices.add(vertex)
  12:         dist[vertex] = float('inf')
  13:         prev[vertex] = None
- 14:     
+ 14:         break
  15:     dist[src] = 0
  16:     
  17:     while vertices:
  18:         min_dist_node = min(list(filter((lambda x: (x[0] in vertices)), dist.items())), key=lambda x: (x[1]))[0]
--------------------------------------------------------------------------------
[0.20352 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]

ts-3-5/test_3-5_0-8_267.py:26: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

weighted_graph = <test_3-5_0-8_267.WeightedGraph object at 0x79a1de30c5b0>
src = 'A', dst = 'B'

>   ???
E   KeyError: 'B'

dijkstras:29: KeyError

   - [#  10] OIL dijkstras: 
--------------------------------------------------------------------------------
  28:             
  29:             if distance < dist[neighbor]:
  30:                 dist[neighbor] = distance
  31:                 prev[neighbor] = min_dist_node
- 32:     
+ 32:         break
  33:     
  34:     path = []
  35:     current = dst
  36:     while prev[current]:
--------------------------------------------------------------------------------
[0.20284 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
        assert dijkstras(graph, "A", "B") == ["A", "B"]
    
        # Test case 2: Shortest path with multiple vertices and edges
        vertex_a = Vertex({"B": 5, "C": 3})
        vertex_b = Vertex({"D": 7})
        vertex_c = Vertex({"D": 2})
        vertex_d = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b, "C": vertex_c, "D": vertex_d})
>       assert dijkstras(graph, "A", "D") == ["A", "C", "D"]
E       AssertionError

ts-3-5/test_3-5_0-8_267.py:34: AssertionError

   - [#  12] OIL dijkstras: 
--------------------------------------------------------------------------------
  35:     current = dst
  36:     while prev[current]:
  37:         path.append(current)
  38:         current = prev[current]
- 39:     path.append(current)
- 40:     
+ 39:         break
+ 40:     path.append(current)
  41:     return path[::-1]
--------------------------------------------------------------------------------
[0.21302 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
        assert dijkstras(graph, "A", "B") == ["A", "B"]
    
        # Test case 2: Shortest path with multiple vertices and edges
        vertex_a = Vertex({"B": 5, "C": 3})
        vertex_b = Vertex({"D": 7})
        vertex_c = Vertex({"D": 2})
        vertex_d = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b, "C": vertex_c, "D": vertex_d})
>       assert dijkstras(graph, "A", "D") == ["A", "C", "D"]
E       AssertionError

ts-3-5/test_3-5_0-8_267.py:34: AssertionError

   - [#  13] RIL dijkstras: 
--------------------------------------------------------------------------------
   6:     dist = {}
   7:     prev = {}
   8:     
   9:     
- 10:     for vertex in weighted_graph.vertices:
+ 10:     for vertex in reversed(weighted_graph.vertices):
  11:         vertices.add(vertex)
  12:         dist[vertex] = float('inf')
  13:         prev[vertex] = None
  14:     
--------------------------------------------------------------------------------
[0.18341 s] survived

   - [#  14] RIL dijkstras: 
--------------------------------------------------------------------------------
  21:             break
  22:         
  23:         vertices.remove(min_dist_node)
  24:         
- 25:         for neighbor in weighted_graph.vertices[min_dist_node].adjacent:
+ 25:         for neighbor in reversed(weighted_graph.vertices[min_dist_node].adjacent):
  26:             
  27:             distance = weighted_graph.vertices[min_dist_node].adjacent[neighbor]
  28:             
  29:             if distance < dist[neighbor]:
--------------------------------------------------------------------------------
[0.17770 s] survived

   - [#  15] ROR dijkstras: 
--------------------------------------------------------------------------------
  16:     
  17:     while vertices:
  18:         min_dist_node = min(list(filter((lambda x: (x[0] in vertices)), dist.items())), key=lambda x: (x[1]))[0]
  19:         
- 20:         if min_dist_node == dst:
+ 20:         if min_dist_node != dst:
  21:             break
  22:         
  23:         vertices.remove(min_dist_node)
  24:         
--------------------------------------------------------------------------------
[0.21074 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]
E       AssertionError

ts-3-5/test_3-5_0-8_267.py:26: AssertionError

   - [#  16] ROR dijkstras: 
--------------------------------------------------------------------------------
  25:         for neighbor in weighted_graph.vertices[min_dist_node].adjacent:
  26:             
  27:             distance = weighted_graph.vertices[min_dist_node].adjacent[neighbor]
  28:             
- 29:             if distance < dist[neighbor]:
+ 29:             if distance > dist[neighbor]:
  30:                 dist[neighbor] = distance
  31:                 prev[neighbor] = min_dist_node
  32:     
  33:     
--------------------------------------------------------------------------------
[0.21234 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]
E       AssertionError

ts-3-5/test_3-5_0-8_267.py:26: AssertionError

   - [#  17] ROR dijkstras: 
--------------------------------------------------------------------------------
  25:         for neighbor in weighted_graph.vertices[min_dist_node].adjacent:
  26:             
  27:             distance = weighted_graph.vertices[min_dist_node].adjacent[neighbor]
  28:             
- 29:             if distance < dist[neighbor]:
+ 29:             if distance <= dist[neighbor]:
  30:                 dist[neighbor] = distance
  31:                 prev[neighbor] = min_dist_node
  32:     
  33:     
--------------------------------------------------------------------------------
[0.17691 s] survived

   - [#  18] SDL dijkstras: 
--------------------------------------------------------------------------------
   1: from functools import reduce
   2: 
   3: def dijkstras(weighted_graph, src, dst):
   4:     
-  5:     vertices = set()
+  5:     pass
   6:     dist = {}
   7:     prev = {}
   8:     
   9:     
--------------------------------------------------------------------------------
[0.20521 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]

ts-3-5/test_3-5_0-8_267.py:26: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

weighted_graph = <test_3-5_0-8_267.WeightedGraph object at 0x79a1de3afcd0>
src = 'A', dst = 'B'

>   ???
E   NameError: name 'vertices' is not defined

dijkstras:11: NameError

   - [#  19] SDL dijkstras: 
--------------------------------------------------------------------------------
   2: 
   3: def dijkstras(weighted_graph, src, dst):
   4:     
   5:     vertices = set()
-  6:     dist = {}
+  6:     pass
   7:     prev = {}
   8:     
   9:     
  10:     for vertex in weighted_graph.vertices:
--------------------------------------------------------------------------------
[0.19788 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]

ts-3-5/test_3-5_0-8_267.py:26: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

weighted_graph = <test_3-5_0-8_267.WeightedGraph object at 0x79a1de39dba0>
src = 'A', dst = 'B'

>   ???
E   NameError: name 'dist' is not defined

dijkstras:12: NameError

   - [#  20] SDL dijkstras: 
--------------------------------------------------------------------------------
   3: def dijkstras(weighted_graph, src, dst):
   4:     
   5:     vertices = set()
   6:     dist = {}
-  7:     prev = {}
+  7:     pass
   8:     
   9:     
  10:     for vertex in weighted_graph.vertices:
  11:         vertices.add(vertex)
--------------------------------------------------------------------------------
[0.20204 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]

ts-3-5/test_3-5_0-8_267.py:26: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

weighted_graph = <test_3-5_0-8_267.WeightedGraph object at 0x79a1de30f460>
src = 'A', dst = 'B'

>   ???
E   NameError: name 'prev' is not defined

dijkstras:13: NameError

   - [#  21] SDL dijkstras: 
--------------------------------------------------------------------------------
   7:     prev = {}
   8:     
   9:     
  10:     for vertex in weighted_graph.vertices:
- 11:         vertices.add(vertex)
+ 11:         pass
  12:         dist[vertex] = float('inf')
  13:         prev[vertex] = None
  14:     
  15:     dist[src] = 0
--------------------------------------------------------------------------------
[0.20904 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]
E       AssertionError

ts-3-5/test_3-5_0-8_267.py:26: AssertionError

   - [#  22] SDL dijkstras: 
--------------------------------------------------------------------------------
   8:     
   9:     
  10:     for vertex in weighted_graph.vertices:
  11:         vertices.add(vertex)
- 12:         dist[vertex] = float('inf')
+ 12:         pass
  13:         prev[vertex] = None
  14:     
  15:     dist[src] = 0
  16:     
--------------------------------------------------------------------------------
[0.22417 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]

ts-3-5/test_3-5_0-8_267.py:26: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

weighted_graph = <test_3-5_0-8_267.WeightedGraph object at 0x79a1de10f430>
src = 'A', dst = 'B'

>   ???
E   KeyError: 'B'

dijkstras:29: KeyError

   - [#  23] SDL dijkstras: 
--------------------------------------------------------------------------------
   9:     
  10:     for vertex in weighted_graph.vertices:
  11:         vertices.add(vertex)
  12:         dist[vertex] = float('inf')
- 13:         prev[vertex] = None
+ 13:         pass
  14:     
  15:     dist[src] = 0
  16:     
  17:     while vertices:
--------------------------------------------------------------------------------
[0.21408 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]

ts-3-5/test_3-5_0-8_267.py:26: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

weighted_graph = <test_3-5_0-8_267.WeightedGraph object at 0x79a1de27b040>
src = 'A', dst = 'B'

>   ???
E   KeyError: 'A'

dijkstras:36: KeyError

   - [#  24] SDL dijkstras: 
--------------------------------------------------------------------------------
  11:         vertices.add(vertex)
  12:         dist[vertex] = float('inf')
  13:         prev[vertex] = None
  14:     
- 15:     dist[src] = 0
+ 15:     pass
  16:     
  17:     while vertices:
  18:         min_dist_node = min(list(filter((lambda x: (x[0] in vertices)), dist.items())), key=lambda x: (x[1]))[0]
  19:         
--------------------------------------------------------------------------------
[0.17258 s] survived

   - [#  25] SDL dijkstras: 
--------------------------------------------------------------------------------
  14:     
  15:     dist[src] = 0
  16:     
  17:     while vertices:
- 18:         min_dist_node = min(list(filter((lambda x: (x[0] in vertices)), dist.items())), key=lambda x: (x[1]))[0]
+ 18:         pass
  19:         
  20:         if min_dist_node == dst:
  21:             break
  22:         
--------------------------------------------------------------------------------
[0.20458 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]

ts-3-5/test_3-5_0-8_267.py:26: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

weighted_graph = <test_3-5_0-8_267.WeightedGraph object at 0x79a1de2799c0>
src = 'A', dst = 'B'

>   ???
E   NameError: name 'min_dist_node' is not defined

dijkstras:20: NameError

   - [#  26] SDL dijkstras: 
--------------------------------------------------------------------------------
  19:         
  20:         if min_dist_node == dst:
  21:             break
  22:         
- 23:         vertices.remove(min_dist_node)
+ 23:         pass
  24:         
  25:         for neighbor in weighted_graph.vertices[min_dist_node].adjacent:
  26:             
  27:             distance = weighted_graph.vertices[min_dist_node].adjacent[neighbor]
--------------------------------------------------------------------------------
[5.00686 s] timeout

   - [#  27] SDL dijkstras: 
--------------------------------------------------------------------------------
  23:         vertices.remove(min_dist_node)
  24:         
  25:         for neighbor in weighted_graph.vertices[min_dist_node].adjacent:
  26:             
- 27:             distance = weighted_graph.vertices[min_dist_node].adjacent[neighbor]
+ 27:             pass
  28:             
  29:             if distance < dist[neighbor]:
  30:                 dist[neighbor] = distance
  31:                 prev[neighbor] = min_dist_node
--------------------------------------------------------------------------------
[0.22143 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]

ts-3-5/test_3-5_0-8_267.py:26: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

weighted_graph = <test_3-5_0-8_267.WeightedGraph object at 0x79a1de39ecb0>
src = 'A', dst = 'B'

>   ???
E   NameError: name 'distance' is not defined

dijkstras:29: NameError

   - [#  28] SDL dijkstras: 
--------------------------------------------------------------------------------
  26:             
  27:             distance = weighted_graph.vertices[min_dist_node].adjacent[neighbor]
  28:             
  29:             if distance < dist[neighbor]:
- 30:                 dist[neighbor] = distance
+ 30:                 pass
  31:                 prev[neighbor] = min_dist_node
  32:     
  33:     
  34:     path = []
--------------------------------------------------------------------------------
[0.17903 s] survived

   - [#  29] SDL dijkstras: 
--------------------------------------------------------------------------------
  27:             distance = weighted_graph.vertices[min_dist_node].adjacent[neighbor]
  28:             
  29:             if distance < dist[neighbor]:
  30:                 dist[neighbor] = distance
- 31:                 prev[neighbor] = min_dist_node
+ 31:                 pass
  32:     
  33:     
  34:     path = []
  35:     current = dst
--------------------------------------------------------------------------------
[0.20896 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]
E       AssertionError

ts-3-5/test_3-5_0-8_267.py:26: AssertionError

   - [#  30] SDL dijkstras: 
--------------------------------------------------------------------------------
  30:                 dist[neighbor] = distance
  31:                 prev[neighbor] = min_dist_node
  32:     
  33:     
- 34:     path = []
+ 34:     pass
  35:     current = dst
  36:     while prev[current]:
  37:         path.append(current)
  38:         current = prev[current]
--------------------------------------------------------------------------------
[0.21035 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]

ts-3-5/test_3-5_0-8_267.py:26: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

weighted_graph = <test_3-5_0-8_267.WeightedGraph object at 0x79a1de21ab00>
src = 'A', dst = 'B'

>   ???
E   NameError: name 'path' is not defined

dijkstras:37: NameError

   - [#  31] SDL dijkstras: 
--------------------------------------------------------------------------------
  31:                 prev[neighbor] = min_dist_node
  32:     
  33:     
  34:     path = []
- 35:     current = dst
+ 35:     pass
  36:     while prev[current]:
  37:         path.append(current)
  38:         current = prev[current]
  39:     path.append(current)
--------------------------------------------------------------------------------
[0.21261 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]

ts-3-5/test_3-5_0-8_267.py:26: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

weighted_graph = <test_3-5_0-8_267.WeightedGraph object at 0x79a1de0df070>
src = 'A', dst = 'B'

>   ???
E   UnboundLocalError: local variable 'current' referenced before assignment

dijkstras:36: UnboundLocalError

   - [#  32] SDL dijkstras: 
--------------------------------------------------------------------------------
  33:     
  34:     path = []
  35:     current = dst
  36:     while prev[current]:
- 37:         path.append(current)
+ 37:         pass
  38:         current = prev[current]
  39:     path.append(current)
  40:     
  41:     return path[::-1]
--------------------------------------------------------------------------------
[0.21312 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]
E       AssertionError

ts-3-5/test_3-5_0-8_267.py:26: AssertionError

   - [#  33] SDL dijkstras: 
--------------------------------------------------------------------------------
  34:     path = []
  35:     current = dst
  36:     while prev[current]:
  37:         path.append(current)
- 38:         current = prev[current]
+ 38:         pass
  39:     path.append(current)
  40:     
  41:     return path[::-1]
--------------------------------------------------------------------------------
[5.00615 s] timeout

   - [#  34] SDL dijkstras: 
--------------------------------------------------------------------------------
  35:     current = dst
  36:     while prev[current]:
  37:         path.append(current)
  38:         current = prev[current]
- 39:     path.append(current)
+ 39:     pass
  40:     
  41:     return path[::-1]
--------------------------------------------------------------------------------
[0.22255 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]
E       AssertionError

ts-3-5/test_3-5_0-8_267.py:26: AssertionError
