   - [#  35] SDL dijkstras: 
--------------------------------------------------------------------------------
  37:         path.append(current)
  38:         current = prev[current]
  39:     path.append(current)
  40:     
- 41:     return path[::-1]
+ 41:     pass
--------------------------------------------------------------------------------
[0.20485 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]
E       AssertionError

ts-3-5/test_3-5_0-8_267.py:26: AssertionError

   - [#  36] SIR dijkstras: 
--------------------------------------------------------------------------------
  37:         path.append(current)
  38:         current = prev[current]
  39:     path.append(current)
  40:     
- 41:     return path[::-1]
+ 41:     return path[:]
--------------------------------------------------------------------------------
[0.20327 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]
E       AssertionError

ts-3-5/test_3-5_0-8_267.py:26: AssertionError

   - [#  37] ZIL dijkstras: 
--------------------------------------------------------------------------------
   7:     prev = {}
   8:     
   9:     
  10:     for vertex in weighted_graph.vertices:
- 11:         vertices.add(vertex)
- 12:         dist[vertex] = float('inf')
- 13:         prev[vertex] = None
+ 11:         break
+ 12:     
+ 13:     
  14:     
  15:     dist[src] = 0
  16:     
  17:     while vertices:
--------------------------------------------------------------------------------
[0.20559 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]

ts-3-5/test_3-5_0-8_267.py:26: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

weighted_graph = <test_3-5_0-8_267.WeightedGraph object at 0x79a1de0de8c0>
src = 'A', dst = 'B'

>   ???
E   KeyError: 'B'

dijkstras:36: KeyError

   - [#  38] ZIL dijkstras: 
--------------------------------------------------------------------------------
  14:     
  15:     dist[src] = 0
  16:     
  17:     while vertices:
- 18:         min_dist_node = min(list(filter((lambda x: (x[0] in vertices)), dist.items())), key=lambda x: (x[1]))[0]
- 19:         
- 20:         if min_dist_node == dst:
- 21:             break
- 22:         
- 23:         vertices.remove(min_dist_node)
- 24:         
- 25:         for neighbor in weighted_graph.vertices[min_dist_node].adjacent:
- 26:             
- 27:             distance = weighted_graph.vertices[min_dist_node].adjacent[neighbor]
- 28:             
- 29:             if distance < dist[neighbor]:
- 30:                 dist[neighbor] = distance
- 31:                 prev[neighbor] = min_dist_node
+ 18:         break
+ 19:     
+ 20:     
+ 21:     
+ 22:     
+ 23:     
+ 24:     
+ 25:     
+ 26:     
+ 27:     
+ 28:     
+ 29:     
+ 30:     
+ 31:     
  32:     
  33:     
  34:     path = []
  35:     current = dst
--------------------------------------------------------------------------------
[0.20618 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})

   - [#  39] ZIL dijkstras: 
--------------------------------------------------------------------------------
  23:         vertices.remove(min_dist_node)
  24:         
  25:         for neighbor in weighted_graph.vertices[min_dist_node].adjacent:
  26:             
- 27:             distance = weighted_graph.vertices[min_dist_node].adjacent[neighbor]
- 28:             
- 29:             if distance < dist[neighbor]:
- 30:                 dist[neighbor] = distance
- 31:                 prev[neighbor] = min_dist_node
+ 27:             break
+ 28:     
+ 29:     
+ 30:     
+ 31:     
  32:     
  33:     
  34:     path = []
  35:     current = dst
--------------------------------------------------------------------------------
[0.20586 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]
E       AssertionError

ts-3-5/test_3-5_0-8_267.py:26: AssertionError

   - [#  40] ZIL dijkstras: 
--------------------------------------------------------------------------------
  33:     
  34:     path = []
  35:     current = dst
  36:     while prev[current]:
- 37:         path.append(current)
- 38:         current = prev[current]
+ 37:         break
+ 38:     
  39:     path.append(current)
  40:     
  41:     return path[::-1]
--------------------------------------------------------------------------------
[0.20494 s] killed by ts-3-5/test_3-5_0-8_267.py::test_dijkstras

def test_dijkstras():
        # Test case 1: Shortest path between two directly connected vertices
        vertex_a = Vertex({"B": 5})
        vertex_b = Vertex({})
        graph = WeightedGraph({"A": vertex_a, "B": vertex_b})
>       assert dijkstras(graph, "A", "B") == ["A", "B"]
E       AssertionError

ts-3-5/test_3-5_0-8_267.py:26: AssertionError
