1 : Job ID a14ad4e8a9324bd480748be7bb18c17b
test outcome: killed
dll.py, start pos: (97, 32), end pos: (97, 34)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -94,7 +94,7 @@
         curr = self.head
         while curr:
             if curr.data is val:
-                if self._length == 1:
+                if self._length != 1:
                     self.head, self.tail = None, None
                 elif curr is not self.head and curr is not self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - Attribute...
========================= 1 failed, 8 passed in 0.14s ==========================

2 : Job ID db5c3dcd071c4405ac8ada45ebe810f9
SURVIVED
test outcome: survived
dll.py, start pos: (97, 32), end pos: (97, 34)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -94,7 +94,7 @@
         curr = self.head
         while curr:
             if curr.data is val:
-                if self._length == 1:
+                if self._length < 1:
                     self.head, self.tail = None, None
                 elif curr is not self.head and curr is not self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

3 : Job ID 62e7202e58cf468cb70f098760f8cac2
SURVIVED
test outcome: survived
dll.py, start pos: (97, 32), end pos: (97, 34)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -94,7 +94,7 @@
         curr = self.head
         while curr:
             if curr.data is val:
-                if self._length == 1:
+                if self._length <= 1:
                     self.head, self.tail = None, None
                 elif curr is not self.head and curr is not self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

4 : Job ID 839b3c2adab94031a670f9f73d7da964
test outcome: killed
dll.py, start pos: (97, 32), end pos: (97, 34)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -94,7 +94,7 @@
         curr = self.head
         while curr:
             if curr.data is val:
-                if self._length == 1:
+                if self._length > 1:
                     self.head, self.tail = None, None
                 elif curr is not self.head and curr is not self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - Attribute...
========================= 1 failed, 8 passed in 0.14s ==========================

5 : Job ID b54e4b7b51a14c25a0cb9c816e6aac5d
test outcome: killed
dll.py, start pos: (97, 32), end pos: (97, 34)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -94,7 +94,7 @@
         curr = self.head
         while curr:
             if curr.data is val:
-                if self._length == 1:
+                if self._length >= 1:
                     self.head, self.tail = None, None
                 elif curr is not self.head and curr is not self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - Attribute...
========================= 1 failed, 8 passed in 0.14s ==========================

6 : Job ID 032f1502077341889dcc12f8d1fe95c9
test outcome: killed
dll.py, start pos: (55, 24), end pos: (55, 25)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -52,7 +52,7 @@
     def pop(self):
         """Remove the val from the head of the list."""
         to_return = self.head
-        if self._length < 1:
+        if self._length == 1:
             raise IndexError('Cannot pop from an empty list.')
         new_head = self.head.next
ts-3-5/test_3-5_0-8_243.py .....FF..                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - assert [3...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_empty_pop - Attrib...
========================= 2 failed, 7 passed in 0.14s ==========================

7 : Job ID 8558f921a68b4d6cb88d889443e1fddc
SURVIVED
test outcome: survived
dll.py, start pos: (63, 24), end pos: (63, 25)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 1
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -60,7 +60,7 @@
             new_head.prev = None
         self.head = new_head
         self._length -= 1
-        if self._length < 1:
+        if self._length == 1:
             self.tail = None
         return to_return.data
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

8 : Job ID 2bb3e038fa5c459cb3cfc7feb5427633
SURVIVED
test outcome: survived
dll.py, start pos: (73, 24), end pos: (73, 25)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 2
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -70,7 +70,7 @@
         self.tail = Node(val, prev=old_tail)
         if old_tail:
             old_tail.next = self.tail
-        if self._length < 1:
+        if self._length == 1:
             self.head = self.tail
         self._length += 1
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.16s ===============================

9 : Job ID 8a4e1c690d964aaca33f61bf1f5bde45
test outcome: killed
dll.py, start pos: (80, 24), end pos: (80, 25)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 3
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -77,7 +77,7 @@
     def shift(self):
         """Remove the val from the tail of the list."""
         to_return = self.tail
-        if self._length < 1:
+        if self._length == 1:
             raise IndexError('Cannot shift from an empty list.')
         new_tail = self.tail.prev
ts-3-5/test_3-5_0-8_243.py .......F.                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_empty_shift - Attr...
========================= 1 failed, 8 passed in 0.14s ==========================

11 : Job ID 20b8a16880aa411595044a4825b3af1b
test outcome: killed
dll.py, start pos: (55, 24), end pos: (55, 25)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -52,7 +52,7 @@
     def pop(self):
         """Remove the val from the head of the list."""
         to_return = self.head
-        if self._length < 1:
+        if self._length != 1:
             raise IndexError('Cannot pop from an empty list.')
         new_head = self.head.next
ts-3-5/test_3-5_0-8_243.py ..F..F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_pop - IndexError: ...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - assert []...
========================= 2 failed, 7 passed in 0.14s ==========================

12 : Job ID 73effadd6297406cbfdb01e29e7cf65b
SURVIVED
test outcome: survived
dll.py, start pos: (63, 24), end pos: (63, 25)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 1
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -60,7 +60,7 @@
             new_head.prev = None
         self.head = new_head
         self._length -= 1
-        if self._length < 1:
+        if self._length != 1:
             self.tail = None
         return to_return.data
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

13 : Job ID 18e9068cbc124e9ca50039dcd16370db
SURVIVED
test outcome: survived
dll.py, start pos: (73, 24), end pos: (73, 25)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 2
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -70,7 +70,7 @@
         self.tail = Node(val, prev=old_tail)
         if old_tail:
             old_tail.next = self.tail
-        if self._length < 1:
+        if self._length != 1:
             self.head = self.tail
         self._length += 1
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

14 : Job ID 57aa956e791f465fa02d55c797b259c9
test outcome: killed
dll.py, start pos: (80, 24), end pos: (80, 25)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 3
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -77,7 +77,7 @@
     def shift(self):
         """Remove the val from the tail of the list."""
         to_return = self.tail
-        if self._length < 1:
+        if self._length != 1:
             raise IndexError('Cannot shift from an empty list.')
         new_tail = self.tail.prev
ts-3-5/test_3-5_0-8_243.py ....F....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_shift - IndexError...
========================= 1 failed, 8 passed in 0.14s ==========================

16 : Job ID 8d2ee6e32c22413eb56d2069dbbfaae7
test outcome: killed
dll.py, start pos: (55, 24), end pos: (55, 25)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -52,7 +52,7 @@
     def pop(self):
         """Remove the val from the head of the list."""
         to_return = self.head
-        if self._length < 1:
+        if self._length <= 1:
             raise IndexError('Cannot pop from an empty list.')
         new_head = self.head.next
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - assert [3...
========================= 1 failed, 8 passed in 0.14s ==========================

17 : Job ID 4b5c838ceaf24979b52488202181ccbd
SURVIVED
test outcome: survived
dll.py, start pos: (63, 24), end pos: (63, 25)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 1
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -60,7 +60,7 @@
             new_head.prev = None
         self.head = new_head
         self._length -= 1
-        if self._length < 1:
+        if self._length <= 1:
             self.tail = None
         return to_return.data
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.16s ===============================

18 : Job ID a4c8c476da09419f99de58c5e2943bef
SURVIVED
test outcome: survived
dll.py, start pos: (73, 24), end pos: (73, 25)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 2
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -70,7 +70,7 @@
         self.tail = Node(val, prev=old_tail)
         if old_tail:
             old_tail.next = self.tail
-        if self._length < 1:
+        if self._length <= 1:
             self.head = self.tail
         self._length += 1
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

19 : Job ID c06994c52fed49f2978cbd8799c606c4
SURVIVED
test outcome: survived
dll.py, start pos: (80, 24), end pos: (80, 25)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 3
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -77,7 +77,7 @@
     def shift(self):
         """Remove the val from the tail of the list."""
         to_return = self.tail
-        if self._length < 1:
+        if self._length <= 1:
             raise IndexError('Cannot shift from an empty list.')
         new_tail = self.tail.prev
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

21 : Job ID 03a7c351355e40a6b590da266a4a200f
test outcome: killed
dll.py, start pos: (55, 24), end pos: (55, 25)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -52,7 +52,7 @@
     def pop(self):
         """Remove the val from the head of the list."""
         to_return = self.head
-        if self._length < 1:
+        if self._length > 1:
             raise IndexError('Cannot pop from an empty list.')
         new_head = self.head.next
ts-3-5/test_3-5_0-8_243.py ..F..FF..                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_pop - IndexError: ...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - assert []...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_empty_pop - Attrib...
========================= 3 failed, 6 passed in 0.14s ==========================

22 : Job ID eced6acac9ca4f3ab4fbae8b014526ce
SURVIVED
test outcome: survived
dll.py, start pos: (63, 24), end pos: (63, 25)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 1
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -60,7 +60,7 @@
             new_head.prev = None
         self.head = new_head
         self._length -= 1
-        if self._length < 1:
+        if self._length > 1:
             self.tail = None
         return to_return.data
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

23 : Job ID b2f998b5df50448d8a19333e4e3174c6
SURVIVED
test outcome: survived
dll.py, start pos: (73, 24), end pos: (73, 25)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 2
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -70,7 +70,7 @@
         self.tail = Node(val, prev=old_tail)
         if old_tail:
             old_tail.next = self.tail
-        if self._length < 1:
+        if self._length > 1:
             self.head = self.tail
         self._length += 1
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

24 : Job ID dc2915d8f2694853bc9e08ffa9da9fa1
test outcome: killed
dll.py, start pos: (80, 24), end pos: (80, 25)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 3
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -77,7 +77,7 @@
     def shift(self):
         """Remove the val from the tail of the list."""
         to_return = self.tail
-        if self._length < 1:
+        if self._length > 1:
             raise IndexError('Cannot shift from an empty list.')
         new_tail = self.tail.prev
ts-3-5/test_3-5_0-8_243.py ....F..F.                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_shift - IndexError...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_empty_shift - Attr...
========================= 2 failed, 7 passed in 0.14s ==========================

26 : Job ID 8404a859de254a1399ef0a633965b414
test outcome: killed
dll.py, start pos: (55, 24), end pos: (55, 25)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -52,7 +52,7 @@
     def pop(self):
         """Remove the val from the head of the list."""
         to_return = self.head
-        if self._length < 1:
+        if self._length >= 1:
             raise IndexError('Cannot pop from an empty list.')
         new_head = self.head.next
ts-3-5/test_3-5_0-8_243.py ..F..FF..                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_pop - IndexError: ...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - assert []...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_empty_pop - Attrib...
========================= 3 failed, 6 passed in 0.14s ==========================

27 : Job ID a9532ee82f9c4cabb7a6bb76e90e8e21
SURVIVED
test outcome: survived
dll.py, start pos: (63, 24), end pos: (63, 25)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 1
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -60,7 +60,7 @@
             new_head.prev = None
         self.head = new_head
         self._length -= 1
-        if self._length < 1:
+        if self._length >= 1:
             self.tail = None
         return to_return.data
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

28 : Job ID 465ddbe790e54b9cb1b8c40a200fd24f
SURVIVED
test outcome: survived
dll.py, start pos: (73, 24), end pos: (73, 25)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 2
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -70,7 +70,7 @@
         self.tail = Node(val, prev=old_tail)
         if old_tail:
             old_tail.next = self.tail
-        if self._length < 1:
+        if self._length >= 1:
             self.head = self.tail
         self._length += 1
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

29 : Job ID d631959cbd6c4169bc74973f1c2643ae
test outcome: killed
dll.py, start pos: (80, 24), end pos: (80, 25)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 3
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -77,7 +77,7 @@
     def shift(self):
         """Remove the val from the tail of the list."""
         to_return = self.tail
-        if self._length < 1:
+        if self._length >= 1:
             raise IndexError('Cannot shift from an empty list.')
         new_tail = self.tail.prev
ts-3-5/test_3-5_0-8_243.py ....F..F.                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_shift - IndexError...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_empty_shift - Attr...
========================= 2 failed, 7 passed in 0.14s ==========================

31 : Job ID 54eb20ba70a947fd9c0878850aa87937
SURVIVED
test outcome: survived
dll.py, start pos: (96, 25), end pos: (96, 27)
operator: core/ReplaceComparisonOperator_Is_Eq, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -93,7 +93,7 @@
         """Remove first occurance of val from list."""
         curr = self.head
         while curr:
-            if curr.data is val:
+            if curr.data == val:
                 if self._length == 1:
                     self.head, self.tail = None, None
                 elif curr is not self.head and curr is not self.tail:
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

32 : Job ID 64bf4c425a0343519bc49e374bdf144b
SURVIVED
test outcome: survived
dll.py, start pos: (101, 26), end pos: (101, 28)
operator: core/ReplaceComparisonOperator_Is_Eq, occurrence: 1
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -98,7 +98,7 @@
                     self.head, self.tail = None, None
                 elif curr is not self.head and curr is not self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
-                elif curr is self.head:
+                elif curr == self.head:
                     self.head, curr.next.prev = curr.next, None
                 elif curr is self.tail:
                     self.tail, curr.prev.next = curr.prev, None
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

33 : Job ID 8a33fa6a76b64d68a5e21899824a7d5a
SURVIVED
test outcome: survived
dll.py, start pos: (103, 26), end pos: (103, 28)
operator: core/ReplaceComparisonOperator_Is_Eq, occurrence: 2
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -100,7 +100,7 @@
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
                 elif curr is self.head:
                     self.head, curr.next.prev = curr.next, None
-                elif curr is self.tail:
+                elif curr == self.tail:
                     self.tail, curr.prev.next = curr.prev, None
                 self._length -= 1
                 return
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

34 : Job ID 7faa4716327a4b4089561f3cad1cc849
test outcome: killed
dll.py, start pos: (96, 25), end pos: (96, 27)
operator: core/ReplaceComparisonOperator_Is_NotEq, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -93,7 +93,7 @@
         """Remove first occurance of val from list."""
         curr = self.head
         while curr:
-            if curr.data is val:
+            if curr.data != val:
                 if self._length == 1:
                     self.head, self.tail = None, None
                 elif curr is not self.head and curr is not self.tail:
ts-3-5/test_3-5_0-8_243.py .....F..F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - assert [2...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove_non_existent
========================= 2 failed, 7 passed in 0.13s ==========================

35 : Job ID bb277f5676bd4a5aa5c84accf5e24faa
SURVIVED
test outcome: survived
dll.py, start pos: (101, 26), end pos: (101, 28)
operator: core/ReplaceComparisonOperator_Is_NotEq, occurrence: 1
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -98,7 +98,7 @@
                     self.head, self.tail = None, None
                 elif curr is not self.head and curr is not self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
-                elif curr is self.head:
+                elif curr != self.head:
                     self.head, curr.next.prev = curr.next, None
                 elif curr is self.tail:
                     self.tail, curr.prev.next = curr.prev, None
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

36 : Job ID 3c94412b6a204b9c84064e2e96d47f7b
SURVIVED
test outcome: survived
dll.py, start pos: (103, 26), end pos: (103, 28)
operator: core/ReplaceComparisonOperator_Is_NotEq, occurrence: 2
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -100,7 +100,7 @@
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
                 elif curr is self.head:
                     self.head, curr.next.prev = curr.next, None
-                elif curr is self.tail:
+                elif curr != self.tail:
                     self.tail, curr.prev.next = curr.prev, None
                 self._length -= 1
                 return
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

37 : Job ID 12b2a7706152450eb33e6bec4423955d
test outcome: killed
dll.py, start pos: (96, 25), end pos: (96, 27)
operator: core/ReplaceComparisonOperator_Is_Lt, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -93,7 +93,7 @@
         """Remove first occurance of val from list."""
         curr = self.head
         while curr:
-            if curr.data is val:
+            if curr.data < val:
                 if self._length == 1:
                     self.head, self.tail = None, None
                 elif curr is not self.head and curr is not self.tail:
ts-3-5/test_3-5_0-8_243.py .....F..F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - assert [3...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove_non_existent
========================= 2 failed, 7 passed in 0.14s ==========================

38 : Job ID 13dad5898be44688945cbb93fef46f3d
SURVIVED
test outcome: survived
dll.py, start pos: (101, 26), end pos: (101, 28)
operator: core/ReplaceComparisonOperator_Is_Lt, occurrence: 1
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -98,7 +98,7 @@
                     self.head, self.tail = None, None
                 elif curr is not self.head and curr is not self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
-                elif curr is self.head:
+                elif curr < self.head:
                     self.head, curr.next.prev = curr.next, None
                 elif curr is self.tail:
                     self.tail, curr.prev.next = curr.prev, None
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

39 : Job ID 4c15bc679aeb423ebc6ee82639dc9bfe
SURVIVED
test outcome: survived
dll.py, start pos: (103, 26), end pos: (103, 28)
operator: core/ReplaceComparisonOperator_Is_Lt, occurrence: 2
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -100,7 +100,7 @@
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
                 elif curr is self.head:
                     self.head, curr.next.prev = curr.next, None
-                elif curr is self.tail:
+                elif curr < self.tail:
                     self.tail, curr.prev.next = curr.prev, None
                 self._length -= 1
                 return
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

40 : Job ID 144b4979aec14657a6a5ec2670c47109
test outcome: killed
dll.py, start pos: (96, 25), end pos: (96, 27)
operator: core/ReplaceComparisonOperator_Is_LtE, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -93,7 +93,7 @@
         """Remove first occurance of val from list."""
         curr = self.head
         while curr:
-            if curr.data is val:
+            if curr.data <= val:
                 if self._length == 1:
                     self.head, self.tail = None, None
                 elif curr is not self.head and curr is not self.tail:
ts-3-5/test_3-5_0-8_243.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove_non_existent
========================= 1 failed, 8 passed in 0.13s ==========================

41 : Job ID 2aef5a49a6da41a9b5ff5622b9ebcc55
SURVIVED
test outcome: survived
dll.py, start pos: (101, 26), end pos: (101, 28)
operator: core/ReplaceComparisonOperator_Is_LtE, occurrence: 1
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -98,7 +98,7 @@
                     self.head, self.tail = None, None
                 elif curr is not self.head and curr is not self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
-                elif curr is self.head:
+                elif curr <= self.head:
                     self.head, curr.next.prev = curr.next, None
                 elif curr is self.tail:
                     self.tail, curr.prev.next = curr.prev, None
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

42 : Job ID 6b43fbf8030a4cd9a7352dc40e88e66c
SURVIVED
test outcome: survived
dll.py, start pos: (103, 26), end pos: (103, 28)
operator: core/ReplaceComparisonOperator_Is_LtE, occurrence: 2
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -100,7 +100,7 @@
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
                 elif curr is self.head:
                     self.head, curr.next.prev = curr.next, None
-                elif curr is self.tail:
+                elif curr <= self.tail:
                     self.tail, curr.prev.next = curr.prev, None
                 self._length -= 1
                 return
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================
