43 : Job ID 13caac55431a40d996c55337394bc43d
test outcome: killed
dll.py, start pos: (96, 25), end pos: (96, 27)
operator: core/ReplaceComparisonOperator_Is_Gt, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -93,7 +93,7 @@
         """Remove first occurance of val from list."""
         curr = self.head
         while curr:
-            if curr.data is val:
+            if curr.data > val:
                 if self._length == 1:
                     self.head, self.tail = None, None
                 elif curr is not self.head and curr is not self.tail:
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - assert [2...
========================= 1 failed, 8 passed in 0.14s ==========================

44 : Job ID 6e1ac82c3e1042dca3b71e1f052e9b2f
SURVIVED
test outcome: survived
dll.py, start pos: (101, 26), end pos: (101, 28)
operator: core/ReplaceComparisonOperator_Is_Gt, occurrence: 1
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -98,7 +98,7 @@
                     self.head, self.tail = None, None
                 elif curr is not self.head and curr is not self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
-                elif curr is self.head:
+                elif curr > self.head:
                     self.head, curr.next.prev = curr.next, None
                 elif curr is self.tail:
                     self.tail, curr.prev.next = curr.prev, None
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

45 : Job ID 36aa3a009ad34ff19b17b8f2a86e33da
SURVIVED
test outcome: survived
dll.py, start pos: (103, 26), end pos: (103, 28)
operator: core/ReplaceComparisonOperator_Is_Gt, occurrence: 2
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -100,7 +100,7 @@
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
                 elif curr is self.head:
                     self.head, curr.next.prev = curr.next, None
-                elif curr is self.tail:
+                elif curr > self.tail:
                     self.tail, curr.prev.next = curr.prev, None
                 self._length -= 1
                 return
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

46 : Job ID 771bd058f55346d4bddcdc590bec4a99
test outcome: killed
dll.py, start pos: (96, 25), end pos: (96, 27)
operator: core/ReplaceComparisonOperator_Is_GtE, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -93,7 +93,7 @@
         """Remove first occurance of val from list."""
         curr = self.head
         while curr:
-            if curr.data is val:
+            if curr.data >= val:
                 if self._length == 1:
                     self.head, self.tail = None, None
                 elif curr is not self.head and curr is not self.tail:
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - assert [2...
========================= 1 failed, 8 passed in 0.14s ==========================

47 : Job ID 47f94e892562450d8bb50160f4c5b5c1
SURVIVED
test outcome: survived
dll.py, start pos: (101, 26), end pos: (101, 28)
operator: core/ReplaceComparisonOperator_Is_GtE, occurrence: 1
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -98,7 +98,7 @@
                     self.head, self.tail = None, None
                 elif curr is not self.head and curr is not self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
-                elif curr is self.head:
+                elif curr >= self.head:
                     self.head, curr.next.prev = curr.next, None
                 elif curr is self.tail:
                     self.tail, curr.prev.next = curr.prev, None
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

48 : Job ID 6e91ee609b9e4c0f8f799a709610d9bf
SURVIVED
test outcome: survived
dll.py, start pos: (103, 26), end pos: (103, 28)
operator: core/ReplaceComparisonOperator_Is_GtE, occurrence: 2
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -100,7 +100,7 @@
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
                 elif curr is self.head:
                     self.head, curr.next.prev = curr.next, None
-                elif curr is self.tail:
+                elif curr >= self.tail:
                     self.tail, curr.prev.next = curr.prev, None
                 self._length -= 1
                 return
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

49 : Job ID 238486b86e9142968b7863747ad58640
test outcome: killed
dll.py, start pos: (96, 25), end pos: (96, 27)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -93,7 +93,7 @@
         """Remove first occurance of val from list."""
         curr = self.head
         while curr:
-            if curr.data is val:
+            if curr.data is not val:
                 if self._length == 1:
                     self.head, self.tail = None, None
                 elif curr is not self.head and curr is not self.tail:
ts-3-5/test_3-5_0-8_243.py .....F..F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - assert [2...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove_non_existent
========================= 2 failed, 7 passed in 0.14s ==========================

50 : Job ID 8f917d098a244040b2986d04cc235b59
SURVIVED
test outcome: survived
dll.py, start pos: (101, 26), end pos: (101, 28)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 1
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -98,7 +98,7 @@
                     self.head, self.tail = None, None
                 elif curr is not self.head and curr is not self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
-                elif curr is self.head:
+                elif curr is not self.head:
                     self.head, curr.next.prev = curr.next, None
                 elif curr is self.tail:
                     self.tail, curr.prev.next = curr.prev, None
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

51 : Job ID c8a27370d49f4ca488100e95d4f436d5
SURVIVED
test outcome: survived
dll.py, start pos: (103, 26), end pos: (103, 28)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 2
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -100,7 +100,7 @@
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
                 elif curr is self.head:
                     self.head, curr.next.prev = curr.next, None
-                elif curr is self.tail:
+                elif curr is not self.tail:
                     self.tail, curr.prev.next = curr.prev, None
                 self._length -= 1
                 return
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

52 : Job ID 54bfc5af0b244af8b8b00ea380087d4f
test outcome: killed
dll.py, start pos: (99, 26), end pos: (99, 32)
operator: core/ReplaceComparisonOperator_IsNot_Eq, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -96,7 +96,7 @@
             if curr.data is val:
                 if self._length == 1:
                     self.head, self.tail = None, None
-                elif curr is not self.head and curr is not self.tail:
+                elif curr == self.head and curr is not self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
                 elif curr is self.head:
                     self.head, curr.next.prev = curr.next, None
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - assert [3...
========================= 1 failed, 8 passed in 0.14s ==========================

53 : Job ID e3f5e8c2ae7043a19f2a2d6a661bca7f
test outcome: killed
dll.py, start pos: (99, 52), end pos: (99, 58)
operator: core/ReplaceComparisonOperator_IsNot_Eq, occurrence: 1
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -96,7 +96,7 @@
             if curr.data is val:
                 if self._length == 1:
                     self.head, self.tail = None, None
-                elif curr is not self.head and curr is not self.tail:
+                elif curr is not self.head and curr == self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
                 elif curr is self.head:
                     self.head, curr.next.prev = curr.next, None
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - assert [3...
========================= 1 failed, 8 passed in 0.13s ==========================

54 : Job ID 74428f79398c4d7ab7c42178ab142d60
SURVIVED
test outcome: survived
dll.py, start pos: (99, 26), end pos: (99, 32)
operator: core/ReplaceComparisonOperator_IsNot_NotEq, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -96,7 +96,7 @@
             if curr.data is val:
                 if self._length == 1:
                     self.head, self.tail = None, None
-                elif curr is not self.head and curr is not self.tail:
+                elif curr != self.head and curr is not self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
                 elif curr is self.head:
                     self.head, curr.next.prev = curr.next, None
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

55 : Job ID ac8f28ad21714018b3acbf38ca570752
SURVIVED
test outcome: survived
dll.py, start pos: (99, 52), end pos: (99, 58)
operator: core/ReplaceComparisonOperator_IsNot_NotEq, occurrence: 1
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -96,7 +96,7 @@
             if curr.data is val:
                 if self._length == 1:
                     self.head, self.tail = None, None
-                elif curr is not self.head and curr is not self.tail:
+                elif curr is not self.head and curr != self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
                 elif curr is self.head:
                     self.head, curr.next.prev = curr.next, None
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

56 : Job ID 2fb969e8bbde4408bccad84028ee6fbf
test outcome: killed
dll.py, start pos: (99, 26), end pos: (99, 32)
operator: core/ReplaceComparisonOperator_IsNot_Lt, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -96,7 +96,7 @@
             if curr.data is val:
                 if self._length == 1:
                     self.head, self.tail = None, None
-                elif curr is not self.head and curr is not self.tail:
+                elif curr < self.head and curr is not self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
                 elif curr is self.head:
                     self.head, curr.next.prev = curr.next, None
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - TypeError...
========================= 1 failed, 8 passed in 0.14s ==========================

57 : Job ID 13613b613c73487a9f08554c9a2aa0b1
test outcome: killed
dll.py, start pos: (99, 52), end pos: (99, 58)
operator: core/ReplaceComparisonOperator_IsNot_Lt, occurrence: 1
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -96,7 +96,7 @@
             if curr.data is val:
                 if self._length == 1:
                     self.head, self.tail = None, None
-                elif curr is not self.head and curr is not self.tail:
+                elif curr is not self.head and curr < self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
                 elif curr is self.head:
                     self.head, curr.next.prev = curr.next, None
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - TypeError...
========================= 1 failed, 8 passed in 0.14s ==========================

58 : Job ID 9fc496555a634a0898fde32c5eab9592
test outcome: killed
dll.py, start pos: (99, 26), end pos: (99, 32)
operator: core/ReplaceComparisonOperator_IsNot_LtE, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -96,7 +96,7 @@
             if curr.data is val:
                 if self._length == 1:
                     self.head, self.tail = None, None
-                elif curr is not self.head and curr is not self.tail:
+                elif curr <= self.head and curr is not self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
                 elif curr is self.head:
                     self.head, curr.next.prev = curr.next, None
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - TypeError...
========================= 1 failed, 8 passed in 0.13s ==========================

59 : Job ID a200308c8cbe4722bcbd96bbf0837229
test outcome: killed
dll.py, start pos: (99, 52), end pos: (99, 58)
operator: core/ReplaceComparisonOperator_IsNot_LtE, occurrence: 1
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -96,7 +96,7 @@
             if curr.data is val:
                 if self._length == 1:
                     self.head, self.tail = None, None
-                elif curr is not self.head and curr is not self.tail:
+                elif curr is not self.head and curr <= self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
                 elif curr is self.head:
                     self.head, curr.next.prev = curr.next, None
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - TypeError...
========================= 1 failed, 8 passed in 0.14s ==========================

60 : Job ID 783d6fda37854c2aa4e281a8b2002b34
test outcome: killed
dll.py, start pos: (99, 26), end pos: (99, 32)
operator: core/ReplaceComparisonOperator_IsNot_Gt, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -96,7 +96,7 @@
             if curr.data is val:
                 if self._length == 1:
                     self.head, self.tail = None, None
-                elif curr is not self.head and curr is not self.tail:
+                elif curr > self.head and curr is not self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
                 elif curr is self.head:
                     self.head, curr.next.prev = curr.next, None
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - TypeError...
========================= 1 failed, 8 passed in 0.13s ==========================

61 : Job ID 95efeca92e7e4f60906367063d40901b
test outcome: killed
dll.py, start pos: (99, 52), end pos: (99, 58)
operator: core/ReplaceComparisonOperator_IsNot_Gt, occurrence: 1
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -96,7 +96,7 @@
             if curr.data is val:
                 if self._length == 1:
                     self.head, self.tail = None, None
-                elif curr is not self.head and curr is not self.tail:
+                elif curr is not self.head and curr > self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
                 elif curr is self.head:
                     self.head, curr.next.prev = curr.next, None
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - TypeError...
========================= 1 failed, 8 passed in 0.13s ==========================

62 : Job ID e4262bf857bb4219b0b6419157c60f91
test outcome: killed
dll.py, start pos: (99, 26), end pos: (99, 32)
operator: core/ReplaceComparisonOperator_IsNot_GtE, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -96,7 +96,7 @@
             if curr.data is val:
                 if self._length == 1:
                     self.head, self.tail = None, None
-                elif curr is not self.head and curr is not self.tail:
+                elif curr >= self.head and curr is not self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
                 elif curr is self.head:
                     self.head, curr.next.prev = curr.next, None
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - TypeError...
========================= 1 failed, 8 passed in 0.14s ==========================

63 : Job ID ede1535f9540461e994c8045d2723338
test outcome: killed
dll.py, start pos: (99, 52), end pos: (99, 58)
operator: core/ReplaceComparisonOperator_IsNot_GtE, occurrence: 1
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -96,7 +96,7 @@
             if curr.data is val:
                 if self._length == 1:
                     self.head, self.tail = None, None
-                elif curr is not self.head and curr is not self.tail:
+                elif curr is not self.head and curr >= self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
                 elif curr is self.head:
                     self.head, curr.next.prev = curr.next, None
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - TypeError...
========================= 1 failed, 8 passed in 0.14s ==========================

64 : Job ID 1ac6e362a7dd49638e1289c2ecd7b1d5
test outcome: killed
dll.py, start pos: (99, 26), end pos: (99, 32)
operator: core/ReplaceComparisonOperator_IsNot_Is, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -96,7 +96,7 @@
             if curr.data is val:
                 if self._length == 1:
                     self.head, self.tail = None, None
-                elif curr is not self.head and curr is not self.tail:
+                elif curr is self.head and curr is not self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
                 elif curr is self.head:
                     self.head, curr.next.prev = curr.next, None
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - assert [3...
========================= 1 failed, 8 passed in 0.13s ==========================

65 : Job ID fb0a534f8d5942ffa5ac5c211c266c81
test outcome: killed
dll.py, start pos: (99, 52), end pos: (99, 58)
operator: core/ReplaceComparisonOperator_IsNot_Is, occurrence: 1
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -96,7 +96,7 @@
             if curr.data is val:
                 if self._length == 1:
                     self.head, self.tail = None, None
-                elif curr is not self.head and curr is not self.tail:
+                elif curr is not self.head and curr is self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
                 elif curr is self.head:
                     self.head, curr.next.prev = curr.next, None
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - assert [3...
========================= 1 failed, 8 passed in 0.14s ==========================

66 : Job ID 5d5f8f8c0dfe4dc9a15005c107d3ff1b
test outcome: killed
dll.py, start pos: (48, 11), end pos: (48, 14)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -45,7 +45,7 @@
         self.head = Node(val, next_node=old_head)
         if old_head:
             old_head.prev = self.head
-        if not self.tail:
+        if  self.tail:
             self.tail = self.head
         self._length += 1
ts-3-5/test_3-5_0-8_243.py ....F....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_shift - AttributeE...
========================= 1 failed, 8 passed in 0.14s ==========================

68 : Job ID b62c795a07d747c5ba5ff8aff86fd6c0
test outcome: killed
dll.py, start pos: (46, 11), end pos: (46, 19)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -43,7 +43,7 @@
         """Add val to the head of the list."""
         old_head = self.head
         self.head = Node(val, next_node=old_head)
-        if old_head:
+        if not old_head:
             old_head.prev = self.head
         if not self.tail:
             self.tail = self.head
ts-3-5/test_3-5_0-8_243.py .FF.FF..F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_push - AttributeEr...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_pop - AttributeErr...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_shift - AttributeE...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - Attribute...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove_non_existent
========================= 5 failed, 4 passed in 0.14s ==========================

69 : Job ID a60402cd89444fa8bd3d940691c0ba84
test outcome: killed
dll.py, start pos: (48, 11), end pos: (48, 24)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -45,7 +45,7 @@
         self.head = Node(val, next_node=old_head)
         if old_head:
             old_head.prev = self.head
-        if not self.tail:
+        if not not self.tail:
             self.tail = self.head
         self._length += 1
ts-3-5/test_3-5_0-8_243.py ....F....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_shift - AttributeE...
========================= 1 failed, 8 passed in 0.13s ==========================

70 : Job ID 1d72a2ee8e654ea5abd2ebfe1357fcd2
test outcome: killed
dll.py, start pos: (55, 11), end pos: (55, 27)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -52,7 +52,7 @@
     def pop(self):
         """Remove the val from the head of the list."""
         to_return = self.head
-        if self._length < 1:
+        if not self._length < 1:
             raise IndexError('Cannot pop from an empty list.')
         new_head = self.head.next
ts-3-5/test_3-5_0-8_243.py ..F..FF..                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_pop - IndexError: ...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - assert []...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_empty_pop - Attrib...
========================= 3 failed, 6 passed in 0.14s ==========================

71 : Job ID 5183e1213ac545d096df5d056f161451
test outcome: killed
dll.py, start pos: (59, 11), end pos: (59, 19)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -56,7 +56,7 @@
             raise IndexError('Cannot pop from an empty list.')
         new_head = self.head.next
-        if new_head:
+        if not new_head:
             new_head.prev = None
         self.head = new_head
         self._length -= 1
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - Attribute...
========================= 1 failed, 8 passed in 0.13s ==========================

72 : Job ID a9f45af2e7da4eda87f7feddc7b87ba4
SURVIVED
test outcome: survived
dll.py, start pos: (63, 11), end pos: (63, 27)
operator: core/AddNot, occurrence: 5
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -60,7 +60,7 @@
             new_head.prev = None
         self.head = new_head
         self._length -= 1
-        if self._length < 1:
+        if not self._length < 1:
             self.tail = None
         return to_return.data
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

73 : Job ID a82f4ffd3a4047eeb1177c87beab18de
test outcome: killed
dll.py, start pos: (71, 11), end pos: (71, 19)
operator: core/AddNot, occurrence: 6
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -68,7 +68,7 @@
         """Add val to the tail of the list."""
         old_tail = self.tail
         self.tail = Node(val, prev=old_tail)
-        if old_tail:
+        if not old_tail:
             old_tail.next = self.tail
         if self._length < 1:
             self.head = self.tail
ts-3-5/test_3-5_0-8_243.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_append - Attribute...
========================= 1 failed, 8 passed in 0.14s ==========================

74 : Job ID 113c08e1b99f4609bab79573ed2bb0ce
SURVIVED
test outcome: survived
dll.py, start pos: (73, 11), end pos: (73, 27)
operator: core/AddNot, occurrence: 7
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -70,7 +70,7 @@
         self.tail = Node(val, prev=old_tail)
         if old_tail:
             old_tail.next = self.tail
-        if self._length < 1:
+        if not self._length < 1:
             self.head = self.tail
         self._length += 1
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

75 : Job ID 073d9bb36c7c436984ee14f5839419ad
test outcome: killed
dll.py, start pos: (80, 11), end pos: (80, 27)
operator: core/AddNot, occurrence: 8
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -77,7 +77,7 @@
     def shift(self):
         """Remove the val from the tail of the list."""
         to_return = self.tail
-        if self._length < 1:
+        if not self._length < 1:
             raise IndexError('Cannot shift from an empty list.')
         new_tail = self.tail.prev
ts-3-5/test_3-5_0-8_243.py ....F..F.                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_shift - IndexError...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_empty_shift - Attr...
========================= 2 failed, 7 passed in 0.14s ==========================

76 : Job ID 353abd22917f4802bc48d99042cc38df
SURVIVED
test outcome: survived
dll.py, start pos: (84, 11), end pos: (84, 19)
operator: core/AddNot, occurrence: 9
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -81,7 +81,7 @@
             raise IndexError('Cannot shift from an empty list.')
         new_tail = self.tail.prev
-        if new_tail:
+        if not new_tail:
             new_tail.next = None
         self.tail = new_tail
         self._length -= 1
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================
