79 : Job ID 3295607000494d0a998018714f3ec9e8
test outcome: killed
dll.py, start pos: (96, 15), end pos: (96, 31)
operator: core/AddNot, occurrence: 12
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -93,7 +93,7 @@
         """Remove first occurance of val from list."""
         curr = self.head
         while curr:
-            if curr.data is val:
+            if not curr.data is val:
                 if self._length == 1:
                     self.head, self.tail = None, None
                 elif curr is not self.head and curr is not self.tail:
ts-3-5/test_3-5_0-8_243.py .....F..F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - assert [2...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove_non_existent
========================= 2 failed, 7 passed in 0.14s ==========================

80 : Job ID 6ce577e082c74ed99af6dc52564d526b
test outcome: killed
dll.py, start pos: (97, 19), end pos: (97, 36)
operator: core/AddNot, occurrence: 13
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -94,7 +94,7 @@
         curr = self.head
         while curr:
             if curr.data is val:
-                if self._length == 1:
+                if not self._length == 1:
                     self.head, self.tail = None, None
                 elif curr is not self.head and curr is not self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - Attribute...
========================= 1 failed, 8 passed in 0.13s ==========================

81 : Job ID 988d1b5b468947b9bd6f49da41973653
test outcome: killed
dll.py, start pos: (114, 14), end pos: (114, 18)
operator: core/AddNot, occurrence: 14
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -111,7 +111,7 @@
     def _repr(self):
         """Return list representation of dll."""
         l = []
-        while True:
+        while not True:
             try:
                 popped_data = self.pop()
                 l.append(popped_data)
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - assert []...
========================= 1 failed, 8 passed in 0.14s ==========================

82 : Job ID 2796a11528514185b1cc7160e84a18c3
test outcome: killed
dll.py, start pos: (114, 14), end pos: (114, 18)
operator: core/ReplaceTrueWithFalse, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -111,7 +111,7 @@
     def _repr(self):
         """Return list representation of dll."""
         l = []
-        while True:
+        while False:
             try:
                 popped_data = self.pop()
                 l.append(popped_data)
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - assert []...
========================= 1 failed, 8 passed in 0.14s ==========================

83 : Job ID 691cce5e42824b29a8cb996aa0bcfa86
SURVIVED
test outcome: survived
dll.py, start pos: (99, 43), end pos: (99, 46)
operator: core/ReplaceAndWithOr, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -96,7 +96,7 @@
             if curr.data is val:
                 if self._length == 1:
                     self.head, self.tail = None, None
-                elif curr is not self.head and curr is not self.tail:
+                elif curr is not self.head or curr is not self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
                 elif curr is self.head:
                     self.head, curr.next.prev = curr.next, None
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

84 : Job ID 7772ad8021794133bec07e09c29796f9
test outcome: killed
dll.py, start pos: (119, 16), end pos: (119, 21)
operator: core/ReplaceBreakWithContinue, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -116,6 +116,6 @@
                 popped_data = self.pop()
                 l.append(popped_data)
             except IndexError:
-                break
+                continue
         return l
timeout

86 : Job ID f9213f6fc8044e04b1a5525a40bc8183
test outcome: killed
dll.py, start pos: (118, 19), end pos: (118, 29)
operator: core/ExceptionReplacer, occurrence: 1
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -115,7 +115,7 @@
             try:
                 popped_data = self.pop()
                 l.append(popped_data)
-            except IndexError:
+            except CosmicRayTestingException:
                 break
         return l
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - NameError...
========================= 1 failed, 8 passed in 0.14s ==========================

87 : Job ID 874edd6a8e8d4eaeb49d4c4567c4617b
test outcome: killed
dll.py, start pos: (34, 23), end pos: (34, 24)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -31,7 +31,7 @@
         """Initialize list."""
         self.head = None
         self.tail = None
-        self._length = 0
+        self._length = 1
         try:
             for val in data:
                 self.push(val)
ts-3-5/test_3-5_0-8_243.py .....FFF.                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - Attribute...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_empty_pop - Attrib...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_empty_shift - Attr...
========================= 3 failed, 6 passed in 0.14s ==========================

88 : Job ID 995d5702741b401f858ce61b771c02e6
test outcome: killed
dll.py, start pos: (34, 23), end pos: (34, 24)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -31,7 +31,7 @@
         """Initialize list."""
         self.head = None
         self.tail = None
-        self._length = 0
+        self._length = -1
         try:
             for val in data:
                 self.push(val)
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - assert [3...
========================= 1 failed, 8 passed in 0.13s ==========================

89 : Job ID b5fe02379868438b903faa794945e8af
test outcome: killed
dll.py, start pos: (50, 24), end pos: (50, 25)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -47,7 +47,7 @@
             old_head.prev = self.head
         if not self.tail:
             self.tail = self.head
-        self._length += 1
+        self._length += 2
     def pop(self):
         """Remove the val from the head of the list."""
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - Attribute...
========================= 1 failed, 8 passed in 0.14s ==========================

90 : Job ID fbe037bd6a7940d294835d972a895263
test outcome: killed
dll.py, start pos: (50, 24), end pos: (50, 25)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -47,7 +47,7 @@
             old_head.prev = self.head
         if not self.tail:
             self.tail = self.head
-        self._length += 1
+        self._length += 0
     def pop(self):
         """Remove the val from the head of the list."""
ts-3-5/test_3-5_0-8_243.py ..F.FF...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_pop - IndexError: ...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_shift - IndexError...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - assert []...
========================= 3 failed, 6 passed in 0.14s ==========================

91 : Job ID fd3b52e2e95240298ebe98c46a4fa7fd
test outcome: killed
dll.py, start pos: (55, 26), end pos: (55, 27)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -52,7 +52,7 @@
     def pop(self):
         """Remove the val from the head of the list."""
         to_return = self.head
-        if self._length < 1:
+        if self._length < 2:
             raise IndexError('Cannot pop from an empty list.')
         new_head = self.head.next
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - assert [3...
========================= 1 failed, 8 passed in 0.14s ==========================

92 : Job ID 31db696c838349d08d99706aec37b30f
test outcome: killed
dll.py, start pos: (55, 26), end pos: (55, 27)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -52,7 +52,7 @@
     def pop(self):
         """Remove the val from the head of the list."""
         to_return = self.head
-        if self._length < 1:
+        if self._length < 0:
             raise IndexError('Cannot pop from an empty list.')
         new_head = self.head.next
ts-3-5/test_3-5_0-8_243.py .....FF..                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - Attribute...
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_empty_pop - Attrib...
========================= 2 failed, 7 passed in 0.14s ==========================

93 : Job ID be4f63e6f287478eaf1e0b39317edd7d
test outcome: killed
dll.py, start pos: (62, 24), end pos: (62, 25)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -59,7 +59,7 @@
         if new_head:
             new_head.prev = None
         self.head = new_head
-        self._length -= 1
+        self._length -= 2
         if self._length < 1:
             self.tail = None
         return to_return.data
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - assert [3...
========================= 1 failed, 8 passed in 0.13s ==========================

94 : Job ID 1bfd86221d9a4a6cbf857474dc28b965
test outcome: killed
dll.py, start pos: (62, 24), end pos: (62, 25)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -59,7 +59,7 @@
         if new_head:
             new_head.prev = None
         self.head = new_head
-        self._length -= 1
+        self._length -= 0
         if self._length < 1:
             self.tail = None
         return to_return.data
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - Attribute...
========================= 1 failed, 8 passed in 0.14s ==========================

95 : Job ID 13c585f8c736489790e68414a0efd575
SURVIVED
test outcome: survived
dll.py, start pos: (63, 26), end pos: (63, 27)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -60,7 +60,7 @@
             new_head.prev = None
         self.head = new_head
         self._length -= 1
-        if self._length < 1:
+        if self._length < 2:
             self.tail = None
         return to_return.data
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

96 : Job ID 9beed3e08a9442deb15eb8975f4ff232
SURVIVED
test outcome: survived
dll.py, start pos: (63, 26), end pos: (63, 27)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -60,7 +60,7 @@
             new_head.prev = None
         self.head = new_head
         self._length -= 1
-        if self._length < 1:
+        if self._length < 0:
             self.tail = None
         return to_return.data
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

97 : Job ID dbdcb869bbdb4beb9ccc998e277bab93
SURVIVED
test outcome: survived
dll.py, start pos: (73, 26), end pos: (73, 27)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -70,7 +70,7 @@
         self.tail = Node(val, prev=old_tail)
         if old_tail:
             old_tail.next = self.tail
-        if self._length < 1:
+        if self._length < 2:
             self.head = self.tail
         self._length += 1
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

98 : Job ID d7aed0f6ea7648a89cd4bbb90c5f9a48
SURVIVED
test outcome: survived
dll.py, start pos: (73, 26), end pos: (73, 27)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -70,7 +70,7 @@
         self.tail = Node(val, prev=old_tail)
         if old_tail:
             old_tail.next = self.tail
-        if self._length < 1:
+        if self._length < 0:
             self.head = self.tail
         self._length += 1
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

99 : Job ID eadb33f9c1f7415680e066e8e7a41776
SURVIVED
test outcome: survived
dll.py, start pos: (75, 24), end pos: (75, 25)
operator: core/NumberReplacer, occurrence: 12
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -72,7 +72,7 @@
             old_tail.next = self.tail
         if self._length < 1:
             self.head = self.tail
-        self._length += 1
+        self._length += 2
     def shift(self):
         """Remove the val from the tail of the list."""
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

100 : Job ID b17267b15c0c4ac9b4df5e4f6c4cd2c6
SURVIVED
test outcome: survived
dll.py, start pos: (75, 24), end pos: (75, 25)
operator: core/NumberReplacer, occurrence: 13
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -72,7 +72,7 @@
             old_tail.next = self.tail
         if self._length < 1:
             self.head = self.tail
-        self._length += 1
+        self._length += 0
     def shift(self):
         """Remove the val from the tail of the list."""
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

101 : Job ID 6017fede34b74078b56d808fb8dd6202
SURVIVED
test outcome: survived
dll.py, start pos: (80, 26), end pos: (80, 27)
operator: core/NumberReplacer, occurrence: 14
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -77,7 +77,7 @@
     def shift(self):
         """Remove the val from the tail of the list."""
         to_return = self.tail
-        if self._length < 1:
+        if self._length < 2:
             raise IndexError('Cannot shift from an empty list.')
         new_tail = self.tail.prev
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

102 : Job ID 74ecca4fbd494f888e5a0224ff4f8e6e
test outcome: killed
dll.py, start pos: (80, 26), end pos: (80, 27)
operator: core/NumberReplacer, occurrence: 15
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -77,7 +77,7 @@
     def shift(self):
         """Remove the val from the tail of the list."""
         to_return = self.tail
-        if self._length < 1:
+        if self._length < 0:
             raise IndexError('Cannot shift from an empty list.')
         new_tail = self.tail.prev
ts-3-5/test_3-5_0-8_243.py .......F.                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_empty_shift - Attr...
========================= 1 failed, 8 passed in 0.14s ==========================

103 : Job ID 23f5a04e63964fcb92ba35829f87a605
SURVIVED
test outcome: survived
dll.py, start pos: (87, 24), end pos: (87, 25)
operator: core/NumberReplacer, occurrence: 16
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -84,7 +84,7 @@
         if new_tail:
             new_tail.next = None
         self.tail = new_tail
-        self._length -= 1
+        self._length -= 2
         if self._length < 1:
             self.tail = None
         return to_return.data
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

104 : Job ID f01be8e66e364c66a906cdbd476cd698
SURVIVED
test outcome: survived
dll.py, start pos: (87, 24), end pos: (87, 25)
operator: core/NumberReplacer, occurrence: 17
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -84,7 +84,7 @@
         if new_tail:
             new_tail.next = None
         self.tail = new_tail
-        self._length -= 1
+        self._length -= 0
         if self._length < 1:
             self.tail = None
         return to_return.data
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

107 : Job ID 4e16a7e501e24246959e94570c1b4068
SURVIVED
test outcome: survived
dll.py, start pos: (97, 35), end pos: (97, 36)
operator: core/NumberReplacer, occurrence: 20
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -94,7 +94,7 @@
         curr = self.head
         while curr:
             if curr.data is val:
-                if self._length == 1:
+                if self._length == 2:
                     self.head, self.tail = None, None
                 elif curr is not self.head and curr is not self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

108 : Job ID baa2e3dd7aba41ebb18732c497f4198f
SURVIVED
test outcome: survived
dll.py, start pos: (97, 35), end pos: (97, 36)
operator: core/NumberReplacer, occurrence: 21
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -94,7 +94,7 @@
         curr = self.head
         while curr:
             if curr.data is val:
-                if self._length == 1:
+                if self._length == 0:
                     self.head, self.tail = None, None
                 elif curr is not self.head and curr is not self.tail:
                     curr.next.prev, curr.prev.next = curr.prev, curr.next
ts-3-5/test_3-5_0-8_243.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

109 : Job ID e39cb4bd80cc4645b7c8d397edba37df
test outcome: killed
dll.py, start pos: (105, 32), end pos: (105, 33)
operator: core/NumberReplacer, occurrence: 22
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -102,7 +102,7 @@
                     self.head, curr.next.prev = curr.next, None
                 elif curr is self.tail:
                     self.tail, curr.prev.next = curr.prev, None
-                self._length -= 1
+                self._length -= 2
                 return
             curr = curr.next
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - assert [3...
========================= 1 failed, 8 passed in 0.14s ==========================

110 : Job ID ee707be1c1454d9582250ac66f58e522
test outcome: killed
dll.py, start pos: (105, 32), end pos: (105, 33)
operator: core/NumberReplacer, occurrence: 23
--- mutation diff ---
--- adll.py
+++ bdll.py
@@ -102,7 +102,7 @@
                     self.head, curr.next.prev = curr.next, None
                 elif curr is self.tail:
                     self.tail, curr.prev.next = curr.prev, None
-                self._length -= 1
+                self._length -= 0
                 return
             curr = curr.next
ts-3-5/test_3-5_0-8_243.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_243.py::test_double_linked_list_remove - Attribute...
========================= 1 failed, 8 passed in 0.14s ==========================
