   - [#   9] CDI dll: 
--------------------------------------------------------------------------------
   26:     remove(val) - will remove the first instance of (val) found in the list,
   27:     starting from the head.
   28:     '''
   29:     
-  30:     def __init__(self, data=None):
-  31:         '''Initialize list.'''
-  32:         self.head = None
-  33:         self.tail = None
-  34:         self._length = 0
-  35:         try:
-  36:             for val in data:
-  37:                 self.push(val)
-  38:         except TypeError:
-  39:             if data:
-  40:                 self.push(data)
-  41:     
+  30:     @classmethod
+  31:     def __init__(self, data=None):
+  32:         '''Initialize list.'''
+  33:         self.head = None
+  34:         self.tail = None
+  35:         self._length = 0
+  36:         try:
+  37:             for val in data:
+  38:                 self.push(val)
+  39:         except TypeError:
+  40:             if data:
+  41:                 self.push(data)
   42:     def push(self, val):
   43:         '''Add val to the head of the list.'''
   44:         old_head = self.head
   45:         self.head = Node(val, next_node=old_head)
--------------------------------------------------------------------------------
[0.16963 s] survived
