   - [#  14] CDI dll: 
--------------------------------------------------------------------------------
   88:         if self._length < 1:
   89:             self.tail = None
   90:         return to_return.data
   91:     
-  92:     def remove(self, val):
-  93:         '''Remove first occurance of val from list.'''
-  94:         curr = self.head
-  95:         while curr:
-  96:             if curr.data is val:
-  97:                 if self._length == 1:
-  98:                     (self.head, self.tail) = (None, None)
-  99:                 elif (curr is not self.head and curr is not self.tail):
- 100:                     (curr.next.prev, curr.prev.next) = (curr.prev, curr.next)
- 101:                 elif curr is self.head:
- 102:                     (self.head, curr.next.prev) = (curr.next, None)
- 103:                 elif curr is self.tail:
- 104:                     (self.tail, curr.prev.next) = (curr.prev, None)
- 105:                 self._length -= 1
- 106:                 return
- 107:             curr = curr.next
- 108:         
- 109:         raise ValueError('{} is not in the list'.format(val))
- 110:     
+  92:     @classmethod
+  93:     def remove(self, val):
+  94:         '''Remove first occurance of val from list.'''
+  95:         curr = self.head
+  96:         while curr:
+  97:             if curr.data is val:
+  98:                 if self._length == 1:
+  99:                     (self.head, self.tail) = (None, None)
+ 100:                 elif (curr is not self.head and curr is not self.tail):
+ 101:                     (curr.next.prev, curr.prev.next) = (curr.prev, curr.next)
+ 102:                 elif curr is self.head:
+ 103:                     (self.head, curr.next.prev) = (curr.next, None)
+ 104:                 elif curr is self.ta

   - [#  15] CDI dll: 
--------------------------------------------------------------------------------
  107:             curr = curr.next
  108:         
  109:         raise ValueError('{} is not in the list'.format(val))
  110:     
- 111:     def _repr(self):
- 112:         '''Return list representation of dll.'''
- 113:         l = []
- 114:         while True:
- 115:             try:
- 116:                 popped_data = self.pop()
- 117:                 l.append(popped_data)
- 118:             except IndexError:
- 119:                 break
- 120:         return l
+ 111:     @classmethod
+ 112:     def _repr(self):
+ 113:         '''Return list representation of dll.'''
+ 114:         l = []
+ 115:         while True:
+ 116:             try:
+ 117:                 popped_data = self.pop()
+ 118:                 l.append(popped_data)
+ 119:             except IndexError:
+ 120:                 break
+ 121:         return l
--------------------------------------------------------------------------------
[0.17868 s] survived

   - [#  63] SDI dll: 
--------------------------------------------------------------------------------
  107:             curr = curr.next
  108:         
  109:         raise ValueError('{} is not in the list'.format(val))
  110:     
- 111:     def _repr(self):
- 112:         '''Return list representation of dll.'''
- 113:         l = []
- 114:         while True:
- 115:             try:
- 116:                 popped_data = self.pop()
- 117:                 l.append(popped_data)
- 118:             except IndexError:
- 119:                 break
- 120:         return l
+ 111:     @staticmethod
+ 112:     def _repr(self):
+ 113:         '''Return list representation of dll.'''
+ 114:         l = []
+ 115:         while True:
+ 116:             try:
+ 117:                 popped_data = self.pop()
+ 118:                 l.append(popped_data)
+ 119:             except IndexError:
+ 120:                 break
+ 121:         return l
--------------------------------------------------------------------------------
[0.18260 s] survived
