   - [#  56] SDI dll: 
--------------------------------------------------------------------------------
    9:         self.data = data
   10:         self.next = next_node
   11:         self.prev = prev
   12:     
-  13:     def __repr__(self):
-  14:         '''String representation.'''
-  15:         return 'Value: {}'.format(self.data)
-  16: 
+  13:     @staticmethod
+  14:     def __repr__(self):
+  15:         '''String representation.'''
+  16:         return 'Value: {}'.format(self.data)
   17: 
   18: class DoubleLinkedList(object):
   19:     '''Double linked list impplementation.
   20: 
--------------------------------------------------------------------------------
[0.17852 s] survived
