1 : Job ID d62e6bf583ef407582307ed8975909d7
test outcome: killed
factorial.py, start pos: (18, 47), end pos: (18, 48)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x * y, range(1,n-1))
ts-3-5/test_3-5_0-0_27.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert 4...
========================= 2 failed, 2 passed in 0.07s ==========================

2 : Job ID 9962e50c147a4a9ab4192c08eaae7612
test outcome: killed
factorial.py, start pos: (18, 47), end pos: (18, 48)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x * y, range(1,n*1))
ts-3-5/test_3-5_0-0_27.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert 3...
========================= 2 failed, 2 passed in 0.07s ==========================

3 : Job ID 354a4c49359e40e1b13b5655bd7cd577
test outcome: killed
factorial.py, start pos: (18, 47), end pos: (18, 48)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x * y, range(1,n/1))
ts-3-5/test_3-5_0-0_27.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - TypeE...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - TypeErro...
========================= 2 failed, 2 passed in 0.07s ==========================

4 : Job ID db21dac2975d4012af2607012a7e24c4
test outcome: killed
factorial.py, start pos: (18, 47), end pos: (18, 48)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x * y, range(1,n//1))
ts-3-5/test_3-5_0-0_27.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert 3...
========================= 2 failed, 2 passed in 0.08s ==========================

5 : Job ID ae7ffb0991ce4556b5de5153a13ba620
test outcome: killed
factorial.py, start pos: (18, 47), end pos: (18, 48)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x * y, range(1,n%1))
ts-3-5/test_3-5_0-0_27.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - TypeE...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - TypeErro...
========================= 2 failed, 2 passed in 0.07s ==========================

6 : Job ID aaf8305cf6664c3fbecdfedd4aa66581
test outcome: killed
factorial.py, start pos: (18, 47), end pos: (18, 48)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x * y, range(1,n**1))
ts-3-5/test_3-5_0-0_27.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert 3...
========================= 2 failed, 2 passed in 0.07s ==========================

7 : Job ID 10dfa7c5c822444e9d6d1d4acd73e7b2
test outcome: killed
factorial.py, start pos: (18, 47), end pos: (18, 48)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x * y, range(1,n>>1))
ts-3-5/test_3-5_0-0_27.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert 2...
========================= 2 failed, 2 passed in 0.07s ==========================

8 : Job ID da37817cffc942d89ae34d549821a7a8
test outcome: killed
factorial.py, start pos: (18, 47), end pos: (18, 48)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x * y, range(1,n<<1))
ts-3-5/test_3-5_0-0_27.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert 1...
========================= 2 failed, 2 passed in 0.07s ==========================

9 : Job ID baeb1fb8f37247e4a27e9883043ac909
test outcome: killed
factorial.py, start pos: (18, 47), end pos: (18, 48)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x * y, range(1,n|1))
ts-3-5/test_3-5_0-0_27.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
========================= 1 failed, 3 passed in 0.07s ==========================

10 : Job ID f3bd6815ba114e84acda3578df6d9a5f
test outcome: killed
factorial.py, start pos: (18, 47), end pos: (18, 48)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x * y, range(1,n&1))
ts-3-5/test_3-5_0-0_27.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - TypeE...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - TypeErro...
========================= 2 failed, 2 passed in 0.07s ==========================

11 : Job ID a21ba975f62e446ab9e5a14de2b41876
test outcome: killed
factorial.py, start pos: (18, 47), end pos: (18, 48)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x * y, range(1,n^1))
ts-3-5/test_3-5_0-0_27.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
========================= 1 failed, 3 passed in 0.07s ==========================

12 : Job ID 4a58cc46224d41a296453179cf809de1
test outcome: killed
factorial.py, start pos: (18, 33), end pos: (18, 34)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x + y, range(1,n+1))
ts-3-5/test_3-5_0-0_27.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert 5...
========================= 2 failed, 2 passed in 0.07s ==========================

13 : Job ID 44b192819ad14db6b088b93fded67b84
test outcome: killed
factorial.py, start pos: (18, 33), end pos: (18, 34)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x - y, range(1,n+1))
ts-3-5/test_3-5_0-0_27.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert -...
========================= 2 failed, 2 passed in 0.07s ==========================

14 : Job ID 55841b4011d440c787b7b8c9bfeeba87
test outcome: killed
factorial.py, start pos: (18, 33), end pos: (18, 34)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x / y, range(1,n+1))
ts-3-5/test_3-5_0-0_27.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert 2...
========================= 2 failed, 2 passed in 0.07s ==========================

15 : Job ID 0d9bf2087c5c44e59dc571c0b9743844
test outcome: killed
factorial.py, start pos: (18, 33), end pos: (18, 34)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x // y, range(1,n+1))
ts-3-5/test_3-5_0-0_27.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert 0...
========================= 2 failed, 2 passed in 0.07s ==========================

16 : Job ID 48d23e4f80c447e386668df873abe0e2
test outcome: killed
factorial.py, start pos: (18, 33), end pos: (18, 34)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x % y, range(1,n+1))
ts-3-5/test_3-5_0-0_27.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert 1...
========================= 2 failed, 2 passed in 0.07s ==========================

17 : Job ID 93f29211e7cc4cdb9640cc38e6097213
test outcome: killed
factorial.py, start pos: (18, 33), end pos: (18, 34)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x ** y, range(1,n+1))
ts-3-5/test_3-5_0-0_27.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert 1...
========================= 2 failed, 2 passed in 0.07s ==========================

18 : Job ID 7dbe750068664fbda814274f6295cc47
test outcome: killed
factorial.py, start pos: (18, 33), end pos: (18, 34)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x >> y, range(1,n+1))
ts-3-5/test_3-5_0-0_27.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert 0...
========================= 2 failed, 2 passed in 0.07s ==========================

19 : Job ID cd9966645eb24df9903bc1fa10c8d7f7
test outcome: killed
factorial.py, start pos: (18, 33), end pos: (18, 34)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x << y, range(1,n+1))
ts-3-5/test_3-5_0-0_27.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert 1...
========================= 2 failed, 2 passed in 0.07s ==========================

20 : Job ID f6f1712559a54312b9959372f9b30f86
test outcome: killed
factorial.py, start pos: (18, 33), end pos: (18, 34)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x | y, range(1,n+1))
ts-3-5/test_3-5_0-0_27.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert 1...
========================= 2 failed, 2 passed in 0.08s ==========================

21 : Job ID a0615aff9cfd46f7841e9d566e208f42
test outcome: killed
factorial.py, start pos: (18, 33), end pos: (18, 34)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x & y, range(1,n+1))
ts-3-5/test_3-5_0-0_27.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert 0...
========================= 2 failed, 2 passed in 0.07s ==========================

22 : Job ID 5a9373b92f204a97b054e11464003539
test outcome: killed
factorial.py, start pos: (18, 33), end pos: (18, 34)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x ^ y, range(1,n+1))
ts-3-5/test_3-5_0-0_27.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert 1...
========================= 2 failed, 2 passed in 0.07s ==========================

23 : Job ID 08cc87f1341148cda75ea03eefc6d6a0
test outcome: killed
factorial.py, start pos: (15, 9), end pos: (15, 11)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -12,7 +12,7 @@
         of 0 or less will output 0.
     """
     # base case, reduce must have non-empty list
-    if n <= 0:
+    if n == 0:
         return 0
     # use reduce function to multiple elements
     return reduce(lambda x, y: x * y, range(1,n+1))
ts-3-5/test_3-5_0-0_27.py ..F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_negative_number - TypeE...
========================= 1 failed, 3 passed in 0.07s ==========================

24 : Job ID 6841051018244d0b9c16da941b1cc173
test outcome: killed
factorial.py, start pos: (15, 9), end pos: (15, 11)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -12,7 +12,7 @@
         of 0 or less will output 0.
     """
     # base case, reduce must have non-empty list
-    if n <= 0:
+    if n != 0:
         return 0
     # use reduce function to multiple elements
     return reduce(lambda x, y: x * y, range(1,n+1))
ts-3-5/test_3-5_0-0_27.py FF.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_zero - TypeError: reduc...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert 0...
========================= 3 failed, 1 passed in 0.07s ==========================

25 : Job ID aa046aaf9e9c4c759ca97b1e0a7f1988
test outcome: killed
factorial.py, start pos: (15, 9), end pos: (15, 11)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -12,7 +12,7 @@
         of 0 or less will output 0.
     """
     # base case, reduce must have non-empty list
-    if n <= 0:
+    if n < 0:
         return 0
     # use reduce function to multiple elements
     return reduce(lambda x, y: x * y, range(1,n+1))
ts-3-5/test_3-5_0-0_27.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_zero - TypeError: reduc...
========================= 1 failed, 3 passed in 0.08s ==========================

26 : Job ID 7f81d9b239b44bb8a0bcab950ca48624
test outcome: killed
factorial.py, start pos: (15, 9), end pos: (15, 11)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -12,7 +12,7 @@
         of 0 or less will output 0.
     """
     # base case, reduce must have non-empty list
-    if n <= 0:
+    if n > 0:
         return 0
     # use reduce function to multiple elements
     return reduce(lambda x, y: x * y, range(1,n+1))
ts-3-5/test_3-5_0-0_27.py FFFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_zero - TypeError: reduc...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_negative_number - TypeE...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert 0...
============================== 4 failed in 0.08s ===============================

27 : Job ID cdcb52ca24bd4bc484036ce6f7f27563
test outcome: killed
factorial.py, start pos: (15, 9), end pos: (15, 11)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -12,7 +12,7 @@
         of 0 or less will output 0.
     """
     # base case, reduce must have non-empty list
-    if n <= 0:
+    if n >= 0:
         return 0
     # use reduce function to multiple elements
     return reduce(lambda x, y: x * y, range(1,n+1))
ts-3-5/test_3-5_0-0_27.py .FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_negative_number - TypeE...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert 0...
========================= 3 failed, 1 passed in 0.07s ==========================

28 : Job ID 18dbc25cd6484945879d6fa93f87dba7
test outcome: killed
factorial.py, start pos: (15, 7), end pos: (15, 13)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -12,7 +12,7 @@
         of 0 or less will output 0.
     """
     # base case, reduce must have non-empty list
-    if n <= 0:
+    if not n <= 0:
         return 0
     # use reduce function to multiple elements
     return reduce(lambda x, y: x * y, range(1,n+1))
ts-3-5/test_3-5_0-0_27.py FFFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_zero - TypeError: reduc...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_negative_number - TypeE...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert 0...
============================== 4 failed in 0.08s ===============================

29 : Job ID 6010f294d646437cb62a3ca53673d125
SURVIVED
test outcome: survived
factorial.py, start pos: (15, 12), end pos: (15, 13)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -12,7 +12,7 @@
         of 0 or less will output 0.
     """
     # base case, reduce must have non-empty list
-    if n <= 0:
+    if n <= 1:
         return 0
     # use reduce function to multiple elements
     return reduce(lambda x, y: x * y, range(1,n+1))
ts-3-5/test_3-5_0-0_27.py ....                                           [100%]
============================== 4 passed in 0.07s ===============================

30 : Job ID 87dcfc0a07d64f129123839f1915db93
test outcome: killed
factorial.py, start pos: (15, 12), end pos: (15, 13)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -12,7 +12,7 @@
         of 0 or less will output 0.
     """
     # base case, reduce must have non-empty list
-    if n <= 0:
+    if n <= -1:
         return 0
     # use reduce function to multiple elements
     return reduce(lambda x, y: x * y, range(1,n+1))
ts-3-5/test_3-5_0-0_27.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_zero - TypeError: reduc...
========================= 1 failed, 3 passed in 0.07s ==========================

31 : Job ID b62722ed1f9a485cb4c0eb29936bd497
test outcome: killed
factorial.py, start pos: (16, 15), end pos: (16, 16)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -13,7 +13,7 @@
     """
     # base case, reduce must have non-empty list
     if n <= 0:
-        return 0
+        return 1
     # use reduce function to multiple elements
     return reduce(lambda x, y: x * y, range(1,n+1))
ts-3-5/test_3-5_0-0_27.py F.F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_zero - assert 1 == 0
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_negative_number - asser...
========================= 2 failed, 2 passed in 0.08s ==========================

32 : Job ID 6559b7e8d3254f889468938eb23b0524
test outcome: killed
factorial.py, start pos: (16, 15), end pos: (16, 16)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -13,7 +13,7 @@
     """
     # base case, reduce must have non-empty list
     if n <= 0:
-        return 0
+        return -1
     # use reduce function to multiple elements
     return reduce(lambda x, y: x * y, range(1,n+1))
ts-3-5/test_3-5_0-0_27.py F.F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_zero - assert -1 == 0
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_negative_number - asser...
========================= 2 failed, 2 passed in 0.07s ==========================

33 : Job ID a481e29d64d34374bb153404994d9d66
SURVIVED
test outcome: survived
factorial.py, start pos: (18, 44), end pos: (18, 45)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x * y, range( 2,n+1))
ts-3-5/test_3-5_0-0_27.py ....                                           [100%]
============================== 4 passed in 0.07s ===============================

34 : Job ID 5afd4ae3b11e41dcbd9178e0ad57e06a
test outcome: killed
factorial.py, start pos: (18, 44), end pos: (18, 45)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x * y, range( 0,n+1))
ts-3-5/test_3-5_0-0_27.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert 0...
========================= 2 failed, 2 passed in 0.07s ==========================

35 : Job ID da679d9590174034886aef3bd731dd73
test outcome: killed
factorial.py, start pos: (18, 48), end pos: (18, 49)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x * y, range(1,n+ 2))
ts-3-5/test_3-5_0-0_27.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert 3...
========================= 2 failed, 2 passed in 0.07s ==========================
