36 : Job ID 4e5be80acd0a49e589d22e8fab2d0568
test outcome: killed
factorial.py, start pos: (18, 48), end pos: (18, 49)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- afactorial.py
+++ bfactorial.py
@@ -15,5 +15,5 @@
     if n <= 0:
         return 0
     # use reduce function to multiple elements
-    return reduce(lambda x, y: x * y, range(1,n+1))
+    return reduce(lambda x, y: x * y, range(1,n+ 0))
ts-3-5/test_3-5_0-0_27.py .F.F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_positive_number - asser...
FAILED ts-3-5/test_3-5_0-0_27.py::test_factorial_with_large_number - assert 3...
========================= 2 failed, 2 passed in 0.07s ==========================
