   - [#   4] AOR factorial: 
--------------------------------------------------------------------------------
  14:     
  15:     if n <= 0:
  16:         return 0
  17:     
- 18:     return reduce((lambda x, y: (x * y)), range(1, n + 1))
+ 18:     return reduce((lambda x, y: (x * y)), range(1, n - 1))
--------------------------------------------------------------------------------
[0.14610 s] killed by ts-3-5/test_3-5_0-0_1.py::test_factorial_with_positive_number

def test_factorial_with_positive_number():
>       assert factorial(5) == 120
E       AssertionError

ts-3-5/test_3-5_0-0_1.py:15: AssertionError

   - [#   6] ROR factorial: 
--------------------------------------------------------------------------------
  11:         The factorial number for n (n!).  Input
  12:         of 0 or less will output 0.
  13:     '''
  14:     
- 15:     if n <= 0:
+ 15:     if n >= 0:
  16:         return 0
  17:     
  18:     return reduce((lambda x, y: (x * y)), range(1, n + 1))
--------------------------------------------------------------------------------
[0.14997 s] killed by ts-3-5/test_3-5_0-0_1.py::test_factorial_with_positive_number

def test_factorial_with_positive_number():
>       assert factorial(5) == 120
E       AssertionError

ts-3-5/test_3-5_0-0_1.py:15: AssertionError
