   - [#   5] COI factorial: 
--------------------------------------------------------------------------------
  11:         The factorial number for n (n!).  Input
  12:         of 0 or less will output 0.
  13:     '''
  14:     
- 15:     if n <= 0:
+ 15:     if not (n <= 0):
  16:         return 0
  17:     
  18:     return reduce((lambda x, y: (x * y)), range(1, n + 1))
--------------------------------------------------------------------------------
[0.14564 s] killed by ts-3-5/test_3-5_0-7_232.py::test_factorial_with_positive_number

def test_factorial_with_positive_number():
>       assert factorial(5) == 120
E       AssertionError

ts-3-5/test_3-5_0-7_232.py:12: AssertionError
