   - [#   1] AOR factorial: 
--------------------------------------------------------------------------------
  14:     
  15:     if n <= 0:
  16:         return 0
  17:     
- 18:     return reduce((lambda x, y: (x * y)), range(1, n + 1))
+ 18:     return reduce((lambda x, y: (x / y)), range(1, n + 1))
--------------------------------------------------------------------------------
[0.14615 s] killed by ts-3-5/test_3-5_0-8_259.py::test_factorial_with_positive_number

def test_factorial_with_positive_number():
        assert factorial(1) == 1
>       assert factorial(5) == 120
E       AssertionError

ts-3-5/test_3-5_0-8_259.py:16: AssertionError

   - [#   2] AOR factorial: 
--------------------------------------------------------------------------------
  14:     
  15:     if n <= 0:
  16:         return 0
  17:     
- 18:     return reduce((lambda x, y: (x * y)), range(1, n + 1))
+ 18:     return reduce((lambda x, y: (x // y)), range(1, n + 1))
--------------------------------------------------------------------------------
[0.15624 s] killed by ts-3-5/test_3-5_0-8_259.py::test_factorial_with_positive_number

def test_factorial_with_positive_number():
        assert factorial(1) == 1
>       assert factorial(5) == 120
E       AssertionError

ts-3-5/test_3-5_0-8_259.py:16: AssertionError

   - [#   3] AOR factorial: 
--------------------------------------------------------------------------------
  14:     
  15:     if n <= 0:
  16:         return 0
  17:     
- 18:     return reduce((lambda x, y: (x * y)), range(1, n + 1))
+ 18:     return reduce((lambda x, y: (x ** y)), range(1, n + 1))
--------------------------------------------------------------------------------
[0.15859 s] killed by ts-3-5/test_3-5_0-8_259.py::test_factorial_with_positive_number

def test_factorial_with_positive_number():
        assert factorial(1) == 1
>       assert factorial(5) == 120
E       AssertionError

ts-3-5/test_3-5_0-8_259.py:16: AssertionError

   - [#   9] SDL factorial: 
--------------------------------------------------------------------------------
  14:     
  15:     if n <= 0:
  16:         return 0
  17:     
- 18:     return reduce((lambda x, y: (x * y)), range(1, n + 1))
+ 18:     pass
--------------------------------------------------------------------------------
[0.14239 s] killed by ts-3-5/test_3-5_0-8_259.py::test_factorial_with_positive_number

def test_factorial_with_positive_number():
>       assert factorial(1) == 1
E       AssertionError

ts-3-5/test_3-5_0-8_259.py:15: AssertionError
