1 : Job ID 4ca62bf50b4d4daf8f97ddd7cd4f3d1e
test outcome: killed
fenwick_tree.py, start pos: (4, 35), end pos: (4, 36)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] * (len(arr)-1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.14s ===============================

2 : Job ID 5245180651b7457cb4f9bfa9ec2f59e9
test outcome: killed
fenwick_tree.py, start pos: (5, 35), end pos: (5, 36)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] * (len(arr)-1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1, 3, 10] == [0, ...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index...
============================== 3 failed in 0.14s ===============================

3 : Job ID 9676a359949c48f0a3b8e54f1f9c04b0
test outcome: killed
fenwick_tree.py, start pos: (4, 35), end pos: (4, 36)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] * (len(arr)*1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.14s ===============================

4 : Job ID fe9529e50ee34e67b5c598e74f05c4ca
test outcome: killed
fenwick_tree.py, start pos: (5, 35), end pos: (5, 36)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] * (len(arr)*1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1, 3, 10, 17] == ...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index...
============================== 3 failed in 0.14s ===============================

5 : Job ID f0aecbc92d034f9bbb7f51fb0aa358d1
test outcome: killed
fenwick_tree.py, start pos: (4, 35), end pos: (4, 36)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] * (len(arr)/1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: can't multiply seq...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: can't multiply s...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: can't multip...
============================== 3 errors in 0.14s ===============================

6 : Job ID 3386b1536a224fe899a1b45388ead5d3
test outcome: killed
fenwick_tree.py, start pos: (5, 35), end pos: (5, 36)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] * (len(arr)/1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: can't multiply seq...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: can't multiply s...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: can't multip...
============================== 3 errors in 0.14s ===============================

7 : Job ID 20aff758ad37467b8a719c02598ae2a2
test outcome: killed
fenwick_tree.py, start pos: (4, 35), end pos: (4, 36)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] * (len(arr)//1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.14s ===============================

8 : Job ID e09b8a336fc14d3c80668eb38267b22a
test outcome: killed
fenwick_tree.py, start pos: (5, 35), end pos: (5, 36)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] * (len(arr)//1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1, 3, 10, 17] == ...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index...
============================== 3 failed in 0.14s ===============================

9 : Job ID a2461e3320e04e34869b6305b78c94d6
test outcome: killed
fenwick_tree.py, start pos: (4, 35), end pos: (4, 36)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] * (len(arr)%1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.14s ===============================

10 : Job ID b894a852ae2741709161f13a4e904e33
test outcome: killed
fenwick_tree.py, start pos: (5, 35), end pos: (5, 36)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] * (len(arr)%1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [] == [0, 1, 3, 10, 1...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index...
============================== 3 failed in 0.14s ===============================

11 : Job ID 0e66ad60b986432e8275e106e3ed91cd
test outcome: killed
fenwick_tree.py, start pos: (4, 35), end pos: (4, 36)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] * (len(arr)**1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.14s ===============================

12 : Job ID ed8a4a67bfb84fd58c5d7a09d453c105
test outcome: killed
fenwick_tree.py, start pos: (5, 35), end pos: (5, 36)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] * (len(arr)**1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1, 3, 10, 17] == ...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index...
============================== 3 failed in 0.14s ===============================

13 : Job ID 52ff6cdd112c41a1b551eefed1598742
test outcome: killed
fenwick_tree.py, start pos: (4, 35), end pos: (4, 36)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] * (len(arr)>>1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.14s ===============================

14 : Job ID a1a7253692b4473fbc6e7f99e064e91b
test outcome: killed
fenwick_tree.py, start pos: (5, 35), end pos: (5, 36)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] * (len(arr)>>1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1] == [0, 1, 3, 1...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index...
============================== 3 failed in 0.14s ===============================

15 : Job ID 3d29517e3fdd48d68d95db9ae50e42c0
test outcome: killed
fenwick_tree.py, start pos: (4, 35), end pos: (4, 36)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] * (len(arr)<<1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1, 2, 10, 4, 5, ....
========================= 1 failed, 2 passed in 0.14s ==========================

16 : Job ID ad5966bc35cc40f3b4695735fe1cb12b
test outcome: killed
fenwick_tree.py, start pos: (5, 35), end pos: (5, 36)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] * (len(arr)<<1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1, 3, 10, 17, 5, ...
========================= 1 failed, 2 passed in 0.14s ==========================

17 : Job ID 4431b3f14d884cae9c5d3acd787953bd
test outcome: killed
fenwick_tree.py, start pos: (4, 35), end pos: (4, 36)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] * (len(arr)|1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.14s ===============================

18 : Job ID 247b115d3c7846e78381896103b2b163
test outcome: killed
fenwick_tree.py, start pos: (5, 35), end pos: (5, 36)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] * (len(arr)|1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1, 3, 10, 17] == ...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index...
============================== 3 failed in 0.14s ===============================

19 : Job ID f873c945a1ec40d8ba6c381af130acf8
test outcome: killed
fenwick_tree.py, start pos: (4, 35), end pos: (4, 36)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] * (len(arr)&1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.14s ===============================

20 : Job ID 5ed542813ae24555a984affa4e0c91bd
test outcome: killed
fenwick_tree.py, start pos: (5, 35), end pos: (5, 36)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] * (len(arr)&1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0] == [0, 1, 3, 10, ...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index...
============================== 3 failed in 0.15s ===============================

21 : Job ID 06804856e903429f99ea0499260007ba
test outcome: killed
fenwick_tree.py, start pos: (4, 35), end pos: (4, 36)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] * (len(arr)^1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.14s ===============================

22 : Job ID abd41545346c4fc196d8183b23ad6a29
test outcome: killed
fenwick_tree.py, start pos: (5, 35), end pos: (5, 36)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] * (len(arr)^1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1, 3, 10] == [0, ...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index...
============================== 3 failed in 0.14s ===============================

23 : Job ID 0f79064adb3e462caf8824d7fac246da
test outcome: killed
fenwick_tree.py, start pos: (12, 22), end pos: (12, 23)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -9,7 +9,7 @@
     def update(self, index, value):
         index += 1
-        delta = value - self.nums[index]
+        delta = value + self.nums[index]
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
ts-3-5/test_3-5_0-3_103.py F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1, 3, 16, 23, 5] ...
========================= 1 failed, 2 passed in 0.15s ==========================

24 : Job ID faacebd7911a4e98b3d84bb0b0041ef5
test outcome: killed
fenwick_tree.py, start pos: (14, 37), end pos: (14, 38)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -11,7 +11,7 @@
         index += 1
         delta = value - self.nums[index]
         self.nums[index] = value
-        while index <= len(self.tree)-1:
+        while index <= len(self.tree)+1:
             self.tree[index] += delta
             index += index & (-index)
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.14s ===============================

25 : Job ID 53950b66c66e4b7fa1a54c9131adebb2
test outcome: killed
fenwick_tree.py, start pos: (31, 34), end pos: (31, 35)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 2
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -28,5 +28,5 @@
     def sum_of_range(self, start, end):
         # minus 1 from start since the range is (s, e) inclusive on both ends
         start -= 1
-        return self.sum_of_n(end) - self.sum_of_n(start)
+        return self.sum_of_n(end) + self.sum_of_n(start)
ts-3-5/test_3-5_0-3_103.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 11 == 9
========================= 1 failed, 2 passed in 0.14s ==========================

26 : Job ID 87f7288d3cea44ada4225695a6805c30
test outcome: killed
fenwick_tree.py, start pos: (12, 22), end pos: (12, 23)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -9,7 +9,7 @@
     def update(self, index, value):
         index += 1
-        delta = value - self.nums[index]
+        delta = value * self.nums[index]
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 0, 0, 30, 30, 0] ...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 0 == 6
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 0 == 9
============================== 3 failed in 0.14s ===============================

27 : Job ID cf14f88b58fa4b94b5538f6770b979b4
test outcome: killed
fenwick_tree.py, start pos: (14, 37), end pos: (14, 38)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -11,7 +11,7 @@
         index += 1
         delta = value - self.nums[index]
         self.nums[index] = value
-        while index <= len(self.tree)-1:
+        while index <= len(self.tree)*1:
             self.tree[index] += delta
             index += index & (-index)
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.14s ===============================

28 : Job ID 1620921a11514acdbc490650310a7df0
test outcome: killed
fenwick_tree.py, start pos: (31, 34), end pos: (31, 35)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 2
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -28,5 +28,5 @@
     def sum_of_range(self, start, end):
         # minus 1 from start since the range is (s, e) inclusive on both ends
         start -= 1
-        return self.sum_of_n(end) - self.sum_of_n(start)
+        return self.sum_of_n(end) * self.sum_of_n(start)
ts-3-5/test_3-5_0-3_103.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 10 == 9
========================= 1 failed, 2 passed in 0.14s ==========================

29 : Job ID e59409d3715940a89551b8f0afd814fd
test outcome: killed
fenwick_tree.py, start pos: (12, 22), end pos: (12, 23)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -9,7 +9,7 @@
     def update(self, index, value):
         index += 1
-        delta = value - self.nums[index]
+        delta = value / self.nums[index]
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - ZeroDivisionError: division b...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - ZeroDivisionError: division...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - ZeroDivisionError: divi...
============================== 3 errors in 0.14s ===============================

30 : Job ID 8f8afded10fb4af1bfa3894ba740d14d
test outcome: killed
fenwick_tree.py, start pos: (14, 37), end pos: (14, 38)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -11,7 +11,7 @@
         index += 1
         delta = value - self.nums[index]
         self.nums[index] = value
-        while index <= len(self.tree)-1:
+        while index <= len(self.tree)/1:
             self.tree[index] += delta
             index += index & (-index)
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.14s ===============================

31 : Job ID 1b8bc38ad2a642458ebf097b5a93ed6c
test outcome: killed
fenwick_tree.py, start pos: (31, 34), end pos: (31, 35)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 2
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -28,5 +28,5 @@
     def sum_of_range(self, start, end):
         # minus 1 from start since the range is (s, e) inclusive on both ends
         start -= 1
-        return self.sum_of_n(end) - self.sum_of_n(start)
+        return self.sum_of_n(end) / self.sum_of_n(start)
ts-3-5/test_3-5_0-3_103.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 10.0 == 9
========================= 1 failed, 2 passed in 0.14s ==========================
