32 : Job ID d05c14bb5f0e4ec1a13bcc982d813afb
test outcome: killed
fenwick_tree.py, start pos: (12, 22), end pos: (12, 23)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -9,7 +9,7 @@
     def update(self, index, value):
         index += 1
-        delta = value - self.nums[index]
+        delta = value // self.nums[index]
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - ZeroDivisionError: integer di...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - ZeroDivisionError: integer ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - ZeroDivisionError: inte...
============================== 3 errors in 0.14s ===============================

33 : Job ID c215f775cad040da8d7ebe467f01cd3a
test outcome: killed
fenwick_tree.py, start pos: (14, 37), end pos: (14, 38)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -11,7 +11,7 @@
         index += 1
         delta = value - self.nums[index]
         self.nums[index] = value
-        while index <= len(self.tree)-1:
+        while index <= len(self.tree)//1:
             self.tree[index] += delta
             index += index & (-index)
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.15s ===============================

34 : Job ID 99c2975a0eb24b6da85e0967abe5a1a9
test outcome: killed
fenwick_tree.py, start pos: (31, 34), end pos: (31, 35)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 2
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -28,5 +28,5 @@
     def sum_of_range(self, start, end):
         # minus 1 from start since the range is (s, e) inclusive on both ends
         start -= 1
-        return self.sum_of_n(end) - self.sum_of_n(start)
+        return self.sum_of_n(end) // self.sum_of_n(start)
ts-3-5/test_3-5_0-3_103.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 10 == 9
========================= 1 failed, 2 passed in 0.14s ==========================

35 : Job ID 6b11d5bb126c4fd7bf9cbef156dd3aef
test outcome: killed
fenwick_tree.py, start pos: (12, 22), end pos: (12, 23)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -9,7 +9,7 @@
     def update(self, index, value):
         index += 1
-        delta = value - self.nums[index]
+        delta = value % self.nums[index]
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - ZeroDivisionError: integer di...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - ZeroDivisionError: integer ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - ZeroDivisionError: inte...
============================== 3 errors in 0.14s ===============================

36 : Job ID 10048c2c5a2a4fde8d50be42c38253c2
test outcome: killed
fenwick_tree.py, start pos: (14, 37), end pos: (14, 38)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -11,7 +11,7 @@
         index += 1
         delta = value - self.nums[index]
         self.nums[index] = value
-        while index <= len(self.tree)-1:
+        while index <= len(self.tree)%1:
             self.tree[index] += delta
             index += index & (-index)
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 0, 0, 0, 0, 0] ==...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 0 == 6
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 0 == 9
============================== 3 failed in 0.14s ===============================

37 : Job ID 9e4aad12e61c49398abb530667760398
test outcome: killed
fenwick_tree.py, start pos: (31, 34), end pos: (31, 35)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 2
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -28,5 +28,5 @@
     def sum_of_range(self, start, end):
         # minus 1 from start since the range is (s, e) inclusive on both ends
         start -= 1
-        return self.sum_of_n(end) - self.sum_of_n(start)
+        return self.sum_of_n(end) % self.sum_of_n(start)
ts-3-5/test_3-5_0-3_103.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 0 == 9
========================= 1 failed, 2 passed in 0.14s ==========================

38 : Job ID 546c53fae24d4583b8f8615326eaf0f1
test outcome: killed
fenwick_tree.py, start pos: (12, 22), end pos: (12, 23)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -9,7 +9,7 @@
     def update(self, index, value):
         index += 1
-        delta = value - self.nums[index]
+        delta = value ** self.nums[index]
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1, 2, 1001, 1004,...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 3 == 6
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 3 == 9
============================== 3 failed in 0.14s ===============================

39 : Job ID 763f1c69aebf43fa9cc19215decfb1d9
test outcome: killed
fenwick_tree.py, start pos: (14, 37), end pos: (14, 38)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -11,7 +11,7 @@
         index += 1
         delta = value - self.nums[index]
         self.nums[index] = value
-        while index <= len(self.tree)-1:
+        while index <= len(self.tree)**1:
             self.tree[index] += delta
             index += index & (-index)
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.14s ===============================

40 : Job ID 42209163abda42989305757d44cd3546
test outcome: killed
fenwick_tree.py, start pos: (31, 34), end pos: (31, 35)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 2
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -28,5 +28,5 @@
     def sum_of_range(self, start, end):
         # minus 1 from start since the range is (s, e) inclusive on both ends
         start -= 1
-        return self.sum_of_n(end) - self.sum_of_n(start)
+        return self.sum_of_n(end) ** self.sum_of_n(start)
ts-3-5/test_3-5_0-3_103.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 10 == 9
========================= 1 failed, 2 passed in 0.14s ==========================

41 : Job ID a0569812145a4df1a69a95336dcf9dac
test outcome: killed
fenwick_tree.py, start pos: (12, 22), end pos: (12, 23)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -9,7 +9,7 @@
     def update(self, index, value):
         index += 1
-        delta = value - self.nums[index]
+        delta = value >> self.nums[index]
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
ts-3-5/test_3-5_0-3_103.py F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1, 3, 4, 11, 5] =...
========================= 1 failed, 2 passed in 0.14s ==========================

42 : Job ID b92cd782b4744ae3912910e5cc1fd587
test outcome: killed
fenwick_tree.py, start pos: (14, 37), end pos: (14, 38)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -11,7 +11,7 @@
         index += 1
         delta = value - self.nums[index]
         self.nums[index] = value
-        while index <= len(self.tree)-1:
+        while index <= len(self.tree)>>1:
             self.tree[index] += delta
             index += index & (-index)
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1, 3, 10, 0, 0] =...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 0 == 15
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert -1 == 9
============================== 3 failed in 0.14s ===============================

43 : Job ID bdbc0c0f4b12463f8d726874ad38651e
test outcome: killed
fenwick_tree.py, start pos: (31, 34), end pos: (31, 35)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 2
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -28,5 +28,5 @@
     def sum_of_range(self, start, end):
         # minus 1 from start since the range is (s, e) inclusive on both ends
         start -= 1
-        return self.sum_of_n(end) - self.sum_of_n(start)
+        return self.sum_of_n(end) >> self.sum_of_n(start)
ts-3-5/test_3-5_0-3_103.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 5 == 9
========================= 1 failed, 2 passed in 0.14s ==========================

44 : Job ID 703efe9594d84b85ac1ad2ac52bfa75f
test outcome: killed
fenwick_tree.py, start pos: (12, 22), end pos: (12, 23)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -9,7 +9,7 @@
     def update(self, index, value):
         index += 1
-        delta = value - self.nums[index]
+        delta = value << self.nums[index]
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
ts-3-5/test_3-5_0-3_103.py F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1, 3, 83, 90, 5] ...
========================= 1 failed, 2 passed in 0.14s ==========================

45 : Job ID 52278374f815459e91f70f4f28a9996c
test outcome: killed
fenwick_tree.py, start pos: (14, 37), end pos: (14, 38)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -11,7 +11,7 @@
         index += 1
         delta = value - self.nums[index]
         self.nums[index] = value
-        while index <= len(self.tree)-1:
+        while index <= len(self.tree)<<1:
             self.tree[index] += delta
             index += index & (-index)
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.15s ===============================

46 : Job ID 4b3c4c60a92a4b5da0643e385489ab80
test outcome: killed
fenwick_tree.py, start pos: (31, 34), end pos: (31, 35)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 2
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -28,5 +28,5 @@
     def sum_of_range(self, start, end):
         # minus 1 from start since the range is (s, e) inclusive on both ends
         start -= 1
-        return self.sum_of_n(end) - self.sum_of_n(start)
+        return self.sum_of_n(end) << self.sum_of_n(start)
ts-3-5/test_3-5_0-3_103.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 20 == 9
========================= 1 failed, 2 passed in 0.14s ==========================

47 : Job ID 04315cbcd54e43898807ed5fd7327983
test outcome: killed
fenwick_tree.py, start pos: (12, 22), end pos: (12, 23)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -9,7 +9,7 @@
     def update(self, index, value):
         index += 1
-        delta = value - self.nums[index]
+        delta = value | self.nums[index]
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
ts-3-5/test_3-5_0-3_103.py F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1, 3, 14, 21, 5] ...
========================= 1 failed, 2 passed in 0.14s ==========================

48 : Job ID ca2fd935385449df98dd6feddf8570e3
test outcome: killed
fenwick_tree.py, start pos: (14, 37), end pos: (14, 38)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -11,7 +11,7 @@
         index += 1
         delta = value - self.nums[index]
         self.nums[index] = value
-        while index <= len(self.tree)-1:
+        while index <= len(self.tree)|1:
             self.tree[index] += delta
             index += index & (-index)
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.14s ===============================

49 : Job ID 6398e1fcf8be4e7281588ecb08eed772
test outcome: killed
fenwick_tree.py, start pos: (31, 34), end pos: (31, 35)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 2
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -28,5 +28,5 @@
     def sum_of_range(self, start, end):
         # minus 1 from start since the range is (s, e) inclusive on both ends
         start -= 1
-        return self.sum_of_n(end) - self.sum_of_n(start)
+        return self.sum_of_n(end) | self.sum_of_n(start)
ts-3-5/test_3-5_0-3_103.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 11 == 9
========================= 1 failed, 2 passed in 0.14s ==========================

50 : Job ID c07bee5074b14c55803343b551a898d5
test outcome: killed
fenwick_tree.py, start pos: (12, 22), end pos: (12, 23)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -9,7 +9,7 @@
     def update(self, index, value):
         index += 1
-        delta = value - self.nums[index]
+        delta = value & self.nums[index]
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 0, 0, 2, 2, 0] ==...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 0 == 6
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 0 == 9
============================== 3 failed in 0.14s ===============================

51 : Job ID 2d6b34c68abb46099e8d5663398cfe85
test outcome: killed
fenwick_tree.py, start pos: (14, 37), end pos: (14, 38)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -11,7 +11,7 @@
         index += 1
         delta = value - self.nums[index]
         self.nums[index] = value
-        while index <= len(self.tree)-1:
+        while index <= len(self.tree)&1:
             self.tree[index] += delta
             index += index & (-index)
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 0, 0, 0, 0, 0] ==...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 0 == 6
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 0 == 9
============================== 3 failed in 0.14s ===============================

52 : Job ID b77904bb4c3048cebbf5cf60d6330aa4
test outcome: killed
fenwick_tree.py, start pos: (31, 34), end pos: (31, 35)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 2
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -28,5 +28,5 @@
     def sum_of_range(self, start, end):
         # minus 1 from start since the range is (s, e) inclusive on both ends
         start -= 1
-        return self.sum_of_n(end) - self.sum_of_n(start)
+        return self.sum_of_n(end) & self.sum_of_n(start)
ts-3-5/test_3-5_0-3_103.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 0 == 9
========================= 1 failed, 2 passed in 0.14s ==========================

53 : Job ID 10e7eec574044bdb83f4ee863c771695
test outcome: killed
fenwick_tree.py, start pos: (12, 22), end pos: (12, 23)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -9,7 +9,7 @@
     def update(self, index, value):
         index += 1
-        delta = value - self.nums[index]
+        delta = value ^ self.nums[index]
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
ts-3-5/test_3-5_0-3_103.py F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1, 3, 12, 19, 5] ...
========================= 1 failed, 2 passed in 0.14s ==========================

54 : Job ID e35995fd9057405f8c852a06590d75d0
test outcome: killed
fenwick_tree.py, start pos: (14, 37), end pos: (14, 38)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -11,7 +11,7 @@
         index += 1
         delta = value - self.nums[index]
         self.nums[index] = value
-        while index <= len(self.tree)-1:
+        while index <= len(self.tree)^1:
             self.tree[index] += delta
             index += index & (-index)
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.14s ===============================

55 : Job ID c3be5db30cbb466fb4d1ed5b9ebeecc0
test outcome: killed
fenwick_tree.py, start pos: (31, 34), end pos: (31, 35)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 2
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -28,5 +28,5 @@
     def sum_of_range(self, start, end):
         # minus 1 from start since the range is (s, e) inclusive on both ends
         start -= 1
-        return self.sum_of_n(end) - self.sum_of_n(start)
+        return self.sum_of_n(end) ^ self.sum_of_n(start)
ts-3-5/test_3-5_0-3_103.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 11 == 9
========================= 1 failed, 2 passed in 0.14s ==========================

56 : Job ID fe7fcd75ce164d1dba11441cb74da351
test outcome: killed
fenwick_tree.py, start pos: (4, 24), end pos: (4, 25)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] + (len(arr)+1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: can only concatena...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: can only concate...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: can only con...
============================== 3 errors in 0.14s ===============================

57 : Job ID 20195c297bcf435481054f5eeaa1a7ca
test outcome: killed
fenwick_tree.py, start pos: (5, 24), end pos: (5, 25)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] + (len(arr)+1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: can only concatena...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: can only concate...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: can only con...
============================== 3 errors in 0.14s ===============================

58 : Job ID 317c619c72a542c4afc49e7270af4626
test outcome: killed
fenwick_tree.py, start pos: (4, 24), end pos: (4, 25)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] - (len(arr)+1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: unsupported operan...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: unsupported oper...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: unsupported ...
============================== 3 errors in 0.14s ===============================

59 : Job ID 1c1bc863bc0b417eb3e920a0345e962b
test outcome: killed
fenwick_tree.py, start pos: (5, 24), end pos: (5, 25)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] - (len(arr)+1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: unsupported operan...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: unsupported oper...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: unsupported ...
============================== 3 errors in 0.14s ===============================

60 : Job ID 10851537b14b45afa3d4cdb7d5183491
test outcome: killed
fenwick_tree.py, start pos: (4, 24), end pos: (4, 25)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] / (len(arr)+1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: unsupported operan...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: unsupported oper...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: unsupported ...
============================== 3 errors in 0.14s ===============================

61 : Job ID 338930833a0f4f64aa68d21828378894
test outcome: killed
fenwick_tree.py, start pos: (5, 24), end pos: (5, 25)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] / (len(arr)+1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: unsupported operan...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: unsupported oper...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: unsupported ...
============================== 3 errors in 0.15s ===============================

62 : Job ID 3d8114bfabad4c26aa75bcab6f86880c
test outcome: killed
fenwick_tree.py, start pos: (4, 24), end pos: (4, 25)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] // (len(arr)+1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: unsupported operan...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: unsupported oper...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: unsupported ...
============================== 3 errors in 0.14s ===============================

63 : Job ID fc770d50c1c74fada78337ea123ba287
test outcome: killed
fenwick_tree.py, start pos: (5, 24), end pos: (5, 25)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] // (len(arr)+1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: unsupported operan...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: unsupported oper...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: unsupported ...
============================== 3 errors in 0.15s ===============================
