64 : Job ID a683fed7f3f941ebb2a7830be692e905
test outcome: killed
fenwick_tree.py, start pos: (4, 24), end pos: (4, 25)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] % (len(arr)+1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: unsupported operan...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: unsupported oper...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: unsupported ...
============================== 3 errors in 0.14s ===============================

65 : Job ID a0981977820248a5a8f7e1fd740db8f7
test outcome: killed
fenwick_tree.py, start pos: (5, 24), end pos: (5, 25)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] % (len(arr)+1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: unsupported operan...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: unsupported oper...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: unsupported ...
============================== 3 errors in 0.14s ===============================

66 : Job ID 531261d444744365a567ea2c8568fa5f
test outcome: killed
fenwick_tree.py, start pos: (4, 24), end pos: (4, 25)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] ** (len(arr)+1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: unsupported operan...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: unsupported oper...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: unsupported ...
============================== 3 errors in 0.14s ===============================

67 : Job ID aab8ffbbfde64694bcc4903a304663f2
test outcome: killed
fenwick_tree.py, start pos: (5, 24), end pos: (5, 25)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] ** (len(arr)+1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: unsupported operan...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: unsupported oper...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: unsupported ...
============================== 3 errors in 0.14s ===============================

68 : Job ID 5580e57e021c4761a8488bd0242469d2
test outcome: killed
fenwick_tree.py, start pos: (4, 24), end pos: (4, 25)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] >> (len(arr)+1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: unsupported operan...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: unsupported oper...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: unsupported ...
============================== 3 errors in 0.14s ===============================

69 : Job ID c3e2d17ea7a04b0e829f2f414eee9eb9
test outcome: killed
fenwick_tree.py, start pos: (5, 24), end pos: (5, 25)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] >> (len(arr)+1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: unsupported operan...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: unsupported oper...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: unsupported ...
============================== 3 errors in 0.14s ===============================

70 : Job ID 2919dc7e2ed5460992ff53c7f1090a23
test outcome: killed
fenwick_tree.py, start pos: (4, 24), end pos: (4, 25)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] << (len(arr)+1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: unsupported operan...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: unsupported oper...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: unsupported ...
============================== 3 errors in 0.15s ===============================

71 : Job ID 426953bc4eb44b94b4bec31c7de16fcf
test outcome: killed
fenwick_tree.py, start pos: (5, 24), end pos: (5, 25)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] << (len(arr)+1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: unsupported operan...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: unsupported oper...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: unsupported ...
============================== 3 errors in 0.14s ===============================

72 : Job ID 6471d69e25b0446e9070818aa92f60fd
test outcome: killed
fenwick_tree.py, start pos: (4, 24), end pos: (4, 25)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] | (len(arr)+1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: unsupported operan...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: unsupported oper...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: unsupported ...
============================== 3 errors in 0.14s ===============================

73 : Job ID e5a40e1316bf4b3c8438c01df2e7d3eb
test outcome: killed
fenwick_tree.py, start pos: (5, 24), end pos: (5, 25)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] | (len(arr)+1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: unsupported operan...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: unsupported oper...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: unsupported ...
============================== 3 errors in 0.16s ===============================

74 : Job ID e91a41cc7a5f4878a979f7457d3003ef
test outcome: killed
fenwick_tree.py, start pos: (4, 24), end pos: (4, 25)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] & (len(arr)+1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: unsupported operan...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: unsupported oper...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: unsupported ...
============================== 3 errors in 0.16s ===============================

75 : Job ID 48c8ea24424f47feae39a3a10f79eb00
test outcome: killed
fenwick_tree.py, start pos: (5, 24), end pos: (5, 25)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] & (len(arr)+1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: unsupported operan...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: unsupported oper...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: unsupported ...
============================== 3 errors in 0.14s ===============================

76 : Job ID 55c1cc34ca634d9e8e75a66841d8c8ba
test outcome: killed
fenwick_tree.py, start pos: (4, 24), end pos: (4, 25)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] ^ (len(arr)+1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: unsupported operan...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: unsupported oper...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: unsupported ...
============================== 3 errors in 0.15s ===============================

77 : Job ID 1ea5033ed9da49d49feb2664eece1ab8
test outcome: killed
fenwick_tree.py, start pos: (5, 24), end pos: (5, 25)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] ^ (len(arr)+1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: unsupported operan...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: unsupported oper...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: unsupported ...
============================== 3 errors in 0.14s ===============================

78 : Job ID 63aa3979bd1a4700bc21597edb46b7da
test outcome: killed
fenwick_tree.py, start pos: (16, 27), end pos: (16, 28)
operator: core/ReplaceBinaryOperator_BitAnd_Add, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -13,7 +13,7 @@
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
-            index += index & (-index)
+            index += index + (-index)
     def sum_of_n(self, index):
         s = 0
timeout

79 : Job ID 0759dc47d0004145b393768b37443f27
test outcome: killed
fenwick_tree.py, start pos: (24, 27), end pos: (24, 28)
operator: core/ReplaceBinaryOperator_BitAnd_Add, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -21,7 +21,7 @@
         while index > 0:
             s += self.tree[index]
-            index -= index & (-index)
+            index -= index + (-index)
         return s
timeout

80 : Job ID 2ee9f640d715412998a8d5af5e349ed9
test outcome: killed
fenwick_tree.py, start pos: (16, 27), end pos: (16, 28)
operator: core/ReplaceBinaryOperator_BitAnd_Sub, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -13,7 +13,7 @@
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
-            index += index & (-index)
+            index += index - (-index)
     def sum_of_n(self, index):
         s = 0
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1, 2, 11, 4, 5] =...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 9 == 15
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 3 == 9
============================== 3 failed in 0.14s ===============================

81 : Job ID 321d17bf54d14754a8aad039a2ee323e
test outcome: killed
fenwick_tree.py, start pos: (24, 27), end pos: (24, 28)
operator: core/ReplaceBinaryOperator_BitAnd_Sub, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -21,7 +21,7 @@
         while index > 0:
             s += self.tree[index]
-            index -= index & (-index)
+            index -= index - (-index)
         return s
ts-3-5/test_3-5_0-3_103.py .FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 3 == 6
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 2 == 12
========================= 2 failed, 1 passed in 0.14s ==========================

82 : Job ID a42de9181e26417f92dff02369d46b9e
test outcome: killed
fenwick_tree.py, start pos: (16, 27), end pos: (16, 28)
operator: core/ReplaceBinaryOperator_BitAnd_Mul, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -13,7 +13,7 @@
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
-            index += index & (-index)
+            index += index * (-index)
     def sum_of_n(self, index):
         s = 0
timeout

83 : Job ID 65976038a331485e96ceb72b6e0b74bc
test outcome: killed
fenwick_tree.py, start pos: (24, 27), end pos: (24, 28)
operator: core/ReplaceBinaryOperator_BitAnd_Mul, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -21,7 +21,7 @@
         while index > 0:
             s += self.tree[index]
-            index -= index & (-index)
+            index -= index * (-index)
         return s
ts-3-5/test_3-5_0-3_103.py .FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index...
========================= 2 failed, 1 passed in 0.14s ==========================

84 : Job ID f25773706c684d6b9aa675845504a94f
test outcome: killed
fenwick_tree.py, start pos: (16, 27), end pos: (16, 28)
operator: core/ReplaceBinaryOperator_BitAnd_Div, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -13,7 +13,7 @@
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
-            index += index & (-index)
+            index += index / (-index)
     def sum_of_n(self, index):
         s = 0
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: list indices must ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: list indices mus...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: list indices...
============================== 3 errors in 0.15s ===============================

85 : Job ID 2090cbe21b514c4096e4d650db9cdd4c
test outcome: killed
fenwick_tree.py, start pos: (24, 27), end pos: (24, 28)
operator: core/ReplaceBinaryOperator_BitAnd_Div, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -21,7 +21,7 @@
         while index > 0:
             s += self.tree[index]
-            index -= index & (-index)
+            index -= index / (-index)
         return s
ts-3-5/test_3-5_0-3_103.py .FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: list indices mu...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: list indice...
========================= 2 failed, 1 passed in 0.14s ==========================

86 : Job ID 196f6145c354438bae571a06b31c23c6
test outcome: killed
fenwick_tree.py, start pos: (16, 27), end pos: (16, 28)
operator: core/ReplaceBinaryOperator_BitAnd_FloorDiv, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -13,7 +13,7 @@
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
-            index += index & (-index)
+            index += index // (-index)
     def sum_of_n(self, index):
         s = 0
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - ZeroDivisionError: integer di...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - ZeroDivisionError: integer ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - ZeroDivisionError: inte...
============================== 3 errors in 0.14s ===============================

87 : Job ID 357a46441fac4bceb7f8bc4430a93bb4
test outcome: killed
fenwick_tree.py, start pos: (24, 27), end pos: (24, 28)
operator: core/ReplaceBinaryOperator_BitAnd_FloorDiv, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -21,7 +21,7 @@
         while index > 0:
             s += self.tree[index]
-            index -= index & (-index)
+            index -= index // (-index)
         return s
ts-3-5/test_3-5_0-3_103.py .FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index...
========================= 2 failed, 1 passed in 0.14s ==========================

88 : Job ID 1c026b0d4b384a619b7155d6a14113ae
test outcome: killed
fenwick_tree.py, start pos: (16, 27), end pos: (16, 28)
operator: core/ReplaceBinaryOperator_BitAnd_Mod, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -13,7 +13,7 @@
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
-            index += index & (-index)
+            index += index % (-index)
     def sum_of_n(self, index):
         s = 0
timeout

89 : Job ID bed39a6d82ee4bf085ff03c8cce0a4b4
test outcome: killed
fenwick_tree.py, start pos: (24, 27), end pos: (24, 28)
operator: core/ReplaceBinaryOperator_BitAnd_Mod, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -21,7 +21,7 @@
         while index > 0:
             s += self.tree[index]
-            index -= index & (-index)
+            index -= index % (-index)
         return s
timeout

90 : Job ID 88f1a942f6dd47379a7f0990ba01cb21
test outcome: killed
fenwick_tree.py, start pos: (16, 27), end pos: (16, 28)
operator: core/ReplaceBinaryOperator_BitAnd_Pow, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -13,7 +13,7 @@
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
-            index += index & (-index)
+            index += index ** (-index)
     def sum_of_n(self, index):
         s = 0
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - TypeError: list indices must ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: list indices mus...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: list indices...
============================== 3 errors in 0.14s ===============================

91 : Job ID c075cc20d4a5437ab0e3842ab39399d8
test outcome: killed
fenwick_tree.py, start pos: (24, 27), end pos: (24, 28)
operator: core/ReplaceBinaryOperator_BitAnd_Pow, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -21,7 +21,7 @@
         while index > 0:
             s += self.tree[index]
-            index -= index & (-index)
+            index -= index ** (-index)
         return s
ts-3-5/test_3-5_0-3_103.py .FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - TypeError: list indices mu...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - TypeError: list indice...
========================= 2 failed, 1 passed in 0.14s ==========================

92 : Job ID 53c65e0801694b1d8aa54eff92351a0b
test outcome: killed
fenwick_tree.py, start pos: (16, 27), end pos: (16, 28)
operator: core/ReplaceBinaryOperator_BitAnd_RShift, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -13,7 +13,7 @@
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
-            index += index & (-index)
+            index += index >> (-index)
     def sum_of_n(self, index):
         s = 0
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - ValueError: negative shift count
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - ValueError: negative shift ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - ValueError: negative sh...
============================== 3 errors in 0.14s ===============================

93 : Job ID f91e20890b3f40c097a72242c31fa626
test outcome: killed
fenwick_tree.py, start pos: (24, 27), end pos: (24, 28)
operator: core/ReplaceBinaryOperator_BitAnd_RShift, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -21,7 +21,7 @@
         while index > 0:
             s += self.tree[index]
-            index -= index & (-index)
+            index -= index >> (-index)
         return s
ts-3-5/test_3-5_0-3_103.py .FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - ValueError: negative shift...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - ValueError: negative s...
========================= 2 failed, 1 passed in 0.14s ==========================

94 : Job ID c5dcbfc5e9714d4a9a9e17d7003741f9
test outcome: killed
fenwick_tree.py, start pos: (16, 27), end pos: (16, 28)
operator: core/ReplaceBinaryOperator_BitAnd_LShift, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -13,7 +13,7 @@
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
-            index += index & (-index)
+            index += index << (-index)
     def sum_of_n(self, index):
         s = 0
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - ValueError: negative shift count
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - ValueError: negative shift ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - ValueError: negative sh...
============================== 3 errors in 0.14s ===============================

95 : Job ID 4ae0693e2d53435a8e1f106e9a0de698
test outcome: killed
fenwick_tree.py, start pos: (24, 27), end pos: (24, 28)
operator: core/ReplaceBinaryOperator_BitAnd_LShift, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -21,7 +21,7 @@
         while index > 0:
             s += self.tree[index]
-            index -= index & (-index)
+            index -= index << (-index)
         return s
ts-3-5/test_3-5_0-3_103.py .FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - ValueError: negative shift...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - ValueError: negative s...
========================= 2 failed, 1 passed in 0.14s ==========================

96 : Job ID e29d7b23416044dfa2d3091e779e06ce
test outcome: killed
fenwick_tree.py, start pos: (16, 27), end pos: (16, 28)
operator: core/ReplaceBinaryOperator_BitAnd_BitOr, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -13,7 +13,7 @@
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
-            index += index & (-index)
+            index += index | (-index)
     def sum_of_n(self, index):
         s = 0
timeout

97 : Job ID bc58efe7fbb04e228ebede4637662de6
test outcome: killed
fenwick_tree.py, start pos: (24, 27), end pos: (24, 28)
operator: core/ReplaceBinaryOperator_BitAnd_BitOr, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -21,7 +21,7 @@
         while index > 0:
             s += self.tree[index]
-            index -= index & (-index)
+            index -= index | (-index)
         return s
ts-3-5/test_3-5_0-3_103.py .FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index...
========================= 2 failed, 1 passed in 0.14s ==========================

98 : Job ID 0080ddf678994978a838e736c019526c
test outcome: killed
fenwick_tree.py, start pos: (16, 27), end pos: (16, 28)
operator: core/ReplaceBinaryOperator_BitAnd_BitXor, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -13,7 +13,7 @@
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
-            index += index & (-index)
+            index += index ^ (-index)
     def sum_of_n(self, index):
         s = 0
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.14s ===============================
