99 : Job ID 22ff61aecffb4e0394a97507e6a31fe7
test outcome: killed
fenwick_tree.py, start pos: (24, 27), end pos: (24, 28)
operator: core/ReplaceBinaryOperator_BitAnd_BitXor, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -21,7 +21,7 @@
         while index > 0:
             s += self.tree[index]
-            index -= index & (-index)
+            index -= index ^ (-index)
         return s
ts-3-5/test_3-5_0-3_103.py .FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index...
========================= 2 failed, 1 passed in 0.14s ==========================

100 : Job ID 88c7c7c7160c47bcb37ed9ae4f89308e
test outcome: killed
fenwick_tree.py, start pos: (14, 20), end pos: (14, 22)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -11,7 +11,7 @@
         index += 1
         delta = value - self.nums[index]
         self.nums[index] = value
-        while index <= len(self.tree)-1:
+        while index == len(self.tree)-1:
             self.tree[index] += delta
             index += index & (-index)
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 0, 0, 0, 0, 5] ==...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 0 == 6
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 0 == 9
============================== 3 failed in 0.14s ===============================

101 : Job ID e3f8f3f9cffa436698929646cb4ce097
test outcome: killed
fenwick_tree.py, start pos: (14, 20), end pos: (14, 22)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -11,7 +11,7 @@
         index += 1
         delta = value - self.nums[index]
         self.nums[index] = value
-        while index <= len(self.tree)-1:
+        while index != len(self.tree)-1:
             self.tree[index] += delta
             index += index & (-index)
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.14s ===============================

102 : Job ID 5c7deebe16394652b74e3ce5f989f911
test outcome: killed
fenwick_tree.py, start pos: (14, 20), end pos: (14, 22)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -11,7 +11,7 @@
         index += 1
         delta = value - self.nums[index]
         self.nums[index] = value
-        while index <= len(self.tree)-1:
+        while index < len(self.tree)-1:
             self.tree[index] += delta
             index += index & (-index)
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1, 3, 10, 17, 0] ...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 10 == 15
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 7 == 12
============================== 3 failed in 0.14s ===============================

103 : Job ID b2d40e0f1cd04be2ac153bc9dc1a72ff
test outcome: killed
fenwick_tree.py, start pos: (14, 20), end pos: (14, 22)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -11,7 +11,7 @@
         index += 1
         delta = value - self.nums[index]
         self.nums[index] = value
-        while index <= len(self.tree)-1:
+        while index > len(self.tree)-1:
             self.tree[index] += delta
             index += index & (-index)
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 0, 0, 0, 0, 0] ==...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 0 == 6
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 0 == 9
============================== 3 failed in 0.14s ===============================

104 : Job ID a612a4bbba464dfea77e8c5192d41799
test outcome: killed
fenwick_tree.py, start pos: (14, 20), end pos: (14, 22)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -11,7 +11,7 @@
         index += 1
         delta = value - self.nums[index]
         self.nums[index] = value
-        while index <= len(self.tree)-1:
+        while index >= len(self.tree)-1:
             self.tree[index] += delta
             index += index & (-index)
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.14s ===============================

105 : Job ID 49078b89cfb042868c591728553cfd30
test outcome: killed
fenwick_tree.py, start pos: (14, 20), end pos: (14, 22)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -11,7 +11,7 @@
         index += 1
         delta = value - self.nums[index]
         self.nums[index] = value
-        while index <= len(self.tree)-1:
+        while index is len(self.tree)-1:
             self.tree[index] += delta
             index += index & (-index)
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 0, 0, 0, 0, 5] ==...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 0 == 6
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 0 == 9
============================== 3 failed in 0.14s ===============================

106 : Job ID e7f11366c6114784a149ad25cb91c59a
test outcome: killed
fenwick_tree.py, start pos: (14, 20), end pos: (14, 22)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -11,7 +11,7 @@
         index += 1
         delta = value - self.nums[index]
         self.nums[index] = value
-        while index <= len(self.tree)-1:
+        while index is not len(self.tree)-1:
             self.tree[index] += delta
             index += index & (-index)
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.14s ===============================

107 : Job ID 170e3bbbbfdb4ce59ecfc892e9b8b8bf
test outcome: killed
fenwick_tree.py, start pos: (22, 20), end pos: (22, 21)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -19,7 +19,7 @@
         s = 0
         index += 1
-        while index > 0:
+        while index == 0:
             s += self.tree[index]
             index -= index & (-index)
ts-3-5/test_3-5_0-3_103.py .FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 0 == 6
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 0 == 9
========================= 2 failed, 1 passed in 0.14s ==========================

108 : Job ID 6e1251adf8f343e392dbd7840b8aed7d
SURVIVED
test outcome: survived
fenwick_tree.py, start pos: (22, 20), end pos: (22, 21)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -19,7 +19,7 @@
         s = 0
         index += 1
-        while index > 0:
+        while index != 0:
             s += self.tree[index]
             index -= index & (-index)
ts-3-5/test_3-5_0-3_103.py ...                                           [100%]
============================== 3 passed in 0.14s ===============================

109 : Job ID 80757bfeca7b445f816a4b42a456d056
test outcome: killed
fenwick_tree.py, start pos: (22, 20), end pos: (22, 21)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -19,7 +19,7 @@
         s = 0
         index += 1
-        while index > 0:
+        while index < 0:
             s += self.tree[index]
             index -= index & (-index)
ts-3-5/test_3-5_0-3_103.py .FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 0 == 6
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 0 == 9
========================= 2 failed, 1 passed in 0.14s ==========================

110 : Job ID df7e437fbdc144b7a65b6e37cc2ceb57
test outcome: killed
fenwick_tree.py, start pos: (22, 20), end pos: (22, 21)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -19,7 +19,7 @@
         s = 0
         index += 1
-        while index > 0:
+        while index <= 0:
             s += self.tree[index]
             index -= index & (-index)
ts-3-5/test_3-5_0-3_103.py .FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 0 == 6
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 0 == 9
========================= 2 failed, 1 passed in 0.14s ==========================

111 : Job ID 3734fd4017c64aeb9c4cec13fa74389b
test outcome: killed
fenwick_tree.py, start pos: (22, 20), end pos: (22, 21)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -19,7 +19,7 @@
         s = 0
         index += 1
-        while index > 0:
+        while index >= 0:
             s += self.tree[index]
             index -= index & (-index)
timeout

112 : Job ID 87c24850040a42f896e9d591ff14c299
test outcome: killed
fenwick_tree.py, start pos: (16, 30), end pos: (16, 31)
operator: core/ReplaceUnaryOperator_USub_UAdd, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -13,7 +13,7 @@
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
-            index += index & (-index)
+            index += index & (+index)
     def sum_of_n(self, index):
         s = 0
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1, 3, 10, 7, 5] =...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 12 == 15
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 6 == 9
============================== 3 failed in 0.14s ===============================

113 : Job ID b3c62e52a08945038d2e99b5c0f2cdb8
test outcome: killed
fenwick_tree.py, start pos: (24, 30), end pos: (24, 31)
operator: core/ReplaceUnaryOperator_USub_UAdd, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -21,7 +21,7 @@
         while index > 0:
             s += self.tree[index]
-            index -= index & (-index)
+            index -= index & (+index)
         return s
ts-3-5/test_3-5_0-3_103.py .FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 3 == 6
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 2 == 12
========================= 2 failed, 1 passed in 0.14s ==========================

114 : Job ID b7102463929f44bc87c9db57ed031e83
test outcome: killed
fenwick_tree.py, start pos: (16, 30), end pos: (16, 31)
operator: core/ReplaceUnaryOperator_USub_Invert, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -13,7 +13,7 @@
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
-            index += index & (-index)
+            index += index & (~index)
     def sum_of_n(self, index):
         s = 0
timeout

115 : Job ID 55e087d0fe18463fb3122bc4879e4c94
test outcome: killed
fenwick_tree.py, start pos: (24, 30), end pos: (24, 31)
operator: core/ReplaceUnaryOperator_USub_Invert, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -21,7 +21,7 @@
         while index > 0:
             s += self.tree[index]
-            index -= index & (-index)
+            index -= index & (~index)
         return s
timeout

116 : Job ID 67c515169c5749f4996d247a88f3530b
test outcome: killed
fenwick_tree.py, start pos: (16, 30), end pos: (16, 31)
operator: core/ReplaceUnaryOperator_USub_Not, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -13,7 +13,7 @@
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
-            index += index & (-index)
+            index += index & (not index)
     def sum_of_n(self, index):
         s = 0
timeout

117 : Job ID 36fcf4d496a1405fb2a1ede8c5f4eacc
test outcome: killed
fenwick_tree.py, start pos: (24, 30), end pos: (24, 31)
operator: core/ReplaceUnaryOperator_USub_Not, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -21,7 +21,7 @@
         while index > 0:
             s += self.tree[index]
-            index -= index & (-index)
+            index -= index & (not index)
         return s
timeout

118 : Job ID cec9b496c44a4de5a43b3ecfaaa6080f
test outcome: killed
fenwick_tree.py, start pos: (16, 30), end pos: (16, 31)
operator: core/ReplaceUnaryOperator_Delete_USub, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -13,7 +13,7 @@
         self.nums[index] = value
         while index <= len(self.tree)-1:
             self.tree[index] += delta
-            index += index & (-index)
+            index += index & (index)
     def sum_of_n(self, index):
         s = 0
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1, 3, 10, 7, 5] =...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 12 == 15
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 6 == 9
============================== 3 failed in 0.14s ===============================

119 : Job ID 4e2b6ad85b134763b43faaf43da7fe3c
test outcome: killed
fenwick_tree.py, start pos: (24, 30), end pos: (24, 31)
operator: core/ReplaceUnaryOperator_Delete_USub, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -21,7 +21,7 @@
         while index > 0:
             s += self.tree[index]
-            index -= index & (-index)
+            index -= index & (index)
         return s
ts-3-5/test_3-5_0-3_103.py .FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 3 == 6
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 2 == 12
========================= 2 failed, 1 passed in 0.14s ==========================

120 : Job ID 0d7c679baa7a4e49bb5e3ebbb7bdbd75
test outcome: killed
fenwick_tree.py, start pos: (14, 14), end pos: (14, 39)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -11,7 +11,7 @@
         index += 1
         delta = value - self.nums[index]
         self.nums[index] = value
-        while index <= len(self.tree)-1:
+        while not index <= len(self.tree)-1:
             self.tree[index] += delta
             index += index & (-index)
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 0, 0, 0, 0, 0] ==...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 0 == 6
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 0 == 9
============================== 3 failed in 0.14s ===============================

121 : Job ID 51934d8d022740ed8953703f7aa10124
test outcome: killed
fenwick_tree.py, start pos: (22, 14), end pos: (22, 23)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -19,7 +19,7 @@
         s = 0
         index += 1
-        while index > 0:
+        while not index > 0:
             s += self.tree[index]
             index -= index & (-index)
ts-3-5/test_3-5_0-3_103.py .FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 0 == 6
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 0 == 9
========================= 2 failed, 1 passed in 0.14s ==========================

122 : Job ID a6dc704086394ea2bdef2f3958c465fb
test outcome: killed
fenwick_tree.py, start pos: (4, 21), end pos: (4, 22)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [ 1] * (len(arr)+1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [1, 1, 2, 10, 4, 5] =...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 3 == 6
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 6 == 9
============================== 3 failed in 0.14s ===============================

123 : Job ID b50ad6cc08f34c1e84efb0f38b801412
test outcome: killed
fenwick_tree.py, start pos: (4, 21), end pos: (4, 22)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [ -1] * (len(arr)+1)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [-1, 1, 2, 10, 4, 5] ...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 9 == 6
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 12 == 9
============================== 3 failed in 0.14s ===============================

124 : Job ID af8afb7ba14a4c718b42079b6dcc274a
test outcome: killed
fenwick_tree.py, start pos: (4, 36), end pos: (4, 37)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] * (len(arr)+ 2)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1, 2, 10, 4, 5, ....
========================= 1 failed, 2 passed in 0.14s ==========================

125 : Job ID f0944fa043dd4699a52ed5b6f68f4040
test outcome: killed
fenwick_tree.py, start pos: (4, 36), end pos: (4, 37)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -1,7 +1,7 @@
 class FenwickTree:
     def __init__(self, arr):
-        self.nums = [0] * (len(arr)+1)
+        self.nums = [0] * (len(arr)+ 0)
         self.tree = [0] * (len(arr)+1)
         for i in range(len(arr)):
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.15s ===============================

126 : Job ID 41270bc4bf0040c98e3a329becf7d5b7
test outcome: killed
fenwick_tree.py, start pos: (5, 21), end pos: (5, 22)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [ 1] * (len(arr)+1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [1, 2, 4, 11, 18, 6] ...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 8 == 6
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 13 == 12
============================== 3 failed in 0.14s ===============================

127 : Job ID 47ecf1a95d714631aa8d0aeb20f28637
test outcome: killed
fenwick_tree.py, start pos: (5, 21), end pos: (5, 22)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [ -1] * (len(arr)+1)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [-1, 0, 2, 9, 16, 4] ...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 4 == 6
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 11 == 12
============================== 3 failed in 0.14s ===============================

128 : Job ID a77859fd40ae4efda0fb5ea141262362
test outcome: killed
fenwick_tree.py, start pos: (5, 36), end pos: (5, 37)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] * (len(arr)+ 2)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1, 3, 10, 17, 5, ...
========================= 1 failed, 2 passed in 0.13s ==========================

129 : Job ID 907aff3ecfb64f14829aaa79208c0965
test outcome: killed
fenwick_tree.py, start pos: (5, 36), end pos: (5, 37)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -2,7 +2,7 @@
     def __init__(self, arr):
         self.nums = [0] * (len(arr)+1)
-        self.tree = [0] * (len(arr)+1)
+        self.tree = [0] * (len(arr)+ 0)
         for i in range(len(arr)):
             self.update(i,arr[i])
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1, 3, 10, 17] == ...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index...
============================== 3 failed in 0.16s ===============================

130 : Job ID a0618622673e4fbcbf07b6da3b41f93b
test outcome: killed
fenwick_tree.py, start pos: (11, 17), end pos: (11, 18)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -8,7 +8,7 @@
             self.update(i,arr[i])
     def update(self, index, value):
-        index += 1
+        index += 2
         delta = value - self.nums[index]
         self.nums[index] = value
         while index <= len(self.tree)-1:
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.14s ===============================

131 : Job ID 4ae182a22a9849008f316cba5e73e7f4
test outcome: killed
fenwick_tree.py, start pos: (11, 17), end pos: (11, 18)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -8,7 +8,7 @@
             self.update(i,arr[i])
     def update(self, index, value):
-        index += 1
+        index += 0
         delta = value - self.nums[index]
         self.nums[index] = value
         while index <= len(self.tree)-1:
timeout

132 : Job ID a9beb50b8cc0452a939b2c951ddae698
test outcome: killed
fenwick_tree.py, start pos: (14, 38), end pos: (14, 39)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -11,7 +11,7 @@
         index += 1
         delta = value - self.nums[index]
         self.nums[index] = value
-        while index <= len(self.tree)-1:
+        while index <= len(self.tree)- 2:
             self.tree[index] += delta
             index += index & (-index)
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 1, 3, 10, 17, 0] ...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 10 == 15
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 7 == 12
============================== 3 failed in 0.14s ===============================

133 : Job ID e3eaaf2e99b74d95af26ad3bc2e71856
test outcome: killed
fenwick_tree.py, start pos: (14, 38), end pos: (14, 39)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -11,7 +11,7 @@
         index += 1
         delta = value - self.nums[index]
         self.nums[index] = value
-        while index <= len(self.tree)-1:
+        while index <= len(self.tree)- 0:
             self.tree[index] += delta
             index += index & (-index)
ts-3-5/test_3-5_0-3_103.py EEE                                           [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-3_103.py::test_update - IndexError: list index out of...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - IndexError: list index out ...
ERROR ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - IndexError: list index ...
============================== 3 errors in 0.14s ===============================

134 : Job ID f273e4e35f784a4b826e74ad848e9581
test outcome: killed
fenwick_tree.py, start pos: (19, 12), end pos: (19, 13)
operator: core/NumberReplacer, occurrence: 12
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -16,7 +16,7 @@
             index += index & (-index)
     def sum_of_n(self, index):
-        s = 0
+        s = 1
         index += 1
         while index > 0:
ts-3-5/test_3-5_0-3_103.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 7 == 6
========================= 1 failed, 2 passed in 0.15s ==========================
