135 : Job ID d518a26148014aa69dc8cb80cf4b3313
test outcome: killed
fenwick_tree.py, start pos: (19, 12), end pos: (19, 13)
operator: core/NumberReplacer, occurrence: 13
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -16,7 +16,7 @@
             index += index & (-index)
     def sum_of_n(self, index):
-        s = 0
+        s = -1
         index += 1
         while index > 0:
ts-3-5/test_3-5_0-3_103.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 5 == 6
========================= 1 failed, 2 passed in 0.14s ==========================

136 : Job ID fc9f7b7a02aa4f239898024622ef3b92
test outcome: killed
fenwick_tree.py, start pos: (20, 17), end pos: (20, 18)
operator: core/NumberReplacer, occurrence: 14
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -17,7 +17,7 @@
     def sum_of_n(self, index):
         s = 0
-        index += 1
+        index += 2
         while index > 0:
             s += self.tree[index]
ts-3-5/test_3-5_0-3_103.py .FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 10 == 6
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 12 == 9
========================= 2 failed, 1 passed in 0.14s ==========================

137 : Job ID c05c7137afbb4f11b37671b46275b1d6
test outcome: killed
fenwick_tree.py, start pos: (20, 17), end pos: (20, 18)
operator: core/NumberReplacer, occurrence: 15
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -17,7 +17,7 @@
     def sum_of_n(self, index):
         s = 0
-        index += 1
+        index += 0
         while index > 0:
             s += self.tree[index]
ts-3-5/test_3-5_0-3_103.py .FF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 3 == 6
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 6 == 9
========================= 2 failed, 1 passed in 0.14s ==========================

138 : Job ID 499f7fa93578479b8951e9a4dde8043d
test outcome: killed
fenwick_tree.py, start pos: (22, 22), end pos: (22, 23)
operator: core/NumberReplacer, occurrence: 16
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -19,7 +19,7 @@
         s = 0
         index += 1
-        while index > 0:
+        while index > 1:
             s += self.tree[index]
             index -= index & (-index)
ts-3-5/test_3-5_0-3_103.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 10 == 9
========================= 1 failed, 2 passed in 0.13s ==========================

139 : Job ID ac59a925745947cca7f785b3bc5279d7
test outcome: killed
fenwick_tree.py, start pos: (22, 22), end pos: (22, 23)
operator: core/NumberReplacer, occurrence: 17
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -19,7 +19,7 @@
         s = 0
         index += 1
-        while index > 0:
+        while index > -1:
             s += self.tree[index]
             index -= index & (-index)
timeout

140 : Job ID 56010b84a5724d43abae44ab983a4353
test outcome: killed
fenwick_tree.py, start pos: (30, 17), end pos: (30, 18)
operator: core/NumberReplacer, occurrence: 18
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -27,6 +27,6 @@
     def sum_of_range(self, start, end):
         # minus 1 from start since the range is (s, e) inclusive on both ends
-        start -= 1
+        start -= 2
         return self.sum_of_n(end) - self.sum_of_n(start)
ts-3-5/test_3-5_0-3_103.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 10 == 9
========================= 1 failed, 2 passed in 0.14s ==========================

141 : Job ID 8bc31d2b1c9c4e228be3c060562b549f
test outcome: killed
fenwick_tree.py, start pos: (30, 17), end pos: (30, 18)
operator: core/NumberReplacer, occurrence: 19
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -27,6 +27,6 @@
     def sum_of_range(self, start, end):
         # minus 1 from start since the range is (s, e) inclusive on both ends
-        start -= 1
+        start -= 0
         return self.sum_of_n(end) - self.sum_of_n(start)
ts-3-5/test_3-5_0-3_103.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 7 == 9
========================= 1 failed, 2 passed in 0.14s ==========================

142 : Job ID e4c23fd72da64b778e3711bccf06caca
test outcome: killed
fenwick_tree.py, start pos: (7, 17), end pos: (7, 32)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- afenwick_tree.py
+++ bfenwick_tree.py
@@ -4,7 +4,7 @@
         self.nums = [0] * (len(arr)+1)
         self.tree = [0] * (len(arr)+1)
-        for i in range(len(arr)):
+        for i in []:
             self.update(i,arr[i])
     def update(self, index, value):
ts-3-5/test_3-5_0-3_103.py FFF                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_103.py::test_update - assert [0, 0, 0, 10, 0, 0] =...
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_n - assert 0 == 6
FAILED ts-3-5/test_3-5_0-3_103.py::test_sum_of_range - assert 0 == 9
============================== 3 failed in 0.16s ===============================
