   - [#   1] AOD fenwick_tree: 
--------------------------------------------------------------------------------
  12:         delta = value - self.nums[index]
  13:         self.nums[index] = value
  14:         while index <= len(self.tree) - 1:
  15:             self.tree[index] += delta
- 16:             index += index & (-index)
+ 16:             index += index & index
  17:     
  18:     def sum_of_n(self, index):
  19:         s = 0
  20:         index += 1
--------------------------------------------------------------------------------
[0.22234 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b4ffe18280>

    def test_update(fenwick_tree):
        fenwick_tree.update(2, 10)
        assert fenwick_tree.sum_of_n(2) == 15
    
        fenwick_tree.update(5, -2)
>       assert fenwick_tree.sum_of_n(5) == 24
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:21: AssertionError

   - [#   2] AOD fenwick_tree: 
--------------------------------------------------------------------------------
  20:         index += 1
  21:         
  22:         while index > 0:
  23:             s += self.tree[index]
- 24:             index -= index & (-index)
+ 24:             index -= index & index
  25:         
  26:         return s
  27:     
  28:     def sum_of_range(self, start, end):
--------------------------------------------------------------------------------
[0.21758 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b4ffec6f80>

    def test_update(fenwick_tree):
        fenwick_tree.update(2, 10)
>       assert fenwick_tree.sum_of_n(2) == 15
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:18: AssertionError

   - [#  16] ASR fenwick_tree: 
--------------------------------------------------------------------------------
   7:         for i in range(len(arr)):
   8:             self.update(i, arr[i])
   9:     
  10:     def update(self, index, value):
- 11:         index += 1
+ 11:         index -= 1
  12:         delta = value - self.nums[index]
  13:         self.nums[index] = value
  14:         while index <= len(self.tree) - 1:
  15:             self.tree[index] += delta
--------------------------------------------------------------------------------
[5.00399 s] timeout

   - [#  17] ASR fenwick_tree: 
--------------------------------------------------------------------------------
  11:         index += 1
  12:         delta = value - self.nums[index]
  13:         self.nums[index] = value
  14:         while index <= len(self.tree) - 1:
- 15:             self.tree[index] += delta
+ 15:             self.tree[index] -= delta
  16:             index += index & (-index)
  17:     
  18:     def sum_of_n(self, index):
  19:         s = 0
--------------------------------------------------------------------------------
[0.22020 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b4ffbfb820>

    def test_update(fenwick_tree):
        fenwick_tree.update(2, 10)
>       assert fenwick_tree.sum_of_n(2) == 15
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:18: AssertionError

   - [#  18] ASR fenwick_tree: 
--------------------------------------------------------------------------------
  12:         delta = value - self.nums[index]
  13:         self.nums[index] = value
  14:         while index <= len(self.tree) - 1:
  15:             self.tree[index] += delta
- 16:             index += index & (-index)
+ 16:             index -= index & (-index)
  17:     
  18:     def sum_of_n(self, index):
  19:         s = 0
  20:         index += 1
--------------------------------------------------------------------------------
[5.00649 s] timeout

   - [#  19] ASR fenwick_tree: 
--------------------------------------------------------------------------------
  16:             index += index & (-index)
  17:     
  18:     def sum_of_n(self, index):
  19:         s = 0
- 20:         index += 1
+ 20:         index -= 1
  21:         
  22:         while index > 0:
  23:             s += self.tree[index]
  24:             index -= index & (-index)
--------------------------------------------------------------------------------
[0.20770 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b4fff543d0>

    def test_update(fenwick_tree):
        fenwick_tree.update(2, 10)
>       assert fenwick_tree.sum_of_n(2) == 15
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:18: AssertionError

   - [#  20] ASR fenwick_tree: 
--------------------------------------------------------------------------------
  19:         s = 0
  20:         index += 1
  21:         
  22:         while index > 0:
- 23:             s += self.tree[index]
+ 23:             s -= self.tree[index]
  24:             index -= index & (-index)
  25:         
  26:         return s
  27:     
--------------------------------------------------------------------------------
[0.21281 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b4ffc3caf0>

    def test_update(fenwick_tree):
        fenwick_tree.update(2, 10)
>       assert fenwick_tree.sum_of_n(2) == 15
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:18: AssertionError

   - [#  21] ASR fenwick_tree: 
--------------------------------------------------------------------------------
  20:         index += 1
  21:         
  22:         while index > 0:
  23:             s += self.tree[index]
- 24:             index -= index & (-index)
+ 24:             index += index & (-index)
  25:         
  26:         return s
  27:     
  28:     def sum_of_range(self, start, end):
--------------------------------------------------------------------------------
[0.21105 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b4ffffba90>

    def test_update(fenwick_tree):
        fenwick_tree.update(2, 10)
>       assert fenwick_tree.sum_of_n(2) == 15

ts-3-5/test_3-5_0-2_81.py:18: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <fenwick_tree.FenwickTree object at 0x72b4ffffba90>, index = 16

>   ???
E   IndexError: list index out of range

fenwick_tree:23: IndexError

   - [#  22] ASR fenwick_tree: 
--------------------------------------------------------------------------------
  26:         return s
  27:     
  28:     def sum_of_range(self, start, end):
  29:         
- 30:         start -= 1
+ 30:         start += 1
  31:         return self.sum_of_n(end) - self.sum_of_n(start)
--------------------------------------------------------------------------------
[0.21082 s] killed by ts-3-5/test_3-5_0-2_81.py::test_sum_of_range

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b4ffbfb3d0>

    def test_sum_of_range(fenwick_tree):
>       assert fenwick_tree.sum_of_range(2, 5) == 14
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:28: AssertionError

   - [#  24] CDI fenwick_tree: 
--------------------------------------------------------------------------------
   6:         
   7:         for i in range(len(arr)):
   8:             self.update(i, arr[i])
   9:     
- 10:     def update(self, index, value):
- 11:         index += 1
- 12:         delta = value - self.nums[index]
- 13:         self.nums[index] = value
- 14:         while index <= len(self.tree) - 1:
- 15:             self.tree[index] += delta
- 16:             index += index & (-index)
- 17:     
+ 10:     @classmethod
+ 11:     def update(self, index, value):
+ 12:         index += 1
+ 13:         delta = value - self.nums[index]
+ 14:         self.nums[index] = value
+ 15:         while index <= len(self.tree) - 1:
+ 16:             self.tree[index] += delta
+ 17:             index += index & (-index)
  18:     def sum_of_n(self, index):
  19:         s = 0
  20:         index += 1
  21:         
--------------------------------------------------------------------------------
[0.21885 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

@pytest.fixture
    def fenwick_tree():
        arr = [3, 2, -1, 6, 5, 4, -3, 3, 7, 2]
>       return FenwickTree(arr)

ts-3-5/test_3-5_0-2_81.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
fenwick_tree:8: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'fenwick_tree.FenwickTree'>, index = 1, value = 3

>   ???
E   AttributeError: type object 'FenwickTree' has no attribute 'nums'

   - [#  25] CDI fenwick_tree: 
--------------------------------------------------------------------------------
  14:         while index <= len(self.tree) - 1:
  15:             self.tree[index] += delta
  16:             index += index & (-index)
  17:     
- 18:     def sum_of_n(self, index):
- 19:         s = 0
- 20:         index += 1
- 21:         
- 22:         while index > 0:
- 23:             s += self.tree[index]
- 24:             index -= index & (-index)
- 25:         
- 26:         return s
- 27:     
+ 18:     @classmethod
+ 19:     def sum_of_n(self, index):
+ 20:         s = 0
+ 21:         index += 1
+ 22:         
+ 23:         while index > 0:
+ 24:             s += self.tree[index]
+ 25:             index -= index & (-index)
+ 26:         
+ 27:         return s
  28:     def sum_of_range(self, start, end):
  29:         
  30:         start -= 1
  31:         return self.sum_of_n(end) - self.sum_of_n(start)
--------------------------------------------------------------------------------
[0.21497 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b4fffa0fd0>

    def test_update(fenwick_tree):
        fenwick_tree.update(2, 10)
>       assert fenwick_tree.sum_of_n(2) == 15

ts-3-5/test_3-5_0-2_81.py:18: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'fenwick_tree.FenwickTree'>, index = 3

>   ???

   - [#  27] COI fenwick_tree: 
--------------------------------------------------------------------------------
  10:     def update(self, index, value):
  11:         index += 1
  12:         delta = value - self.nums[index]
  13:         self.nums[index] = value
- 14:         while index <= len(self.tree) - 1:
+ 14:         while not (index <= len(self.tree) - 1):
  15:             self.tree[index] += delta
  16:             index += index & (-index)
  17:     
  18:     def sum_of_n(self, index):
--------------------------------------------------------------------------------
[0.21419 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b4ffee55d0>

    def test_update(fenwick_tree):
        fenwick_tree.update(2, 10)
>       assert fenwick_tree.sum_of_n(2) == 15
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:18: AssertionError

   - [#  28] COI fenwick_tree: 
--------------------------------------------------------------------------------
  18:     def sum_of_n(self, index):
  19:         s = 0
  20:         index += 1
  21:         
- 22:         while index > 0:
+ 22:         while not (index > 0):
  23:             s += self.tree[index]
  24:             index -= index & (-index)
  25:         
  26:         return s
--------------------------------------------------------------------------------
[0.21107 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b4fff55240>

    def test_update(fenwick_tree):
        fenwick_tree.update(2, 10)
>       assert fenwick_tree.sum_of_n(2) == 15
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:18: AssertionError

   - [#  31] OIL fenwick_tree: 
--------------------------------------------------------------------------------
   5:         self.tree = [0] * (len(arr) + 1)
   6:         
   7:         for i in range(len(arr)):
   8:             self.update(i, arr[i])
-  9:     
+  9:             break
  10:     def update(self, index, value):
  11:         index += 1
  12:         delta = value - self.nums[index]
  13:         self.nums[index] = value
--------------------------------------------------------------------------------
[0.21031 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b5000094e0>

    def test_update(fenwick_tree):
        fenwick_tree.update(2, 10)
>       assert fenwick_tree.sum_of_n(2) == 15
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:18: AssertionError

   - [#  32] OIL fenwick_tree: 
--------------------------------------------------------------------------------
  13:         self.nums[index] = value
  14:         while index <= len(self.tree) - 1:
  15:             self.tree[index] += delta
  16:             index += index & (-index)
- 17:     
+ 17:             break
  18:     def sum_of_n(self, index):
  19:         s = 0
  20:         index += 1
  21:         
--------------------------------------------------------------------------------
[0.21247 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b5000cc340>

    def test_update(fenwick_tree):
        fenwick_tree.update(2, 10)
>       assert fenwick_tree.sum_of_n(2) == 15
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:18: AssertionError

   - [#  33] OIL fenwick_tree: 
--------------------------------------------------------------------------------
  21:         
  22:         while index > 0:
  23:             s += self.tree[index]
  24:             index -= index & (-index)
- 25:         
+ 25:             break
  26:         return s
  27:     
  28:     def sum_of_range(self, start, end):
  29:         
--------------------------------------------------------------------------------
[0.21155 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b4ffe35d20>

    def test_update(fenwick_tree):
        fenwick_tree.update(2, 10)
>       assert fenwick_tree.sum_of_n(2) == 15
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:18: AssertionError

   - [#  37] ROR fenwick_tree: 
--------------------------------------------------------------------------------
  18:     def sum_of_n(self, index):
  19:         s = 0
  20:         index += 1
  21:         
- 22:         while index > 0:
+ 22:         while index < 0:
  23:             s += self.tree[index]
  24:             index -= index & (-index)
  25:         
  26:         return s
--------------------------------------------------------------------------------
[0.21211 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b4fff54160>

    def test_update(fenwick_tree):
        fenwick_tree.update(2, 10)
>       assert fenwick_tree.sum_of_n(2) == 15
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:18: AssertionError

   - [#  38] ROR fenwick_tree: 
--------------------------------------------------------------------------------
  18:     def sum_of_n(self, index):
  19:         s = 0
  20:         index += 1
  21:         
- 22:         while index > 0:
+ 22:         while index >= 0:
  23:             s += self.tree[index]
  24:             index -= index & (-index)
  25:         
  26:         return s
--------------------------------------------------------------------------------
[5.00682 s] timeout

   - [#  43] SDL fenwick_tree: 
--------------------------------------------------------------------------------
   1: class FenwickTree:
   2:     
   3:     def __init__(self, arr):
-  4:         self.nums = [0] * (len(arr) + 1)
+  4:         pass
   5:         self.tree = [0] * (len(arr) + 1)
   6:         
   7:         for i in range(len(arr)):
   8:             self.update(i, arr[i])
--------------------------------------------------------------------------------
[0.21648 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

@pytest.fixture
    def fenwick_tree():
        arr = [3, 2, -1, 6, 5, 4, -3, 3, 7, 2]
>       return FenwickTree(arr)

ts-3-5/test_3-5_0-2_81.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
fenwick_tree:8: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <fenwick_tree.FenwickTree object at 0x72b5000cded0>, index = 1, value = 3

>   ???
E   AttributeError: 'FenwickTree' object has no attribute 'nums'

fenwick_tree:12: AttributeError

   - [#  44] SDL fenwick_tree: 
--------------------------------------------------------------------------------
   1: class FenwickTree:
   2:     
   3:     def __init__(self, arr):
   4:         self.nums = [0] * (len(arr) + 1)
-  5:         self.tree = [0] * (len(arr) + 1)
+  5:         pass
   6:         
   7:         for i in range(len(arr)):
   8:             self.update(i, arr[i])
   9:     
--------------------------------------------------------------------------------
[0.21620 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

@pytest.fixture
    def fenwick_tree():
        arr = [3, 2, -1, 6, 5, 4, -3, 3, 7, 2]
>       return FenwickTree(arr)

ts-3-5/test_3-5_0-2_81.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
fenwick_tree:8: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <fenwick_tree.FenwickTree object at 0x72b4ffffb820>, index = 1, value = 3

>   ???
E   AttributeError: 'FenwickTree' object has no attribute 'tree'

fenwick_tree:14: AttributeError

   - [#  45] SDL fenwick_tree: 
--------------------------------------------------------------------------------
   4:         self.nums = [0] * (len(arr) + 1)
   5:         self.tree = [0] * (len(arr) + 1)
   6:         
   7:         for i in range(len(arr)):
-  8:             self.update(i, arr[i])
+  8:             pass
   9:     
  10:     def update(self, index, value):
  11:         index += 1
  12:         delta = value - self.nums[index]
--------------------------------------------------------------------------------
[0.20144 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b4ffee7400>

    def test_update(fenwick_tree):
        fenwick_tree.update(2, 10)
>       assert fenwick_tree.sum_of_n(2) == 15
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:18: AssertionError

   - [#  46] SDL fenwick_tree: 
--------------------------------------------------------------------------------
   8:             self.update(i, arr[i])
   9:     
  10:     def update(self, index, value):
  11:         index += 1
- 12:         delta = value - self.nums[index]
+ 12:         pass
  13:         self.nums[index] = value
  14:         while index <= len(self.tree) - 1:
  15:             self.tree[index] += delta
  16:             index += index & (-index)
--------------------------------------------------------------------------------
[0.21073 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

@pytest.fixture
    def fenwick_tree():
        arr = [3, 2, -1, 6, 5, 4, -3, 3, 7, 2]
>       return FenwickTree(arr)

ts-3-5/test_3-5_0-2_81.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
fenwick_tree:8: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <fenwick_tree.FenwickTree object at 0x72b4fff55b40>, index = 1, value = 3

>   ???
E   NameError: name 'delta' is not defined

fenwick_tree:15: NameError

   - [#  47] SDL fenwick_tree: 
--------------------------------------------------------------------------------
   9:     
  10:     def update(self, index, value):
  11:         index += 1
  12:         delta = value - self.nums[index]
- 13:         self.nums[index] = value
+ 13:         pass
  14:         while index <= len(self.tree) - 1:
  15:             self.tree[index] += delta
  16:             index += index & (-index)
  17:     
--------------------------------------------------------------------------------
[0.21481 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b4ffc6c0d0>

    def test_update(fenwick_tree):
        fenwick_tree.update(2, 10)
>       assert fenwick_tree.sum_of_n(2) == 15
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:18: AssertionError

   - [#  48] SDL fenwick_tree: 
--------------------------------------------------------------------------------
  15:             self.tree[index] += delta
  16:             index += index & (-index)
  17:     
  18:     def sum_of_n(self, index):
- 19:         s = 0
+ 19:         pass
  20:         index += 1
  21:         
  22:         while index > 0:
  23:             s += self.tree[index]
--------------------------------------------------------------------------------
[0.21524 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b4fff57670>

    def test_update(fenwick_tree):
        fenwick_tree.update(2, 10)
>       assert fenwick_tree.sum_of_n(2) == 15

ts-3-5/test_3-5_0-2_81.py:18: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <fenwick_tree.FenwickTree object at 0x72b4fff57670>, index = 3

>   ???
E   UnboundLocalError: local variable 's' referenced before assignment

fenwick_tree:23: UnboundLocalError

   - [#  49] SDL fenwick_tree: 
--------------------------------------------------------------------------------
  22:         while index > 0:
  23:             s += self.tree[index]
  24:             index -= index & (-index)
  25:         
- 26:         return s
+ 26:         pass
  27:     
  28:     def sum_of_range(self, start, end):
  29:         
  30:         start -= 1
--------------------------------------------------------------------------------
[0.21477 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b500009330>

    def test_update(fenwick_tree):
        fenwick_tree.update(2, 10)
>       assert fenwick_tree.sum_of_n(2) == 15
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:18: AssertionError

   - [#  50] SDL fenwick_tree: 
--------------------------------------------------------------------------------
  27:     
  28:     def sum_of_range(self, start, end):
  29:         
  30:         start -= 1
- 31:         return self.sum_of_n(end) - self.sum_of_n(start)
+ 31:         pass
--------------------------------------------------------------------------------
[0.21363 s] killed by ts-3-5/test_3-5_0-2_81.py::test_sum_of_range

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b4ffee5990>

    def test_sum_of_range(fenwick_tree):
>       assert fenwick_tree.sum_of_range(2, 5) == 14
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:28: AssertionError

   - [#  53] SVD fenwick_tree: 
--------------------------------------------------------------------------------
   4:         self.nums = [0] * (len(arr) + 1)
   5:         self.tree = [0] * (len(arr) + 1)
   6:         
   7:         for i in range(len(arr)):
-  8:             self.update(i, arr[i])
+  8:             update(i, arr[i])
   9:     
  10:     def update(self, index, value):
  11:         index += 1
  12:         delta = value - self.nums[index]
--------------------------------------------------------------------------------
[0.21362 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

@pytest.fixture
    def fenwick_tree():
        arr = [3, 2, -1, 6, 5, 4, -3, 3, 7, 2]
>       return FenwickTree(arr)

ts-3-5/test_3-5_0-2_81.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <fenwick_tree.FenwickTree object at 0x72b5000cfe50>
arr = [3, 2, -1, 6, 5, 4, ...]

>   ???
E   NameError: name 'update' is not defined

fenwick_tree:8: NameError

   - [#  54] SVD fenwick_tree: 
--------------------------------------------------------------------------------
   8:             self.update(i, arr[i])
   9:     
  10:     def update(self, index, value):
  11:         index += 1
- 12:         delta = value - self.nums[index]
+ 12:         delta = value - nums[index]
  13:         self.nums[index] = value
  14:         while index <= len(self.tree) - 1:
  15:             self.tree[index] += delta
  16:             index += index & (-index)
--------------------------------------------------------------------------------
[0.21383 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

@pytest.fixture
    def fenwick_tree():
        arr = [3, 2, -1, 6, 5, 4, -3, 3, 7, 2]
>       return FenwickTree(arr)

ts-3-5/test_3-5_0-2_81.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
fenwick_tree:8: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <fenwick_tree.FenwickTree object at 0x72b4ffc97910>, index = 1, value = 3

>   ???
E   NameError: name 'nums' is not defined

fenwick_tree:12: NameError

   - [#  55] SVD fenwick_tree: 
--------------------------------------------------------------------------------
   9:     
  10:     def update(self, index, value):
  11:         index += 1
  12:         delta = value - self.nums[index]
- 13:         self.nums[index] = value
+ 13:         nums[index] = value
  14:         while index <= len(self.tree) - 1:
  15:             self.tree[index] += delta
  16:             index += index & (-index)
  17:     
--------------------------------------------------------------------------------
[0.23000 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

@pytest.fixture
    def fenwick_tree():
        arr = [3, 2, -1, 6, 5, 4, -3, 3, 7, 2]
>       return FenwickTree(arr)

ts-3-5/test_3-5_0-2_81.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
fenwick_tree:8: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <fenwick_tree.FenwickTree object at 0x72b4fff12b60>, index = 1, value = 3

>   ???
E   NameError: name 'nums' is not defined

fenwick_tree:13: NameError

   - [#  56] SVD fenwick_tree: 
--------------------------------------------------------------------------------
  10:     def update(self, index, value):
  11:         index += 1
  12:         delta = value - self.nums[index]
  13:         self.nums[index] = value
- 14:         while index <= len(self.tree) - 1:
+ 14:         while index <= len(tree) - 1:
  15:             self.tree[index] += delta
  16:             index += index & (-index)
  17:     
  18:     def sum_of_n(self, index):
--------------------------------------------------------------------------------
[0.23124 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

@pytest.fixture
    def fenwick_tree():
        arr = [3, 2, -1, 6, 5, 4, -3, 3, 7, 2]
>       return FenwickTree(arr)

ts-3-5/test_3-5_0-2_81.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
fenwick_tree:8: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <fenwick_tree.FenwickTree object at 0x72b4ffeab130>, index = 1, value = 3

>   ???
E   NameError: name 'tree' is not defined

fenwick_tree:14: NameError

   - [#  57] SVD fenwick_tree: 
--------------------------------------------------------------------------------
  11:         index += 1
  12:         delta = value - self.nums[index]
  13:         self.nums[index] = value
  14:         while index <= len(self.tree) - 1:
- 15:             self.tree[index] += delta
+ 15:             tree[index] += delta
  16:             index += index & (-index)
  17:     
  18:     def sum_of_n(self, index):
  19:         s = 0
--------------------------------------------------------------------------------
[0.20385 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

@pytest.fixture
    def fenwick_tree():
        arr = [3, 2, -1, 6, 5, 4, -3, 3, 7, 2]
>       return FenwickTree(arr)

ts-3-5/test_3-5_0-2_81.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
fenwick_tree:8: in __init__
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <fenwick_tree.FenwickTree object at 0x72b4fffa1150>, index = 1, value = 3

>   ???
E   NameError: name 'tree' is not defined

fenwick_tree:15: NameError

   - [#  58] SVD fenwick_tree: 
--------------------------------------------------------------------------------
  19:         s = 0
  20:         index += 1
  21:         
  22:         while index > 0:
- 23:             s += self.tree[index]
+ 23:             s += tree[index]
  24:             index -= index & (-index)
  25:         
  26:         return s
  27:     
--------------------------------------------------------------------------------
[0.20573 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b50000a2f0>

    def test_update(fenwick_tree):
        fenwick_tree.update(2, 10)
>       assert fenwick_tree.sum_of_n(2) == 15

ts-3-5/test_3-5_0-2_81.py:18: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <fenwick_tree.FenwickTree object at 0x72b50000a2f0>, index = 3

>   ???
E   NameError: name 'tree' is not defined

fenwick_tree:23: NameError
