   - [#  59] SVD fenwick_tree: 
--------------------------------------------------------------------------------
  27:     
  28:     def sum_of_range(self, start, end):
  29:         
  30:         start -= 1
- 31:         return self.sum_of_n(end) - self.sum_of_n(start)
+ 31:         return sum_of_n(end) - self.sum_of_n(start)
--------------------------------------------------------------------------------
[0.20227 s] killed by ts-3-5/test_3-5_0-2_81.py::test_sum_of_range

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b4ffee4100>

    def test_sum_of_range(fenwick_tree):
>       assert fenwick_tree.sum_of_range(2, 5) == 14

ts-3-5/test_3-5_0-2_81.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <fenwick_tree.FenwickTree object at 0x72b4ffee4100>, start = 1, end = 5

>   ???
E   NameError: name 'sum_of_n' is not defined

fenwick_tree:31: NameError

   - [#  60] SVD fenwick_tree: 
--------------------------------------------------------------------------------
  27:     
  28:     def sum_of_range(self, start, end):
  29:         
  30:         start -= 1
- 31:         return self.sum_of_n(end) - self.sum_of_n(start)
+ 31:         return self.sum_of_n(end) - sum_of_n(start)
--------------------------------------------------------------------------------
[0.20611 s] killed by ts-3-5/test_3-5_0-2_81.py::test_sum_of_range

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b4ffeb05b0>

    def test_sum_of_range(fenwick_tree):
>       assert fenwick_tree.sum_of_range(2, 5) == 14

ts-3-5/test_3-5_0-2_81.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <fenwick_tree.FenwickTree object at 0x72b4ffeb05b0>, start = 1, end = 5

>   ???
E   NameError: name 'sum_of_n' is not defined

fenwick_tree:31: NameError

   - [#  61] ZIL fenwick_tree: 
--------------------------------------------------------------------------------
   4:         self.nums = [0] * (len(arr) + 1)
   5:         self.tree = [0] * (len(arr) + 1)
   6:         
   7:         for i in range(len(arr)):
-  8:             self.update(i, arr[i])
+  8:             break
   9:     
  10:     def update(self, index, value):
  11:         index += 1
  12:         delta = value - self.nums[index]
--------------------------------------------------------------------------------
[0.21311 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b5000081c0>

    def test_update(fenwick_tree):
        fenwick_tree.update(2, 10)
>       assert fenwick_tree.sum_of_n(2) == 15
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:18: AssertionError

   - [#  62] ZIL fenwick_tree: 
--------------------------------------------------------------------------------
  11:         index += 1
  12:         delta = value - self.nums[index]
  13:         self.nums[index] = value
  14:         while index <= len(self.tree) - 1:
- 15:             self.tree[index] += delta
- 16:             index += index & (-index)
+ 15:             break
+ 16:     
  17:     
  18:     def sum_of_n(self, index):
  19:         s = 0
  20:         index += 1
--------------------------------------------------------------------------------
[0.21376 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b4fff55ae0>

    def test_update(fenwick_tree):
        fenwick_tree.update(2, 10)
>       assert fenwick_tree.sum_of_n(2) == 15
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:18: AssertionError

   - [#  63] ZIL fenwick_tree: 
--------------------------------------------------------------------------------
  19:         s = 0
  20:         index += 1
  21:         
  22:         while index > 0:
- 23:             s += self.tree[index]
- 24:             index -= index & (-index)
+ 23:             break
+ 24:         
  25:         
  26:         return s
  27:     
  28:     def sum_of_range(self, start, end):
--------------------------------------------------------------------------------
[0.21345 s] killed by ts-3-5/test_3-5_0-2_81.py::test_update

fenwick_tree = <fenwick_tree.FenwickTree object at 0x72b4ffc59690>

    def test_update(fenwick_tree):
        fenwick_tree.update(2, 10)
>       assert fenwick_tree.sum_of_n(2) == 15
E       AssertionError

ts-3-5/test_3-5_0-2_81.py:18: AssertionError
