1 : Job ID fda2bfa1e4814b879f351fdcf11b0e08
test outcome: killed
fibonacci.py, start pos: (19, 27), end pos: (19, 28)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -16,7 +16,7 @@
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
     # start on i = 2 as the first calculated fibb number
-    for _ in range(2,target+1):
+    for _ in range(2,target-1):
         # calc n and set n_minus_1 to last calc'd value
         n, n_minus_1 = n + n_minus_1, n
     return n
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.07s ==========================

2 : Job ID 2444319ee19e4e8da5209cda236e038e
test outcome: killed
fibonacci.py, start pos: (21, 25), end pos: (21, 26)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -18,7 +18,7 @@
     # start on i = 2 as the first calculated fibb number
     for _ in range(2,target+1):
         # calc n and set n_minus_1 to last calc'd value
-        n, n_minus_1 = n + n_minus_1, n
+        n, n_minus_1 = n - n_minus_1, n
     return n
 def fibonacci_recursive(target: int):
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.08s ==========================

3 : Job ID aab57413c99143b9adaf3c9308e1cbc7
test outcome: killed
fibonacci.py, start pos: (41, 43), end pos: (41, 44)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 2
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) - fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

4 : Job ID 0d0548b934ac40ca8cda256303bba5a1
test outcome: killed
fibonacci.py, start pos: (19, 27), end pos: (19, 28)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -16,7 +16,7 @@
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
     # start on i = 2 as the first calculated fibb number
-    for _ in range(2,target+1):
+    for _ in range(2,target*1):
         # calc n and set n_minus_1 to last calc'd value
         n, n_minus_1 = n + n_minus_1, n
     return n
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.07s ==========================

5 : Job ID 19cd308cd2b04f948f8d6e087749e149
test outcome: killed
fibonacci.py, start pos: (21, 25), end pos: (21, 26)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -18,7 +18,7 @@
     # start on i = 2 as the first calculated fibb number
     for _ in range(2,target+1):
         # calc n and set n_minus_1 to last calc'd value
-        n, n_minus_1 = n + n_minus_1, n
+        n, n_minus_1 = n * n_minus_1, n
     return n
 def fibonacci_recursive(target: int):
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.08s ==========================

6 : Job ID 8bfce48ce2ed46d6b3216fcc7f87fc66
test outcome: killed
fibonacci.py, start pos: (41, 43), end pos: (41, 44)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 2
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) * fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

7 : Job ID e549160ed4a04bf081040eb78caa50a5
test outcome: killed
fibonacci.py, start pos: (19, 27), end pos: (19, 28)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -16,7 +16,7 @@
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
     # start on i = 2 as the first calculated fibb number
-    for _ in range(2,target+1):
+    for _ in range(2,target/1):
         # calc n and set n_minus_1 to last calc'd value
         n, n_minus_1 = n + n_minus_1, n
     return n
ts-3-5/test_3-5_0-9_293.py .FF...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_one - TypeError: 'f...
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - T...
========================= 2 failed, 4 passed in 0.08s ==========================

8 : Job ID 64ffe367919547f094d21f4e80baabe6
test outcome: killed
fibonacci.py, start pos: (21, 25), end pos: (21, 26)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -18,7 +18,7 @@
     # start on i = 2 as the first calculated fibb number
     for _ in range(2,target+1):
         # calc n and set n_minus_1 to last calc'd value
-        n, n_minus_1 = n + n_minus_1, n
+        n, n_minus_1 = n / n_minus_1, n
     return n
 def fibonacci_recursive(target: int):
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - Z...
========================= 1 failed, 5 passed in 0.08s ==========================

9 : Job ID 03f7c14854fe44babb9e9272ffac1a2d
test outcome: killed
fibonacci.py, start pos: (41, 43), end pos: (41, 44)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 2
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) / fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.07s ==========================

10 : Job ID fac0dbd1902846e2ab6fea8db1b5cf2d
test outcome: killed
fibonacci.py, start pos: (19, 27), end pos: (19, 28)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -16,7 +16,7 @@
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
     # start on i = 2 as the first calculated fibb number
-    for _ in range(2,target+1):
+    for _ in range(2,target//1):
         # calc n and set n_minus_1 to last calc'd value
         n, n_minus_1 = n + n_minus_1, n
     return n
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.07s ==========================

11 : Job ID ac9fd40312f44b7087b3b4f3fe546ed7
test outcome: killed
fibonacci.py, start pos: (21, 25), end pos: (21, 26)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -18,7 +18,7 @@
     # start on i = 2 as the first calculated fibb number
     for _ in range(2,target+1):
         # calc n and set n_minus_1 to last calc'd value
-        n, n_minus_1 = n + n_minus_1, n
+        n, n_minus_1 = n // n_minus_1, n
     return n
 def fibonacci_recursive(target: int):
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - Z...
========================= 1 failed, 5 passed in 0.08s ==========================

12 : Job ID a49ce34914534bb39dd14e8fce2e938c
test outcome: killed
fibonacci.py, start pos: (41, 43), end pos: (41, 44)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 2
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) // fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

13 : Job ID ee37c5f9a4b643b3a41d95ab213efa06
test outcome: killed
fibonacci.py, start pos: (19, 27), end pos: (19, 28)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -16,7 +16,7 @@
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
     # start on i = 2 as the first calculated fibb number
-    for _ in range(2,target+1):
+    for _ in range(2,target%1):
         # calc n and set n_minus_1 to last calc'd value
         n, n_minus_1 = n + n_minus_1, n
     return n
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.08s ==========================

14 : Job ID 48d0a8a24f314385a8e94df076331ff6
test outcome: killed
fibonacci.py, start pos: (21, 25), end pos: (21, 26)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -18,7 +18,7 @@
     # start on i = 2 as the first calculated fibb number
     for _ in range(2,target+1):
         # calc n and set n_minus_1 to last calc'd value
-        n, n_minus_1 = n + n_minus_1, n
+        n, n_minus_1 = n % n_minus_1, n
     return n
 def fibonacci_recursive(target: int):
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - Z...
========================= 1 failed, 5 passed in 0.08s ==========================

15 : Job ID a562af2d9b274d159a4b4736a0dbbbd5
test outcome: killed
fibonacci.py, start pos: (41, 43), end pos: (41, 44)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 2
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) % fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

16 : Job ID 2131b6e2963b4e5bb180f7ee51eaedbc
test outcome: killed
fibonacci.py, start pos: (19, 27), end pos: (19, 28)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -16,7 +16,7 @@
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
     # start on i = 2 as the first calculated fibb number
-    for _ in range(2,target+1):
+    for _ in range(2,target**1):
         # calc n and set n_minus_1 to last calc'd value
         n, n_minus_1 = n + n_minus_1, n
     return n
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.08s ==========================

17 : Job ID fdd9a48c3b204f0da6a95f3332b6a427
test outcome: killed
fibonacci.py, start pos: (21, 25), end pos: (21, 26)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -18,7 +18,7 @@
     # start on i = 2 as the first calculated fibb number
     for _ in range(2,target+1):
         # calc n and set n_minus_1 to last calc'd value
-        n, n_minus_1 = n + n_minus_1, n
+        n, n_minus_1 = n ** n_minus_1, n
     return n
 def fibonacci_recursive(target: int):
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.08s ==========================

18 : Job ID 767aa5684b7244c0b4aa64246ffa9beb
test outcome: killed
fibonacci.py, start pos: (41, 43), end pos: (41, 44)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 2
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) ** fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.07s ==========================

19 : Job ID 89eeac08a28f45089c36862553712c91
test outcome: killed
fibonacci.py, start pos: (19, 27), end pos: (19, 28)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -16,7 +16,7 @@
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
     # start on i = 2 as the first calculated fibb number
-    for _ in range(2,target+1):
+    for _ in range(2,target>>1):
         # calc n and set n_minus_1 to last calc'd value
         n, n_minus_1 = n + n_minus_1, n
     return n
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.08s ==========================

20 : Job ID 90588d7150a54e8fa7088d719ca5b6f6
test outcome: killed
fibonacci.py, start pos: (21, 25), end pos: (21, 26)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -18,7 +18,7 @@
     # start on i = 2 as the first calculated fibb number
     for _ in range(2,target+1):
         # calc n and set n_minus_1 to last calc'd value
-        n, n_minus_1 = n + n_minus_1, n
+        n, n_minus_1 = n >> n_minus_1, n
     return n
 def fibonacci_recursive(target: int):
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.07s ==========================

21 : Job ID d2be7cdfdd554503ad5349bec0c4d739
test outcome: killed
fibonacci.py, start pos: (41, 43), end pos: (41, 44)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 2
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) >> fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

22 : Job ID c2538eb932d346a49a3e402b2a8db0b6
test outcome: killed
fibonacci.py, start pos: (19, 27), end pos: (19, 28)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -16,7 +16,7 @@
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
     # start on i = 2 as the first calculated fibb number
-    for _ in range(2,target+1):
+    for _ in range(2,target<<1):
         # calc n and set n_minus_1 to last calc'd value
         n, n_minus_1 = n + n_minus_1, n
     return n
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.08s ==========================

23 : Job ID f0f9e6671c774403b859594099cacab7
test outcome: killed
fibonacci.py, start pos: (21, 25), end pos: (21, 26)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -18,7 +18,7 @@
     # start on i = 2 as the first calculated fibb number
     for _ in range(2,target+1):
         # calc n and set n_minus_1 to last calc'd value
-        n, n_minus_1 = n + n_minus_1, n
+        n, n_minus_1 = n << n_minus_1, n
     return n
 def fibonacci_recursive(target: int):
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.08s ==========================

24 : Job ID 7b9c72ef5e994df0b118438e9121e29d
test outcome: killed
fibonacci.py, start pos: (41, 43), end pos: (41, 44)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 2
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) << fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.09s ==========================

25 : Job ID 039ca8d406ec4ae181c23ccf6b99c088
test outcome: killed
fibonacci.py, start pos: (19, 27), end pos: (19, 28)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -16,7 +16,7 @@
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
     # start on i = 2 as the first calculated fibb number
-    for _ in range(2,target+1):
+    for _ in range(2,target|1):
         # calc n and set n_minus_1 to last calc'd value
         n, n_minus_1 = n + n_minus_1, n
     return n
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.08s ==========================

26 : Job ID cbea58010f4946b08246ab1f78a022b9
test outcome: killed
fibonacci.py, start pos: (21, 25), end pos: (21, 26)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -18,7 +18,7 @@
     # start on i = 2 as the first calculated fibb number
     for _ in range(2,target+1):
         # calc n and set n_minus_1 to last calc'd value
-        n, n_minus_1 = n + n_minus_1, n
+        n, n_minus_1 = n | n_minus_1, n
     return n
 def fibonacci_recursive(target: int):
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.08s ==========================

27 : Job ID a134c498a0d74e6aaa69957717d872a9
test outcome: killed
fibonacci.py, start pos: (41, 43), end pos: (41, 44)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 2
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) | fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

28 : Job ID 12203d6f4e2740dc91211981dc3a533c
test outcome: killed
fibonacci.py, start pos: (19, 27), end pos: (19, 28)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -16,7 +16,7 @@
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
     # start on i = 2 as the first calculated fibb number
-    for _ in range(2,target+1):
+    for _ in range(2,target&1):
         # calc n and set n_minus_1 to last calc'd value
         n, n_minus_1 = n + n_minus_1, n
     return n
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.07s ==========================

29 : Job ID 89782f69abbf40cfb39c59898d0cc428
test outcome: killed
fibonacci.py, start pos: (21, 25), end pos: (21, 26)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -18,7 +18,7 @@
     # start on i = 2 as the first calculated fibb number
     for _ in range(2,target+1):
         # calc n and set n_minus_1 to last calc'd value
-        n, n_minus_1 = n + n_minus_1, n
+        n, n_minus_1 = n & n_minus_1, n
     return n
 def fibonacci_recursive(target: int):
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.08s ==========================

30 : Job ID ca79c15c19d145c2bd2d1d48333514be
test outcome: killed
fibonacci.py, start pos: (41, 43), end pos: (41, 44)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 2
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) & fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.07s ==========================

31 : Job ID 785e956c445e43dcb79a2e1fcd960979
test outcome: killed
fibonacci.py, start pos: (19, 27), end pos: (19, 28)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -16,7 +16,7 @@
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
     # start on i = 2 as the first calculated fibb number
-    for _ in range(2,target+1):
+    for _ in range(2,target^1):
         # calc n and set n_minus_1 to last calc'd value
         n, n_minus_1 = n + n_minus_1, n
     return n
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.08s ==========================

32 : Job ID c44ebe2a736f442a8f28e568c6fff40e
test outcome: killed
fibonacci.py, start pos: (21, 25), end pos: (21, 26)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -18,7 +18,7 @@
     # start on i = 2 as the first calculated fibb number
     for _ in range(2,target+1):
         # calc n and set n_minus_1 to last calc'd value
-        n, n_minus_1 = n + n_minus_1, n
+        n, n_minus_1 = n ^ n_minus_1, n
     return n
 def fibonacci_recursive(target: int):
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.07s ==========================

33 : Job ID 98d8574179ea4a5eae781dccc1077486
test outcome: killed
fibonacci.py, start pos: (41, 43), end pos: (41, 44)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 2
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) ^ fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

34 : Job ID 71c580aa208b4c5382582b64b333d5f4
test outcome: killed
fibonacci.py, start pos: (41, 38), end pos: (41, 39)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target + 1) + fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.12s ==========================
