35 : Job ID cfc7154a5df8417aa9281f5bf7635355
test outcome: killed
fibonacci.py, start pos: (41, 72), end pos: (41, 73)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) + fibonacci_recursive(target + 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

36 : Job ID fb938b5250c74d4cb4d89034004e8ae6
test outcome: killed
fibonacci.py, start pos: (41, 38), end pos: (41, 39)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target * 1) + fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

37 : Job ID 5c45e38635ff484a959fb7e59b00a1ab
test outcome: killed
fibonacci.py, start pos: (41, 72), end pos: (41, 73)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) + fibonacci_recursive(target * 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

38 : Job ID 5d77f8c858414d00a65b4e6c379c1e4e
test outcome: killed
fibonacci.py, start pos: (41, 38), end pos: (41, 39)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target / 1) + fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.07s ==========================

39 : Job ID 0338f3cbb6c54810a99ed0b90490f8ef
test outcome: killed
fibonacci.py, start pos: (41, 72), end pos: (41, 73)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) + fibonacci_recursive(target / 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

40 : Job ID 30deb4a9c59e40328be22842ff47007e
test outcome: killed
fibonacci.py, start pos: (41, 38), end pos: (41, 39)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target // 1) + fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

41 : Job ID 4155090e4f3f459d8283795724eb6f7a
test outcome: killed
fibonacci.py, start pos: (41, 72), end pos: (41, 73)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) + fibonacci_recursive(target // 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

42 : Job ID 7df3ef68b0c14a26ae22bf786a2cca14
test outcome: killed
fibonacci.py, start pos: (41, 38), end pos: (41, 39)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target % 1) + fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.07s ==========================

43 : Job ID c7c4fd0597ba4dfeacc500298522c1bf
test outcome: killed
fibonacci.py, start pos: (41, 72), end pos: (41, 73)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) + fibonacci_recursive(target % 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

44 : Job ID e6f47d30c8ae495a83bf9a62ee30f1b3
test outcome: killed
fibonacci.py, start pos: (41, 38), end pos: (41, 39)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target ** 1) + fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

45 : Job ID 6a200d5614d74215bb2c20c1b31505fc
test outcome: killed
fibonacci.py, start pos: (41, 72), end pos: (41, 73)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) + fibonacci_recursive(target ** 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

46 : Job ID 74cbc032e3e74af380be07716aa808f8
test outcome: killed
fibonacci.py, start pos: (41, 38), end pos: (41, 39)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target >> 1) + fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.07s ==========================

47 : Job ID 30747b3913d24d8a9df612dfbd68a551
test outcome: killed
fibonacci.py, start pos: (41, 72), end pos: (41, 73)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) + fibonacci_recursive(target >> 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

48 : Job ID 19b9553a768b458eb5bdcbec9d18478f
test outcome: killed
fibonacci.py, start pos: (41, 38), end pos: (41, 39)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target << 1) + fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.14s ==========================

49 : Job ID 677640bc85bd4150873f06c49055df8c
test outcome: killed
fibonacci.py, start pos: (41, 72), end pos: (41, 73)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) + fibonacci_recursive(target << 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

50 : Job ID a5825d58ec9d4d4a830e806a491f9359
test outcome: killed
fibonacci.py, start pos: (41, 38), end pos: (41, 39)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target | 1) + fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

51 : Job ID 01a7ba700efd440faf8d3938cdb1204c
test outcome: killed
fibonacci.py, start pos: (41, 72), end pos: (41, 73)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) + fibonacci_recursive(target | 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

52 : Job ID a8dd9eb61b8d46d99976a568edd3dcbd
test outcome: killed
fibonacci.py, start pos: (41, 38), end pos: (41, 39)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target & 1) + fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.07s ==========================

53 : Job ID 5c56b38b787b4f2db783b78ff7ca5c2e
test outcome: killed
fibonacci.py, start pos: (41, 72), end pos: (41, 73)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) + fibonacci_recursive(target & 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

54 : Job ID 7ec72e4277a1436a859d03f89ec68632
test outcome: killed
fibonacci.py, start pos: (41, 38), end pos: (41, 39)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target ^ 1) + fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

55 : Job ID 039c92409d3248009a487726882fde14
test outcome: killed
fibonacci.py, start pos: (41, 72), end pos: (41, 73)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) + fibonacci_recursive(target ^ 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

56 : Job ID f5b46c88c33f4bf890a657f8e8e70517
test outcome: killed
fibonacci.py, start pos: (14, 14), end pos: (14, 15)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -11,7 +11,7 @@
     Returns:
         The nth fibonacci number.
     """
-    if target < 1:
+    if target == 1:
         return 0
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
ts-3-5/test_3-5_0-9_293.py FF....                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_zero - assert 1 == 0
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_one - assert 0 == 1
========================= 2 failed, 4 passed in 0.08s ==========================

57 : Job ID ce854d5dee684671a05d20d92f9e58cd
test outcome: killed
fibonacci.py, start pos: (14, 14), end pos: (14, 15)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -11,7 +11,7 @@
     Returns:
         The nth fibonacci number.
     """
-    if target < 1:
+    if target != 1:
         return 0
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.07s ==========================

58 : Job ID 5d4172f4f1ce4c0693474ce5500e91ab
test outcome: killed
fibonacci.py, start pos: (14, 14), end pos: (14, 15)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -11,7 +11,7 @@
     Returns:
         The nth fibonacci number.
     """
-    if target < 1:
+    if target <= 1:
         return 0
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
ts-3-5/test_3-5_0-9_293.py .F....                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_one - assert 0 == 1
========================= 1 failed, 5 passed in 0.07s ==========================

59 : Job ID baaaf3cf58834bd386fb464a9ee06f3a
test outcome: killed
fibonacci.py, start pos: (14, 14), end pos: (14, 15)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -11,7 +11,7 @@
     Returns:
         The nth fibonacci number.
     """
-    if target < 1:
+    if target > 1:
         return 0
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
ts-3-5/test_3-5_0-9_293.py F.F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_zero - assert 1 == 0
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 2 failed, 4 passed in 0.08s ==========================

60 : Job ID 8b27acf795224b7080b752fd9237db5a
test outcome: killed
fibonacci.py, start pos: (14, 14), end pos: (14, 15)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -11,7 +11,7 @@
     Returns:
         The nth fibonacci number.
     """
-    if target < 1:
+    if target >= 1:
         return 0
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
ts-3-5/test_3-5_0-9_293.py FFF...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_zero - assert 1 == 0
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_one - assert 0 == 1
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 3 failed, 3 passed in 0.08s ==========================

61 : Job ID 5b3224330eaf4a6785d9aef6d631065f
test outcome: killed
fibonacci.py, start pos: (38, 14), end pos: (38, 16)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -35,7 +35,7 @@
         The nth fibonacci number.
     """
     # base case of 0 or 1, return 0 or 1.  If less than 0, ceil to 0.
-    if target <= 1:
+    if target == 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
     return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py ...F.F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_zero - Recur...
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 2 failed, 4 passed in 0.16s ==========================

62 : Job ID 6fbab0efe65e4784a9e94a5d1c3b1035
test outcome: killed
fibonacci.py, start pos: (38, 14), end pos: (38, 16)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -35,7 +35,7 @@
         The nth fibonacci number.
     """
     # base case of 0 or 1, return 0 or 1.  If less than 0, ceil to 0.
-    if target <= 1:
+    if target != 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
     return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py ....F.                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_one - assert...
========================= 1 failed, 5 passed in 0.07s ==========================

63 : Job ID c4f7b6b3d79e434485c17e696dc16d03
test outcome: killed
fibonacci.py, start pos: (38, 14), end pos: (38, 16)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -35,7 +35,7 @@
         The nth fibonacci number.
     """
     # base case of 0 or 1, return 0 or 1.  If less than 0, ceil to 0.
-    if target <= 1:
+    if target < 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
     return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py ....FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_one - assert...
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 2 failed, 4 passed in 0.08s ==========================

64 : Job ID 1d4d5794322546a990755c636b9e7ae1
test outcome: killed
fibonacci.py, start pos: (38, 14), end pos: (38, 16)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -35,7 +35,7 @@
         The nth fibonacci number.
     """
     # base case of 0 or 1, return 0 or 1.  If less than 0, ceil to 0.
-    if target <= 1:
+    if target > 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
     return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py ...FF.                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_zero - Recur...
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_one - Recurs...
========================= 2 failed, 4 passed in 0.17s ==========================

65 : Job ID c2795d648b3c4ed9af420ee3e0448aa8
test outcome: killed
fibonacci.py, start pos: (38, 14), end pos: (38, 16)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -35,7 +35,7 @@
         The nth fibonacci number.
     """
     # base case of 0 or 1, return 0 or 1.  If less than 0, ceil to 0.
-    if target <= 1:
+    if target >= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
     return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py ...F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_zero - Recur...
========================= 1 failed, 5 passed in 0.12s ==========================

66 : Job ID 969dd30d42314a93a7587a3504e66f3e
test outcome: killed
fibonacci.py, start pos: (14, 7), end pos: (14, 17)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -11,7 +11,7 @@
     Returns:
         The nth fibonacci number.
     """
-    if target < 1:
+    if not target < 1:
         return 0
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
ts-3-5/test_3-5_0-9_293.py FFF...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_zero - assert 1 == 0
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_one - assert 0 == 1
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 3 failed, 3 passed in 0.08s ==========================

67 : Job ID c6e14f5203434ffc8e8c109ef9384236
test outcome: killed
fibonacci.py, start pos: (38, 7), end pos: (38, 18)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -35,7 +35,7 @@
         The nth fibonacci number.
     """
     # base case of 0 or 1, return 0 or 1.  If less than 0, ceil to 0.
-    if target <= 1:
+    if not target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
     return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py ...FF.                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_zero - Recur...
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_one - Recurs...
========================= 2 failed, 4 passed in 0.16s ==========================

68 : Job ID 13fd7d8b9ac249beaef1f5e0128403ce
test outcome: killed
fibonacci.py, start pos: (14, 16), end pos: (14, 17)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -11,7 +11,7 @@
     Returns:
         The nth fibonacci number.
     """
-    if target < 1:
+    if target < 2:
         return 0
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
ts-3-5/test_3-5_0-9_293.py .F....                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_one - assert 0 == 1
========================= 1 failed, 5 passed in 0.08s ==========================
