69 : Job ID 979f5629038d4786b8ae7b70b45dc48f
test outcome: killed
fibonacci.py, start pos: (14, 16), end pos: (14, 17)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -11,7 +11,7 @@
     Returns:
         The nth fibonacci number.
     """
-    if target < 1:
+    if target < 0:
         return 0
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
ts-3-5/test_3-5_0-9_293.py F.....                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_zero - assert 1 == 0
========================= 1 failed, 5 passed in 0.08s ==========================

70 : Job ID cf869eaae2f84da4a193ac1ff0f2ca05
test outcome: killed
fibonacci.py, start pos: (15, 15), end pos: (15, 16)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -12,7 +12,7 @@
         The nth fibonacci number.
     """
     if target < 1:
-        return 0
+        return 1
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
     # start on i = 2 as the first calculated fibb number
ts-3-5/test_3-5_0-9_293.py F.....                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_zero - assert 1 == 0
========================= 1 failed, 5 passed in 0.07s ==========================

71 : Job ID a3c393e15eaa4731bc683cc57536ba07
test outcome: killed
fibonacci.py, start pos: (15, 15), end pos: (15, 16)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -12,7 +12,7 @@
         The nth fibonacci number.
     """
     if target < 1:
-        return 0
+        return -1
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
     # start on i = 2 as the first calculated fibb number
ts-3-5/test_3-5_0-9_293.py F.....                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_zero - assert -1 == 0
========================= 1 failed, 5 passed in 0.08s ==========================

72 : Job ID 9e1ccba2a2324ad79d96a4e931d88857
test outcome: killed
fibonacci.py, start pos: (17, 19), end pos: (17, 20)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -14,7 +14,7 @@
     if target < 1:
         return 0
     # initialize i = 0, and i = 1
-    n_minus_1, n = 0, 1
+    n_minus_1, n = 1, 1
     # start on i = 2 as the first calculated fibb number
     for _ in range(2,target+1):
         # calc n and set n_minus_1 to last calc'd value
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.08s ==========================

73 : Job ID de1af3f7bae040a3b64603e665ecb6b0
test outcome: killed
fibonacci.py, start pos: (17, 19), end pos: (17, 20)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -14,7 +14,7 @@
     if target < 1:
         return 0
     # initialize i = 0, and i = 1
-    n_minus_1, n = 0, 1
+    n_minus_1, n = -1, 1
     # start on i = 2 as the first calculated fibb number
     for _ in range(2,target+1):
         # calc n and set n_minus_1 to last calc'd value
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.07s ==========================

74 : Job ID 2f67bc46c5a94d6f80a19c6d10191b2d
test outcome: killed
fibonacci.py, start pos: (17, 22), end pos: (17, 23)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -14,7 +14,7 @@
     if target < 1:
         return 0
     # initialize i = 0, and i = 1
-    n_minus_1, n = 0, 1
+    n_minus_1, n = 0, 2
     # start on i = 2 as the first calculated fibb number
     for _ in range(2,target+1):
         # calc n and set n_minus_1 to last calc'd value
ts-3-5/test_3-5_0-9_293.py .FF...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_one - assert 2 == 1
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 2 failed, 4 passed in 0.07s ==========================

75 : Job ID 5ad673733acf4165b8adad99a5fb3419
test outcome: killed
fibonacci.py, start pos: (17, 22), end pos: (17, 23)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -14,7 +14,7 @@
     if target < 1:
         return 0
     # initialize i = 0, and i = 1
-    n_minus_1, n = 0, 1
+    n_minus_1, n = 0, 0
     # start on i = 2 as the first calculated fibb number
     for _ in range(2,target+1):
         # calc n and set n_minus_1 to last calc'd value
ts-3-5/test_3-5_0-9_293.py .FF...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_one - assert 0 == 1
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 2 failed, 4 passed in 0.08s ==========================

76 : Job ID 47acfd91e7bb434f909b99f0d8033c69
test outcome: killed
fibonacci.py, start pos: (19, 19), end pos: (19, 20)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -16,7 +16,7 @@
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
     # start on i = 2 as the first calculated fibb number
-    for _ in range(2,target+1):
+    for _ in range( 3,target+1):
         # calc n and set n_minus_1 to last calc'd value
         n, n_minus_1 = n + n_minus_1, n
     return n
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.07s ==========================

77 : Job ID a25967b83b1c41fea37dd791508e73f5
test outcome: killed
fibonacci.py, start pos: (19, 19), end pos: (19, 20)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -16,7 +16,7 @@
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
     # start on i = 2 as the first calculated fibb number
-    for _ in range(2,target+1):
+    for _ in range( 1,target+1):
         # calc n and set n_minus_1 to last calc'd value
         n, n_minus_1 = n + n_minus_1, n
     return n
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.07s ==========================

78 : Job ID 299a71eec3534e6eb58afd6e74c05ccd
test outcome: killed
fibonacci.py, start pos: (19, 28), end pos: (19, 29)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -16,7 +16,7 @@
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
     # start on i = 2 as the first calculated fibb number
-    for _ in range(2,target+1):
+    for _ in range(2,target+ 2):
         # calc n and set n_minus_1 to last calc'd value
         n, n_minus_1 = n + n_minus_1, n
     return n
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.08s ==========================

79 : Job ID 6b5d39f9009e42518aa1cdd41844733b
test outcome: killed
fibonacci.py, start pos: (19, 28), end pos: (19, 29)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -16,7 +16,7 @@
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
     # start on i = 2 as the first calculated fibb number
-    for _ in range(2,target+1):
+    for _ in range(2,target+ 0):
         # calc n and set n_minus_1 to last calc'd value
         n, n_minus_1 = n + n_minus_1, n
     return n
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.07s ==========================

80 : Job ID 09c48f7077bf4234af31c7e9d0fba724
test outcome: killed
fibonacci.py, start pos: (38, 17), end pos: (38, 18)
operator: core/NumberReplacer, occurrence: 12
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -35,7 +35,7 @@
         The nth fibonacci number.
     """
     # base case of 0 or 1, return 0 or 1.  If less than 0, ceil to 0.
-    if target <= 1:
+    if target <= 2:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
     return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.07s ==========================

81 : Job ID 1de0fa9bbd884da990802bb93cb2a1ac
test outcome: killed
fibonacci.py, start pos: (38, 17), end pos: (38, 18)
operator: core/NumberReplacer, occurrence: 13
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -35,7 +35,7 @@
         The nth fibonacci number.
     """
     # base case of 0 or 1, return 0 or 1.  If less than 0, ceil to 0.
-    if target <= 1:
+    if target <= 0:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
     return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py ....FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_one - assert...
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 2 failed, 4 passed in 0.07s ==========================

82 : Job ID d197eda9abf8423f95d1d65166ca7e27
test outcome: killed
fibonacci.py, start pos: (39, 19), end pos: (39, 20)
operator: core/NumberReplacer, occurrence: 14
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -36,7 +36,7 @@
     """
     # base case of 0 or 1, return 0 or 1.  If less than 0, ceil to 0.
     if target <= 1:
-        return max(0, target)
+        return max( 1, target)
     # calculate the target number by calculating the previous 2 recursively 
     return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py ...F.F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_zero - asser...
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 2 failed, 4 passed in 0.08s ==========================

83 : Job ID 6dd56bdaf9fd464e98ad42c4caee3493
SURVIVED
test outcome: survived
fibonacci.py, start pos: (39, 19), end pos: (39, 20)
operator: core/NumberReplacer, occurrence: 15
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -36,7 +36,7 @@
     """
     # base case of 0 or 1, return 0 or 1.  If less than 0, ceil to 0.
     if target <= 1:
-        return max(0, target)
+        return max( -1, target)
     # calculate the target number by calculating the previous 2 recursively 
     return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py ......                                        [100%]
============================== 6 passed in 0.08s ===============================

84 : Job ID 4a37cc93b0e54431ae9b3ba06d5d15e1
test outcome: killed
fibonacci.py, start pos: (41, 40), end pos: (41, 41)
operator: core/NumberReplacer, occurrence: 16
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 2) + fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.07s ==========================

85 : Job ID 43047cf8c0ce40d4bedbd663a4b73c9f
test outcome: killed
fibonacci.py, start pos: (41, 40), end pos: (41, 41)
operator: core/NumberReplacer, occurrence: 17
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 0) + fibonacci_recursive(target - 2)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

86 : Job ID 2740a536367c42ae81ef22fb86bce7a5
test outcome: killed
fibonacci.py, start pos: (41, 74), end pos: (41, 75)
operator: core/NumberReplacer, occurrence: 18
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 3)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

87 : Job ID 05031d5ece8d4fc09f4f445e9e6d8837
test outcome: killed
fibonacci.py, start pos: (41, 74), end pos: (41, 75)
operator: core/NumberReplacer, occurrence: 19
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -38,5 +38,5 @@
     if target <= 1:
         return max(0, target)
     # calculate the target number by calculating the previous 2 recursively 
-    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+    return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 1)
ts-3-5/test_3-5_0-9_293.py .....F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_recursive_with_positive_number
========================= 1 failed, 5 passed in 0.08s ==========================

88 : Job ID c91e60ce8e7249288e5c6c6138d52c70
test outcome: killed
fibonacci.py, start pos: (19, 13), end pos: (19, 30)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- afibonacci.py
+++ bfibonacci.py
@@ -16,7 +16,7 @@
     # initialize i = 0, and i = 1
     n_minus_1, n = 0, 1
     # start on i = 2 as the first calculated fibb number
-    for _ in range(2,target+1):
+    for _ in []:
         # calc n and set n_minus_1 to last calc'd value
         n, n_minus_1 = n + n_minus_1, n
     return n
ts-3-5/test_3-5_0-9_293.py ..F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_293.py::test_fibonacci_dp_with_positive_number - a...
========================= 1 failed, 5 passed in 0.07s ==========================
