   - [#   1] AOR fibonacci: 
--------------------------------------------------------------------------------
  15:         return 0
  16:     
  17:     (n_minus_1, n) = (0, 1)
  18:     
- 19:     for _ in range(2, target + 1):
+ 19:     for _ in range(2, target - 1):
  20:         
  21:         (n, n_minus_1) = (n + n_minus_1, n)
  22:     return n
  23: 
--------------------------------------------------------------------------------
[0.14681 s] killed by ts-3-5/test_3-5_0-3_103.py::test_fibonacci_dp

def test_fibonacci_dp():
        assert fibonacci_dp(0) == 0
        assert fibonacci_dp(1) == 1
        assert fibonacci_dp(2) == 1
>       assert fibonacci_dp(5) == 5
E       AssertionError

ts-3-5/test_3-5_0-3_103.py:15: AssertionError

   - [#   2] AOR fibonacci: 
--------------------------------------------------------------------------------
  17:     (n_minus_1, n) = (0, 1)
  18:     
  19:     for _ in range(2, target + 1):
  20:         
- 21:         (n, n_minus_1) = (n + n_minus_1, n)
+ 21:         (n, n_minus_1) = (n - n_minus_1, n)
  22:     return n
  23: 
  24: def fibonacci_recursive(target: int):
  25:     '''
--------------------------------------------------------------------------------
[0.14764 s] killed by ts-3-5/test_3-5_0-3_103.py::test_fibonacci_dp

def test_fibonacci_dp():
        assert fibonacci_dp(0) == 0
        assert fibonacci_dp(1) == 1
        assert fibonacci_dp(2) == 1
>       assert fibonacci_dp(5) == 5
E       AssertionError

ts-3-5/test_3-5_0-3_103.py:15: AssertionError

   - [#   3] AOR fibonacci: 
--------------------------------------------------------------------------------
  37:     
  38:     if target <= 1:
  39:         return max(0, target)
  40:     
- 41:     return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+ 41:     return fibonacci_recursive(target + 1) + fibonacci_recursive(target - 2)
--------------------------------------------------------------------------------
[0.49774 s] killed by ts-3-5/test_3-5_0-3_103.py::test_fibonacci_recursive

def test_fibonacci_recursive():
        assert fibonacci_recursive(0) == 0
        assert fibonacci_recursive(1) == 1
>       assert fibonacci_recursive(2) == 1

ts-3-5/test_3-5_0-3_103.py:25: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive

   - [#   4] AOR fibonacci: 
--------------------------------------------------------------------------------
  37:     
  38:     if target <= 1:
  39:         return max(0, target)
  40:     
- 41:     return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+ 41:     return fibonacci_recursive(target - 1) - fibonacci_recursive(target - 2)
--------------------------------------------------------------------------------
[0.14877 s] killed by ts-3-5/test_3-5_0-3_103.py::test_fibonacci_recursive

def test_fibonacci_recursive():
        assert fibonacci_recursive(0) == 0
        assert fibonacci_recursive(1) == 1
        assert fibonacci_recursive(2) == 1
>       assert fibonacci_recursive(5) == 5
E       AssertionError

ts-3-5/test_3-5_0-3_103.py:26: AssertionError

   - [#   5] AOR fibonacci: 
--------------------------------------------------------------------------------
  37:     
  38:     if target <= 1:
  39:         return max(0, target)
  40:     
- 41:     return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+ 41:     return fibonacci_recursive(target - 1) + fibonacci_recursive(target + 2)
--------------------------------------------------------------------------------
[0.15495 s] killed by ts-3-5/test_3-5_0-3_103.py::test_fibonacci_recursive

def test_fibonacci_recursive():
        assert fibonacci_recursive(0) == 0
        assert fibonacci_recursive(1) == 1
>       assert fibonacci_recursive(2) == 1

ts-3-5/test_3-5_0-3_103.py:25: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
E   RecursionError: maximum recursion depth exceeded in comparison
!!! Recursion detected (same locals & position)

   - [#   6] COI fibonacci: 
--------------------------------------------------------------------------------
  10: 
  11:     Returns:
  12:         The nth fibonacci number.
  13:     '''
- 14:     if target < 1:
+ 14:     if not (target < 1):
  15:         return 0
  16:     
  17:     (n_minus_1, n) = (0, 1)
  18:     
--------------------------------------------------------------------------------
[0.14017 s] killed by ts-3-5/test_3-5_0-3_103.py::test_fibonacci_dp

def test_fibonacci_dp():
>       assert fibonacci_dp(0) == 0
E       AssertionError

ts-3-5/test_3-5_0-3_103.py:12: AssertionError

   - [#   7] COI fibonacci: 
--------------------------------------------------------------------------------
  34:     Returns:
  35:         The nth fibonacci number.
  36:     '''
  37:     
- 38:     if target <= 1:
+ 38:     if not (target <= 1):
  39:         return max(0, target)
  40:     
  41:     return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
--------------------------------------------------------------------------------
[0.47266 s] killed by ts-3-5/test_3-5_0-3_103.py::test_fibonacci_recursive

def test_fibonacci_recursive():
>       assert fibonacci_recursive(0) == 0

ts-3-5/test_3-5_0-3_103.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???

   - [#   8] OIL fibonacci: 
--------------------------------------------------------------------------------
  18:     
  19:     for _ in range(2, target + 1):
  20:         
  21:         (n, n_minus_1) = (n + n_minus_1, n)
- 22:     return n
- 23: 
+ 22:         break
+ 23:     return n
  24: def fibonacci_recursive(target: int):
  25:     '''
  26:     Fibonacci found with recursion.
  27: 
--------------------------------------------------------------------------------
[0.13725 s] killed by ts-3-5/test_3-5_0-3_103.py::test_fibonacci_dp

def test_fibonacci_dp():
        assert fibonacci_dp(0) == 0
        assert fibonacci_dp(1) == 1
        assert fibonacci_dp(2) == 1
>       assert fibonacci_dp(5) == 5
E       AssertionError

ts-3-5/test_3-5_0-3_103.py:15: AssertionError

   - [#   9] RIL fibonacci: 
--------------------------------------------------------------------------------
  15:         return 0
  16:     
  17:     (n_minus_1, n) = (0, 1)
  18:     
- 19:     for _ in range(2, target + 1):
+ 19:     for _ in reversed(range(2, target + 1)):
  20:         
  21:         (n, n_minus_1) = (n + n_minus_1, n)
  22:     return n
  23: 
--------------------------------------------------------------------------------
[0.11400 s] survived

   - [#  10] ROR fibonacci: 
--------------------------------------------------------------------------------
  10: 
  11:     Returns:
  12:         The nth fibonacci number.
  13:     '''
- 14:     if target < 1:
+ 14:     if target > 1:
  15:         return 0
  16:     
  17:     (n_minus_1, n) = (0, 1)
  18:     
--------------------------------------------------------------------------------
[0.13493 s] killed by ts-3-5/test_3-5_0-3_103.py::test_fibonacci_dp

def test_fibonacci_dp():
>       assert fibonacci_dp(0) == 0
E       AssertionError

ts-3-5/test_3-5_0-3_103.py:12: AssertionError

   - [#  11] ROR fibonacci: 
--------------------------------------------------------------------------------
  10: 
  11:     Returns:
  12:         The nth fibonacci number.
  13:     '''
- 14:     if target < 1:
+ 14:     if target <= 1:
  15:         return 0
  16:     
  17:     (n_minus_1, n) = (0, 1)
  18:     
--------------------------------------------------------------------------------
[0.13741 s] killed by ts-3-5/test_3-5_0-3_103.py::test_fibonacci_dp

def test_fibonacci_dp():
        assert fibonacci_dp(0) == 0
>       assert fibonacci_dp(1) == 1
E       AssertionError

ts-3-5/test_3-5_0-3_103.py:13: AssertionError

   - [#  12] ROR fibonacci: 
--------------------------------------------------------------------------------
  34:     Returns:
  35:         The nth fibonacci number.
  36:     '''
  37:     
- 38:     if target <= 1:
+ 38:     if target >= 1:
  39:         return max(0, target)
  40:     
  41:     return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
--------------------------------------------------------------------------------
[0.47676 s] killed by ts-3-5/test_3-5_0-3_103.py::test_fibonacci_recursive

def test_fibonacci_recursive():
>       assert fibonacci_recursive(0) == 0

ts-3-5/test_3-5_0-3_103.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???

   - [#  13] ROR fibonacci: 
--------------------------------------------------------------------------------
  34:     Returns:
  35:         The nth fibonacci number.
  36:     '''
  37:     
- 38:     if target <= 1:
+ 38:     if target < 1:
  39:         return max(0, target)
  40:     
  41:     return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
--------------------------------------------------------------------------------
[0.13609 s] killed by ts-3-5/test_3-5_0-3_103.py::test_fibonacci_recursive

def test_fibonacci_recursive():
        assert fibonacci_recursive(0) == 0
>       assert fibonacci_recursive(1) == 1
E       AssertionError

ts-3-5/test_3-5_0-3_103.py:24: AssertionError

   - [#  14] SDL fibonacci: 
--------------------------------------------------------------------------------
  11:     Returns:
  12:         The nth fibonacci number.
  13:     '''
  14:     if target < 1:
- 15:         return 0
+ 15:         pass
  16:     
  17:     (n_minus_1, n) = (0, 1)
  18:     
  19:     for _ in range(2, target + 1):
--------------------------------------------------------------------------------
[0.13710 s] killed by ts-3-5/test_3-5_0-3_103.py::test_fibonacci_dp

def test_fibonacci_dp():
>       assert fibonacci_dp(0) == 0
E       AssertionError

ts-3-5/test_3-5_0-3_103.py:12: AssertionError

   - [#  15] SDL fibonacci: 
--------------------------------------------------------------------------------
  13:     '''
  14:     if target < 1:
  15:         return 0
  16:     
- 17:     (n_minus_1, n) = (0, 1)
+ 17:     pass
  18:     
  19:     for _ in range(2, target + 1):
  20:         
  21:         (n, n_minus_1) = (n + n_minus_1, n)
--------------------------------------------------------------------------------
[0.13884 s] killed by ts-3-5/test_3-5_0-3_103.py::test_fibonacci_dp

def test_fibonacci_dp():
        assert fibonacci_dp(0) == 0
>       assert fibonacci_dp(1) == 1

ts-3-5/test_3-5_0-3_103.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

target = 1

>   ???
E   UnboundLocalError: local variable 'n' referenced before assignment

fibonacci:22: UnboundLocalError

   - [#  16] SDL fibonacci: 
--------------------------------------------------------------------------------
  17:     (n_minus_1, n) = (0, 1)
  18:     
  19:     for _ in range(2, target + 1):
  20:         
- 21:         (n, n_minus_1) = (n + n_minus_1, n)
+ 21:         pass
  22:     return n
  23: 
  24: def fibonacci_recursive(target: int):
  25:     '''
--------------------------------------------------------------------------------
[0.13794 s] killed by ts-3-5/test_3-5_0-3_103.py::test_fibonacci_dp

def test_fibonacci_dp():
        assert fibonacci_dp(0) == 0
        assert fibonacci_dp(1) == 1
        assert fibonacci_dp(2) == 1
>       assert fibonacci_dp(5) == 5
E       AssertionError

ts-3-5/test_3-5_0-3_103.py:15: AssertionError

   - [#  17] SDL fibonacci: 
--------------------------------------------------------------------------------
  18:     
  19:     for _ in range(2, target + 1):
  20:         
  21:         (n, n_minus_1) = (n + n_minus_1, n)
- 22:     return n
+ 22:     pass
  23: 
  24: def fibonacci_recursive(target: int):
  25:     '''
  26:     Fibonacci found with recursion.
--------------------------------------------------------------------------------
[0.13797 s] killed by ts-3-5/test_3-5_0-3_103.py::test_fibonacci_dp

def test_fibonacci_dp():
        assert fibonacci_dp(0) == 0
>       assert fibonacci_dp(1) == 1
E       AssertionError

ts-3-5/test_3-5_0-3_103.py:13: AssertionError

   - [#  18] SDL fibonacci: 
--------------------------------------------------------------------------------
  35:         The nth fibonacci number.
  36:     '''
  37:     
  38:     if target <= 1:
- 39:         return max(0, target)
+ 39:         pass
  40:     
  41:     return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
--------------------------------------------------------------------------------
[0.47916 s] killed by ts-3-5/test_3-5_0-3_103.py::test_fibonacci_recursive

def test_fibonacci_recursive():
>       assert fibonacci_recursive(0) == 0

ts-3-5/test_3-5_0-3_103.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive
    ???
fibonacci:41: in fibonacci_recursive

   - [#  19] SDL fibonacci: 
--------------------------------------------------------------------------------
  37:     
  38:     if target <= 1:
  39:         return max(0, target)
  40:     
- 41:     return fibonacci_recursive(target - 1) + fibonacci_recursive(target - 2)
+ 41:     pass
--------------------------------------------------------------------------------
[0.14003 s] killed by ts-3-5/test_3-5_0-3_103.py::test_fibonacci_recursive

def test_fibonacci_recursive():
        assert fibonacci_recursive(0) == 0
        assert fibonacci_recursive(1) == 1
>       assert fibonacci_recursive(2) == 1
E       AssertionError

ts-3-5/test_3-5_0-3_103.py:25: AssertionError

   - [#  20] ZIL fibonacci: 
--------------------------------------------------------------------------------
  17:     (n_minus_1, n) = (0, 1)
  18:     
  19:     for _ in range(2, target + 1):
  20:         
- 21:         (n, n_minus_1) = (n + n_minus_1, n)
+ 21:         break
  22:     return n
  23: 
  24: def fibonacci_recursive(target: int):
  25:     '''
--------------------------------------------------------------------------------
[0.13784 s] killed by ts-3-5/test_3-5_0-3_103.py::test_fibonacci_dp

def test_fibonacci_dp():
        assert fibonacci_dp(0) == 0
        assert fibonacci_dp(1) == 1
        assert fibonacci_dp(2) == 1
>       assert fibonacci_dp(5) == 5
E       AssertionError

ts-3-5/test_3-5_0-3_103.py:15: AssertionError
