1 : Job ID 23e96476054b45db8d406310968f7017
test outcome: killed
find_duplicates.py, start pos: (21, 23), end pos: (21, 25)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -18,7 +18,7 @@
     while ptr_1 < len(arr1) and ptr_2 < len(arr2):
-        if arr2[ptr_2] == arr1[ptr_1]:
+        if arr2[ptr_2] != arr1[ptr_1]:
             output.append(arr1[ptr_1])
             ptr_1 += 1
             ptr_2 += 1
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [1, 2,...
========================= 1 failed, 2 passed in 0.09s ==========================

2 : Job ID 508b9bee65d848b0a6f8e9f4098a0258
test outcome: killed
find_duplicates.py, start pos: (21, 23), end pos: (21, 25)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -18,7 +18,7 @@
     while ptr_1 < len(arr1) and ptr_2 < len(arr2):
-        if arr2[ptr_2] == arr1[ptr_1]:
+        if arr2[ptr_2] < arr1[ptr_1]:
             output.append(arr1[ptr_1])
             ptr_1 += 1
             ptr_2 += 1
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [] == ...
========================= 1 failed, 2 passed in 0.09s ==========================

3 : Job ID bcb9c7a377944dbd853edc4f3a031c12
SURVIVED
test outcome: survived
find_duplicates.py, start pos: (21, 23), end pos: (21, 25)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -18,7 +18,7 @@
     while ptr_1 < len(arr1) and ptr_2 < len(arr2):
-        if arr2[ptr_2] == arr1[ptr_1]:
+        if arr2[ptr_2] <= arr1[ptr_1]:
             output.append(arr1[ptr_1])
             ptr_1 += 1
             ptr_2 += 1
ts-3-5/test_3-5_0-4_131.py ...                                           [100%]
============================== 3 passed in 0.08s ===============================

4 : Job ID d936b1dca6034293a4717b50eb13ddb5
test outcome: killed
find_duplicates.py, start pos: (21, 23), end pos: (21, 25)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -18,7 +18,7 @@
     while ptr_1 < len(arr1) and ptr_2 < len(arr2):
-        if arr2[ptr_2] == arr1[ptr_1]:
+        if arr2[ptr_2] > arr1[ptr_1]:
             output.append(arr1[ptr_1])
             ptr_1 += 1
             ptr_2 += 1
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [1, 2,...
========================= 1 failed, 2 passed in 0.09s ==========================

5 : Job ID da3b2d21db7340859d38541f00ae7332
test outcome: killed
find_duplicates.py, start pos: (21, 23), end pos: (21, 25)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -18,7 +18,7 @@
     while ptr_1 < len(arr1) and ptr_2 < len(arr2):
-        if arr2[ptr_2] == arr1[ptr_1]:
+        if arr2[ptr_2] >= arr1[ptr_1]:
             output.append(arr1[ptr_1])
             ptr_1 += 1
             ptr_2 += 1
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [1, 2,...
========================= 1 failed, 2 passed in 0.09s ==========================

6 : Job ID 7041d19dd8114f8ba75817f0d0dbc126
SURVIVED
test outcome: survived
find_duplicates.py, start pos: (21, 23), end pos: (21, 25)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -18,7 +18,7 @@
     while ptr_1 < len(arr1) and ptr_2 < len(arr2):
-        if arr2[ptr_2] == arr1[ptr_1]:
+        if arr2[ptr_2] is arr1[ptr_1]:
             output.append(arr1[ptr_1])
             ptr_1 += 1
             ptr_2 += 1
ts-3-5/test_3-5_0-4_131.py ...                                           [100%]
============================== 3 passed in 0.09s ===============================

7 : Job ID 108a0d0ce4f64f568e3fca89e6116e70
test outcome: killed
find_duplicates.py, start pos: (21, 23), end pos: (21, 25)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -18,7 +18,7 @@
     while ptr_1 < len(arr1) and ptr_2 < len(arr2):
-        if arr2[ptr_2] == arr1[ptr_1]:
+        if arr2[ptr_2] is not arr1[ptr_1]:
             output.append(arr1[ptr_1])
             ptr_1 += 1
             ptr_2 += 1
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [1, 2,...
========================= 1 failed, 2 passed in 0.09s ==========================

8 : Job ID 90ee6c6853ad403b9a55a69d456f97a2
test outcome: killed
find_duplicates.py, start pos: (19, 16), end pos: (19, 17)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -16,7 +16,7 @@
     ptr_1 = 0
     ptr_2 = 0
-    while ptr_1 < len(arr1) and ptr_2 < len(arr2):
+    while ptr_1 == len(arr1) and ptr_2 < len(arr2):
         if arr2[ptr_2] == arr1[ptr_1]:
             output.append(arr1[ptr_1])
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [] == ...
========================= 1 failed, 2 passed in 0.09s ==========================

9 : Job ID 8f0a871d7a0c499ab05bfc3ffc851837
test outcome: killed
find_duplicates.py, start pos: (19, 38), end pos: (19, 39)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 1
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -16,7 +16,7 @@
     ptr_1 = 0
     ptr_2 = 0
-    while ptr_1 < len(arr1) and ptr_2 < len(arr2):
+    while ptr_1 < len(arr1) and ptr_2 == len(arr2):
         if arr2[ptr_2] == arr1[ptr_1]:
             output.append(arr1[ptr_1])
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [] == ...
========================= 1 failed, 2 passed in 0.09s ==========================

10 : Job ID 8ca150db843f4ff8af5275ee2f45b8b9
test outcome: killed
find_duplicates.py, start pos: (39, 17), end pos: (39, 18)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 2
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -36,7 +36,7 @@
     """
     # if arr1 is greater, swap them
-    if len(arr2) < len(arr1):
+    if len(arr2) == len(arr1):
         arr1, arr2 = arr2, arr1
     output = []
ts-3-5/test_3-5_0-4_131.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_bin_search - IndexError: l...
========================= 1 failed, 2 passed in 0.09s ==========================

11 : Job ID a07a24a86ad64a8884f01e13804a3a83
SURVIVED
test outcome: survived
find_duplicates.py, start pos: (19, 16), end pos: (19, 17)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -16,7 +16,7 @@
     ptr_1 = 0
     ptr_2 = 0
-    while ptr_1 < len(arr1) and ptr_2 < len(arr2):
+    while ptr_1 != len(arr1) and ptr_2 < len(arr2):
         if arr2[ptr_2] == arr1[ptr_1]:
             output.append(arr1[ptr_1])
ts-3-5/test_3-5_0-4_131.py ...                                           [100%]
============================== 3 passed in 0.09s ===============================

12 : Job ID 97328cb19ecb4ed3a72a0bd2b61f0a32
SURVIVED
test outcome: survived
find_duplicates.py, start pos: (19, 38), end pos: (19, 39)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 1
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -16,7 +16,7 @@
     ptr_1 = 0
     ptr_2 = 0
-    while ptr_1 < len(arr1) and ptr_2 < len(arr2):
+    while ptr_1 < len(arr1) and ptr_2 != len(arr2):
         if arr2[ptr_2] == arr1[ptr_1]:
             output.append(arr1[ptr_1])
ts-3-5/test_3-5_0-4_131.py ...                                           [100%]
============================== 3 passed in 0.09s ===============================

13 : Job ID a06fceec4d964f09aeab7ef8ee1e92e1
SURVIVED
test outcome: survived
find_duplicates.py, start pos: (39, 17), end pos: (39, 18)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 2
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -36,7 +36,7 @@
     """
     # if arr1 is greater, swap them
-    if len(arr2) < len(arr1):
+    if len(arr2) != len(arr1):
         arr1, arr2 = arr2, arr1
     output = []
ts-3-5/test_3-5_0-4_131.py ...                                           [100%]
============================== 3 passed in 0.09s ===============================

14 : Job ID db2a8a85e96949108cf133469677f2e0
test outcome: killed
find_duplicates.py, start pos: (19, 16), end pos: (19, 17)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -16,7 +16,7 @@
     ptr_1 = 0
     ptr_2 = 0
-    while ptr_1 < len(arr1) and ptr_2 < len(arr2):
+    while ptr_1 <= len(arr1) and ptr_2 < len(arr2):
         if arr2[ptr_2] == arr1[ptr_1]:
             output.append(arr1[ptr_1])
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - IndexError: l...
========================= 1 failed, 2 passed in 0.09s ==========================

15 : Job ID 18268b45dc814b6b9068e259de9d0e63
SURVIVED
test outcome: survived
find_duplicates.py, start pos: (19, 38), end pos: (19, 39)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 1
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -16,7 +16,7 @@
     ptr_1 = 0
     ptr_2 = 0
-    while ptr_1 < len(arr1) and ptr_2 < len(arr2):
+    while ptr_1 < len(arr1) and ptr_2 <= len(arr2):
         if arr2[ptr_2] == arr1[ptr_1]:
             output.append(arr1[ptr_1])
ts-3-5/test_3-5_0-4_131.py ...                                           [100%]
============================== 3 passed in 0.09s ===============================

16 : Job ID 3c25948d7f6240ec928a250df0cabb1b
test outcome: killed
find_duplicates.py, start pos: (39, 17), end pos: (39, 18)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 2
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -36,7 +36,7 @@
     """
     # if arr1 is greater, swap them
-    if len(arr2) < len(arr1):
+    if len(arr2) <= len(arr1):
         arr1, arr2 = arr2, arr1
     output = []
ts-3-5/test_3-5_0-4_131.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_bin_search - IndexError: l...
========================= 1 failed, 2 passed in 0.09s ==========================

17 : Job ID fafb5801df484366a91ea793b65eacb0
test outcome: killed
find_duplicates.py, start pos: (19, 16), end pos: (19, 17)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -16,7 +16,7 @@
     ptr_1 = 0
     ptr_2 = 0
-    while ptr_1 < len(arr1) and ptr_2 < len(arr2):
+    while ptr_1 > len(arr1) and ptr_2 < len(arr2):
         if arr2[ptr_2] == arr1[ptr_1]:
             output.append(arr1[ptr_1])
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [] == ...
========================= 1 failed, 2 passed in 0.09s ==========================

18 : Job ID b712e2e452ac4812b01dd2502655f746
test outcome: killed
find_duplicates.py, start pos: (19, 38), end pos: (19, 39)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 1
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -16,7 +16,7 @@
     ptr_1 = 0
     ptr_2 = 0
-    while ptr_1 < len(arr1) and ptr_2 < len(arr2):
+    while ptr_1 < len(arr1) and ptr_2 > len(arr2):
         if arr2[ptr_2] == arr1[ptr_1]:
             output.append(arr1[ptr_1])
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [] == ...
========================= 1 failed, 2 passed in 0.09s ==========================

19 : Job ID 026e03cd613c40c799a19d2557f939ba
SURVIVED
test outcome: survived
find_duplicates.py, start pos: (39, 17), end pos: (39, 18)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 2
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -36,7 +36,7 @@
     """
     # if arr1 is greater, swap them
-    if len(arr2) < len(arr1):
+    if len(arr2) > len(arr1):
         arr1, arr2 = arr2, arr1
     output = []
ts-3-5/test_3-5_0-4_131.py ...                                           [100%]
============================== 3 passed in 0.09s ===============================

20 : Job ID fe44b62f29dd4a5ab610e0d5cd0485d0
test outcome: killed
find_duplicates.py, start pos: (19, 16), end pos: (19, 17)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -16,7 +16,7 @@
     ptr_1 = 0
     ptr_2 = 0
-    while ptr_1 < len(arr1) and ptr_2 < len(arr2):
+    while ptr_1 >= len(arr1) and ptr_2 < len(arr2):
         if arr2[ptr_2] == arr1[ptr_1]:
             output.append(arr1[ptr_1])
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [] == ...
========================= 1 failed, 2 passed in 0.09s ==========================

21 : Job ID 75f86bc572514606aed93599c8e3cc46
test outcome: killed
find_duplicates.py, start pos: (19, 38), end pos: (19, 39)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 1
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -16,7 +16,7 @@
     ptr_1 = 0
     ptr_2 = 0
-    while ptr_1 < len(arr1) and ptr_2 < len(arr2):
+    while ptr_1 < len(arr1) and ptr_2 >= len(arr2):
         if arr2[ptr_2] == arr1[ptr_1]:
             output.append(arr1[ptr_1])
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [] == ...
========================= 1 failed, 2 passed in 0.09s ==========================

22 : Job ID 560580850bb24aae824c1aed4a31a829
test outcome: killed
find_duplicates.py, start pos: (39, 17), end pos: (39, 18)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 2
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -36,7 +36,7 @@
     """
     # if arr1 is greater, swap them
-    if len(arr2) < len(arr1):
+    if len(arr2) >= len(arr1):
         arr1, arr2 = arr2, arr1
     output = []
ts-3-5/test_3-5_0-4_131.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_bin_search - IndexError: l...
========================= 1 failed, 2 passed in 0.09s ==========================

23 : Job ID d892f18124bb43d7ace6959f055b39f9
test outcome: killed
find_duplicates.py, start pos: (19, 16), end pos: (19, 17)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -16,7 +16,7 @@
     ptr_1 = 0
     ptr_2 = 0
-    while ptr_1 < len(arr1) and ptr_2 < len(arr2):
+    while ptr_1 is len(arr1) and ptr_2 < len(arr2):
         if arr2[ptr_2] == arr1[ptr_1]:
             output.append(arr1[ptr_1])
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [] == ...
========================= 1 failed, 2 passed in 0.09s ==========================

24 : Job ID 77c6be3dcd2f4143b8316ac365dbd25b
test outcome: killed
find_duplicates.py, start pos: (19, 38), end pos: (19, 39)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 1
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -16,7 +16,7 @@
     ptr_1 = 0
     ptr_2 = 0
-    while ptr_1 < len(arr1) and ptr_2 < len(arr2):
+    while ptr_1 < len(arr1) and ptr_2 is len(arr2):
         if arr2[ptr_2] == arr1[ptr_1]:
             output.append(arr1[ptr_1])
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [] == ...
========================= 1 failed, 2 passed in 0.09s ==========================

25 : Job ID c6da14a219ef4fc3bdd92340e712f648
test outcome: killed
find_duplicates.py, start pos: (39, 17), end pos: (39, 18)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 2
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -36,7 +36,7 @@
     """
     # if arr1 is greater, swap them
-    if len(arr2) < len(arr1):
+    if len(arr2) is len(arr1):
         arr1, arr2 = arr2, arr1
     output = []
ts-3-5/test_3-5_0-4_131.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_bin_search - IndexError: l...
========================= 1 failed, 2 passed in 0.09s ==========================

26 : Job ID 5e3221aa00664a9cab355feb45cf80f2
SURVIVED
test outcome: survived
find_duplicates.py, start pos: (19, 16), end pos: (19, 17)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -16,7 +16,7 @@
     ptr_1 = 0
     ptr_2 = 0
-    while ptr_1 < len(arr1) and ptr_2 < len(arr2):
+    while ptr_1 is not len(arr1) and ptr_2 < len(arr2):
         if arr2[ptr_2] == arr1[ptr_1]:
             output.append(arr1[ptr_1])
ts-3-5/test_3-5_0-4_131.py ...                                           [100%]
============================== 3 passed in 0.09s ===============================

27 : Job ID 114c80cacec14a66aa676e591089fdd0
SURVIVED
test outcome: survived
find_duplicates.py, start pos: (19, 38), end pos: (19, 39)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 1
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -16,7 +16,7 @@
     ptr_1 = 0
     ptr_2 = 0
-    while ptr_1 < len(arr1) and ptr_2 < len(arr2):
+    while ptr_1 < len(arr1) and ptr_2 is not len(arr2):
         if arr2[ptr_2] == arr1[ptr_1]:
             output.append(arr1[ptr_1])
ts-3-5/test_3-5_0-4_131.py ...                                           [100%]
============================== 3 passed in 0.08s ===============================

28 : Job ID 8432f4e1188140d997e4ac2cf4e73896
SURVIVED
test outcome: survived
find_duplicates.py, start pos: (39, 17), end pos: (39, 18)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 2
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -36,7 +36,7 @@
     """
     # if arr1 is greater, swap them
-    if len(arr2) < len(arr1):
+    if len(arr2) is not len(arr1):
         arr1, arr2 = arr2, arr1
     output = []
ts-3-5/test_3-5_0-4_131.py ...                                           [100%]
============================== 3 passed in 0.09s ===============================

29 : Job ID 5984e698f985484980bd6becc9b423dc
test outcome: killed
find_duplicates.py, start pos: (25, 25), end pos: (25, 26)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -22,7 +22,7 @@
             output.append(arr1[ptr_1])
             ptr_1 += 1
             ptr_2 += 1
-        elif arr2[ptr_2] > arr1[ptr_1]:
+        elif arr2[ptr_2] == arr1[ptr_1]:
             ptr_1 += 1
         else:
             ptr_2 += 1
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [] == ...
========================= 1 failed, 2 passed in 0.09s ==========================

30 : Job ID df166d4228f34a2793c4dc4db5bfaa4b
SURVIVED
test outcome: survived
find_duplicates.py, start pos: (25, 25), end pos: (25, 26)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -22,7 +22,7 @@
             output.append(arr1[ptr_1])
             ptr_1 += 1
             ptr_2 += 1
-        elif arr2[ptr_2] > arr1[ptr_1]:
+        elif arr2[ptr_2] != arr1[ptr_1]:
             ptr_1 += 1
         else:
             ptr_2 += 1
ts-3-5/test_3-5_0-4_131.py ...                                           [100%]
============================== 3 passed in 0.09s ===============================

31 : Job ID 6220ffd0a6fb428692b2f23145192877
test outcome: killed
find_duplicates.py, start pos: (25, 25), end pos: (25, 26)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -22,7 +22,7 @@
             output.append(arr1[ptr_1])
             ptr_1 += 1
             ptr_2 += 1
-        elif arr2[ptr_2] > arr1[ptr_1]:
+        elif arr2[ptr_2] < arr1[ptr_1]:
             ptr_1 += 1
         else:
             ptr_2 += 1
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [] == ...
========================= 1 failed, 2 passed in 0.09s ==========================

32 : Job ID 6d5628c3cbcc4596ad17f6ccc57494ce
test outcome: killed
find_duplicates.py, start pos: (25, 25), end pos: (25, 26)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -22,7 +22,7 @@
             output.append(arr1[ptr_1])
             ptr_1 += 1
             ptr_2 += 1
-        elif arr2[ptr_2] > arr1[ptr_1]:
+        elif arr2[ptr_2] <= arr1[ptr_1]:
             ptr_1 += 1
         else:
             ptr_2 += 1
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [] == ...
========================= 1 failed, 2 passed in 0.09s ==========================

33 : Job ID 88eb5eec674542a3a6dc28eaf221c638
SURVIVED
test outcome: survived
find_duplicates.py, start pos: (25, 25), end pos: (25, 26)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -22,7 +22,7 @@
             output.append(arr1[ptr_1])
             ptr_1 += 1
             ptr_2 += 1
-        elif arr2[ptr_2] > arr1[ptr_1]:
+        elif arr2[ptr_2] >= arr1[ptr_1]:
             ptr_1 += 1
         else:
             ptr_2 += 1
ts-3-5/test_3-5_0-4_131.py ...                                           [100%]
============================== 3 passed in 0.09s ===============================

34 : Job ID 7fb6b809a84c4feb947cc55e3d52cd61
test outcome: killed
find_duplicates.py, start pos: (25, 25), end pos: (25, 26)
operator: core/ReplaceComparisonOperator_Gt_Is, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -22,7 +22,7 @@
             output.append(arr1[ptr_1])
             ptr_1 += 1
             ptr_2 += 1
-        elif arr2[ptr_2] > arr1[ptr_1]:
+        elif arr2[ptr_2] is arr1[ptr_1]:
             ptr_1 += 1
         else:
             ptr_2 += 1
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [] == ...
========================= 1 failed, 2 passed in 0.09s ==========================

35 : Job ID 947c9545a499476da0af9e4149832097
SURVIVED
test outcome: survived
find_duplicates.py, start pos: (25, 25), end pos: (25, 26)
operator: core/ReplaceComparisonOperator_Gt_IsNot, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -22,7 +22,7 @@
             output.append(arr1[ptr_1])
             ptr_1 += 1
             ptr_2 += 1
-        elif arr2[ptr_2] > arr1[ptr_1]:
+        elif arr2[ptr_2] is not arr1[ptr_1]:
             ptr_1 += 1
         else:
             ptr_2 += 1
ts-3-5/test_3-5_0-4_131.py ...                                           [100%]
============================== 3 passed in 0.09s ===============================

36 : Job ID a0cc66ca6b7a4847bae07fb683728a02
test outcome: killed
find_duplicates.py, start pos: (45, 40), end pos: (45, 42)
operator: core/ReplaceComparisonOperator_GtE_Eq, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -42,7 +42,7 @@
     output = []
     for element in arr1:
-        if binary_search(arr2, element) >= 0:
+        if binary_search(arr2, element) == 0:
             output.append(element)
     return output
ts-3-5/test_3-5_0-4_131.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_bin_search - assert [3] ==...
========================= 1 failed, 2 passed in 0.09s ==========================

37 : Job ID debdbffdb47a46c0b35d50a4993f36db
test outcome: killed
find_duplicates.py, start pos: (45, 40), end pos: (45, 42)
operator: core/ReplaceComparisonOperator_GtE_NotEq, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -42,7 +42,7 @@
     output = []
     for element in arr1:
-        if binary_search(arr2, element) >= 0:
+        if binary_search(arr2, element) != 0:
             output.append(element)
     return output
ts-3-5/test_3-5_0-4_131.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_bin_search - assert [1, 2,...
========================= 1 failed, 2 passed in 0.09s ==========================

38 : Job ID ad464507501349fc931a35f2447f393c
test outcome: killed
find_duplicates.py, start pos: (45, 40), end pos: (45, 42)
operator: core/ReplaceComparisonOperator_GtE_Lt, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -42,7 +42,7 @@
     output = []
     for element in arr1:
-        if binary_search(arr2, element) >= 0:
+        if binary_search(arr2, element) < 0:
             output.append(element)
     return output
ts-3-5/test_3-5_0-4_131.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_bin_search - assert [1, 2]...
========================= 1 failed, 2 passed in 0.09s ==========================

39 : Job ID 6a7a446a893943f494311c63eb5663ce
test outcome: killed
find_duplicates.py, start pos: (45, 40), end pos: (45, 42)
operator: core/ReplaceComparisonOperator_GtE_LtE, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -42,7 +42,7 @@
     output = []
     for element in arr1:
-        if binary_search(arr2, element) >= 0:
+        if binary_search(arr2, element) <= 0:
             output.append(element)
     return output
ts-3-5/test_3-5_0-4_131.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_bin_search - assert [1, 2,...
========================= 1 failed, 2 passed in 0.09s ==========================
