40 : Job ID a6e152d575144cf495d98bc6073a743d
test outcome: killed
find_duplicates.py, start pos: (45, 40), end pos: (45, 42)
operator: core/ReplaceComparisonOperator_GtE_Gt, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -42,7 +42,7 @@
     output = []
     for element in arr1:
-        if binary_search(arr2, element) >= 0:
+        if binary_search(arr2, element) > 0:
             output.append(element)
     return output
ts-3-5/test_3-5_0-4_131.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_bin_search - assert [4, 5]...
========================= 1 failed, 2 passed in 0.09s ==========================

41 : Job ID abe020ba8d884a0695194a186bee62f5
test outcome: killed
find_duplicates.py, start pos: (8, 11), end pos: (8, 31)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -5,7 +5,7 @@
     output = []
     for element in arr2:
-        if element in arr1_seen:
+        if not element in arr1_seen:
             output.append(element)
     return output
ts-3-5/test_3-5_0-4_131.py F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_linear - assert [6, 7] == ...
========================= 1 failed, 2 passed in 0.09s ==========================

42 : Job ID 665fd759a7ae4f66acc73533a778c2ba
test outcome: killed
find_duplicates.py, start pos: (19, 10), end pos: (19, 49)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -16,7 +16,7 @@
     ptr_1 = 0
     ptr_2 = 0
-    while ptr_1 < len(arr1) and ptr_2 < len(arr2):
+    while not ptr_1 < len(arr1) and ptr_2 < len(arr2):
         if arr2[ptr_2] == arr1[ptr_1]:
             output.append(arr1[ptr_1])
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [] == ...
========================= 1 failed, 2 passed in 0.09s ==========================

43 : Job ID 15aedd4e3cb64761a2377bd615fe2384
test outcome: killed
find_duplicates.py, start pos: (21, 11), end pos: (21, 37)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -18,7 +18,7 @@
     while ptr_1 < len(arr1) and ptr_2 < len(arr2):
-        if arr2[ptr_2] == arr1[ptr_1]:
+        if not arr2[ptr_2] == arr1[ptr_1]:
             output.append(arr1[ptr_1])
             ptr_1 += 1
             ptr_2 += 1
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [1, 2,...
========================= 1 failed, 2 passed in 0.09s ==========================

44 : Job ID 5c19b4efc9d84823b9794bde2687f3ed
test outcome: killed
find_duplicates.py, start pos: (39, 7), end pos: (39, 28)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -36,7 +36,7 @@
     """
     # if arr1 is greater, swap them
-    if len(arr2) < len(arr1):
+    if not len(arr2) < len(arr1):
         arr1, arr2 = arr2, arr1
     output = []
ts-3-5/test_3-5_0-4_131.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_bin_search - IndexError: l...
========================= 1 failed, 2 passed in 0.08s ==========================

45 : Job ID fd7777106830409f8f75fc8c2e853d53
test outcome: killed
find_duplicates.py, start pos: (45, 11), end pos: (45, 44)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -42,7 +42,7 @@
     output = []
     for element in arr1:
-        if binary_search(arr2, element) >= 0:
+        if not binary_search(arr2, element) >= 0:
             output.append(element)
     return output
ts-3-5/test_3-5_0-4_131.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_bin_search - assert [1, 2]...
========================= 1 failed, 2 passed in 0.09s ==========================

46 : Job ID 919204bed24945108e62a8c53c7db6f3
test outcome: killed
find_duplicates.py, start pos: (19, 28), end pos: (19, 31)
operator: core/ReplaceAndWithOr, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -16,7 +16,7 @@
     ptr_1 = 0
     ptr_2 = 0
-    while ptr_1 < len(arr1) and ptr_2 < len(arr2):
+    while ptr_1 < len(arr1) or ptr_2 < len(arr2):
         if arr2[ptr_2] == arr1[ptr_1]:
             output.append(arr1[ptr_1])
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - IndexError: l...
========================= 1 failed, 2 passed in 0.11s ==========================

47 : Job ID 04ee56cd3de246a8b8a7b6805182f3f9
SURVIVED
test outcome: survived
find_duplicates.py, start pos: (16, 12), end pos: (16, 13)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -13,7 +13,7 @@
 def duplicates_pre_sorted(arr1, arr2):
     output = []
-    ptr_1 = 0
+    ptr_1 = 1
     ptr_2 = 0
     while ptr_1 < len(arr1) and ptr_2 < len(arr2):
ts-3-5/test_3-5_0-4_131.py ...                                           [100%]
============================== 3 passed in 0.08s ===============================

48 : Job ID dbb5ee7178a0422e972a5f5b742ef641
test outcome: killed
find_duplicates.py, start pos: (16, 12), end pos: (16, 13)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -13,7 +13,7 @@
 def duplicates_pre_sorted(arr1, arr2):
     output = []
-    ptr_1 = 0
+    ptr_1 = -1
     ptr_2 = 0
     while ptr_1 < len(arr1) and ptr_2 < len(arr2):
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [5] ==...
========================= 1 failed, 2 passed in 0.09s ==========================

49 : Job ID c4d0cd9115d843d494eb4a714ac61046
test outcome: killed
find_duplicates.py, start pos: (17, 12), end pos: (17, 13)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -14,7 +14,7 @@
     output = []
     ptr_1 = 0
-    ptr_2 = 0
+    ptr_2 = 1
     while ptr_1 < len(arr1) and ptr_2 < len(arr2):
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [4, 5]...
========================= 1 failed, 2 passed in 0.09s ==========================

50 : Job ID 9f2c5d0fe22e4e15b08d6cb9db28cc11
test outcome: killed
find_duplicates.py, start pos: (17, 12), end pos: (17, 13)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -14,7 +14,7 @@
     output = []
     ptr_1 = 0
-    ptr_2 = 0
+    ptr_2 = -1
     while ptr_1 < len(arr1) and ptr_2 < len(arr2):
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [] == ...
========================= 1 failed, 2 passed in 0.09s ==========================

51 : Job ID 8c5a0b3437ef4922898af5fa5fccce41
test outcome: killed
find_duplicates.py, start pos: (23, 21), end pos: (23, 22)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -20,7 +20,7 @@
         if arr2[ptr_2] == arr1[ptr_1]:
             output.append(arr1[ptr_1])
-            ptr_1 += 1
+            ptr_1 += 2
             ptr_2 += 1
         elif arr2[ptr_2] > arr1[ptr_1]:
             ptr_1 += 1
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [3, 5]...
========================= 1 failed, 2 passed in 0.09s ==========================

52 : Job ID 2c8189205ac74968974da2c93f1044f0
SURVIVED
test outcome: survived
find_duplicates.py, start pos: (23, 21), end pos: (23, 22)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -20,7 +20,7 @@
         if arr2[ptr_2] == arr1[ptr_1]:
             output.append(arr1[ptr_1])
-            ptr_1 += 1
+            ptr_1 += 0
             ptr_2 += 1
         elif arr2[ptr_2] > arr1[ptr_1]:
             ptr_1 += 1
ts-3-5/test_3-5_0-4_131.py ...                                           [100%]
============================== 3 passed in 0.09s ===============================

53 : Job ID f175fcc355d24fbcb1ffdb3379581fd9
test outcome: killed
find_duplicates.py, start pos: (24, 21), end pos: (24, 22)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -21,7 +21,7 @@
         if arr2[ptr_2] == arr1[ptr_1]:
             output.append(arr1[ptr_1])
             ptr_1 += 1
-            ptr_2 += 1
+            ptr_2 += 2
         elif arr2[ptr_2] > arr1[ptr_1]:
             ptr_1 += 1
         else:
ts-3-5/test_3-5_0-4_131.py .F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_pre_sorted - assert [3, 5]...
========================= 1 failed, 2 passed in 0.11s ==========================

54 : Job ID 7082892ff01841618ce86471a227a083
SURVIVED
test outcome: survived
find_duplicates.py, start pos: (24, 21), end pos: (24, 22)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -21,7 +21,7 @@
         if arr2[ptr_2] == arr1[ptr_1]:
             output.append(arr1[ptr_1])
             ptr_1 += 1
-            ptr_2 += 1
+            ptr_2 += 0
         elif arr2[ptr_2] > arr1[ptr_1]:
             ptr_1 += 1
         else:
ts-3-5/test_3-5_0-4_131.py ...                                           [100%]
============================== 3 passed in 0.10s ===============================

55 : Job ID 72847a38b9534358898f10ccdb11c9dd
SURVIVED
test outcome: survived
find_duplicates.py, start pos: (26, 21), end pos: (26, 22)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -23,7 +23,7 @@
             ptr_1 += 1
             ptr_2 += 1
         elif arr2[ptr_2] > arr1[ptr_1]:
-            ptr_1 += 1
+            ptr_1 += 2
         else:
             ptr_2 += 1
ts-3-5/test_3-5_0-4_131.py ...                                           [100%]
============================== 3 passed in 0.09s ===============================

56 : Job ID 74214c449f6c473b8067210258dcc38a
test outcome: killed
find_duplicates.py, start pos: (26, 21), end pos: (26, 22)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -23,7 +23,7 @@
             ptr_1 += 1
             ptr_2 += 1
         elif arr2[ptr_2] > arr1[ptr_1]:
-            ptr_1 += 1
+            ptr_1 += 0
         else:
             ptr_2 += 1
timeout

57 : Job ID 2a045067e4524bdf9dab8acbd5e8e6f4
SURVIVED
test outcome: survived
find_duplicates.py, start pos: (28, 21), end pos: (28, 22)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -25,7 +25,7 @@
         elif arr2[ptr_2] > arr1[ptr_1]:
             ptr_1 += 1
         else:
-            ptr_2 += 1
+            ptr_2 += 2
     return output
ts-3-5/test_3-5_0-4_131.py ...                                           [100%]
============================== 3 passed in 0.08s ===============================

58 : Job ID ee96069e5382412bbe5cbf587332fd61
SURVIVED
test outcome: survived
find_duplicates.py, start pos: (28, 21), end pos: (28, 22)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -25,7 +25,7 @@
         elif arr2[ptr_2] > arr1[ptr_1]:
             ptr_1 += 1
         else:
-            ptr_2 += 1
+            ptr_2 += 0
     return output
ts-3-5/test_3-5_0-4_131.py ...                                           [100%]
============================== 3 passed in 0.09s ===============================

59 : Job ID ad63e826c82848e1b24fe517351643dc
test outcome: killed
find_duplicates.py, start pos: (45, 43), end pos: (45, 44)
operator: core/NumberReplacer, occurrence: 12
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -42,7 +42,7 @@
     output = []
     for element in arr1:
-        if binary_search(arr2, element) >= 0:
+        if binary_search(arr2, element) >= 1:
             output.append(element)
     return output
ts-3-5/test_3-5_0-4_131.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_bin_search - assert [4, 5]...
========================= 1 failed, 2 passed in 0.09s ==========================

60 : Job ID d7ba3c8066304df3b1759d6526f2908f
test outcome: killed
find_duplicates.py, start pos: (45, 43), end pos: (45, 44)
operator: core/NumberReplacer, occurrence: 13
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -42,7 +42,7 @@
     output = []
     for element in arr1:
-        if binary_search(arr2, element) >= 0:
+        if binary_search(arr2, element) >= -1:
             output.append(element)
     return output
ts-3-5/test_3-5_0-4_131.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_bin_search - assert [1, 2,...
========================= 1 failed, 2 passed in 0.09s ==========================

61 : Job ID 834595f68cb448feb5cac5989b578181
test outcome: killed
find_duplicates.py, start pos: (7, 19), end pos: (7, 23)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -4,7 +4,7 @@
     arr1_seen = set(arr1)
     output = []
-    for element in arr2:
+    for element in []:
         if element in arr1_seen:
             output.append(element)
ts-3-5/test_3-5_0-4_131.py F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_linear - assert [] == [3, ...
========================= 1 failed, 2 passed in 0.09s ==========================

62 : Job ID 071fb5328d8f41b39441476f9cb6bb8f
test outcome: killed
find_duplicates.py, start pos: (44, 19), end pos: (44, 23)
operator: core/ZeroIterationForLoop, occurrence: 1
--- mutation diff ---
--- afind_duplicates.py
+++ bfind_duplicates.py
@@ -41,7 +41,7 @@
     output = []
-    for element in arr1:
+    for element in []:
         if binary_search(arr2, element) >= 0:
             output.append(element)
ts-3-5/test_3-5_0-4_131.py ..F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_131.py::test_duplicates_bin_search - assert [] == ...
========================= 1 failed, 2 passed in 0.09s ==========================
