   - [#  43] ZIL find_duplicates: 
--------------------------------------------------------------------------------
  17:     ptr_2 = 0
  18:     
  19:     while (ptr_1 < len(arr1) and ptr_2 < len(arr2)):
  20:         
- 21:         if arr2[ptr_2] == arr1[ptr_1]:
- 22:             output.append(arr1[ptr_1])
- 23:             ptr_1 += 1
- 24:             ptr_2 += 1
- 25:         elif arr2[ptr_2] > arr1[ptr_1]:
- 26:             ptr_1 += 1
- 27:         else:
- 28:             ptr_2 += 1
+ 21:         break
+ 22:     
+ 23:     
+ 24:     
+ 25:     
+ 26:     
+ 27:     
+ 28:     
  29:     
  30:     return output
  31: 
  32: def duplicates_bin_search(arr1, arr2):
--------------------------------------------------------------------------------
[0.16645 s] killed by ts-3-5/test_3-5_0-7_215.py::test_duplicates_pre_sorted_with_duplicates

def test_duplicates_pre_sorted_with_duplicates():
>       assert duplicates_pre_sorted([1, 2, 3], [2, 3, 4, 5]) == [2, 3]
E       AssertionError

ts-3-5/test_3-5_0-7_215.py:30: AssertionError

   - [#  44] ZIL find_duplicates: 
--------------------------------------------------------------------------------
  41:     
  42:     output = []
  43:     
  44:     for element in arr1:
- 45:         if binary_search(arr2, element) >= 0:
- 46:             output.append(element)
+ 45:         break
+ 46:     
  47:     
  48:     return output
--------------------------------------------------------------------------------
[0.16640 s] killed by ts-3-5/test_3-5_0-7_215.py::test_duplicates_bin_search_with_duplicates

def test_duplicates_bin_search_with_duplicates():
>       assert duplicates_bin_search([1, 2, 3], [2, 3, 4, 5]) == [2, 3]
E       AssertionError

ts-3-5/test_3-5_0-7_215.py:40: AssertionError
