1 : Job ID 355efcbfa217492d8e8102c46f7718e8
test outcome: killed
first_missing_positive.py, start pos: (44, 17), end pos: (44, 18)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -41,4 +41,4 @@
         else:
             nums[start], nums[i] = nums[i], nums[start]
-    return start + 1
+    return start - 1
ts-3-5/test_3-5_0-2_84.py FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 1 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - as...
============================== 7 failed in 0.08s ===============================

2 : Job ID d223976daf74460a8a8fa3afcab94484
test outcome: killed
first_missing_positive.py, start pos: (44, 17), end pos: (44, 18)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -41,4 +41,4 @@
         else:
             nums[start], nums[i] = nums[i], nums[start]
-    return start + 1
+    return start * 1
ts-3-5/test_3-5_0-2_84.py FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 2 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - as...
============================== 7 failed in 0.08s ===============================

3 : Job ID 19cc13465ea04698823b0eff35960fa0
test outcome: killed
first_missing_positive.py, start pos: (44, 17), end pos: (44, 18)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -41,4 +41,4 @@
         else:
             nums[start], nums[i] = nums[i], nums[start]
-    return start + 1
+    return start / 1
ts-3-5/test_3-5_0-2_84.py FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 2.0 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - as...
============================== 7 failed in 0.08s ===============================

4 : Job ID d11203b8bdbd41239f84308fade52e6b
test outcome: killed
first_missing_positive.py, start pos: (44, 17), end pos: (44, 18)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -41,4 +41,4 @@
         else:
             nums[start], nums[i] = nums[i], nums[start]
-    return start + 1
+    return start // 1
ts-3-5/test_3-5_0-2_84.py FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 2 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - as...
============================== 7 failed in 0.08s ===============================

5 : Job ID 873f451fb935453a890e2e32733e1382
test outcome: killed
first_missing_positive.py, start pos: (44, 17), end pos: (44, 18)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -41,4 +41,4 @@
         else:
             nums[start], nums[i] = nums[i], nums[start]
-    return start + 1
+    return start % 1
ts-3-5/test_3-5_0-2_84.py FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 0 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - as...
============================== 7 failed in 0.08s ===============================

6 : Job ID da970cbb2aa14824916f507931b689e0
test outcome: killed
first_missing_positive.py, start pos: (44, 17), end pos: (44, 18)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -41,4 +41,4 @@
         else:
             nums[start], nums[i] = nums[i], nums[start]
-    return start + 1
+    return start ** 1
ts-3-5/test_3-5_0-2_84.py FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 2 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - as...
============================== 7 failed in 0.08s ===============================

7 : Job ID f1c4e6b3f3204681b2d3c42dc130190a
test outcome: killed
first_missing_positive.py, start pos: (44, 17), end pos: (44, 18)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -41,4 +41,4 @@
         else:
             nums[start], nums[i] = nums[i], nums[start]
-    return start + 1
+    return start >> 1
ts-3-5/test_3-5_0-2_84.py FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 1 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - as...
============================== 7 failed in 0.08s ===============================

8 : Job ID b0d377333a7941179d19638ae07c2ef9
test outcome: killed
first_missing_positive.py, start pos: (44, 17), end pos: (44, 18)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -41,4 +41,4 @@
         else:
             nums[start], nums[i] = nums[i], nums[start]
-    return start + 1
+    return start << 1
ts-3-5/test_3-5_0-2_84.py F.FFF.F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 4 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - as...
========================= 5 failed, 2 passed in 0.07s ==========================

9 : Job ID dff9e8c38b81478fbcfea991916ddeea
test outcome: killed
first_missing_positive.py, start pos: (44, 17), end pos: (44, 18)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -41,4 +41,4 @@
         else:
             nums[start], nums[i] = nums[i], nums[start]
-    return start + 1
+    return start | 1
ts-3-5/test_3-5_0-2_84.py .F..FF.                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
========================= 3 failed, 4 passed in 0.07s ==========================

10 : Job ID e0dc4fe64116446b82820881b6c07d77
test outcome: killed
first_missing_positive.py, start pos: (44, 17), end pos: (44, 18)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -41,4 +41,4 @@
         else:
             nums[start], nums[i] = nums[i], nums[start]
-    return start + 1
+    return start & 1
ts-3-5/test_3-5_0-2_84.py FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 0 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - as...
============================== 7 failed in 0.08s ===============================

11 : Job ID 686ce248d1de42d2be74f028a901e044
test outcome: killed
first_missing_positive.py, start pos: (44, 17), end pos: (44, 18)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -41,4 +41,4 @@
         else:
             nums[start], nums[i] = nums[i], nums[start]
-    return start + 1
+    return start ^ 1
ts-3-5/test_3-5_0-2_84.py .F..FF.                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
========================= 3 failed, 4 passed in 0.08s ==========================

12 : Job ID 9d4bd8bdfaa84684a0e7e947cb6f9272
test outcome: killed
first_missing_positive.py, start pos: (28, 20), end pos: (28, 21)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -25,7 +25,7 @@
         present in the input list.
     """
     start = 0
-    end = len(nums) - 1
+    end = len(nums) + 1
     while start <= end:
         i = nums[start] - 1
         # if this element is in position
ts-3-5/test_3-5_0-2_84.py FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - IndexError: l...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - In...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - In...
============================== 7 failed in 0.08s ===============================

13 : Job ID e235a5ada1db44bc9dfd7f7098556e7a
test outcome: killed
first_missing_positive.py, start pos: (30, 24), end pos: (30, 25)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 1
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -27,7 +27,7 @@
     start = 0
     end = len(nums) - 1
     while start <= end:
-        i = nums[start] - 1
+        i = nums[start] + 1
         # if this element is in position
         if i == start:
             start += 1
ts-3-5/test_3-5_0-2_84.py F.F.FF.                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 1 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
========================= 4 failed, 3 passed in 0.08s ==========================

14 : Job ID ba417eb4b9984ecf8826fafaab4cfe03
test outcome: killed
first_missing_positive.py, start pos: (28, 20), end pos: (28, 21)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -25,7 +25,7 @@
         present in the input list.
     """
     start = 0
-    end = len(nums) - 1
+    end = len(nums) * 1
     while start <= end:
         i = nums[start] - 1
         # if this element is in position
ts-3-5/test_3-5_0-2_84.py FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - IndexError: l...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - In...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - In...
============================== 7 failed in 0.08s ===============================

15 : Job ID d8662313fc9e44038e227d80dc020e2e
test outcome: killed
first_missing_positive.py, start pos: (30, 24), end pos: (30, 25)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 1
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -27,7 +27,7 @@
     start = 0
     end = len(nums) - 1
     while start <= end:
-        i = nums[start] - 1
+        i = nums[start] * 1
         # if this element is in position
         if i == start:
             start += 1
ts-3-5/test_3-5_0-2_84.py FF..FF.                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 4 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
========================= 4 failed, 3 passed in 0.07s ==========================

16 : Job ID 77e4dce895ba4b699b9970327458b889
test outcome: killed
first_missing_positive.py, start pos: (28, 20), end pos: (28, 21)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -25,7 +25,7 @@
         present in the input list.
     """
     start = 0
-    end = len(nums) - 1
+    end = len(nums) / 1
     while start <= end:
         i = nums[start] - 1
         # if this element is in position
ts-3-5/test_3-5_0-2_84.py FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - TypeError: li...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - Ty...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - In...
============================== 7 failed in 0.08s ===============================

17 : Job ID 6ccb5e5bcbff4f60929c223d1e0a0ee9
test outcome: killed
first_missing_positive.py, start pos: (30, 24), end pos: (30, 25)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 1
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -27,7 +27,7 @@
     start = 0
     end = len(nums) - 1
     while start <= end:
-        i = nums[start] - 1
+        i = nums[start] / 1
         # if this element is in position
         if i == start:
             start += 1
ts-3-5/test_3-5_0-2_84.py FF..FF.                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - TypeError: li...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - Ty...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
========================= 4 failed, 3 passed in 0.07s ==========================

18 : Job ID 76c4557f33954462bf038700bf6c3537
test outcome: killed
first_missing_positive.py, start pos: (28, 20), end pos: (28, 21)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -25,7 +25,7 @@
         present in the input list.
     """
     start = 0
-    end = len(nums) - 1
+    end = len(nums) // 1
     while start <= end:
         i = nums[start] - 1
         # if this element is in position
ts-3-5/test_3-5_0-2_84.py FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - IndexError: l...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - In...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - In...
============================== 7 failed in 0.08s ===============================

19 : Job ID 9ed549be08d94c9aa66043e6a1467442
test outcome: killed
first_missing_positive.py, start pos: (30, 24), end pos: (30, 25)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 1
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -27,7 +27,7 @@
     start = 0
     end = len(nums) - 1
     while start <= end:
-        i = nums[start] - 1
+        i = nums[start] // 1
         # if this element is in position
         if i == start:
             start += 1
ts-3-5/test_3-5_0-2_84.py FF..FF.                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 4 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
========================= 4 failed, 3 passed in 0.08s ==========================

20 : Job ID f58d4881109f4c23bd75ddfad1e36d7a
test outcome: killed
first_missing_positive.py, start pos: (28, 20), end pos: (28, 21)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -25,7 +25,7 @@
         present in the input list.
     """
     start = 0
-    end = len(nums) - 1
+    end = len(nums) % 1
     while start <= end:
         i = nums[start] - 1
         # if this element is in position
ts-3-5/test_3-5_0-2_84.py FF..F.F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 2 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - In...
========================= 4 failed, 3 passed in 0.08s ==========================

21 : Job ID bc3649e138d347609979cccdc56c9cd8
test outcome: killed
first_missing_positive.py, start pos: (30, 24), end pos: (30, 25)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 1
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -27,7 +27,7 @@
     start = 0
     end = len(nums) - 1
     while start <= end:
-        i = nums[start] - 1
+        i = nums[start] % 1
         # if this element is in position
         if i == start:
             start += 1
timeout

22 : Job ID 624cf0b13a044e868ca920f4cac5b197
test outcome: killed
first_missing_positive.py, start pos: (28, 20), end pos: (28, 21)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -25,7 +25,7 @@
         present in the input list.
     """
     start = 0
-    end = len(nums) - 1
+    end = len(nums) ** 1
     while start <= end:
         i = nums[start] - 1
         # if this element is in position
ts-3-5/test_3-5_0-2_84.py FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - IndexError: l...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - In...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - In...
============================== 7 failed in 0.08s ===============================

23 : Job ID dbdcef20c5ef464a884900717a1fc1a0
test outcome: killed
first_missing_positive.py, start pos: (30, 24), end pos: (30, 25)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 1
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -27,7 +27,7 @@
     start = 0
     end = len(nums) - 1
     while start <= end:
-        i = nums[start] - 1
+        i = nums[start] ** 1
         # if this element is in position
         if i == start:
             start += 1
ts-3-5/test_3-5_0-2_84.py FF..FF.                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 4 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
========================= 4 failed, 3 passed in 0.07s ==========================

24 : Job ID 959a483cb30d43ba924d015fa4ee681c
test outcome: killed
first_missing_positive.py, start pos: (28, 20), end pos: (28, 21)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -25,7 +25,7 @@
         present in the input list.
     """
     start = 0
-    end = len(nums) - 1
+    end = len(nums) >> 1
     while start <= end:
         i = nums[start] - 1
         # if this element is in position
ts-3-5/test_3-5_0-2_84.py .F..F.F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - In...
========================= 3 failed, 4 passed in 0.07s ==========================

25 : Job ID d144f80c541742f98306e2e475e421ee
test outcome: killed
first_missing_positive.py, start pos: (30, 24), end pos: (30, 25)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 1
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -27,7 +27,7 @@
     start = 0
     end = len(nums) - 1
     while start <= end:
-        i = nums[start] - 1
+        i = nums[start] >> 1
         # if this element is in position
         if i == start:
             start += 1
timeout

26 : Job ID 3a691df3eba8431daf31ef31ecd295ed
test outcome: killed
first_missing_positive.py, start pos: (28, 20), end pos: (28, 21)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -25,7 +25,7 @@
         present in the input list.
     """
     start = 0
-    end = len(nums) - 1
+    end = len(nums) << 1
     while start <= end:
         i = nums[start] - 1
         # if this element is in position
ts-3-5/test_3-5_0-2_84.py FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - IndexError: l...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - In...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - In...
============================== 7 failed in 0.08s ===============================

27 : Job ID 08c29b14f32e47ca80744a7d099fa4fe
test outcome: killed
first_missing_positive.py, start pos: (30, 24), end pos: (30, 25)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 1
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -27,7 +27,7 @@
     start = 0
     end = len(nums) - 1
     while start <= end:
-        i = nums[start] - 1
+        i = nums[start] << 1
         # if this element is in position
         if i == start:
             start += 1
ts-3-5/test_3-5_0-2_84.py FF..FF.                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 2 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
========================= 4 failed, 3 passed in 0.08s ==========================
