28 : Job ID 7575d12ba5d14daab2866b4eda603536
test outcome: killed
first_missing_positive.py, start pos: (28, 20), end pos: (28, 21)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -25,7 +25,7 @@
         present in the input list.
     """
     start = 0
-    end = len(nums) - 1
+    end = len(nums) | 1
     while start <= end:
         i = nums[start] - 1
         # if this element is in position
ts-3-5/test_3-5_0-2_84.py FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - IndexError: l...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - In...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - In...
============================== 7 failed in 0.08s ===============================

29 : Job ID eea82eaa6f4847158270d02d219ee93a
test outcome: killed
first_missing_positive.py, start pos: (30, 24), end pos: (30, 25)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 1
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -27,7 +27,7 @@
     start = 0
     end = len(nums) - 1
     while start <= end:
-        i = nums[start] - 1
+        i = nums[start] | 1
         # if this element is in position
         if i == start:
             start += 1
timeout

30 : Job ID 449cf28c5cba4f7cb5ebde2d7bc8d656
test outcome: killed
first_missing_positive.py, start pos: (28, 20), end pos: (28, 21)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -25,7 +25,7 @@
         present in the input list.
     """
     start = 0
-    end = len(nums) - 1
+    end = len(nums) & 1
     while start <= end:
         i = nums[start] - 1
         # if this element is in position
ts-3-5/test_3-5_0-2_84.py .F..FFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - In...
========================= 4 failed, 3 passed in 0.08s ==========================

31 : Job ID be2c0ad7f99c46ff80d30cf56683db87
test outcome: killed
first_missing_positive.py, start pos: (30, 24), end pos: (30, 25)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 1
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -27,7 +27,7 @@
     start = 0
     end = len(nums) - 1
     while start <= end:
-        i = nums[start] - 1
+        i = nums[start] & 1
         # if this element is in position
         if i == start:
             start += 1
timeout

32 : Job ID 04e1e0eeceec4dde8d4575eae2b7e93a
test outcome: killed
first_missing_positive.py, start pos: (28, 20), end pos: (28, 21)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -25,7 +25,7 @@
         present in the input list.
     """
     start = 0
-    end = len(nums) - 1
+    end = len(nums) ^ 1
     while start <= end:
         i = nums[start] - 1
         # if this element is in position
ts-3-5/test_3-5_0-2_84.py .F..F.F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - In...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - In...
========================= 3 failed, 4 passed in 0.07s ==========================

33 : Job ID f1757b22c00b40ba90d3ba5ff6e2b852
test outcome: killed
first_missing_positive.py, start pos: (30, 24), end pos: (30, 25)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 1
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -27,7 +27,7 @@
     start = 0
     end = len(nums) - 1
     while start <= end:
-        i = nums[start] - 1
+        i = nums[start] ^ 1
         # if this element is in position
         if i == start:
             start += 1
ts-3-5/test_3-5_0-2_84.py ....F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
========================= 1 failed, 6 passed in 0.07s ==========================

34 : Job ID 7cbe30000da94bafbc6a8f83ca244d74
test outcome: killed
first_missing_positive.py, start pos: (32, 13), end pos: (32, 15)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -29,7 +29,7 @@
     while start <= end:
         i = nums[start] - 1
         # if this element is in position
-        if i == start:
+        if i != start:
             start += 1
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
ts-3-5/test_3-5_0-2_84.py FFFFFF.                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 2 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
========================= 6 failed, 1 passed in 0.10s ==========================

35 : Job ID 40b07577204046d2b57360f276f835f4
test outcome: killed
first_missing_positive.py, start pos: (37, 45), end pos: (37, 47)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 1
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -34,7 +34,7 @@
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
-        elif i < 0 or i > end or nums[start] == nums[i]:
+        elif i < 0 or i > end or nums[start] != nums[i]:
             nums[start] = nums[end]
             end -= 1
         # swap the element to where it should be
ts-3-5/test_3-5_0-2_84.py ....F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
========================= 1 failed, 6 passed in 0.07s ==========================

36 : Job ID 84a0cb1fbdda47d8aef62820111d7603
test outcome: killed
first_missing_positive.py, start pos: (32, 13), end pos: (32, 15)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -29,7 +29,7 @@
     while start <= end:
         i = nums[start] - 1
         # if this element is in position
-        if i == start:
+        if i < start:
             start += 1
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
ts-3-5/test_3-5_0-2_84.py FFF.FF.                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 2 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
========================= 5 failed, 2 passed in 0.08s ==========================

37 : Job ID 4eabcab195ce41c9b4be4d5c8a8b3d2f
test outcome: killed
first_missing_positive.py, start pos: (37, 45), end pos: (37, 47)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 1
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -34,7 +34,7 @@
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
-        elif i < 0 or i > end or nums[start] == nums[i]:
+        elif i < 0 or i > end or nums[start] < nums[i]:
             nums[start] = nums[end]
             end -= 1
         # swap the element to where it should be
ts-3-5/test_3-5_0-2_84.py ....F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
========================= 1 failed, 6 passed in 0.07s ==========================

38 : Job ID 43fabc1e487f4dc881fa54c8f77f5263
test outcome: killed
first_missing_positive.py, start pos: (32, 13), end pos: (32, 15)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -29,7 +29,7 @@
     while start <= end:
         i = nums[start] - 1
         # if this element is in position
-        if i == start:
+        if i <= start:
             start += 1
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
ts-3-5/test_3-5_0-2_84.py FFF.F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 4 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
========================= 4 failed, 3 passed in 0.08s ==========================

39 : Job ID 3c8e5a6b5e6440b9a6657be7304c938e
test outcome: killed
first_missing_positive.py, start pos: (37, 45), end pos: (37, 47)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 1
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -34,7 +34,7 @@
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
-        elif i < 0 or i > end or nums[start] == nums[i]:
+        elif i < 0 or i > end or nums[start] <= nums[i]:
             nums[start] = nums[end]
             end -= 1
         # swap the element to where it should be
ts-3-5/test_3-5_0-2_84.py ....F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
========================= 1 failed, 6 passed in 0.07s ==========================

40 : Job ID 88759fec2ae94ac4b0c47cebe3db83b8
test outcome: killed
first_missing_positive.py, start pos: (32, 13), end pos: (32, 15)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -29,7 +29,7 @@
     while start <= end:
         i = nums[start] - 1
         # if this element is in position
-        if i == start:
+        if i > start:
             start += 1
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
ts-3-5/test_3-5_0-2_84.py FF.FFF.                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 2 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
========================= 5 failed, 2 passed in 0.08s ==========================

41 : Job ID e9d3468129794dde94ff37b93cef0d7f
test outcome: killed
first_missing_positive.py, start pos: (37, 45), end pos: (37, 47)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 1
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -34,7 +34,7 @@
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
-        elif i < 0 or i > end or nums[start] == nums[i]:
+        elif i < 0 or i > end or nums[start] > nums[i]:
             nums[start] = nums[end]
             end -= 1
         # swap the element to where it should be
ts-3-5/test_3-5_0-2_84.py ....F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
========================= 1 failed, 6 passed in 0.07s ==========================

42 : Job ID 15c11d2bcc15498499633bd9ffbe5874
test outcome: killed
first_missing_positive.py, start pos: (32, 13), end pos: (32, 15)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -29,7 +29,7 @@
     while start <= end:
         i = nums[start] - 1
         # if this element is in position
-        if i == start:
+        if i >= start:
             start += 1
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
ts-3-5/test_3-5_0-2_84.py .F.F...                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
========================= 2 failed, 5 passed in 0.07s ==========================

43 : Job ID 6b1a0aae7e784e0f91c202e643c56f16
test outcome: killed
first_missing_positive.py, start pos: (37, 45), end pos: (37, 47)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 1
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -34,7 +34,7 @@
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
-        elif i < 0 or i > end or nums[start] == nums[i]:
+        elif i < 0 or i > end or nums[start] >= nums[i]:
             nums[start] = nums[end]
             end -= 1
         # swap the element to where it should be
ts-3-5/test_3-5_0-2_84.py ....F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
========================= 1 failed, 6 passed in 0.07s ==========================

44 : Job ID b9ce330ede82480bb1ee22e23d6d2dc1
SURVIVED
test outcome: survived
first_missing_positive.py, start pos: (32, 13), end pos: (32, 15)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -29,7 +29,7 @@
     while start <= end:
         i = nums[start] - 1
         # if this element is in position
-        if i == start:
+        if i is start:
             start += 1
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
ts-3-5/test_3-5_0-2_84.py .......                                        [100%]
============================== 7 passed in 0.07s ===============================

45 : Job ID 88ea6aeaecc748a3b5cea2d1631376ab
SURVIVED
test outcome: survived
first_missing_positive.py, start pos: (37, 45), end pos: (37, 47)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 1
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -34,7 +34,7 @@
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
-        elif i < 0 or i > end or nums[start] == nums[i]:
+        elif i < 0 or i > end or nums[start] is nums[i]:
             nums[start] = nums[end]
             end -= 1
         # swap the element to where it should be
ts-3-5/test_3-5_0-2_84.py .......                                        [100%]
============================== 7 passed in 0.07s ===============================

46 : Job ID 830c929ac8ce42289b7df642b34752fd
test outcome: killed
first_missing_positive.py, start pos: (32, 13), end pos: (32, 15)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -29,7 +29,7 @@
     while start <= end:
         i = nums[start] - 1
         # if this element is in position
-        if i == start:
+        if i is not start:
             start += 1
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
ts-3-5/test_3-5_0-2_84.py FFFFFF.                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 2 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
========================= 6 failed, 1 passed in 0.08s ==========================

47 : Job ID 46ba3a64ade2409ca45045924a8140cf
test outcome: killed
first_missing_positive.py, start pos: (37, 45), end pos: (37, 47)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 1
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -34,7 +34,7 @@
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
-        elif i < 0 or i > end or nums[start] == nums[i]:
+        elif i < 0 or i > end or nums[start] is not nums[i]:
             nums[start] = nums[end]
             end -= 1
         # swap the element to where it should be
ts-3-5/test_3-5_0-2_84.py ....F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
========================= 1 failed, 6 passed in 0.07s ==========================

48 : Job ID 672091b72de140cda16445d161392162
test outcome: killed
first_missing_positive.py, start pos: (37, 15), end pos: (37, 16)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -34,7 +34,7 @@
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
-        elif i < 0 or i > end or nums[start] == nums[i]:
+        elif i == 0 or i > end or nums[start] == nums[i]:
             nums[start] = nums[end]
             end -= 1
         # swap the element to where it should be
timeout

49 : Job ID 7934bc870e2240ce920aa6780a92c9c6
test outcome: killed
first_missing_positive.py, start pos: (37, 15), end pos: (37, 16)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -34,7 +34,7 @@
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
-        elif i < 0 or i > end or nums[start] == nums[i]:
+        elif i != 0 or i > end or nums[start] == nums[i]:
             nums[start] = nums[end]
             end -= 1
         # swap the element to where it should be
ts-3-5/test_3-5_0-2_84.py ....F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
========================= 1 failed, 6 passed in 0.07s ==========================

50 : Job ID 8e641ab971d948cb81436bebc59c3465
SURVIVED
test outcome: survived
first_missing_positive.py, start pos: (37, 15), end pos: (37, 16)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -34,7 +34,7 @@
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
-        elif i < 0 or i > end or nums[start] == nums[i]:
+        elif i <= 0 or i > end or nums[start] == nums[i]:
             nums[start] = nums[end]
             end -= 1
         # swap the element to where it should be
ts-3-5/test_3-5_0-2_84.py .......                                        [100%]
============================== 7 passed in 0.07s ===============================

51 : Job ID c9784a2e025d40a0a9b74f085f37ad7f
test outcome: killed
first_missing_positive.py, start pos: (37, 15), end pos: (37, 16)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -34,7 +34,7 @@
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
-        elif i < 0 or i > end or nums[start] == nums[i]:
+        elif i > 0 or i > end or nums[start] == nums[i]:
             nums[start] = nums[end]
             end -= 1
         # swap the element to where it should be
ts-3-5/test_3-5_0-2_84.py ..F.F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
========================= 2 failed, 5 passed in 0.07s ==========================

52 : Job ID f7156f4103604558ad95574eee243249
test outcome: killed
first_missing_positive.py, start pos: (37, 15), end pos: (37, 16)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -34,7 +34,7 @@
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
-        elif i < 0 or i > end or nums[start] == nums[i]:
+        elif i >= 0 or i > end or nums[start] == nums[i]:
             nums[start] = nums[end]
             end -= 1
         # swap the element to where it should be
ts-3-5/test_3-5_0-2_84.py ..F.F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
========================= 2 failed, 5 passed in 0.07s ==========================

53 : Job ID 78a1f0103ea7473da4f95428b4fac0e9
test outcome: killed
first_missing_positive.py, start pos: (29, 16), end pos: (29, 18)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -26,7 +26,7 @@
     """
     start = 0
     end = len(nums) - 1
-    while start <= end:
+    while start == end:
         i = nums[start] - 1
         # if this element is in position
         if i == start:
ts-3-5/test_3-5_0-2_84.py FF..F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 1 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
========================= 3 failed, 4 passed in 0.07s ==========================

54 : Job ID fbf990981d644f9aa0df5a3038f496be
test outcome: killed
first_missing_positive.py, start pos: (29, 16), end pos: (29, 18)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -26,7 +26,7 @@
     """
     start = 0
     end = len(nums) - 1
-    while start <= end:
+    while start != end:
         i = nums[start] - 1
         # if this element is in position
         if i == start:
ts-3-5/test_3-5_0-2_84.py ....FFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - In...
========================= 3 failed, 4 passed in 0.07s ==========================

55 : Job ID fd72fd500987450cb3613ae840fe2917
test outcome: killed
first_missing_positive.py, start pos: (29, 16), end pos: (29, 18)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -26,7 +26,7 @@
     """
     start = 0
     end = len(nums) - 1
-    while start <= end:
+    while start < end:
         i = nums[start] - 1
         # if this element is in position
         if i == start:
ts-3-5/test_3-5_0-2_84.py ....FF.                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
========================= 2 failed, 5 passed in 0.07s ==========================

56 : Job ID 080809eb9bde4d16bf1e4190775663f7
test outcome: killed
first_missing_positive.py, start pos: (29, 16), end pos: (29, 18)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -26,7 +26,7 @@
     """
     start = 0
     end = len(nums) - 1
-    while start <= end:
+    while start > end:
         i = nums[start] - 1
         # if this element is in position
         if i == start:
ts-3-5/test_3-5_0-2_84.py FF..FFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 1 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - In...
========================= 5 failed, 2 passed in 0.08s ==========================
