57 : Job ID 621080f292b54e468bf4c7a51ad334ed
test outcome: killed
first_missing_positive.py, start pos: (29, 16), end pos: (29, 18)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -26,7 +26,7 @@
     """
     start = 0
     end = len(nums) - 1
-    while start <= end:
+    while start >= end:
         i = nums[start] - 1
         # if this element is in position
         if i == start:
ts-3-5/test_3-5_0-2_84.py FF..FFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 1 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - In...
========================= 5 failed, 2 passed in 0.08s ==========================

58 : Job ID 57f76ce4243046e5a119e86467414dc2
test outcome: killed
first_missing_positive.py, start pos: (29, 16), end pos: (29, 18)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -26,7 +26,7 @@
     """
     start = 0
     end = len(nums) - 1
-    while start <= end:
+    while start is end:
         i = nums[start] - 1
         # if this element is in position
         if i == start:
ts-3-5/test_3-5_0-2_84.py FF..F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 1 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
========================= 3 failed, 4 passed in 0.07s ==========================

59 : Job ID 22ce0496de0d407ca2a8a5657324c489
test outcome: killed
first_missing_positive.py, start pos: (29, 16), end pos: (29, 18)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -26,7 +26,7 @@
     """
     start = 0
     end = len(nums) - 1
-    while start <= end:
+    while start is not end:
         i = nums[start] - 1
         # if this element is in position
         if i == start:
ts-3-5/test_3-5_0-2_84.py ....FFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - In...
========================= 3 failed, 4 passed in 0.07s ==========================

60 : Job ID e567630a60dc4d218131079301b9d7fd
test outcome: killed
first_missing_positive.py, start pos: (37, 24), end pos: (37, 25)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -34,7 +34,7 @@
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
-        elif i < 0 or i > end or nums[start] == nums[i]:
+        elif i < 0 or i == end or nums[start] == nums[i]:
             nums[start] = nums[end]
             end -= 1
         # swap the element to where it should be
ts-3-5/test_3-5_0-2_84.py ...FF..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
========================= 2 failed, 5 passed in 0.07s ==========================

61 : Job ID a9319a2792c8444f970ad1e854e88134
test outcome: killed
first_missing_positive.py, start pos: (37, 24), end pos: (37, 25)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -34,7 +34,7 @@
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
-        elif i < 0 or i > end or nums[start] == nums[i]:
+        elif i < 0 or i != end or nums[start] == nums[i]:
             nums[start] = nums[end]
             end -= 1
         # swap the element to where it should be
ts-3-5/test_3-5_0-2_84.py ....F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
========================= 1 failed, 6 passed in 0.07s ==========================

62 : Job ID 8b4e21181fc045158c91f0ad40fe46ca
test outcome: killed
first_missing_positive.py, start pos: (37, 24), end pos: (37, 25)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -34,7 +34,7 @@
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
-        elif i < 0 or i > end or nums[start] == nums[i]:
+        elif i < 0 or i < end or nums[start] == nums[i]:
             nums[start] = nums[end]
             end -= 1
         # swap the element to where it should be
ts-3-5/test_3-5_0-2_84.py ...FF..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
========================= 2 failed, 5 passed in 0.07s ==========================

63 : Job ID 7d7e6c2a1e0f415485ffe414aa24345a
test outcome: killed
first_missing_positive.py, start pos: (37, 24), end pos: (37, 25)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -34,7 +34,7 @@
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
-        elif i < 0 or i > end or nums[start] == nums[i]:
+        elif i < 0 or i <= end or nums[start] == nums[i]:
             nums[start] = nums[end]
             end -= 1
         # swap the element to where it should be
ts-3-5/test_3-5_0-2_84.py ...FF..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
========================= 2 failed, 5 passed in 0.08s ==========================

64 : Job ID d634274773384137ad1acda1fa8aff39
test outcome: killed
first_missing_positive.py, start pos: (37, 24), end pos: (37, 25)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -34,7 +34,7 @@
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
-        elif i < 0 or i > end or nums[start] == nums[i]:
+        elif i < 0 or i >= end or nums[start] == nums[i]:
             nums[start] = nums[end]
             end -= 1
         # swap the element to where it should be
ts-3-5/test_3-5_0-2_84.py ....F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
========================= 1 failed, 6 passed in 0.08s ==========================

65 : Job ID fae1e800b54a418b9bdb38b719f0ba32
test outcome: killed
first_missing_positive.py, start pos: (37, 24), end pos: (37, 25)
operator: core/ReplaceComparisonOperator_Gt_Is, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -34,7 +34,7 @@
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
-        elif i < 0 or i > end or nums[start] == nums[i]:
+        elif i < 0 or i is end or nums[start] == nums[i]:
             nums[start] = nums[end]
             end -= 1
         # swap the element to where it should be
ts-3-5/test_3-5_0-2_84.py ...FF..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
========================= 2 failed, 5 passed in 0.07s ==========================

66 : Job ID 9f3f6d4f8bac4a5eacd473a0c095f632
test outcome: killed
first_missing_positive.py, start pos: (37, 24), end pos: (37, 25)
operator: core/ReplaceComparisonOperator_Gt_IsNot, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -34,7 +34,7 @@
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
-        elif i < 0 or i > end or nums[start] == nums[i]:
+        elif i < 0 or i is not end or nums[start] == nums[i]:
             nums[start] = nums[end]
             end -= 1
         # swap the element to where it should be
ts-3-5/test_3-5_0-2_84.py ....F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
========================= 1 failed, 6 passed in 0.07s ==========================

67 : Job ID 74a089637f424888b4c72ce01fd1f7af
test outcome: killed
first_missing_positive.py, start pos: (29, 10), end pos: (29, 22)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -26,7 +26,7 @@
     """
     start = 0
     end = len(nums) - 1
-    while start <= end:
+    while not start <= end:
         i = nums[start] - 1
         # if this element is in position
         if i == start:
ts-3-5/test_3-5_0-2_84.py FF..FFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 1 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - In...
========================= 5 failed, 2 passed in 0.08s ==========================

68 : Job ID 4c004abfcb424955baf6a3f80d47a4c4
test outcome: killed
first_missing_positive.py, start pos: (32, 11), end pos: (32, 21)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -29,7 +29,7 @@
     while start <= end:
         i = nums[start] - 1
         # if this element is in position
-        if i == start:
+        if not i == start:
             start += 1
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
ts-3-5/test_3-5_0-2_84.py FFFFFF.                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 2 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
========================= 6 failed, 1 passed in 0.08s ==========================

69 : Job ID ed96744b522e44a2846c15fe347cde8e
test outcome: killed
first_missing_positive.py, start pos: (37, 19), end pos: (37, 21)
operator: core/ReplaceOrWithAnd, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -34,7 +34,7 @@
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
-        elif i < 0 or i > end or nums[start] == nums[i]:
+        elif i < 0 and i > end or nums[start] == nums[i]:
             nums[start] = nums[end]
             end -= 1
         # swap the element to where it should be
timeout

70 : Job ID 84e644ecda284edcba21cb85e9c795ff
test outcome: killed
first_missing_positive.py, start pos: (37, 30), end pos: (37, 32)
operator: core/ReplaceOrWithAnd, occurrence: 1
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -34,7 +34,7 @@
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
-        elif i < 0 or i > end or nums[start] == nums[i]:
+        elif i < 0 or i > end and nums[start] == nums[i]:
             nums[start] = nums[end]
             end -= 1
         # swap the element to where it should be
timeout

71 : Job ID 0e24368ded58415bbc0c2eb534367998
test outcome: killed
first_missing_positive.py, start pos: (27, 12), end pos: (27, 13)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -24,7 +24,7 @@
         The first integer greater than 0 that is not 
         present in the input list.
     """
-    start = 0
+    start = 1
     end = len(nums) - 1
     while start <= end:
         i = nums[start] - 1
ts-3-5/test_3-5_0-2_84.py ..FF..F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - as...
========================= 3 failed, 4 passed in 0.07s ==========================

72 : Job ID 07bdc2f23d9b45169dcb62d5f377abbb
test outcome: killed
first_missing_positive.py, start pos: (27, 12), end pos: (27, 13)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -24,7 +24,7 @@
         The first integer greater than 0 that is not 
         present in the input list.
     """
-    start = 0
+    start = -1
     end = len(nums) - 1
     while start <= end:
         i = nums[start] - 1
ts-3-5/test_3-5_0-2_84.py .FFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - In...
========================= 6 failed, 1 passed in 0.08s ==========================

73 : Job ID 460072465a784b10b351504377ddeb37
test outcome: killed
first_missing_positive.py, start pos: (28, 22), end pos: (28, 23)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -25,7 +25,7 @@
         present in the input list.
     """
     start = 0
-    end = len(nums) - 1
+    end = len(nums) - 2
     while start <= end:
         i = nums[start] - 1
         # if this element is in position
ts-3-5/test_3-5_0-2_84.py .F..FF.                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
========================= 3 failed, 4 passed in 0.08s ==========================

74 : Job ID 849248a2cfe44214b64211eef83fb6f3
test outcome: killed
first_missing_positive.py, start pos: (28, 22), end pos: (28, 23)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -25,7 +25,7 @@
         present in the input list.
     """
     start = 0
-    end = len(nums) - 1
+    end = len(nums) - 0
     while start <= end:
         i = nums[start] - 1
         # if this element is in position
ts-3-5/test_3-5_0-2_84.py FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - IndexError: l...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - In...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - In...
============================== 7 failed in 0.08s ===============================

75 : Job ID 93efb5d2cf4b4c2dba695d2916eec615
test outcome: killed
first_missing_positive.py, start pos: (30, 26), end pos: (30, 27)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -27,7 +27,7 @@
     start = 0
     end = len(nums) - 1
     while start <= end:
-        i = nums[start] - 1
+        i = nums[start] - 2
         # if this element is in position
         if i == start:
             start += 1
ts-3-5/test_3-5_0-2_84.py FF..FF.                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 2 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
========================= 4 failed, 3 passed in 0.08s ==========================

76 : Job ID 463ff4cdd3f74a02babfd495f46408c5
test outcome: killed
first_missing_positive.py, start pos: (30, 26), end pos: (30, 27)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -27,7 +27,7 @@
     start = 0
     end = len(nums) - 1
     while start <= end:
-        i = nums[start] - 1
+        i = nums[start] - 0
         # if this element is in position
         if i == start:
             start += 1
ts-3-5/test_3-5_0-2_84.py FF..FF.                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 4 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
========================= 4 failed, 3 passed in 0.07s ==========================

77 : Job ID 04bb6c00eeb24e2b811d7e26948ecfc7
test outcome: killed
first_missing_positive.py, start pos: (33, 21), end pos: (33, 22)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -30,7 +30,7 @@
         i = nums[start] - 1
         # if this element is in position
         if i == start:
-            start += 1
+            start += 2
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
ts-3-5/test_3-5_0-2_84.py .F..FF.                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
========================= 3 failed, 4 passed in 0.07s ==========================

78 : Job ID 4ffb56d694c045879df3d472298cb92c
test outcome: killed
first_missing_positive.py, start pos: (33, 21), end pos: (33, 22)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -30,7 +30,7 @@
         i = nums[start] - 1
         # if this element is in position
         if i == start:
-            start += 1
+            start += 0
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
timeout

79 : Job ID c83224b8871e4db69981fae4c0810d60
SURVIVED
test outcome: survived
first_missing_positive.py, start pos: (37, 17), end pos: (37, 18)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -34,7 +34,7 @@
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
-        elif i < 0 or i > end or nums[start] == nums[i]:
+        elif i < 1 or i > end or nums[start] == nums[i]:
             nums[start] = nums[end]
             end -= 1
         # swap the element to where it should be
ts-3-5/test_3-5_0-2_84.py .......                                        [100%]
============================== 7 passed in 0.07s ===============================

80 : Job ID 10bdaaffe5ae4b689c68d2adc8e49098
SURVIVED
test outcome: survived
first_missing_positive.py, start pos: (37, 17), end pos: (37, 18)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -34,7 +34,7 @@
         # if the element is negative or out of bounds 
         # or a duplicate that is already sorted swap the
         # current element into the oob and dec the end 
-        elif i < 0 or i > end or nums[start] == nums[i]:
+        elif i < -1 or i > end or nums[start] == nums[i]:
             nums[start] = nums[end]
             end -= 1
         # swap the element to where it should be
ts-3-5/test_3-5_0-2_84.py .......                                        [100%]
============================== 7 passed in 0.07s ===============================

81 : Job ID 9214aab2815d454bb8270a8cd2133cce
test outcome: killed
first_missing_positive.py, start pos: (39, 19), end pos: (39, 20)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -36,7 +36,7 @@
         # current element into the oob and dec the end 
         elif i < 0 or i > end or nums[start] == nums[i]:
             nums[start] = nums[end]
-            end -= 1
+            end -= 2
         # swap the element to where it should be
         else:
             nums[start], nums[i] = nums[i], nums[start]
ts-3-5/test_3-5_0-2_84.py ....F..                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
========================= 1 failed, 6 passed in 0.07s ==========================

82 : Job ID ec83ced6f9814c7fb9da440a3de73fea
test outcome: killed
first_missing_positive.py, start pos: (39, 19), end pos: (39, 20)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -36,7 +36,7 @@
         # current element into the oob and dec the end 
         elif i < 0 or i > end or nums[start] == nums[i]:
             nums[start] = nums[end]
-            end -= 1
+            end -= 0
         # swap the element to where it should be
         else:
             nums[start], nums[i] = nums[i], nums[start]
timeout

83 : Job ID c7a397be02a748acb75f11fb1277e6aa
test outcome: killed
first_missing_positive.py, start pos: (44, 19), end pos: (44, 20)
operator: core/NumberReplacer, occurrence: 12
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -41,4 +41,4 @@
         else:
             nums[start], nums[i] = nums[i], nums[start]
-    return start + 1
+    return start + 2
ts-3-5/test_3-5_0-2_84.py FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 4 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - as...
============================== 7 failed in 0.08s ===============================

84 : Job ID 1ebcd5b1ac514409bd04393a28a3e099
test outcome: killed
first_missing_positive.py, start pos: (44, 19), end pos: (44, 20)
operator: core/NumberReplacer, occurrence: 13
--- mutation diff ---
--- afirst_missing_positive.py
+++ bfirst_missing_positive.py
@@ -41,4 +41,4 @@
         else:
             nums[start], nums[i] = nums[i], nums[start]
-    return start + 1
+    return start + 0
ts-3-5/test_3-5_0-2_84.py FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive - assert 2 == 3
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_duplicates - as...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_negative_values
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_large_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_mixed_values - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_single_value - ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_first_missing_positive_empty_list - as...
============================== 7 failed in 0.08s ===============================
