1 : Job ID 8824b43305504645bb95ff04eb069834
test outcome: killed
fizz_buzz.py, start pos: (9, 43), end pos: (9, 44)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") - ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - TypeE...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - Ty...
========================= 4 failed, 1 passed in 0.07s ==========================

2 : Job ID d4eed8be324d4c658c0bc04f06e3a215
test outcome: killed
fizz_buzz.py, start pos: (9, 104), end pos: (9, 105)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n-1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

3 : Job ID 79ce72f3bf984a9cb5323eeb862b72e0
test outcome: killed
fizz_buzz.py, start pos: (9, 43), end pos: (9, 44)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") * ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - TypeE...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - Ty...
========================= 4 failed, 1 passed in 0.07s ==========================

4 : Job ID 110186ca306e4c83bb6818b76b69d5af
test outcome: killed
fizz_buzz.py, start pos: (9, 104), end pos: (9, 105)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n*1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

5 : Job ID 740f1068220c4090b9c0535ac2e3ff1c
test outcome: killed
fizz_buzz.py, start pos: (9, 43), end pos: (9, 44)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") / ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - TypeE...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - Ty...
========================= 4 failed, 1 passed in 0.07s ==========================

6 : Job ID 218aa70d74144761abea24f272ceb326
test outcome: killed
fizz_buzz.py, start pos: (9, 104), end pos: (9, 105)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n/1)]
ts-3-5/test_3-5_0-3_98.py FFFFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - TypeE...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - Ty...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_negative_input - TypeError: ...
============================== 5 failed in 0.07s ===============================

7 : Job ID d80580f771bf42289db15c4636cab024
test outcome: killed
fizz_buzz.py, start pos: (9, 43), end pos: (9, 44)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") // ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - TypeE...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - Ty...
========================= 4 failed, 1 passed in 0.07s ==========================

8 : Job ID 4c64da6e4f104cb68bdc81351977721d
test outcome: killed
fizz_buzz.py, start pos: (9, 104), end pos: (9, 105)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n//1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

9 : Job ID 010fd14a75b04179b357fdc3c4676630
test outcome: killed
fizz_buzz.py, start pos: (9, 43), end pos: (9, 44)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") % ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - TypeE...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - Ty...
========================= 4 failed, 1 passed in 0.07s ==========================

10 : Job ID aa11d9513f184381a1980d910d0a852a
test outcome: killed
fizz_buzz.py, start pos: (9, 104), end pos: (9, 105)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n%1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

11 : Job ID 357aeb43a8b44c848340ff3787adab33
test outcome: killed
fizz_buzz.py, start pos: (9, 43), end pos: (9, 44)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") ** ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - TypeE...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - Ty...
========================= 4 failed, 1 passed in 0.07s ==========================

12 : Job ID d38d32a33d714c11ac6e50278d4a9f29
test outcome: killed
fizz_buzz.py, start pos: (9, 104), end pos: (9, 105)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n**1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

13 : Job ID 0faf8c04ff9f42cab140d68a07a60585
test outcome: killed
fizz_buzz.py, start pos: (9, 43), end pos: (9, 44)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") >> ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - TypeE...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - Ty...
========================= 4 failed, 1 passed in 0.07s ==========================

14 : Job ID aee72195412e497a8f89ea55de3753cc
test outcome: killed
fizz_buzz.py, start pos: (9, 104), end pos: (9, 105)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n>>1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

15 : Job ID 0c209e1a8acb436290f4e211a16041c7
test outcome: killed
fizz_buzz.py, start pos: (9, 43), end pos: (9, 44)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") << ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - TypeE...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - Ty...
========================= 4 failed, 1 passed in 0.07s ==========================

16 : Job ID e81c0c2aff634d23a40c20ffba18ea2b
test outcome: killed
fizz_buzz.py, start pos: (9, 104), end pos: (9, 105)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n<<1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

17 : Job ID 270dfb6520d84b6ca4c0177e8a7c2c39
test outcome: killed
fizz_buzz.py, start pos: (9, 43), end pos: (9, 44)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") | ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - TypeE...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - Ty...
========================= 4 failed, 1 passed in 0.07s ==========================

18 : Job ID 0be8d9d32b8c470ba40ea19e5c19027b
test outcome: killed
fizz_buzz.py, start pos: (9, 104), end pos: (9, 105)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n|1)]
ts-3-5/test_3-5_0-3_98.py FFF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 3 failed, 2 passed in 0.07s ==========================

19 : Job ID a92b6a197eba4f7aa5d5f0e7f1e1ee2d
test outcome: killed
fizz_buzz.py, start pos: (9, 43), end pos: (9, 44)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") & ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - TypeE...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - Ty...
========================= 4 failed, 1 passed in 0.07s ==========================

20 : Job ID 7ed8bcf94d2e4c4d9dd9bff17f9934e6
test outcome: killed
fizz_buzz.py, start pos: (9, 104), end pos: (9, 105)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n&1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

21 : Job ID e195ce2b651e477fb0f35835bb41635a
test outcome: killed
fizz_buzz.py, start pos: (9, 43), end pos: (9, 44)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") ^ ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - TypeError: ...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - TypeE...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - Ty...
========================= 4 failed, 1 passed in 0.07s ==========================

22 : Job ID 2d47ce2947a54162848e1b6d576ef6a5
test outcome: killed
fizz_buzz.py, start pos: (9, 104), end pos: (9, 105)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n^1)]
ts-3-5/test_3-5_0-3_98.py FFF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 3 failed, 2 passed in 0.07s ==========================

23 : Job ID d127c3f54636477a99134be8f2880dcd
test outcome: killed
fizz_buzz.py, start pos: (9, 25), end pos: (9, 26)
operator: core/ReplaceBinaryOperator_Mod_Add, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x + 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 3 failed, 2 passed in 0.07s ==========================

24 : Job ID ccf27ac04ed0416f834792d3eb0ab3cf
test outcome: killed
fizz_buzz.py, start pos: (9, 58), end pos: (9, 59)
operator: core/ReplaceBinaryOperator_Mod_Add, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x + 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py .FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 2 failed, 3 passed in 0.07s ==========================

25 : Job ID ca86a240bf1945f5bfc1ab3674ee28f7
test outcome: killed
fizz_buzz.py, start pos: (9, 25), end pos: (9, 26)
operator: core/ReplaceBinaryOperator_Mod_Sub, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x - 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py ..F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 1 failed, 4 passed in 0.07s ==========================

26 : Job ID da354f8a4b804b34804aa85c4d3722b3
test outcome: killed
fizz_buzz.py, start pos: (9, 58), end pos: (9, 59)
operator: core/ReplaceBinaryOperator_Mod_Sub, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x - 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py ..F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 1 failed, 4 passed in 0.07s ==========================

27 : Job ID f1e5b0ad27e545af9de84a53e11a0a1e
test outcome: killed
fizz_buzz.py, start pos: (9, 25), end pos: (9, 26)
operator: core/ReplaceBinaryOperator_Mod_Mul, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x * 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 3 failed, 2 passed in 0.07s ==========================

28 : Job ID b49762abc4124773ab94442eccddec5b
test outcome: killed
fizz_buzz.py, start pos: (9, 58), end pos: (9, 59)
operator: core/ReplaceBinaryOperator_Mod_Mul, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x * 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py .FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 2 failed, 3 passed in 0.07s ==========================
