29 : Job ID e82f5148378c4d30b2ce90ce4f0c13b5
test outcome: killed
fizz_buzz.py, start pos: (9, 25), end pos: (9, 26)
operator: core/ReplaceBinaryOperator_Mod_Div, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x / 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 3 failed, 2 passed in 0.07s ==========================

30 : Job ID 4ab9c5525ca0499f8b03d3f23c4f037a
test outcome: killed
fizz_buzz.py, start pos: (9, 58), end pos: (9, 59)
operator: core/ReplaceBinaryOperator_Mod_Div, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x / 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py .FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 2 failed, 3 passed in 0.07s ==========================

31 : Job ID 3680159627ec414f8489d8ee6ccb6257
test outcome: killed
fizz_buzz.py, start pos: (9, 25), end pos: (9, 26)
operator: core/ReplaceBinaryOperator_Mod_FloorDiv, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x // 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

32 : Job ID 69b61ad09d924a658651ebeee92bef13
test outcome: killed
fizz_buzz.py, start pos: (9, 58), end pos: (9, 59)
operator: core/ReplaceBinaryOperator_Mod_FloorDiv, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x // 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

33 : Job ID bfa9e567dd8243af929eebba8c15f915
test outcome: killed
fizz_buzz.py, start pos: (9, 25), end pos: (9, 26)
operator: core/ReplaceBinaryOperator_Mod_Pow, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x ** 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 3 failed, 2 passed in 0.07s ==========================

34 : Job ID 5795880b82f745cfa4a9bab3888a8989
test outcome: killed
fizz_buzz.py, start pos: (9, 58), end pos: (9, 59)
operator: core/ReplaceBinaryOperator_Mod_Pow, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x ** 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py .FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 2 failed, 3 passed in 0.07s ==========================

35 : Job ID 4ca286f782eb4ceda44d829859584739
test outcome: killed
fizz_buzz.py, start pos: (9, 25), end pos: (9, 26)
operator: core/ReplaceBinaryOperator_Mod_RShift, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x >> 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

36 : Job ID ae4c043f833240ce80e3390f6eb7efaa
test outcome: killed
fizz_buzz.py, start pos: (9, 58), end pos: (9, 59)
operator: core/ReplaceBinaryOperator_Mod_RShift, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x >> 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

37 : Job ID 780975229fe54a6bb30728521233ace4
test outcome: killed
fizz_buzz.py, start pos: (9, 25), end pos: (9, 26)
operator: core/ReplaceBinaryOperator_Mod_LShift, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x << 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 3 failed, 2 passed in 0.07s ==========================

38 : Job ID 6aea8eb845a143d4875bb6446b0aafe8
test outcome: killed
fizz_buzz.py, start pos: (9, 58), end pos: (9, 59)
operator: core/ReplaceBinaryOperator_Mod_LShift, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x << 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py .FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 2 failed, 3 passed in 0.07s ==========================

39 : Job ID 71c256e7926d4a7b8ad28862458bf2c3
test outcome: killed
fizz_buzz.py, start pos: (9, 25), end pos: (9, 26)
operator: core/ReplaceBinaryOperator_Mod_BitOr, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x | 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 3 failed, 2 passed in 0.07s ==========================

40 : Job ID 295b477775224f2193a7894cd8b24bb1
test outcome: killed
fizz_buzz.py, start pos: (9, 58), end pos: (9, 59)
operator: core/ReplaceBinaryOperator_Mod_BitOr, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x | 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py .FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 2 failed, 3 passed in 0.07s ==========================

41 : Job ID f425dc3ab1484eb5b9589e2234f98c1e
test outcome: killed
fizz_buzz.py, start pos: (9, 25), end pos: (9, 26)
operator: core/ReplaceBinaryOperator_Mod_BitAnd, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x & 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 3 failed, 2 passed in 0.07s ==========================

42 : Job ID dded3c6562fb4c45b4c63c824f97da82
test outcome: killed
fizz_buzz.py, start pos: (9, 58), end pos: (9, 59)
operator: core/ReplaceBinaryOperator_Mod_BitAnd, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x & 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

43 : Job ID 469b865d9289415c9c24c73f5ba96976
test outcome: killed
fizz_buzz.py, start pos: (9, 25), end pos: (9, 26)
operator: core/ReplaceBinaryOperator_Mod_BitXor, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x ^ 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py ..F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 1 failed, 4 passed in 0.07s ==========================

44 : Job ID a634a431c0d946169e57d4cb2e9aeb7d
test outcome: killed
fizz_buzz.py, start pos: (9, 58), end pos: (9, 59)
operator: core/ReplaceBinaryOperator_Mod_BitXor, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x ^ 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py ..F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 1 failed, 4 passed in 0.07s ==========================

45 : Job ID d2ffbfe0f9fb4cf8b35976ebeae9df6e
test outcome: killed
fizz_buzz.py, start pos: (9, 29), end pos: (9, 31)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 != 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

46 : Job ID f9a9182825b84d95856958f3ef40c833
test outcome: killed
fizz_buzz.py, start pos: (9, 62), end pos: (9, 64)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 != 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

47 : Job ID 5ca90ecb19b34bff948691c4621b7666
test outcome: killed
fizz_buzz.py, start pos: (9, 29), end pos: (9, 31)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 < 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 3 failed, 2 passed in 0.07s ==========================

48 : Job ID 5cd9ff8c0b3c49d9a3ce79b84ebf3e5d
test outcome: killed
fizz_buzz.py, start pos: (9, 62), end pos: (9, 64)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 < 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py .FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 2 failed, 3 passed in 0.07s ==========================

49 : Job ID 0ea8d493c02b43208eb3b8a740bda9b9
SURVIVED
test outcome: survived
fizz_buzz.py, start pos: (9, 29), end pos: (9, 31)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 <= 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py .....                                          [100%]
============================== 5 passed in 0.07s ===============================

50 : Job ID 9ef6778602794ffa9f4da5164539c1f3
SURVIVED
test outcome: survived
fizz_buzz.py, start pos: (9, 62), end pos: (9, 64)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 <= 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py .....                                          [100%]
============================== 5 passed in 0.07s ===============================

51 : Job ID 2e95f24748d44a9c88498c767c1c9f98
test outcome: killed
fizz_buzz.py, start pos: (9, 29), end pos: (9, 31)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 > 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

52 : Job ID 8c07b8b4a5784f009c1af2b97c977ba6
test outcome: killed
fizz_buzz.py, start pos: (9, 62), end pos: (9, 64)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 > 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

53 : Job ID b803826724cb4afc86645ad2d171b909
test outcome: killed
fizz_buzz.py, start pos: (9, 29), end pos: (9, 31)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 >= 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

54 : Job ID 7451f76144b04fd88e657542e55022a1
test outcome: killed
fizz_buzz.py, start pos: (9, 62), end pos: (9, 64)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 >= 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

55 : Job ID 0d3e952c477545ceb7656716e150600a
test outcome: killed
fizz_buzz.py, start pos: (9, 23), end pos: (9, 33)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if not x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

56 : Job ID 50fbc1b7f54e43d187c776004a9d85d8
test outcome: killed
fizz_buzz.py, start pos: (9, 56), end pos: (9, 66)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if not x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

57 : Job ID ed33b744462e485bb6554b448e32624a
test outcome: killed
fizz_buzz.py, start pos: (9, 76), end pos: (9, 78)
operator: core/ReplaceOrWithAnd, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") and str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.08s ==========================

58 : Job ID 2c2ca813f48944fa9e51eeda06f1988d
test outcome: killed
fizz_buzz.py, start pos: (9, 27), end pos: (9, 28)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 4 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 3 failed, 2 passed in 0.07s ==========================
