59 : Job ID 8f744c86990144f9b00627c2fae57620
test outcome: killed
fizz_buzz.py, start pos: (9, 27), end pos: (9, 28)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 2 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

60 : Job ID 7ff950849d8049d5b268f0cad51fd6b7
test outcome: killed
fizz_buzz.py, start pos: (9, 32), end pos: (9, 33)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 1 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

61 : Job ID 365ebd40141944f38ab7e4107a56948e
test outcome: killed
fizz_buzz.py, start pos: (9, 32), end pos: (9, 33)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == -1 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 3 failed, 2 passed in 0.07s ==========================

62 : Job ID b74b1a02bd994227878057af4981f709
test outcome: killed
fizz_buzz.py, start pos: (9, 60), end pos: (9, 61)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 6 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py .FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 2 failed, 3 passed in 0.07s ==========================

63 : Job ID 57a92b4bff5944e6be127621fd2b8955
test outcome: killed
fizz_buzz.py, start pos: (9, 60), end pos: (9, 61)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 4 == 0 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py .FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 2 failed, 3 passed in 0.07s ==========================

64 : Job ID 0e4c72279c284d428f1e4bd8df366c2c
test outcome: killed
fizz_buzz.py, start pos: (9, 65), end pos: (9, 66)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 1 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

65 : Job ID e0982cc0192f41a798b3a8c3a77079d3
test outcome: killed
fizz_buzz.py, start pos: (9, 65), end pos: (9, 66)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == -1 else "") or str(x) for x in range(1,n+1)]
ts-3-5/test_3-5_0-3_98.py .FF..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
========================= 2 failed, 3 passed in 0.07s ==========================

66 : Job ID a39e0670947641e39f27248e0512b297
test outcome: killed
fizz_buzz.py, start pos: (9, 101), end pos: (9, 102)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range( 2,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

67 : Job ID e80a622b71264a7b954140cc177de274
test outcome: killed
fizz_buzz.py, start pos: (9, 101), end pos: (9, 102)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range( 0,n+1)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================

68 : Job ID 697f60e5c7ff42eda013d0b8aebfd08f
test outcome: killed
fizz_buzz.py, start pos: (9, 105), end pos: (9, 106)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+ 2)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.08s ==========================

69 : Job ID 12b2191ab28043c6a97224c92f42a05d
test outcome: killed
fizz_buzz.py, start pos: (9, 105), end pos: (9, 106)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- afizz_buzz.py
+++ bfizz_buzz.py
@@ -6,4 +6,4 @@
     divisible by both, add "FizzBuzz"
     """
-    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+1)]
+    return [("Fizz" if x % 3 == 0 else "") + ("Buzz" if x % 5 == 0 else "") or str(x) for x in range(1,n+ 0)]
ts-3-5/test_3-5_0-3_98.py FFFF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_5 - AssertionEr...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_divisible_by_3_and_5 - Asser...
FAILED ts-3-5/test_3-5_0-3_98.py::test_fizz_buzz_not_divisible_by_3_or_5 - As...
========================= 4 failed, 1 passed in 0.07s ==========================
