   - [#   1] AOR fizz_buzz: 
--------------------------------------------------------------------------------
  5:     divisible by 5, add "Buzz", if it is 
  6:     divisible by both, add "FizzBuzz"
  7: 
  8:     '''
- 9:     return [(('Fizz' if x % 3 == 0 else '') + ('Buzz' if x % 5 == 0 else '') or str(x)) for x in range(1, n + 1)]
+ 9:     return [(('Fizz' if x * 3 == 0 else '') + ('Buzz' if x % 5 == 0 else '') or str(x)) for x in range(1, n + 1)]
--------------------------------------------------------------------------------
[0.14576 s] killed by ts-3-5/test_3-5_0-9_271.py::test_fizz_buzz_divisible_by_three

def test_fizz_buzz_divisible_by_three():
        result = fizz_buzz(3)
>       assert result == ["1", "2", "Fizz"]
E       AssertionError

ts-3-5/test_3-5_0-9_271.py:13: AssertionError

   - [#   3] AOR fizz_buzz: 
--------------------------------------------------------------------------------
  5:     divisible by 5, add "Buzz", if it is 
  6:     divisible by both, add "FizzBuzz"
  7: 
  8:     '''
- 9:     return [(('Fizz' if x % 3 == 0 else '') + ('Buzz' if x % 5 == 0 else '') or str(x)) for x in range(1, n + 1)]
+ 9:     return [(('Fizz' if x % 3 == 0 else '') + ('Buzz' if x * 5 == 0 else '') or str(x)) for x in range(1, n + 1)]
--------------------------------------------------------------------------------
[0.13930 s] killed by ts-3-5/test_3-5_0-9_271.py::test_fizz_buzz_divisible_by_five

def test_fizz_buzz_divisible_by_five():
        result = fizz_buzz(5)
>       assert result == ["1", "2", "Fizz", "4", "Buzz"]
E       AssertionError

ts-3-5/test_3-5_0-9_271.py:17: AssertionError

   - [#   4] AOR fizz_buzz: 
--------------------------------------------------------------------------------
  5:     divisible by 5, add "Buzz", if it is 
  6:     divisible by both, add "FizzBuzz"
  7: 
  8:     '''
- 9:     return [(('Fizz' if x % 3 == 0 else '') + ('Buzz' if x % 5 == 0 else '') or str(x)) for x in range(1, n + 1)]
+ 9:     return [(('Fizz' if x % 3 == 0 else '') + ('Buzz' if x % 5 == 0 else '') or str(x)) for x in range(1, n - 1)]
--------------------------------------------------------------------------------
[0.13750 s] killed by ts-3-5/test_3-5_0-9_271.py::test_fizz_buzz_divisible_by_three

def test_fizz_buzz_divisible_by_three():
        result = fizz_buzz(3)
>       assert result == ["1", "2", "Fizz"]
E       AssertionError

ts-3-5/test_3-5_0-9_271.py:13: AssertionError

   - [#   5] LCR fizz_buzz: 
--------------------------------------------------------------------------------
  5:     divisible by 5, add "Buzz", if it is 
  6:     divisible by both, add "FizzBuzz"
  7: 
  8:     '''
- 9:     return [(('Fizz' if x % 3 == 0 else '') + ('Buzz' if x % 5 == 0 else '') or str(x)) for x in range(1, n + 1)]
+ 9:     return [(('Fizz' if x % 3 == 0 else '') + ('Buzz' if x % 5 == 0 else '') and str(x)) for x in range(1, n + 1)]
--------------------------------------------------------------------------------
[0.14157 s] killed by ts-3-5/test_3-5_0-9_271.py::test_fizz_buzz_divisible_by_three

def test_fizz_buzz_divisible_by_three():
        result = fizz_buzz(3)
>       assert result == ["1", "2", "Fizz"]
E       AssertionError

ts-3-5/test_3-5_0-9_271.py:13: AssertionError

   - [#   6] ROR fizz_buzz: 
--------------------------------------------------------------------------------
  5:     divisible by 5, add "Buzz", if it is 
  6:     divisible by both, add "FizzBuzz"
  7: 
  8:     '''
- 9:     return [(('Fizz' if x % 3 == 0 else '') + ('Buzz' if x % 5 == 0 else '') or str(x)) for x in range(1, n + 1)]
+ 9:     return [(('Fizz' if x % 3 != 0 else '') + ('Buzz' if x % 5 == 0 else '') or str(x)) for x in range(1, n + 1)]
--------------------------------------------------------------------------------
[0.14269 s] killed by ts-3-5/test_3-5_0-9_271.py::test_fizz_buzz_divisible_by_three

def test_fizz_buzz_divisible_by_three():
        result = fizz_buzz(3)
>       assert result == ["1", "2", "Fizz"]
E       AssertionError

ts-3-5/test_3-5_0-9_271.py:13: AssertionError

   - [#   7] ROR fizz_buzz: 
--------------------------------------------------------------------------------
  5:     divisible by 5, add "Buzz", if it is 
  6:     divisible by both, add "FizzBuzz"
  7: 
  8:     '''
- 9:     return [(('Fizz' if x % 3 == 0 else '') + ('Buzz' if x % 5 == 0 else '') or str(x)) for x in range(1, n + 1)]
+ 9:     return [(('Fizz' if x % 3 == 0 else '') + ('Buzz' if x % 5 != 0 else '') or str(x)) for x in range(1, n + 1)]
--------------------------------------------------------------------------------
[0.13971 s] killed by ts-3-5/test_3-5_0-9_271.py::test_fizz_buzz_divisible_by_three

def test_fizz_buzz_divisible_by_three():
        result = fizz_buzz(3)
>       assert result == ["1", "2", "Fizz"]
E       AssertionError

ts-3-5/test_3-5_0-9_271.py:13: AssertionError

   - [#   8] SDL fizz_buzz: 
--------------------------------------------------------------------------------
  5:     divisible by 5, add "Buzz", if it is 
  6:     divisible by both, add "FizzBuzz"
  7: 
  8:     '''
- 9:     return [(('Fizz' if x % 3 == 0 else '') + ('Buzz' if x % 5 == 0 else '') or str(x)) for x in range(1, n + 1)]
+ 9:     pass
--------------------------------------------------------------------------------
[0.14680 s] killed by ts-3-5/test_3-5_0-9_271.py::test_fizz_buzz_divisible_by_three

def test_fizz_buzz_divisible_by_three():
        result = fizz_buzz(3)
>       assert result == ["1", "2", "Fizz"]
E       AssertionError

ts-3-5/test_3-5_0-9_271.py:13: AssertionError
