1 : Job ID 2aa5d47fb4a94dd2a297e01058560436
SURVIVED
test outcome: survived
graph1.py, start pos: (131, 29), end pos: (131, 30)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -128,7 +128,7 @@
         self.adjacent = {}
     def __str__(self):
-        return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
+        return str(self.val) - ' adjacent: ' + str([x for x in self.adjacent])
     def add_adjacent(self, node, weight=0):
         self.adjacent[node] = weight
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

2 : Job ID 44dbc4bb3bf0436ab0e7ee58b3ef5ef9
SURVIVED
test outcome: survived
graph1.py, start pos: (131, 45), end pos: (131, 46)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -128,7 +128,7 @@
         self.adjacent = {}
     def __str__(self):
-        return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
+        return str(self.val) + ' adjacent: ' - str([x for x in self.adjacent])
     def add_adjacent(self, node, weight=0):
         self.adjacent[node] = weight
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

3 : Job ID 424f77dd14fe44b483d8825a4456be78
SURVIVED
test outcome: survived
graph1.py, start pos: (131, 29), end pos: (131, 30)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -128,7 +128,7 @@
         self.adjacent = {}
     def __str__(self):
-        return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
+        return str(self.val) * ' adjacent: ' + str([x for x in self.adjacent])
     def add_adjacent(self, node, weight=0):
         self.adjacent[node] = weight
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

4 : Job ID 55f2b15b70ee49f7ab095be9d2aef767
SURVIVED
test outcome: survived
graph1.py, start pos: (131, 45), end pos: (131, 46)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -128,7 +128,7 @@
         self.adjacent = {}
     def __str__(self):
-        return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
+        return str(self.val) + ' adjacent: ' * str([x for x in self.adjacent])
     def add_adjacent(self, node, weight=0):
         self.adjacent[node] = weight
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

5 : Job ID b2fa8e2664c84429a6f3238320b0b415
SURVIVED
test outcome: survived
graph1.py, start pos: (131, 29), end pos: (131, 30)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -128,7 +128,7 @@
         self.adjacent = {}
     def __str__(self):
-        return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
+        return str(self.val) / ' adjacent: ' + str([x for x in self.adjacent])
     def add_adjacent(self, node, weight=0):
         self.adjacent[node] = weight
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

6 : Job ID 527d2226d7fd4e8981522f5e1a837a4e
SURVIVED
test outcome: survived
graph1.py, start pos: (131, 45), end pos: (131, 46)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -128,7 +128,7 @@
         self.adjacent = {}
     def __str__(self):
-        return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
+        return str(self.val) + ' adjacent: ' / str([x for x in self.adjacent])
     def add_adjacent(self, node, weight=0):
         self.adjacent[node] = weight
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

7 : Job ID a29a9f9aa08a49d5b091e8092cf7eeb3
SURVIVED
test outcome: survived
graph1.py, start pos: (131, 29), end pos: (131, 30)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -128,7 +128,7 @@
         self.adjacent = {}
     def __str__(self):
-        return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
+        return str(self.val) // ' adjacent: ' + str([x for x in self.adjacent])
     def add_adjacent(self, node, weight=0):
         self.adjacent[node] = weight
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

8 : Job ID e02f6d61500c4121b0dec9a0d60edb92
SURVIVED
test outcome: survived
graph1.py, start pos: (131, 45), end pos: (131, 46)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -128,7 +128,7 @@
         self.adjacent = {}
     def __str__(self):
-        return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
+        return str(self.val) + ' adjacent: ' // str([x for x in self.adjacent])
     def add_adjacent(self, node, weight=0):
         self.adjacent[node] = weight
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

9 : Job ID ba7ce151a2874054974741a6b3b31f2e
SURVIVED
test outcome: survived
graph1.py, start pos: (131, 29), end pos: (131, 30)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -128,7 +128,7 @@
         self.adjacent = {}
     def __str__(self):
-        return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
+        return str(self.val) % ' adjacent: ' + str([x for x in self.adjacent])
     def add_adjacent(self, node, weight=0):
         self.adjacent[node] = weight
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

10 : Job ID b9a35bdf73574397bf4436db4be538ae
SURVIVED
test outcome: survived
graph1.py, start pos: (131, 45), end pos: (131, 46)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -128,7 +128,7 @@
         self.adjacent = {}
     def __str__(self):
-        return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
+        return str(self.val) + ' adjacent: ' % str([x for x in self.adjacent])
     def add_adjacent(self, node, weight=0):
         self.adjacent[node] = weight
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

11 : Job ID fd514e70e5d644f4a8b5b4de789a90e0
SURVIVED
test outcome: survived
graph1.py, start pos: (131, 29), end pos: (131, 30)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -128,7 +128,7 @@
         self.adjacent = {}
     def __str__(self):
-        return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
+        return str(self.val) ** ' adjacent: ' + str([x for x in self.adjacent])
     def add_adjacent(self, node, weight=0):
         self.adjacent[node] = weight
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

12 : Job ID 4d8c05f253514d34bb6028adff4d9f8a
SURVIVED
test outcome: survived
graph1.py, start pos: (131, 45), end pos: (131, 46)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -128,7 +128,7 @@
         self.adjacent = {}
     def __str__(self):
-        return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
+        return str(self.val) + ' adjacent: ' ** str([x for x in self.adjacent])
     def add_adjacent(self, node, weight=0):
         self.adjacent[node] = weight
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

13 : Job ID 3e0bf4a2388b4849ab63efc962b990ea
SURVIVED
test outcome: survived
graph1.py, start pos: (131, 29), end pos: (131, 30)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -128,7 +128,7 @@
         self.adjacent = {}
     def __str__(self):
-        return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
+        return str(self.val) >> ' adjacent: ' + str([x for x in self.adjacent])
     def add_adjacent(self, node, weight=0):
         self.adjacent[node] = weight
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

14 : Job ID 922df02cbae149a9be91385a0b8b277e
SURVIVED
test outcome: survived
graph1.py, start pos: (131, 45), end pos: (131, 46)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -128,7 +128,7 @@
         self.adjacent = {}
     def __str__(self):
-        return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
+        return str(self.val) + ' adjacent: ' >> str([x for x in self.adjacent])
     def add_adjacent(self, node, weight=0):
         self.adjacent[node] = weight
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.15s ===============================

15 : Job ID 3c08786bc56a4ba1837ea7e3635566c2
SURVIVED
test outcome: survived
graph1.py, start pos: (131, 29), end pos: (131, 30)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -128,7 +128,7 @@
         self.adjacent = {}
     def __str__(self):
-        return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
+        return str(self.val) << ' adjacent: ' + str([x for x in self.adjacent])
     def add_adjacent(self, node, weight=0):
         self.adjacent[node] = weight
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

16 : Job ID 28e19a997d854eb2801cffcaccf4e9f0
SURVIVED
test outcome: survived
graph1.py, start pos: (131, 45), end pos: (131, 46)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -128,7 +128,7 @@
         self.adjacent = {}
     def __str__(self):
-        return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
+        return str(self.val) + ' adjacent: ' << str([x for x in self.adjacent])
     def add_adjacent(self, node, weight=0):
         self.adjacent[node] = weight
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

17 : Job ID 3eb06edd7bbd47db8e5598368263913d
SURVIVED
test outcome: survived
graph1.py, start pos: (131, 29), end pos: (131, 30)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -128,7 +128,7 @@
         self.adjacent = {}
     def __str__(self):
-        return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
+        return str(self.val) | ' adjacent: ' + str([x for x in self.adjacent])
     def add_adjacent(self, node, weight=0):
         self.adjacent[node] = weight
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

18 : Job ID 8b8dc5604ac24a4c8dce93a100acd851
SURVIVED
test outcome: survived
graph1.py, start pos: (131, 45), end pos: (131, 46)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -128,7 +128,7 @@
         self.adjacent = {}
     def __str__(self):
-        return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
+        return str(self.val) + ' adjacent: ' | str([x for x in self.adjacent])
     def add_adjacent(self, node, weight=0):
         self.adjacent[node] = weight
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

19 : Job ID 54ce801197f546709b54a70c617beebc
SURVIVED
test outcome: survived
graph1.py, start pos: (131, 29), end pos: (131, 30)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -128,7 +128,7 @@
         self.adjacent = {}
     def __str__(self):
-        return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
+        return str(self.val) & ' adjacent: ' + str([x for x in self.adjacent])
     def add_adjacent(self, node, weight=0):
         self.adjacent[node] = weight
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

20 : Job ID 599c65ada9e448399f178e46676cfffb
SURVIVED
test outcome: survived
graph1.py, start pos: (131, 45), end pos: (131, 46)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -128,7 +128,7 @@
         self.adjacent = {}
     def __str__(self):
-        return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
+        return str(self.val) + ' adjacent: ' & str([x for x in self.adjacent])
     def add_adjacent(self, node, weight=0):
         self.adjacent[node] = weight
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

21 : Job ID 6feb9a0315af471ba62d7eacd4663752
SURVIVED
test outcome: survived
graph1.py, start pos: (131, 29), end pos: (131, 30)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -128,7 +128,7 @@
         self.adjacent = {}
     def __str__(self):
-        return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
+        return str(self.val) ^ ' adjacent: ' + str([x for x in self.adjacent])
     def add_adjacent(self, node, weight=0):
         self.adjacent[node] = weight
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.15s ===============================

22 : Job ID a32d2d064a2f4253a86c7e00c99b4b9d
SURVIVED
test outcome: survived
graph1.py, start pos: (131, 45), end pos: (131, 46)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -128,7 +128,7 @@
         self.adjacent = {}
     def __str__(self):
-        return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
+        return str(self.val) + ' adjacent: ' ^ str([x for x in self.adjacent])
     def add_adjacent(self, node, weight=0):
         self.adjacent[node] = weight
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

23 : Job ID 893a203868e74f56a9e9fc364bff52be
test outcome: killed
graph1.py, start pos: (57, 22), end pos: (57, 23)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -54,7 +54,7 @@
         """
-        visited = [0] * self.verticies
+        visited = [0] + self.verticies
         def valid(node):
             # print(visited, node)
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - TypeError: can only...
========================= 1 failed, 8 passed in 0.14s ==========================

24 : Job ID 5ee9278e05f146f79bb80706c8380f61
test outcome: killed
graph1.py, start pos: (57, 22), end pos: (57, 23)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -54,7 +54,7 @@
         """
-        visited = [0] * self.verticies
+        visited = [0] - self.verticies
         def valid(node):
             # print(visited, node)
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - TypeError: unsuppor...
========================= 1 failed, 8 passed in 0.14s ==========================

25 : Job ID 9c96acd78a4f40d38d9eb2315dd30972
test outcome: killed
graph1.py, start pos: (57, 22), end pos: (57, 23)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -54,7 +54,7 @@
         """
-        visited = [0] * self.verticies
+        visited = [0] / self.verticies
         def valid(node):
             # print(visited, node)
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - TypeError: unsuppor...
========================= 1 failed, 8 passed in 0.16s ==========================

26 : Job ID dbf5ce5a9dd347219390cdcdb3c718e7
test outcome: killed
graph1.py, start pos: (57, 22), end pos: (57, 23)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -54,7 +54,7 @@
         """
-        visited = [0] * self.verticies
+        visited = [0] // self.verticies
         def valid(node):
             # print(visited, node)
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - TypeError: unsuppor...
========================= 1 failed, 8 passed in 0.14s ==========================

27 : Job ID 1f0b399f16ef481f8c17c5c50c6d23f4
test outcome: killed
graph1.py, start pos: (57, 22), end pos: (57, 23)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -54,7 +54,7 @@
         """
-        visited = [0] * self.verticies
+        visited = [0] % self.verticies
         def valid(node):
             # print(visited, node)
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - TypeError: unsuppor...
========================= 1 failed, 8 passed in 0.14s ==========================

28 : Job ID 8df2e0be92bc40fcb57af44dc6001116
test outcome: killed
graph1.py, start pos: (57, 22), end pos: (57, 23)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -54,7 +54,7 @@
         """
-        visited = [0] * self.verticies
+        visited = [0] ** self.verticies
         def valid(node):
             # print(visited, node)
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - TypeError: unsuppor...
========================= 1 failed, 8 passed in 0.13s ==========================

29 : Job ID cfb199132b664b49b91c6ff327b38489
test outcome: killed
graph1.py, start pos: (57, 22), end pos: (57, 23)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -54,7 +54,7 @@
         """
-        visited = [0] * self.verticies
+        visited = [0] >> self.verticies
         def valid(node):
             # print(visited, node)
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - TypeError: unsuppor...
========================= 1 failed, 8 passed in 0.15s ==========================

30 : Job ID 4fd2319a3c7941e89c743dfd35c17cbf
test outcome: killed
graph1.py, start pos: (57, 22), end pos: (57, 23)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -54,7 +54,7 @@
         """
-        visited = [0] * self.verticies
+        visited = [0] << self.verticies
         def valid(node):
             # print(visited, node)
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - TypeError: unsuppor...
========================= 1 failed, 8 passed in 0.13s ==========================

31 : Job ID 9cf52ea9cc214ac5b53f30d4903e0721
test outcome: killed
graph1.py, start pos: (57, 22), end pos: (57, 23)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -54,7 +54,7 @@
         """
-        visited = [0] * self.verticies
+        visited = [0] | self.verticies
         def valid(node):
             # print(visited, node)
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - TypeError: unsuppor...
========================= 1 failed, 8 passed in 0.13s ==========================

32 : Job ID 24a7a117b61c4b1ba28995fee7b068b5
test outcome: killed
graph1.py, start pos: (57, 22), end pos: (57, 23)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -54,7 +54,7 @@
         """
-        visited = [0] * self.verticies
+        visited = [0] & self.verticies
         def valid(node):
             # print(visited, node)
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - TypeError: unsuppor...
========================= 1 failed, 8 passed in 0.13s ==========================

33 : Job ID 658a36ea62584acea47e75dc4ad69855
test outcome: killed
graph1.py, start pos: (57, 22), end pos: (57, 23)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -54,7 +54,7 @@
         """
-        visited = [0] * self.verticies
+        visited = [0] ^ self.verticies
         def valid(node):
             # print(visited, node)
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - TypeError: unsuppor...
========================= 1 failed, 8 passed in 0.13s ==========================

34 : Job ID 69fd7df5287c438886f804fa54328bd1
SURVIVED
test outcome: survived
graph1.py, start pos: (61, 29), end pos: (61, 31)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -58,7 +58,7 @@
         def valid(node):
             # print(visited, node)
-            if visited[node] == -1:
+            if visited[node] != -1:
                 return False
             elif visited[node] == 1:
                 return True
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

35 : Job ID 3ab6bdafbc6b4a27b10df1024ba64c1a
test outcome: killed
graph1.py, start pos: (63, 31), end pos: (63, 33)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -60,7 +60,7 @@
             # print(visited, node)
             if visited[node] == -1:
                 return False
-            elif visited[node] == 1:
+            elif visited[node] != 1:
                 return True
             visited[node] = -1
             for neighbor in self.graph[node]:
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - assert False == True
========================= 1 failed, 8 passed in 0.15s ==========================

36 : Job ID 26451500fba94af2a040dad82ca36998
test outcome: killed
graph1.py, start pos: (61, 29), end pos: (61, 31)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -58,7 +58,7 @@
         def valid(node):
             # print(visited, node)
-            if visited[node] == -1:
+            if visited[node] < -1:
                 return False
             elif visited[node] == 1:
                 return True
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - RecursionError: max...
========================= 1 failed, 8 passed in 0.14s ==========================

37 : Job ID 5957bb584b0a41229ddde84ecfba5f28
test outcome: killed
graph1.py, start pos: (63, 31), end pos: (63, 33)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -60,7 +60,7 @@
             # print(visited, node)
             if visited[node] == -1:
                 return False
-            elif visited[node] == 1:
+            elif visited[node] < 1:
                 return True
             visited[node] = -1
             for neighbor in self.graph[node]:
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - assert False == True
========================= 1 failed, 8 passed in 0.13s ==========================

38 : Job ID 306073497b754290904eb62aa92bc018
SURVIVED
test outcome: survived
graph1.py, start pos: (61, 29), end pos: (61, 31)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -58,7 +58,7 @@
         def valid(node):
             # print(visited, node)
-            if visited[node] == -1:
+            if visited[node] <= -1:
                 return False
             elif visited[node] == 1:
                 return True
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

39 : Job ID f2fc37a0632f44f4b439b02404ce6052
test outcome: killed
graph1.py, start pos: (63, 31), end pos: (63, 33)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -60,7 +60,7 @@
             # print(visited, node)
             if visited[node] == -1:
                 return False
-            elif visited[node] == 1:
+            elif visited[node] <= 1:
                 return True
             visited[node] = -1
             for neighbor in self.graph[node]:
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - assert False == True
========================= 1 failed, 8 passed in 0.14s ==========================

40 : Job ID 73e31768ca84431daa193b9c700b27e9
SURVIVED
test outcome: survived
graph1.py, start pos: (61, 29), end pos: (61, 31)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -58,7 +58,7 @@
         def valid(node):
             # print(visited, node)
-            if visited[node] == -1:
+            if visited[node] > -1:
                 return False
             elif visited[node] == 1:
                 return True
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

41 : Job ID 2fa37aa7c4ae4c9eae264ca693c6919f
SURVIVED
test outcome: survived
graph1.py, start pos: (63, 31), end pos: (63, 33)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -60,7 +60,7 @@
             # print(visited, node)
             if visited[node] == -1:
                 return False
-            elif visited[node] == 1:
+            elif visited[node] > 1:
                 return True
             visited[node] = -1
             for neighbor in self.graph[node]:
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================
