42 : Job ID 0f7a3cf417eb4c48a127517a175f2cdd
SURVIVED
test outcome: survived
graph1.py, start pos: (61, 29), end pos: (61, 31)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -58,7 +58,7 @@
         def valid(node):
             # print(visited, node)
-            if visited[node] == -1:
+            if visited[node] >= -1:
                 return False
             elif visited[node] == 1:
                 return True
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

43 : Job ID fa59d200551b405299eda9e0550bcb83
SURVIVED
test outcome: survived
graph1.py, start pos: (63, 31), end pos: (63, 33)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -60,7 +60,7 @@
             # print(visited, node)
             if visited[node] == -1:
                 return False
-            elif visited[node] == 1:
+            elif visited[node] >= 1:
                 return True
             visited[node] = -1
             for neighbor in self.graph[node]:
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

44 : Job ID aef922c74ed74a218807ae323c47c17f
SURVIVED
test outcome: survived
graph1.py, start pos: (61, 29), end pos: (61, 31)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -58,7 +58,7 @@
         def valid(node):
             # print(visited, node)
-            if visited[node] == -1:
+            if visited[node] is -1:
                 return False
             elif visited[node] == 1:
                 return True
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
=============================== warnings summary ===============================
graph1.py:61
  /home/lucca/teste/python_experiments2/graph1/graph1.py:61: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if visited[node] is -1:
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
========================= 9 passed, 1 warning in 0.14s =========================

45 : Job ID 80afda761f2647a8b799d9d76b2848f6
SURVIVED
test outcome: survived
graph1.py, start pos: (61, 29), end pos: (61, 31)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -58,7 +58,7 @@
         def valid(node):
             # print(visited, node)
-            if visited[node] == -1:
+            if visited[node] is not -1:
                 return False
             elif visited[node] == 1:
                 return True
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
=============================== warnings summary ===============================
graph1.py:61
  /home/lucca/teste/python_experiments2/graph1/graph1.py:61: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if visited[node] is not -1:
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
========================= 9 passed, 1 warning in 0.13s =========================

46 : Job ID e8ef7a75549547c19a4618bed2ae9112
test outcome: killed
graph1.py, start pos: (36, 27), end pos: (36, 28)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -33,7 +33,7 @@
             destination: the destination vertex
         """
-        if len(self.graph) > self.verticies:
+        if len(self.graph) == self.verticies:
             raise IndexError("Too many verticies in graph.")
         if source in self.graph:
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - IndexError: Too man...
========================= 1 failed, 8 passed in 0.13s ==========================

47 : Job ID d23fe54765064696a4bace39531bb5a8
test outcome: killed
graph1.py, start pos: (36, 27), end pos: (36, 28)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -33,7 +33,7 @@
             destination: the destination vertex
         """
-        if len(self.graph) > self.verticies:
+        if len(self.graph) != self.verticies:
             raise IndexError("Too many verticies in graph.")
         if source in self.graph:
ts-3-5/test_3-5_0-6_181.py ..FFF....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_add_edge - IndexError: Too many...
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - IndexError: Too man...
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_topological_sort - IndexError: ...
========================= 3 failed, 6 passed in 0.13s ==========================

48 : Job ID a5e046a2dd8e4d45821fc7cc86f59dd8
test outcome: killed
graph1.py, start pos: (36, 27), end pos: (36, 28)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -33,7 +33,7 @@
             destination: the destination vertex
         """
-        if len(self.graph) > self.verticies:
+        if len(self.graph) < self.verticies:
             raise IndexError("Too many verticies in graph.")
         if source in self.graph:
ts-3-5/test_3-5_0-6_181.py ..FFF....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_add_edge - IndexError: Too many...
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - IndexError: Too man...
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_topological_sort - IndexError: ...
========================= 3 failed, 6 passed in 0.14s ==========================

49 : Job ID f513381e84a64ae1969c6abe5702e2be
test outcome: killed
graph1.py, start pos: (36, 27), end pos: (36, 28)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -33,7 +33,7 @@
             destination: the destination vertex
         """
-        if len(self.graph) > self.verticies:
+        if len(self.graph) <= self.verticies:
             raise IndexError("Too many verticies in graph.")
         if source in self.graph:
ts-3-5/test_3-5_0-6_181.py ..FFF....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_add_edge - IndexError: Too many...
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - IndexError: Too man...
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_topological_sort - IndexError: ...
========================= 3 failed, 6 passed in 0.14s ==========================

50 : Job ID d4ebb9d7c35c4bf4b567699c5780f79f
test outcome: killed
graph1.py, start pos: (36, 27), end pos: (36, 28)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -33,7 +33,7 @@
             destination: the destination vertex
         """
-        if len(self.graph) > self.verticies:
+        if len(self.graph) >= self.verticies:
             raise IndexError("Too many verticies in graph.")
         if source in self.graph:
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - IndexError: Too man...
========================= 1 failed, 8 passed in 0.13s ==========================

51 : Job ID 5e5b6a41aa5d4af389c4d5fafc06ec5f
test outcome: killed
graph1.py, start pos: (36, 27), end pos: (36, 28)
operator: core/ReplaceComparisonOperator_Gt_Is, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -33,7 +33,7 @@
             destination: the destination vertex
         """
-        if len(self.graph) > self.verticies:
+        if len(self.graph) is self.verticies:
             raise IndexError("Too many verticies in graph.")
         if source in self.graph:
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - IndexError: Too man...
========================= 1 failed, 8 passed in 0.13s ==========================

52 : Job ID 674e519c40f44cdf925e5b344601ded6
test outcome: killed
graph1.py, start pos: (36, 27), end pos: (36, 28)
operator: core/ReplaceComparisonOperator_Gt_IsNot, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -33,7 +33,7 @@
             destination: the destination vertex
         """
-        if len(self.graph) > self.verticies:
+        if len(self.graph) is not self.verticies:
             raise IndexError("Too many verticies in graph.")
         if source in self.graph:
ts-3-5/test_3-5_0-6_181.py ..FFF....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_add_edge - IndexError: Too many...
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - IndexError: Too man...
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_topological_sort - IndexError: ...
========================= 3 failed, 6 passed in 0.14s ==========================

53 : Job ID ed677f6f051347729f3800a9bb3f113a
test outcome: killed
graph1.py, start pos: (61, 32), end pos: (61, 33)
operator: core/ReplaceUnaryOperator_USub_UAdd, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -58,7 +58,7 @@
         def valid(node):
             # print(visited, node)
-            if visited[node] == -1:
+            if visited[node] == +1:
                 return False
             elif visited[node] == 1:
                 return True
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - RecursionError: max...
========================= 1 failed, 8 passed in 0.14s ==========================

54 : Job ID 51a4571dfefc4e038251aca67b02eb76
test outcome: killed
graph1.py, start pos: (65, 28), end pos: (65, 29)
operator: core/ReplaceUnaryOperator_USub_UAdd, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -62,7 +62,7 @@
                 return False
             elif visited[node] == 1:
                 return True
-            visited[node] = -1
+            visited[node] = +1
             for neighbor in self.graph[node]:
                 if not valid(neighbor):
                     return False
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - assert False == True
========================= 1 failed, 8 passed in 0.13s ==========================

55 : Job ID 7d84ad57c8e34e0c9484318a2f619c66
test outcome: killed
graph1.py, start pos: (61, 32), end pos: (61, 33)
operator: core/ReplaceUnaryOperator_USub_Invert, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -58,7 +58,7 @@
         def valid(node):
             # print(visited, node)
-            if visited[node] == -1:
+            if visited[node] == ~1:
                 return False
             elif visited[node] == 1:
                 return True
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - RecursionError: max...
========================= 1 failed, 8 passed in 0.14s ==========================

56 : Job ID 56031e934496436f8ef17c3088d173c4
test outcome: killed
graph1.py, start pos: (65, 28), end pos: (65, 29)
operator: core/ReplaceUnaryOperator_USub_Invert, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -62,7 +62,7 @@
                 return False
             elif visited[node] == 1:
                 return True
-            visited[node] = -1
+            visited[node] = ~1
             for neighbor in self.graph[node]:
                 if not valid(neighbor):
                     return False
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - RecursionError: max...
========================= 1 failed, 8 passed in 0.14s ==========================

57 : Job ID e63e613590114d0e9f341d2d4cd07482
test outcome: killed
graph1.py, start pos: (61, 32), end pos: (61, 33)
operator: core/ReplaceUnaryOperator_USub_Not, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -58,7 +58,7 @@
         def valid(node):
             # print(visited, node)
-            if visited[node] == -1:
+            if visited[node] == not 1:
                 return False
             elif visited[node] == 1:
                 return True
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-6_181.py
!!!!!!!!!!!!!!!!!!!! Interrupted: 1 error during collection !!!!!!!!!!!!!!!!!!!!
=============================== 1 error in 0.28s ===============================

58 : Job ID 4acd48fc8da146c799d834d27bc73235
test outcome: killed
graph1.py, start pos: (65, 28), end pos: (65, 29)
operator: core/ReplaceUnaryOperator_USub_Not, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -62,7 +62,7 @@
                 return False
             elif visited[node] == 1:
                 return True
-            visited[node] = -1
+            visited[node] = not 1
             for neighbor in self.graph[node]:
                 if not valid(neighbor):
                     return False
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - RecursionError: max...
========================= 1 failed, 8 passed in 0.15s ==========================

59 : Job ID 5b722481097e474abed1892188d0fecf
test outcome: killed
graph1.py, start pos: (61, 32), end pos: (61, 33)
operator: core/ReplaceUnaryOperator_Delete_USub, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -58,7 +58,7 @@
         def valid(node):
             # print(visited, node)
-            if visited[node] == -1:
+            if visited[node] == 1:
                 return False
             elif visited[node] == 1:
                 return True
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - RecursionError: max...
========================= 1 failed, 8 passed in 0.14s ==========================

60 : Job ID f369faebb7074cc8959fb3b9d75e01e9
test outcome: killed
graph1.py, start pos: (65, 28), end pos: (65, 29)
operator: core/ReplaceUnaryOperator_Delete_USub, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -62,7 +62,7 @@
                 return False
             elif visited[node] == 1:
                 return True
-            visited[node] = -1
+            visited[node] = 1
             for neighbor in self.graph[node]:
                 if not valid(neighbor):
                     return False
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - assert False == True
========================= 1 failed, 8 passed in 0.13s ==========================

61 : Job ID df31643501f44667ab4e5b1e20aa545b
SURVIVED
test outcome: survived
graph1.py, start pos: (67, 19), end pos: (67, 22)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -64,7 +64,7 @@
                 return True
             visited[node] = -1
             for neighbor in self.graph[node]:
-                if not valid(neighbor):
+                if  valid(neighbor):
                     return False
             return True
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

62 : Job ID 3b4785b4b7434ff59161922258254847
test outcome: killed
graph1.py, start pos: (75, 15), end pos: (75, 18)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -72,7 +72,7 @@
             # dfs from each, mark as -1 when visited
             # after dfs set all -1 -> 1
             # cancel if find a 1, as its already been explored
-            if not visited[node]:
+            if  visited[node]:
                 # print(visited)
                 if valid(node):
                     # set all -1 to 1
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - assert False == True
========================= 1 failed, 8 passed in 0.14s ==========================

63 : Job ID 7753fe61b3b644b49f47dc7c5db00d50
test outcome: killed
graph1.py, start pos: (36, 11), end pos: (36, 43)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -33,7 +33,7 @@
             destination: the destination vertex
         """
-        if len(self.graph) > self.verticies:
+        if not len(self.graph) > self.verticies:
             raise IndexError("Too many verticies in graph.")
         if source in self.graph:
ts-3-5/test_3-5_0-6_181.py ..FFF....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_add_edge - IndexError: Too many...
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - IndexError: Too man...
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_topological_sort - IndexError: ...
========================= 3 failed, 6 passed in 0.13s ==========================

64 : Job ID 2ef436cca6e3472c8990a892484c771e
test outcome: killed
graph1.py, start pos: (39, 11), end pos: (39, 31)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -36,7 +36,7 @@
         if len(self.graph) > self.verticies:
             raise IndexError("Too many verticies in graph.")
-        if source in self.graph:
+        if not source in self.graph:
             self.graph[source].append(destination)
         else:
             self.graph[source] = [destination]
ts-3-5/test_3-5_0-6_181.py ..FFF....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_add_edge - KeyError: 1
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - KeyError: 0
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_topological_sort - KeyError: 0
========================= 3 failed, 6 passed in 0.14s ==========================

65 : Job ID 795b141d7efe422c99ee545af23e74b1
test outcome: killed
graph1.py, start pos: (44, 11), end pos: (44, 40)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -41,7 +41,7 @@
         else:
             self.graph[source] = [destination]
-        if destination not in self.graph:
+        if not destination not in self.graph:
             self.graph[destination] = []
     def has_cycle(self):
ts-3-5/test_3-5_0-6_181.py ..FFF....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_add_edge - assert {1: [2]} == {...
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - assert False == True
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_topological_sort - KeyError: 4
========================= 3 failed, 6 passed in 0.14s ==========================

66 : Job ID 5be872e0f53e49508c5402ca914dcd9b
SURVIVED
test outcome: survived
graph1.py, start pos: (61, 15), end pos: (61, 34)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -58,7 +58,7 @@
         def valid(node):
             # print(visited, node)
-            if visited[node] == -1:
+            if not visited[node] == -1:
                 return False
             elif visited[node] == 1:
                 return True
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

67 : Job ID 94d12a707c0c41d583c09089f7b3aa69
SURVIVED
test outcome: survived
graph1.py, start pos: (67, 19), end pos: (67, 38)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -64,7 +64,7 @@
                 return True
             visited[node] = -1
             for neighbor in self.graph[node]:
-                if not valid(neighbor):
+                if not not valid(neighbor):
                     return False
             return True
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

68 : Job ID b522a1f24eb94a62848388768fd5f49e
test outcome: killed
graph1.py, start pos: (75, 15), end pos: (75, 32)
operator: core/AddNot, occurrence: 5
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -72,7 +72,7 @@
             # dfs from each, mark as -1 when visited
             # after dfs set all -1 -> 1
             # cancel if find a 1, as its already been explored
-            if not visited[node]:
+            if not not visited[node]:
                 # print(visited)
                 if valid(node):
                     # set all -1 to 1
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - assert False == True
========================= 1 failed, 8 passed in 0.13s ==========================

69 : Job ID 4c91297b59dd4e34aeda36d1c868cda5
test outcome: killed
graph1.py, start pos: (77, 19), end pos: (77, 30)
operator: core/AddNot, occurrence: 6
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -74,7 +74,7 @@
             # cancel if find a 1, as its already been explored
             if not visited[node]:
                 # print(visited)
-                if valid(node):
+                if not valid(node):
                     # set all -1 to 1
                     visited = list(map(lambda x: abs(x),visited))
                 else:
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - assert False == True
========================= 1 failed, 8 passed in 0.14s ==========================

70 : Job ID e289fb2eccc1492e8b9a21ec375dd5f5
test outcome: killed
graph1.py, start pos: (113, 19), end pos: (113, 35)
operator: core/AddNot, occurrence: 7
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -110,7 +110,7 @@
         def dfs(vertex):
             visited.add(vertex)
             for j in self.graph[vertex]:
-                if j not in visited:
+                if not j not in visited:
                     dfs(j)
             stack.appendleft(vertex)
ts-3-5/test_3-5_0-6_181.py ....F....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_topological_sort - assert [4, 3...
========================= 1 failed, 8 passed in 0.15s ==========================

71 : Job ID 377dbbc9f947493c987bb431ff2360b9
test outcome: killed
graph1.py, start pos: (119, 15), end pos: (119, 33)
operator: core/AddNot, occurrence: 8
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -116,7 +116,7 @@
             stack.appendleft(vertex)
         for key, _ in self.graph.items():
-            if key not in visited:
+            if not key not in visited:
                 dfs(key)
         return list(stack)
ts-3-5/test_3-5_0-6_181.py ....F....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_topological_sort - assert [] ==...
========================= 1 failed, 8 passed in 0.15s ==========================

72 : Job ID f0c8c83d14c0421a84249d95310c1217
test outcome: killed
graph1.py, start pos: (152, 11), end pos: (152, 35)
operator: core/AddNot, occurrence: 9
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -149,7 +149,7 @@
         self.vertices[val] = vertex
     def add_edge(self, src, dst, weight=0):
-        if src not in self.vertices:
+        if not src not in self.vertices:
             self.add_vertex(src)
         if dst not in self.vertices:
             self.add_vertex(dst)
ts-3-5/test_3-5_0-6_181.py .......FF                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_weighted_graph_add_edge - KeyError: 1
FAILED ts-3-5/test_3-5_0-6_181.py::test_weighted_graph_remove_edge - KeyError: 1
========================= 2 failed, 7 passed in 0.14s ==========================

73 : Job ID 50e2852ac2c04426b96bd172779ac6e8
test outcome: killed
graph1.py, start pos: (154, 11), end pos: (154, 35)
operator: core/AddNot, occurrence: 10
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -151,7 +151,7 @@
     def add_edge(self, src, dst, weight=0):
         if src not in self.vertices:
             self.add_vertex(src)
-        if dst not in self.vertices:
+        if not dst not in self.vertices:
             self.add_vertex(dst)
         self.vertices[src].add_adjacent(dst, weight)
ts-3-5/test_3-5_0-6_181.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_weighted_graph_remove_edge - assert 2...
========================= 1 failed, 8 passed in 0.14s ==========================

74 : Job ID 386bf49cf56c42a19d9065edb4f6af0b
test outcome: killed
graph1.py, start pos: (159, 11), end pos: (159, 35)
operator: core/AddNot, occurrence: 11
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -156,7 +156,7 @@
         self.vertices[src].add_adjacent(dst, weight)
     def remove_edge(self, src, dst):
-        if src not in self.vertices:
+        if not src not in self.vertices:
             return
         if dst not in self.vertices:
             return
ts-3-5/test_3-5_0-6_181.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_weighted_graph_remove_edge - assert 2...
========================= 1 failed, 8 passed in 0.13s ==========================

75 : Job ID 234b20d8442841fdb52c3bf239212aba
test outcome: killed
graph1.py, start pos: (161, 11), end pos: (161, 35)
operator: core/AddNot, occurrence: 12
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -158,7 +158,7 @@
     def remove_edge(self, src, dst):
         if src not in self.vertices:
             return
-        if dst not in self.vertices:
+        if not dst not in self.vertices:
             return
         if dst in self.vertices[src].adjacent:
             self.vertices[src].remove_adjacent(dst)
ts-3-5/test_3-5_0-6_181.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_weighted_graph_remove_edge - assert 2...
========================= 1 failed, 8 passed in 0.14s ==========================

76 : Job ID eec205da8e8640f989af8bd150448c74
test outcome: killed
graph1.py, start pos: (163, 11), end pos: (163, 45)
operator: core/AddNot, occurrence: 13
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -160,6 +160,6 @@
             return
         if dst not in self.vertices:
             return
-        if dst in self.vertices[src].adjacent:
+        if not dst in self.vertices[src].adjacent:
             self.vertices[src].remove_adjacent(dst)
ts-3-5/test_3-5_0-6_181.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_weighted_graph_remove_edge - assert 2...
========================= 1 failed, 8 passed in 0.13s ==========================
