77 : Job ID 354f54a31dec4f3b8a7a8faea2bd84eb
SURVIVED
test outcome: survived
graph1.py, start pos: (64, 23), end pos: (64, 27)
operator: core/ReplaceTrueWithFalse, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -61,7 +61,7 @@
             if visited[node] == -1:
                 return False
             elif visited[node] == 1:
-                return True
+                return False
             visited[node] = -1
             for neighbor in self.graph[node]:
                 if not valid(neighbor):
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

78 : Job ID d891f100747b4bfaa62ea1cbc8be63e3
SURVIVED
test outcome: survived
graph1.py, start pos: (69, 19), end pos: (69, 23)
operator: core/ReplaceTrueWithFalse, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -66,7 +66,7 @@
             for neighbor in self.graph[node]:
                 if not valid(neighbor):
                     return False
-            return True
+            return False
         for node in range(self.verticies):
             # dfs from each, mark as -1 when visited
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

79 : Job ID b1cd51dbaca44d5e8a9e49369d81f91a
test outcome: killed
graph1.py, start pos: (82, 27), end pos: (82, 31)
operator: core/ReplaceTrueWithFalse, occurrence: 2
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -79,7 +79,7 @@
                     visited = list(map(lambda x: abs(x),visited))
                 else:
                     # cycle!
-                    return True
+                    return False
         # no cycle available
         return False
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - assert False == True
========================= 1 failed, 8 passed in 0.14s ==========================

80 : Job ID 30588c04824b4cd49a10d2a8ae3612ea
test outcome: killed
graph1.py, start pos: (62, 23), end pos: (62, 28)
operator: core/ReplaceFalseWithTrue, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -59,7 +59,7 @@
         def valid(node):
             # print(visited, node)
             if visited[node] == -1:
-                return False
+                return True
             elif visited[node] == 1:
                 return True
             visited[node] = -1
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - assert False == True
========================= 1 failed, 8 passed in 0.13s ==========================

81 : Job ID 772a56c8cdde438c91c0c25f8284b42f
test outcome: killed
graph1.py, start pos: (68, 27), end pos: (68, 32)
operator: core/ReplaceFalseWithTrue, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -65,7 +65,7 @@
             visited[node] = -1
             for neighbor in self.graph[node]:
                 if not valid(neighbor):
-                    return False
+                    return True
             return True
         for node in range(self.verticies):
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - assert False == True
========================= 1 failed, 8 passed in 0.13s ==========================

82 : Job ID d0dee8f08618452ebeacd690b25e26ed
SURVIVED
test outcome: survived
graph1.py, start pos: (84, 15), end pos: (84, 20)
operator: core/ReplaceFalseWithTrue, occurrence: 2
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -81,7 +81,7 @@
                     # cycle!
                     return True
         # no cycle available
-        return False
+        return True
     def topological_sort(self):
         """
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

83 : Job ID cba70c8524a4405dbcb42bfdd91e8399
test outcome: killed
graph1.py, start pos: (57, 19), end pos: (57, 20)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -54,7 +54,7 @@
         """
-        visited = [0] * self.verticies
+        visited = [ 1] * self.verticies
         def valid(node):
             # print(visited, node)
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - assert False == True
========================= 1 failed, 8 passed in 0.14s ==========================

84 : Job ID d1c8e97361a84b66bd1f9bd50498ff7a
test outcome: killed
graph1.py, start pos: (57, 19), end pos: (57, 20)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -54,7 +54,7 @@
         """
-        visited = [0] * self.verticies
+        visited = [ -1] * self.verticies
         def valid(node):
             # print(visited, node)
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - assert False == True
========================= 1 failed, 8 passed in 0.14s ==========================

85 : Job ID e263c070dbad4a09897535d85eec088d
test outcome: killed
graph1.py, start pos: (61, 33), end pos: (61, 34)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -58,7 +58,7 @@
         def valid(node):
             # print(visited, node)
-            if visited[node] == -1:
+            if visited[node] == - 2:
                 return False
             elif visited[node] == 1:
                 return True
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - RecursionError: max...
========================= 1 failed, 8 passed in 0.14s ==========================

86 : Job ID 29c5bde479694f3f8890ee0976bfc317
SURVIVED
test outcome: survived
graph1.py, start pos: (61, 33), end pos: (61, 34)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -58,7 +58,7 @@
         def valid(node):
             # print(visited, node)
-            if visited[node] == -1:
+            if visited[node] == - 0:
                 return False
             elif visited[node] == 1:
                 return True
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.15s ===============================

87 : Job ID 82691bc5d148426da4166c4a340cbf0b
SURVIVED
test outcome: survived
graph1.py, start pos: (63, 34), end pos: (63, 35)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -60,7 +60,7 @@
             # print(visited, node)
             if visited[node] == -1:
                 return False
-            elif visited[node] == 1:
+            elif visited[node] == 2:
                 return True
             visited[node] = -1
             for neighbor in self.graph[node]:
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

88 : Job ID c86c2a88aebf4ba094c40e0823847ce2
test outcome: killed
graph1.py, start pos: (63, 34), end pos: (63, 35)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -60,7 +60,7 @@
             # print(visited, node)
             if visited[node] == -1:
                 return False
-            elif visited[node] == 1:
+            elif visited[node] == 0:
                 return True
             visited[node] = -1
             for neighbor in self.graph[node]:
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - assert False == True
========================= 1 failed, 8 passed in 0.15s ==========================

89 : Job ID 2f4d3e2a40b545c9992e058a36742c25
test outcome: killed
graph1.py, start pos: (65, 29), end pos: (65, 30)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -62,7 +62,7 @@
                 return False
             elif visited[node] == 1:
                 return True
-            visited[node] = -1
+            visited[node] = - 2
             for neighbor in self.graph[node]:
                 if not valid(neighbor):
                     return False
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - RecursionError: max...
========================= 1 failed, 8 passed in 0.14s ==========================

90 : Job ID c82b33b0b7b240e59c58d8b01194a78e
test outcome: killed
graph1.py, start pos: (65, 29), end pos: (65, 30)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -62,7 +62,7 @@
                 return False
             elif visited[node] == 1:
                 return True
-            visited[node] = -1
+            visited[node] = - 0
             for neighbor in self.graph[node]:
                 if not valid(neighbor):
                     return False
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - RecursionError: max...
========================= 1 failed, 8 passed in 0.14s ==========================

91 : Job ID 248626c5f1784d18995c0ae6c6a94f79
SURVIVED
test outcome: survived
graph1.py, start pos: (133, 40), end pos: (133, 41)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -130,7 +130,7 @@
     def __str__(self):
         return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
-    def add_adjacent(self, node, weight=0):
+    def add_adjacent(self, node, weight= 1):
         self.adjacent[node] = weight
     def remove_adjacent(self, node):
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.13s ===============================

92 : Job ID d28e3c67100144a9ad95a3440a1dd6a3
SURVIVED
test outcome: survived
graph1.py, start pos: (133, 40), end pos: (133, 41)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -130,7 +130,7 @@
     def __str__(self):
         return str(self.val) + ' adjacent: ' + str([x for x in self.adjacent])
-    def add_adjacent(self, node, weight=0):
+    def add_adjacent(self, node, weight= -1):
         self.adjacent[node] = weight
     def remove_adjacent(self, node):
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.14s ===============================

93 : Job ID 8a5c142b97d049ffab5bf2e3ecfb4e11
SURVIVED
test outcome: survived
graph1.py, start pos: (151, 40), end pos: (151, 41)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -148,7 +148,7 @@
         vertex = WeightedGraphNode(val)
         self.vertices[val] = vertex
-    def add_edge(self, src, dst, weight=0):
+    def add_edge(self, src, dst, weight= 1):
         if src not in self.vertices:
             self.add_vertex(src)
         if dst not in self.vertices:
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.15s ===============================

94 : Job ID 1a66a6e17e5247e09ca9154eea2d6a48
SURVIVED
test outcome: survived
graph1.py, start pos: (151, 40), end pos: (151, 41)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -148,7 +148,7 @@
         vertex = WeightedGraphNode(val)
         self.vertices[val] = vertex
-    def add_edge(self, src, dst, weight=0):
+    def add_edge(self, src, dst, weight= -1):
         if src not in self.vertices:
             self.add_vertex(src)
         if dst not in self.vertices:
ts-3-5/test_3-5_0-6_181.py .........                                     [100%]
============================== 9 passed in 0.15s ===============================

95 : Job ID 370d8a271ec9422293d2299e3c1be80d
test outcome: killed
graph1.py, start pos: (66, 28), end pos: (66, 44)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -63,7 +63,7 @@
             elif visited[node] == 1:
                 return True
             visited[node] = -1
-            for neighbor in self.graph[node]:
+            for neighbor in []:
                 if not valid(neighbor):
                     return False
             return True
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - assert False == True
========================= 1 failed, 8 passed in 0.14s ==========================

96 : Job ID 921cb4bbf66344778c0c7e3e806b2cab
test outcome: killed
graph1.py, start pos: (71, 20), end pos: (71, 41)
operator: core/ZeroIterationForLoop, occurrence: 1
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -68,7 +68,7 @@
                     return False
             return True
-        for node in range(self.verticies):
+        for node in []:
             # dfs from each, mark as -1 when visited
             # after dfs set all -1 -> 1
             # cancel if find a 1, as its already been explored
ts-3-5/test_3-5_0-6_181.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_has_cycle - assert False == True
========================= 1 failed, 8 passed in 0.14s ==========================

97 : Job ID d187ecd12f454254b43ef304c305a52e
test outcome: killed
graph1.py, start pos: (112, 21), end pos: (112, 39)
operator: core/ZeroIterationForLoop, occurrence: 2
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -109,7 +109,7 @@
         def dfs(vertex):
             visited.add(vertex)
-            for j in self.graph[vertex]:
+            for j in []:
                 if j not in visited:
                     dfs(j)
ts-3-5/test_3-5_0-6_181.py ....F....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_topological_sort - assert [4, 3...
========================= 1 failed, 8 passed in 0.14s ==========================

98 : Job ID 27cb8b2286444462bfa2eec84b9415d0
test outcome: killed
graph1.py, start pos: (118, 22), end pos: (118, 40)
operator: core/ZeroIterationForLoop, occurrence: 3
--- mutation diff ---
--- agraph1.py
+++ bgraph1.py
@@ -115,7 +115,7 @@
             stack.appendleft(vertex)
-        for key, _ in self.graph.items():
+        for key, _ in []:
             if key not in visited:
                 dfs(key)
ts-3-5/test_3-5_0-6_181.py ....F....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_181.py::test_graph_topological_sort - assert [] ==...
========================= 1 failed, 8 passed in 0.14s ==========================
