   - [# 126] SVD graph1: 
--------------------------------------------------------------------------------
   32:             source: the source vertex
   33:             destination: the destination vertex
   34: 
   35:         '''
-  36:         if len(self.graph) > self.verticies:
+  36:         if len(self.graph) > verticies:
   37:             raise IndexError('Too many verticies in graph.')
   38:         
   39:         if source in self.graph:
   40:             self.graph[source].append(destination)
--------------------------------------------------------------------------------
[0.19930 s] killed by ts-3-5/test_3-5_0-6_192.py::test_graph_add_edge

def test_graph_add_edge():
        graph = Graph(3)
    
>       graph.add_edge(1, 2)

ts-3-5/test_3-5_0-6_192.py:29: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph1.Graph object at 0x7183484e0160>, source = 1, destination = 2

>   ???
E   NameError: name 'verticies' is not defined

graph1:36: NameError

   - [# 127] SVD graph1: 
--------------------------------------------------------------------------------
   35:         '''
   36:         if len(self.graph) > self.verticies:
   37:             raise IndexError('Too many verticies in graph.')
   38:         
-  39:         if source in self.graph:
+  39:         if source in graph:
   40:             self.graph[source].append(destination)
   41:         else:
   42:             self.graph[source] = [destination]
   43:         
--------------------------------------------------------------------------------
[0.19610 s] killed by ts-3-5/test_3-5_0-6_192.py::test_graph_add_edge

def test_graph_add_edge():
        graph = Graph(3)
    
>       graph.add_edge(1, 2)

ts-3-5/test_3-5_0-6_192.py:29: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph1.Graph object at 0x718347ff0520>, source = 1, destination = 2

>   ???
E   NameError: name 'graph' is not defined

graph1:39: NameError

   - [# 128] SVD graph1: 
--------------------------------------------------------------------------------
   36:         if len(self.graph) > self.verticies:
   37:             raise IndexError('Too many verticies in graph.')
   38:         
   39:         if source in self.graph:
-  40:             self.graph[source].append(destination)
+  40:             graph[source].append(destination)
   41:         else:
   42:             self.graph[source] = [destination]
   43:         
   44:         if destination not in self.graph:
--------------------------------------------------------------------------------
[0.19917 s] killed by ts-3-5/test_3-5_0-6_192.py::test_graph_has_cycle

def test_graph_has_cycle():
        graph = Graph(3)
        graph.add_edge(0, 1)
>       graph.add_edge(1, 2)

ts-3-5/test_3-5_0-6_192.py:36: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph1.Graph object at 0x718348592320>, source = 1, destination = 2

>   ???
E   NameError: name 'graph' is not defined

graph1:40: NameError

   - [# 129] SVD graph1: 
--------------------------------------------------------------------------------
   38:         
   39:         if source in self.graph:
   40:             self.graph[source].append(destination)
   41:         else:
-  42:             self.graph[source] = [destination]
+  42:             graph[source] = [destination]
   43:         
   44:         if destination not in self.graph:
   45:             self.graph[destination] = []
   46:     
--------------------------------------------------------------------------------
[0.20590 s] killed by ts-3-5/test_3-5_0-6_192.py::test_graph_add_edge

def test_graph_add_edge():
        graph = Graph(3)
    
>       graph.add_edge(1, 2)

ts-3-5/test_3-5_0-6_192.py:29: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph1.Graph object at 0x71834801d450>, source = 1, destination = 2

>   ???
E   NameError: name 'graph' is not defined

graph1:42: NameError

   - [# 130] SVD graph1: 
--------------------------------------------------------------------------------
   40:             self.graph[source].append(destination)
   41:         else:
   42:             self.graph[source] = [destination]
   43:         
-  44:         if destination not in self.graph:
+  44:         if destination not in graph:
   45:             self.graph[destination] = []
   46:     
   47:     def has_cycle(self):
   48:         '''
--------------------------------------------------------------------------------
[0.18928 s] killed by ts-3-5/test_3-5_0-6_192.py::test_graph_add_edge

def test_graph_add_edge():
        graph = Graph(3)
    
>       graph.add_edge(1, 2)

ts-3-5/test_3-5_0-6_192.py:29: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph1.Graph object at 0x718347f57040>, source = 1, destination = 2

>   ???
E   NameError: name 'graph' is not defined

graph1:44: NameError

   - [# 131] SVD graph1: 
--------------------------------------------------------------------------------
   41:         else:
   42:             self.graph[source] = [destination]
   43:         
   44:         if destination not in self.graph:
-  45:             self.graph[destination] = []
+  45:             graph[destination] = []
   46:     
   47:     def has_cycle(self):
   48:         '''
   49:         Detect if a graph has a cycle.
--------------------------------------------------------------------------------
[0.23037 s] killed by ts-3-5/test_3-5_0-6_192.py::test_graph_add_edge

def test_graph_add_edge():
        graph = Graph(3)
    
>       graph.add_edge(1, 2)

ts-3-5/test_3-5_0-6_192.py:29: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph1.Graph object at 0x718347f39ba0>, source = 1, destination = 2

>   ???
E   NameError: name 'graph' is not defined

graph1:45: NameError

   - [# 132] SVD graph1: 
--------------------------------------------------------------------------------
   53:             False if the graph is acyclic.
   54: 
   55:         '''
   56:         
-  57:         visited = [0] * self.verticies
+  57:         visited = [0] * verticies
   58:         
   59:         def valid(node):
   60:             
   61:             if visited[node] == -1:
--------------------------------------------------------------------------------
[0.20197 s] killed by ts-3-5/test_3-5_0-6_192.py::test_graph_has_cycle

def test_graph_has_cycle():
        graph = Graph(3)
        graph.add_edge(0, 1)
        graph.add_edge(1, 2)
        graph.add_edge(2, 0)
    
>       assert graph.has_cycle() == True

ts-3-5/test_3-5_0-6_192.py:39: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph1.Graph object at 0x7183481d1ff0>

>   ???
E   NameError: name 'verticies' is not defined

graph1:57: NameError

   - [# 133] SVD graph1: 
--------------------------------------------------------------------------------
   62:                 return False
   63:             elif visited[node] == 1:
   64:                 return True
   65:             visited[node] = -1
-  66:             for neighbor in self.graph[node]:
+  66:             for neighbor in graph[node]:
   67:                 if not (valid(neighbor)):
   68:                     return False
   69:             return True
   70:         
--------------------------------------------------------------------------------
[0.19963 s] killed by ts-3-5/test_3-5_0-6_192.py::test_graph_has_cycle

def test_graph_has_cycle():
        graph = Graph(3)
        graph.add_edge(0, 1)
        graph.add_edge(1, 2)
        graph.add_edge(2, 0)
    
>       assert graph.has_cycle() == True

ts-3-5/test_3-5_0-6_192.py:39: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
graph1:77: in has_cycle
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

node = 0

>   ???
E   NameError: name 'graph' is not defined

graph1:66: NameError

   - [# 134] SVD graph1: 
--------------------------------------------------------------------------------
   67:                 if not (valid(neighbor)):
   68:                     return False
   69:             return True
   70:         
-  71:         for node in range(self.verticies):
+  71:         for node in range(verticies):
   72:             
   73:             
   74:             
   75:             if not (visited[node]):
--------------------------------------------------------------------------------
[0.20699 s] killed by ts-3-5/test_3-5_0-6_192.py::test_graph_has_cycle

def test_graph_has_cycle():
        graph = Graph(3)
        graph.add_edge(0, 1)
        graph.add_edge(1, 2)
        graph.add_edge(2, 0)
    
>       assert graph.has_cycle() == True

ts-3-5/test_3-5_0-6_192.py:39: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph1.Graph object at 0x718347ec4e50>

>   ???
E   NameError: name 'verticies' is not defined

graph1:71: NameError

   - [# 135] SVD graph1: 
--------------------------------------------------------------------------------
  108:         stack = deque()
  109:         
  110:         def dfs(vertex):
  111:             visited.add(vertex)
- 112:             for j in self.graph[vertex]:
+ 112:             for j in graph[vertex]:
  113:                 if j not in visited:
  114:                     dfs(j)
  115:             
  116:             stack.appendleft(vertex)
--------------------------------------------------------------------------------
[0.19345 s] survived

   - [# 136] SVD graph1: 
--------------------------------------------------------------------------------
  114:                     dfs(j)
  115:             
  116:             stack.appendleft(vertex)
  117:         
- 118:         for (key, _) in self.graph.items():
+ 118:         for (key, _) in graph.items():
  119:             if key not in visited:
  120:                 dfs(key)
  121:         
  122:         return list(stack)
--------------------------------------------------------------------------------
[0.17610 s] survived

   - [# 139] SVD graph1: 
--------------------------------------------------------------------------------
  127:         self.val = val
  128:         self.adjacent = {}
  129:     
  130:     def __str__(self):
- 131:         return (str(self.val) + ' adjacent: ') + str([x for x in self.adjacent])
+ 131:         return (str(val) + ' adjacent: ') + str([x for x in self.adjacent])
  132:     
  133:     def add_adjacent(self, node, weight=0):
  134:         self.adjacent[node] = weight
  135:     
--------------------------------------------------------------------------------
[0.17659 s] survived

   - [# 140] SVD graph1: 
--------------------------------------------------------------------------------
  127:         self.val = val
  128:         self.adjacent = {}
  129:     
  130:     def __str__(self):
- 131:         return (str(self.val) + ' adjacent: ') + str([x for x in self.adjacent])
+ 131:         return (str(self.val) + ' adjacent: ') + str([x for x in adjacent])
  132:     
  133:     def add_adjacent(self, node, weight=0):
  134:         self.adjacent[node] = weight
  135:     
--------------------------------------------------------------------------------
[0.17580 s] survived

   - [# 141] SVD graph1: 
--------------------------------------------------------------------------------
  130:     def __str__(self):
  131:         return (str(self.val) + ' adjacent: ') + str([x for x in self.adjacent])
  132:     
  133:     def add_adjacent(self, node, weight=0):
- 134:         self.adjacent[node] = weight
+ 134:         adjacent[node] = weight
  135:     
  136:     def remove_adjacent(self, node):
  137:         del self.adjacent[node]
  138: 
--------------------------------------------------------------------------------
[0.20468 s] killed by ts-3-5/test_3-5_0-6_192.py::test_weighted_graph_node_add_adjacent

def test_weighted_graph_node_add_adjacent():
        node1 = WeightedGraphNode(1)
        node2 = WeightedGraphNode(2)
    
>       node1.add_adjacent(node2, 5)

ts-3-5/test_3-5_0-6_192.py:45: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph1.WeightedGraphNode object at 0x7183481d26e0>
node = <graph1.WeightedGraphNode object at 0x7183481d3670>, weight = 5

>   ???
E   NameError: name 'adjacent' is not defined

graph1:134: NameError

   - [# 142] SVD graph1: 
--------------------------------------------------------------------------------
  133:     def add_adjacent(self, node, weight=0):
  134:         self.adjacent[node] = weight
  135:     
  136:     def remove_adjacent(self, node):
- 137:         del self.adjacent[node]
+ 137:         del adjacent[node]
  138: 
  139: class WeightedGraph:
  140:     
  141:     def __init__(self):
--------------------------------------------------------------------------------
[0.19590 s] killed by ts-3-5/test_3-5_0-6_192.py::test_weighted_graph_remove_edge

def test_weighted_graph_remove_edge():
        weighted_graph = WeightedGraph()
    
        weighted_graph.add_edge(1, 2, 3)
>       weighted_graph.remove_edge(1, 2)

ts-3-5/test_3-5_0-6_192.py:60: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
graph1:164: in remove_edge
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph1.WeightedGraphNode object at 0x718347f2cbb0>, node = 2

>   ???
E   NameError: name 'adjacent' is not defined

graph1:137: NameError

   - [# 144] SVD graph1: 
--------------------------------------------------------------------------------
  141:     def __init__(self):
  142:         self.vertices = {}
  143:     
  144:     def __str__(self):
- 145:         return ', '.join([node.__str__() for node in self.vertices.values()])
+ 145:         return ', '.join([node.__str__() for node in vertices.values()])
  146:     
  147:     def add_vertex(self, val):
  148:         vertex = WeightedGraphNode(val)
  149:         self.vertices[val] = vertex
--------------------------------------------------------------------------------
[0.17595 s] survived

   - [# 145] SVD graph1: 
--------------------------------------------------------------------------------
  145:         return ', '.join([node.__str__() for node in self.vertices.values()])
  146:     
  147:     def add_vertex(self, val):
  148:         vertex = WeightedGraphNode(val)
- 149:         self.vertices[val] = vertex
+ 149:         vertices[val] = vertex
  150:     
  151:     def add_edge(self, src, dst, weight=0):
  152:         if src not in self.vertices:
  153:             self.add_vertex(src)
--------------------------------------------------------------------------------
[0.19968 s] killed by ts-3-5/test_3-5_0-6_192.py::test_weighted_graph_add_edge

def test_weighted_graph_add_edge():
        weighted_graph = WeightedGraph()
    
>       weighted_graph.add_edge(1, 2, 3)

ts-3-5/test_3-5_0-6_192.py:52: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
graph1:153: in add_edge
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph1.WeightedGraph object at 0x718348442650>, val = 1

>   ???
E   NameError: name 'vertices' is not defined

graph1:149: NameError

   - [# 146] SVD graph1: 
--------------------------------------------------------------------------------
  148:         vertex = WeightedGraphNode(val)
  149:         self.vertices[val] = vertex
  150:     
  151:     def add_edge(self, src, dst, weight=0):
- 152:         if src not in self.vertices:
+ 152:         if src not in vertices:
  153:             self.add_vertex(src)
  154:         if dst not in self.vertices:
  155:             self.add_vertex(dst)
  156:         self.vertices[src].add_adjacent(dst, weight)
--------------------------------------------------------------------------------
[0.19771 s] killed by ts-3-5/test_3-5_0-6_192.py::test_weighted_graph_add_edge

def test_weighted_graph_add_edge():
        weighted_graph = WeightedGraph()
    
>       weighted_graph.add_edge(1, 2, 3)

ts-3-5/test_3-5_0-6_192.py:52: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph1.WeightedGraph object at 0x718347de4b80>, src = 1, dst = 2
weight = 3

>   ???
E   NameError: name 'vertices' is not defined

graph1:152: NameError

   - [# 147] SVD graph1: 
--------------------------------------------------------------------------------
  149:         self.vertices[val] = vertex
  150:     
  151:     def add_edge(self, src, dst, weight=0):
  152:         if src not in self.vertices:
- 153:             self.add_vertex(src)
+ 153:             add_vertex(src)
  154:         if dst not in self.vertices:
  155:             self.add_vertex(dst)
  156:         self.vertices[src].add_adjacent(dst, weight)
  157:     
--------------------------------------------------------------------------------
[0.22807 s] killed by ts-3-5/test_3-5_0-6_192.py::test_weighted_graph_add_edge

def test_weighted_graph_add_edge():
        weighted_graph = WeightedGraph()
    
>       weighted_graph.add_edge(1, 2, 3)

ts-3-5/test_3-5_0-6_192.py:52: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph1.WeightedGraph object at 0x7183485931c0>, src = 1, dst = 2
weight = 3

>   ???
E   NameError: name 'add_vertex' is not defined

graph1:153: NameError

   - [# 148] SVD graph1: 
--------------------------------------------------------------------------------
  150:     
  151:     def add_edge(self, src, dst, weight=0):
  152:         if src not in self.vertices:
  153:             self.add_vertex(src)
- 154:         if dst not in self.vertices:
+ 154:         if dst not in vertices:
  155:             self.add_vertex(dst)
  156:         self.vertices[src].add_adjacent(dst, weight)
  157:     
  158:     def remove_edge(self, src, dst):
--------------------------------------------------------------------------------
[0.19527 s] killed by ts-3-5/test_3-5_0-6_192.py::test_weighted_graph_add_edge

def test_weighted_graph_add_edge():
        weighted_graph = WeightedGraph()
    
>       weighted_graph.add_edge(1, 2, 3)

ts-3-5/test_3-5_0-6_192.py:52: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph1.WeightedGraph object at 0x718347f38d60>, src = 1, dst = 2
weight = 3

>   ???
E   NameError: name 'vertices' is not defined

graph1:154: NameError

   - [# 149] SVD graph1: 
--------------------------------------------------------------------------------
  151:     def add_edge(self, src, dst, weight=0):
  152:         if src not in self.vertices:
  153:             self.add_vertex(src)
  154:         if dst not in self.vertices:
- 155:             self.add_vertex(dst)
+ 155:             add_vertex(dst)
  156:         self.vertices[src].add_adjacent(dst, weight)
  157:     
  158:     def remove_edge(self, src, dst):
  159:         if src not in self.vertices:
--------------------------------------------------------------------------------
[0.19931 s] killed by ts-3-5/test_3-5_0-6_192.py::test_weighted_graph_add_edge

def test_weighted_graph_add_edge():
        weighted_graph = WeightedGraph()
    
>       weighted_graph.add_edge(1, 2, 3)

ts-3-5/test_3-5_0-6_192.py:52: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph1.WeightedGraph object at 0x7183484184c0>, src = 1, dst = 2
weight = 3

>   ???
E   NameError: name 'add_vertex' is not defined

graph1:155: NameError

   - [# 150] SVD graph1: 
--------------------------------------------------------------------------------
  152:         if src not in self.vertices:
  153:             self.add_vertex(src)
  154:         if dst not in self.vertices:
  155:             self.add_vertex(dst)
- 156:         self.vertices[src].add_adjacent(dst, weight)
+ 156:         vertices[src].add_adjacent(dst, weight)
  157:     
  158:     def remove_edge(self, src, dst):
  159:         if src not in self.vertices:
  160:             return
--------------------------------------------------------------------------------
[0.19943 s] killed by ts-3-5/test_3-5_0-6_192.py::test_weighted_graph_add_edge

def test_weighted_graph_add_edge():
        weighted_graph = WeightedGraph()
    
>       weighted_graph.add_edge(1, 2, 3)

ts-3-5/test_3-5_0-6_192.py:52: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph1.WeightedGraph object at 0x718347f3a020>, src = 1, dst = 2
weight = 3

>   ???
E   NameError: name 'vertices' is not defined

graph1:156: NameError

   - [# 151] SVD graph1: 
--------------------------------------------------------------------------------
  155:             self.add_vertex(dst)
  156:         self.vertices[src].add_adjacent(dst, weight)
  157:     
  158:     def remove_edge(self, src, dst):
- 159:         if src not in self.vertices:
+ 159:         if src not in vertices:
  160:             return
  161:         if dst not in self.vertices:
  162:             return
  163:         if dst in self.vertices[src].adjacent:
--------------------------------------------------------------------------------
[0.20009 s] killed by ts-3-5/test_3-5_0-6_192.py::test_weighted_graph_remove_edge

def test_weighted_graph_remove_edge():
        weighted_graph = WeightedGraph()
    
        weighted_graph.add_edge(1, 2, 3)
>       weighted_graph.remove_edge(1, 2)

ts-3-5/test_3-5_0-6_192.py:60: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph1.WeightedGraph object at 0x718348442980>, src = 1, dst = 2

>   ???
E   NameError: name 'vertices' is not defined

graph1:159: NameError

   - [# 152] SVD graph1: 
--------------------------------------------------------------------------------
  157:     
  158:     def remove_edge(self, src, dst):
  159:         if src not in self.vertices:
  160:             return
- 161:         if dst not in self.vertices:
+ 161:         if dst not in vertices:
  162:             return
  163:         if dst in self.vertices[src].adjacent:
  164:             self.vertices[src].remove_adjacent(dst)
--------------------------------------------------------------------------------
[0.20222 s] killed by ts-3-5/test_3-5_0-6_192.py::test_weighted_graph_remove_edge

def test_weighted_graph_remove_edge():
        weighted_graph = WeightedGraph()
    
        weighted_graph.add_edge(1, 2, 3)
>       weighted_graph.remove_edge(1, 2)

ts-3-5/test_3-5_0-6_192.py:60: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph1.WeightedGraph object at 0x718347f9bb50>, src = 1, dst = 2

>   ???
E   NameError: name 'vertices' is not defined

graph1:161: NameError

   - [# 153] SVD graph1: 
--------------------------------------------------------------------------------
  159:         if src not in self.vertices:
  160:             return
  161:         if dst not in self.vertices:
  162:             return
- 163:         if dst in self.vertices[src].adjacent:
+ 163:         if dst in vertices[src].adjacent:
  164:             self.vertices[src].remove_adjacent(dst)
--------------------------------------------------------------------------------
[0.19672 s] killed by ts-3-5/test_3-5_0-6_192.py::test_weighted_graph_remove_edge

def test_weighted_graph_remove_edge():
        weighted_graph = WeightedGraph()
    
        weighted_graph.add_edge(1, 2, 3)
>       weighted_graph.remove_edge(1, 2)

ts-3-5/test_3-5_0-6_192.py:60: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph1.WeightedGraph object at 0x718348443fd0>, src = 1, dst = 2

>   ???
E   NameError: name 'vertices' is not defined

graph1:163: NameError

   - [# 154] SVD graph1: 
--------------------------------------------------------------------------------
  160:             return
  161:         if dst not in self.vertices:
  162:             return
  163:         if dst in self.vertices[src].adjacent:
- 164:             self.vertices[src].remove_adjacent(dst)
+ 164:             vertices[src].remove_adjacent(dst)
--------------------------------------------------------------------------------
[0.19374 s] killed by ts-3-5/test_3-5_0-6_192.py::test_weighted_graph_remove_edge

def test_weighted_graph_remove_edge():
        weighted_graph = WeightedGraph()
    
        weighted_graph.add_edge(1, 2, 3)
>       weighted_graph.remove_edge(1, 2)

ts-3-5/test_3-5_0-6_192.py:60: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph1.WeightedGraph object at 0x718347dee020>, src = 1, dst = 2

>   ???
E   NameError: name 'vertices' is not defined

graph1:164: NameError

   - [# 155] ZIL graph1: 
--------------------------------------------------------------------------------
   63:             elif visited[node] == 1:
   64:                 return True
   65:             visited[node] = -1
   66:             for neighbor in self.graph[node]:
-  67:                 if not (valid(neighbor)):
-  68:                     return False
+  67:                 break
+  68:             
   69:             return True
   70:         
   71:         for node in range(self.verticies):
   72:             
--------------------------------------------------------------------------------
[0.22486 s] killed by ts-3-5/test_3-5_0-6_192.py::test_graph_has_cycle

def test_graph_has_cycle():
        graph = Graph(3)
        graph.add_edge(0, 1)
        graph.add_edge(1, 2)
        graph.add_edge(2, 0)
    
>       assert graph.has_cycle() == True
E       AssertionError

ts-3-5/test_3-5_0-6_192.py:39: AssertionError

   - [# 156] ZIL graph1: 
--------------------------------------------------------------------------------
   71:         for node in range(self.verticies):
   72:             
   73:             
   74:             
-  75:             if not (visited[node]):
-  76:                 
-  77:                 if valid(node):
-  78:                     
-  79:                     visited = list(map((lambda x: (abs(x))), visited))
-  80:                 else:
-  81:                     
-  82:                     return True
+  75:             break
+  76:         
+  77:         
+  78:         
+  79:         
+  80:         
+  81:         
+  82:         
   83:         
   84:         return False
   85:     
   86:     def topological_sort(self):
--------------------------------------------------------------------------------
[0.20094 s] killed by ts-3-5/test_3-5_0-6_192.py::test_graph_has_cycle

def test_graph_has_cycle():
        graph = Graph(3)
        graph.add_edge(0, 1)
        graph.add_edge(1, 2)
        graph.add_edge(2, 0)
    
>       assert graph.has_cycle() == True
E       AssertionError

ts-3-5/test_3-5_0-6_192.py:39: AssertionError

   - [# 157] ZIL graph1: 
--------------------------------------------------------------------------------
  109:         
  110:         def dfs(vertex):
  111:             visited.add(vertex)
  112:             for j in self.graph[vertex]:
- 113:                 if j not in visited:
- 114:                     dfs(j)
+ 113:                 break
+ 114:             
  115:             
  116:             stack.appendleft(vertex)
  117:         
  118:         for (key, _) in self.graph.items():
--------------------------------------------------------------------------------
[0.17568 s] survived

   - [# 158] ZIL graph1: 
--------------------------------------------------------------------------------
  115:             
  116:             stack.appendleft(vertex)
  117:         
  118:         for (key, _) in self.graph.items():
- 119:             if key not in visited:
- 120:                 dfs(key)
+ 119:             break
+ 120:         
  121:         
  122:         return list(stack)
  123: 
  124: class WeightedGraphNode:
--------------------------------------------------------------------------------
[0.17925 s] survived
