1 : Job ID a48490933647404997370cf6e87d4b00
test outcome: killed
graph2.py, start pos: (29, 11), end pos: (29, 15)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- agraph2.py
+++ bgraph2.py
@@ -26,7 +26,7 @@
     def __init__(self, data=None):
         """Initialize graph."""
         self.graph = {}
-        if data:
+        if not data:
             for i in data:
                 self.add_node(i)
ts-3-5/test_3-5_0-6_203.py EEEEEEE                                       [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-6_203.py::test_add_node - TypeError: 'NoneType' objec...
ERROR ts-3-5/test_3-5_0-6_203.py::test_add_edge - TypeError: 'NoneType' objec...
ERROR ts-3-5/test_3-5_0-6_203.py::test_del_node - TypeError: 'NoneType' objec...
ERROR ts-3-5/test_3-5_0-6_203.py::test_del_edge - TypeError: 'NoneType' objec...
ERROR ts-3-5/test_3-5_0-6_203.py::test_has_node - TypeError: 'NoneType' objec...
ERROR ts-3-5/test_3-5_0-6_203.py::test_neighbors - TypeError: 'NoneType' obje...
ERROR ts-3-5/test_3-5_0-6_203.py::test_adjacent - TypeError: 'NoneType' objec...
============================== 7 errors in 0.16s ===============================

3 : Job ID 1eeeec1d8f5e499189781c030a0c0692
SURVIVED
test outcome: survived
graph2.py, start pos: (54, 17), end pos: (54, 27)
operator: core/ZeroIterationForLoop, occurrence: 1
--- mutation diff ---
--- agraph2.py
+++ bgraph2.py
@@ -51,7 +51,7 @@
     def del_node(self, n):
         """Delete the node 'n' from the graph."""
         del self.graph[n]
-        for k in self.graph:
+        for k in []:
             self.graph[k].discard(n)
     def del_edge(self, n1, n2):
ts-3-5/test_3-5_0-6_203.py .......                                       [100%]
============================== 7 passed in 0.16s ===============================
