   - [#  48] SVD graph2: 
--------------------------------------------------------------------------------
  45:     def add_edge(self, n1, n2):
  46:         '''Add new edge to the graph.'''
  47:         self.graph.setdefault(n1, set([n2]))
  48:         self.graph.setdefault(n2, set())
- 49:         self.graph[n1].add(n2)
+ 49:         graph[n1].add(n2)
  50:     
  51:     def del_node(self, n):
  52:         """Delete the node 'n' from the graph."""
  53:         del self.graph[n]
--------------------------------------------------------------------------------
[0.20828 s] killed by ts-3-5/test_3-5_0-2_76.py::test_add_edge

graph = <graph2.Graph object at 0x78c54ed36fb0>

    def test_add_edge(graph):
        graph.add_node(1)
        graph.add_node(2)
>       graph.add_edge(1, 2)

ts-3-5/test_3-5_0-2_76.py:22: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph2.Graph object at 0x78c54ed36fb0>, n1 = 1, n2 = 2

>   ???
E   NameError: name 'graph' is not defined

graph2:49: NameError

   - [#  49] SVD graph2: 
--------------------------------------------------------------------------------
  49:         self.graph[n1].add(n2)
  50:     
  51:     def del_node(self, n):
  52:         """Delete the node 'n' from the graph."""
- 53:         del self.graph[n]
+ 53:         del graph[n]
  54:         for k in self.graph:
  55:             self.graph[k].discard(n)
  56:     
  57:     def del_edge(self, n1, n2):
--------------------------------------------------------------------------------
[0.21547 s] killed by ts-3-5/test_3-5_0-2_76.py::test_del_node

graph = <graph2.Graph object at 0x78c54eef0040>

    def test_del_node(graph):
        graph.add_node(1)
>       graph.del_node(1)

ts-3-5/test_3-5_0-2_76.py:27: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph2.Graph object at 0x78c54eef0040>, n = 1

>   ???
E   NameError: name 'graph' is not defined

graph2:53: NameError

   - [#  50] SVD graph2: 
--------------------------------------------------------------------------------
  50:     
  51:     def del_node(self, n):
  52:         """Delete the node 'n' from the graph."""
  53:         del self.graph[n]
- 54:         for k in self.graph:
+ 54:         for k in graph:
  55:             self.graph[k].discard(n)
  56:     
  57:     def del_edge(self, n1, n2):
  58:         '''Delete the edge connecting n1 and n2.'''
--------------------------------------------------------------------------------
[0.21558 s] killed by ts-3-5/test_3-5_0-2_76.py::test_del_node

graph = <graph2.Graph object at 0x78c54ee37f10>

    def test_del_node(graph):
        graph.add_node(1)
>       graph.del_node(1)

ts-3-5/test_3-5_0-2_76.py:27: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph2.Graph object at 0x78c54ee37f10>, n = 1

>   ???
E   NameError: name 'graph' is not defined

graph2:54: NameError

   - [#  51] SVD graph2: 
--------------------------------------------------------------------------------
  51:     def del_node(self, n):
  52:         """Delete the node 'n' from the graph."""
  53:         del self.graph[n]
  54:         for k in self.graph:
- 55:             self.graph[k].discard(n)
+ 55:             graph[k].discard(n)
  56:     
  57:     def del_edge(self, n1, n2):
  58:         '''Delete the edge connecting n1 and n2.'''
  59:         self.graph[n1].remove(n2)
--------------------------------------------------------------------------------
[0.19803 s] survived

   - [#  52] SVD graph2: 
--------------------------------------------------------------------------------
  55:             self.graph[k].discard(n)
  56:     
  57:     def del_edge(self, n1, n2):
  58:         '''Delete the edge connecting n1 and n2.'''
- 59:         self.graph[n1].remove(n2)
+ 59:         graph[n1].remove(n2)
  60:     
  61:     def has_node(self, n):
  62:         """Return boolean if 'n' is in the graph."""
  63:         return n in self.graph
--------------------------------------------------------------------------------
[0.21277 s] killed by ts-3-5/test_3-5_0-2_76.py::test_del_edge

graph = <graph2.Graph object at 0x78c54ed36a10>

    def test_del_edge(graph):
        graph.add_node(1)
        graph.add_node(2)
        graph.add_edge(1, 2)
>       graph.del_edge(1, 2)

ts-3-5/test_3-5_0-2_76.py:34: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph2.Graph object at 0x78c54ed36a10>, n1 = 1, n2 = 2

>   ???
E   NameError: name 'graph' is not defined

graph2:59: NameError

   - [#  53] SVD graph2: 
--------------------------------------------------------------------------------
  59:         self.graph[n1].remove(n2)
  60:     
  61:     def has_node(self, n):
  62:         """Return boolean if 'n' is in the graph."""
- 63:         return n in self.graph
+ 63:         return n in graph
  64:     
  65:     def neighbors(self, n):
  66:         '''Return the list of all nodes connected to n by edges.'''
  67:         return self.graph[n]
--------------------------------------------------------------------------------
[0.21478 s] killed by ts-3-5/test_3-5_0-2_76.py::test_add_node

graph = <graph2.Graph object at 0x78c54e9ea500>

    def test_add_node(graph):
        graph.add_node(1)
>       assert graph.has_node(1) == True

ts-3-5/test_3-5_0-2_76.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph2.Graph object at 0x78c54e9ea500>, n = 1

>   ???
E   NameError: name 'graph' is not defined

graph2:63: NameError

   - [#  54] SVD graph2: 
--------------------------------------------------------------------------------
  63:         return n in self.graph
  64:     
  65:     def neighbors(self, n):
  66:         '''Return the list of all nodes connected to n by edges.'''
- 67:         return self.graph[n]
+ 67:         return graph[n]
  68:     
  69:     def adjacent(self, n1, n2):
  70:         '''Return boolean if there is an edge connecting n1 and n2.'''
  71:         return n2 in self.neighbors(n1)
--------------------------------------------------------------------------------
[0.21737 s] killed by ts-3-5/test_3-5_0-2_76.py::test_add_edge

graph = <graph2.Graph object at 0x78c54ed69e10>

    def test_add_edge(graph):
        graph.add_node(1)
        graph.add_node(2)
        graph.add_edge(1, 2)
>       assert graph.adjacent(1, 2) == True

ts-3-5/test_3-5_0-2_76.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
graph2:71: in adjacent
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph2.Graph object at 0x78c54ed69e10>, n = 1

>   ???
E   NameError: name 'graph' is not defined

graph2:67: NameError

   - [#  55] SVD graph2: 
--------------------------------------------------------------------------------
  67:         return self.graph[n]
  68:     
  69:     def adjacent(self, n1, n2):
  70:         '''Return boolean if there is an edge connecting n1 and n2.'''
- 71:         return n2 in self.neighbors(n1)
+ 71:         return n2 in neighbors(n1)
--------------------------------------------------------------------------------
[0.21578 s] killed by ts-3-5/test_3-5_0-2_76.py::test_add_edge

graph = <graph2.Graph object at 0x78c54eba8f10>

    def test_add_edge(graph):
        graph.add_node(1)
        graph.add_node(2)
        graph.add_edge(1, 2)
>       assert graph.adjacent(1, 2) == True

ts-3-5/test_3-5_0-2_76.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <graph2.Graph object at 0x78c54eba8f10>, n1 = 1, n2 = 2

>   ???
E   NameError: name 'neighbors' is not defined

graph2:71: NameError

   - [#  56] ZIL graph2: 
--------------------------------------------------------------------------------
  27:         '''Initialize graph.'''
  28:         self.graph = {}
  29:         if data:
  30:             for i in data:
- 31:                 self.add_node(i)
+ 31:                 break
  32:     
  33:     def nodes(self):
  34:         '''Return a list of all nodes in the graph.'''
  35:         return list(self.graph.keys())
--------------------------------------------------------------------------------
[0.19707 s] survived

   - [#  57] ZIL graph2: 
--------------------------------------------------------------------------------
  51:     def del_node(self, n):
  52:         """Delete the node 'n' from the graph."""
  53:         del self.graph[n]
  54:         for k in self.graph:
- 55:             self.graph[k].discard(n)
+ 55:             break
  56:     
  57:     def del_edge(self, n1, n2):
  58:         '''Delete the edge connecting n1 and n2.'''
  59:         self.graph[n1].remove(n2)
--------------------------------------------------------------------------------
[0.18396 s] survived
