1 : Job ID 9d76a3988041442baf0f3172feae669a
test outcome: killed
hamming_ops.py, start pos: (37, 15), end pos: (37, 16)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -34,7 +34,7 @@
         x = abs(x)
         count = 1
     while x:
-        x &= x - 1
+        x &= x + 1
         count += 1
     return count
ts-3-5/test_3-5_0-6_194.py FF                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - assert 1 == 2
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_weight - assert 1 == 8
============================== 2 failed in 0.10s ===============================

2 : Job ID f25bc5adf6164af881ab391c58586582
test outcome: killed
hamming_ops.py, start pos: (37, 15), end pos: (37, 16)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -34,7 +34,7 @@
         x = abs(x)
         count = 1
     while x:
-        x &= x - 1
+        x &= x * 1
         count += 1
     return count
timeout

3 : Job ID 4453a74c157241da84965db45e4b4155
test outcome: killed
hamming_ops.py, start pos: (37, 15), end pos: (37, 16)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -34,7 +34,7 @@
         x = abs(x)
         count = 1
     while x:
-        x &= x - 1
+        x &= x / 1
         count += 1
     return count
ts-3-5/test_3-5_0-6_194.py FF                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - TypeError: unsuppo...
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_weight - TypeError: unsupport...
============================== 2 failed in 0.10s ===============================

4 : Job ID 0e82bd83fcda426c8a0a5e8b5adb56ca
test outcome: killed
hamming_ops.py, start pos: (37, 15), end pos: (37, 16)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -34,7 +34,7 @@
         x = abs(x)
         count = 1
     while x:
-        x &= x - 1
+        x &= x // 1
         count += 1
     return count
timeout

5 : Job ID dd04c484faee44528c8a36f6ed5deac7
test outcome: killed
hamming_ops.py, start pos: (37, 15), end pos: (37, 16)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -34,7 +34,7 @@
         x = abs(x)
         count = 1
     while x:
-        x &= x - 1
+        x &= x % 1
         count += 1
     return count
ts-3-5/test_3-5_0-6_194.py FF                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - assert 1 == 2
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_weight - assert 1 == 8
============================== 2 failed in 0.10s ===============================

6 : Job ID dc7d3882a5064d5e99c161b622774bfa
test outcome: killed
hamming_ops.py, start pos: (37, 15), end pos: (37, 16)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -34,7 +34,7 @@
         x = abs(x)
         count = 1
     while x:
-        x &= x - 1
+        x &= x ** 1
         count += 1
     return count
timeout

7 : Job ID 27ee9f72cd05422fab6ce580ac8886ea
SURVIVED
test outcome: survived
hamming_ops.py, start pos: (37, 15), end pos: (37, 16)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -34,7 +34,7 @@
         x = abs(x)
         count = 1
     while x:
-        x &= x - 1
+        x &= x >> 1
         count += 1
     return count
ts-3-5/test_3-5_0-6_194.py ..                                            [100%]
============================== 2 passed in 0.10s ===============================

8 : Job ID d3102ec11b4f443cafe3fb0cf0ee6c25
SURVIVED
test outcome: survived
hamming_ops.py, start pos: (37, 15), end pos: (37, 16)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -34,7 +34,7 @@
         x = abs(x)
         count = 1
     while x:
-        x &= x - 1
+        x &= x << 1
         count += 1
     return count
ts-3-5/test_3-5_0-6_194.py ..                                            [100%]
============================== 2 passed in 0.10s ===============================

9 : Job ID 8fe2ab6af704490aab394ef095d21950
test outcome: killed
hamming_ops.py, start pos: (37, 15), end pos: (37, 16)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -34,7 +34,7 @@
         x = abs(x)
         count = 1
     while x:
-        x &= x - 1
+        x &= x | 1
         count += 1
     return count
timeout

10 : Job ID 0d6144e864484e42b4b9772bbee17748
test outcome: killed
hamming_ops.py, start pos: (37, 15), end pos: (37, 16)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -34,7 +34,7 @@
         x = abs(x)
         count = 1
     while x:
-        x &= x - 1
+        x &= x & 1
         count += 1
     return count
timeout

11 : Job ID da38f21305bd41a4a9bb82484d5315cc
test outcome: killed
hamming_ops.py, start pos: (37, 15), end pos: (37, 16)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -34,7 +34,7 @@
         x = abs(x)
         count = 1
     while x:
-        x &= x - 1
+        x &= x ^ 1
         count += 1
     return count
timeout

12 : Job ID a7c9075f6e474e61a9355359043c7993
test outcome: killed
hamming_ops.py, start pos: (14, 12), end pos: (14, 13)
operator: core/ReplaceBinaryOperator_BitXor_Add, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -11,7 +11,7 @@
         in the two args.
     """
     # xor numbers to get diff bits as 1's
-    xor = x ^ y
+    xor = x + y
     # count the 1's in integer
     return hamming_weight(xor)
ts-3-5/test_3-5_0-6_194.py F.                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - assert 3 == 0
========================= 1 failed, 1 passed in 0.10s ==========================

13 : Job ID a6fdf9abc8b343c29479f558357498e5
SURVIVED
test outcome: survived
hamming_ops.py, start pos: (14, 12), end pos: (14, 13)
operator: core/ReplaceBinaryOperator_BitXor_Sub, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -11,7 +11,7 @@
         in the two args.
     """
     # xor numbers to get diff bits as 1's
-    xor = x ^ y
+    xor = x - y
     # count the 1's in integer
     return hamming_weight(xor)
ts-3-5/test_3-5_0-6_194.py ..                                            [100%]
============================== 2 passed in 0.10s ===============================

14 : Job ID edf612ee6b3e4563977cbef8c0573e3a
test outcome: killed
hamming_ops.py, start pos: (14, 12), end pos: (14, 13)
operator: core/ReplaceBinaryOperator_BitXor_Mul, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -11,7 +11,7 @@
         in the two args.
     """
     # xor numbers to get diff bits as 1's
-    xor = x ^ y
+    xor = x * y
     # count the 1's in integer
     return hamming_weight(xor)
ts-3-5/test_3-5_0-6_194.py F.                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - assert 1 == 2
========================= 1 failed, 1 passed in 0.10s ==========================

15 : Job ID 742d059980c34647b51f691d37b47fb9
test outcome: killed
hamming_ops.py, start pos: (14, 12), end pos: (14, 13)
operator: core/ReplaceBinaryOperator_BitXor_Div, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -11,7 +11,7 @@
         in the two args.
     """
     # xor numbers to get diff bits as 1's
-    xor = x ^ y
+    xor = x / y
     # count the 1's in integer
     return hamming_weight(xor)
ts-3-5/test_3-5_0-6_194.py F.                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - ZeroDivisionError:...
========================= 1 failed, 1 passed in 0.10s ==========================

16 : Job ID c4cc7f009ed34b14aaea770aa6aa5d25
test outcome: killed
hamming_ops.py, start pos: (14, 12), end pos: (14, 13)
operator: core/ReplaceBinaryOperator_BitXor_FloorDiv, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -11,7 +11,7 @@
         in the two args.
     """
     # xor numbers to get diff bits as 1's
-    xor = x ^ y
+    xor = x // y
     # count the 1's in integer
     return hamming_weight(xor)
ts-3-5/test_3-5_0-6_194.py F.                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - ZeroDivisionError:...
========================= 1 failed, 1 passed in 0.10s ==========================

17 : Job ID 35fff8e1ee7b4f7fa91e84fefc6f7ba2
test outcome: killed
hamming_ops.py, start pos: (14, 12), end pos: (14, 13)
operator: core/ReplaceBinaryOperator_BitXor_Mod, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -11,7 +11,7 @@
         in the two args.
     """
     # xor numbers to get diff bits as 1's
-    xor = x ^ y
+    xor = x % y
     # count the 1's in integer
     return hamming_weight(xor)
ts-3-5/test_3-5_0-6_194.py F.                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - ZeroDivisionError:...
========================= 1 failed, 1 passed in 0.10s ==========================

18 : Job ID 545bda3f02a44e18aa8a46b133086cc1
test outcome: killed
hamming_ops.py, start pos: (14, 12), end pos: (14, 13)
operator: core/ReplaceBinaryOperator_BitXor_Pow, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -11,7 +11,7 @@
         in the two args.
     """
     # xor numbers to get diff bits as 1's
-    xor = x ^ y
+    xor = x ** y
     # count the 1's in integer
     return hamming_weight(xor)
ts-3-5/test_3-5_0-6_194.py F.                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - assert 1 == 0
========================= 1 failed, 1 passed in 0.10s ==========================

19 : Job ID e59cf4655acf43e0b81826cb5023e0db
test outcome: killed
hamming_ops.py, start pos: (14, 12), end pos: (14, 13)
operator: core/ReplaceBinaryOperator_BitXor_RShift, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -11,7 +11,7 @@
         in the two args.
     """
     # xor numbers to get diff bits as 1's
-    xor = x ^ y
+    xor = x >> y
     # count the 1's in integer
     return hamming_weight(xor)
ts-3-5/test_3-5_0-6_194.py F.                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - assert 0 == 2
========================= 1 failed, 1 passed in 0.10s ==========================

20 : Job ID 869ee867afdf4f849fb6e36651628239
test outcome: killed
hamming_ops.py, start pos: (14, 12), end pos: (14, 13)
operator: core/ReplaceBinaryOperator_BitXor_LShift, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -11,7 +11,7 @@
         in the two args.
     """
     # xor numbers to get diff bits as 1's
-    xor = x ^ y
+    xor = x << y
     # count the 1's in integer
     return hamming_weight(xor)
ts-3-5/test_3-5_0-6_194.py F.                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - assert 1 == 2
========================= 1 failed, 1 passed in 0.10s ==========================

21 : Job ID e7f8ea4d123440499f2b1e358436cb89
test outcome: killed
hamming_ops.py, start pos: (14, 12), end pos: (14, 13)
operator: core/ReplaceBinaryOperator_BitXor_BitOr, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -11,7 +11,7 @@
         in the two args.
     """
     # xor numbers to get diff bits as 1's
-    xor = x ^ y
+    xor = x | y
     # count the 1's in integer
     return hamming_weight(xor)
ts-3-5/test_3-5_0-6_194.py F.                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - assert 3 == 0
========================= 1 failed, 1 passed in 0.10s ==========================

22 : Job ID b86d8c83380e4d14adcbf6ef04a3db7b
test outcome: killed
hamming_ops.py, start pos: (14, 12), end pos: (14, 13)
operator: core/ReplaceBinaryOperator_BitXor_BitAnd, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -11,7 +11,7 @@
         in the two args.
     """
     # xor numbers to get diff bits as 1's
-    xor = x ^ y
+    xor = x & y
     # count the 1's in integer
     return hamming_weight(xor)
ts-3-5/test_3-5_0-6_194.py F.                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - assert 0 == 2
========================= 1 failed, 1 passed in 0.10s ==========================

23 : Job ID b91afdda8eba472ca8252ae59517f9eb
test outcome: killed
hamming_ops.py, start pos: (32, 9), end pos: (32, 10)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -29,7 +29,7 @@
         that are on (1).
     """
     count = 0
-    if x < 0:
+    if x == 0:
         # Calculate bit length for the negative number including the sign bit
         x = abs(x)
         count = 1
ts-3-5/test_3-5_0-6_194.py FF                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - assert 1 == 0
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_weight - assert 1 == 0
============================== 2 failed in 0.10s ===============================

24 : Job ID 6624b9df07b0480eb294fd24e0dd0232
test outcome: killed
hamming_ops.py, start pos: (32, 9), end pos: (32, 10)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -29,7 +29,7 @@
         that are on (1).
     """
     count = 0
-    if x < 0:
+    if x != 0:
         # Calculate bit length for the negative number including the sign bit
         x = abs(x)
         count = 1
ts-3-5/test_3-5_0-6_194.py FF                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - assert 3 == 2
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_weight - assert 2 == 1
============================== 2 failed in 0.10s ===============================

25 : Job ID c4d2d21d15594a6e93bce445e4e63e67
test outcome: killed
hamming_ops.py, start pos: (32, 9), end pos: (32, 10)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -29,7 +29,7 @@
         that are on (1).
     """
     count = 0
-    if x < 0:
+    if x <= 0:
         # Calculate bit length for the negative number including the sign bit
         x = abs(x)
         count = 1
ts-3-5/test_3-5_0-6_194.py FF                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - assert 1 == 0
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_weight - assert 1 == 0
============================== 2 failed in 0.10s ===============================

26 : Job ID b4ff44e9b476489282ccee979f49a044
test outcome: killed
hamming_ops.py, start pos: (32, 9), end pos: (32, 10)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -29,7 +29,7 @@
         that are on (1).
     """
     count = 0
-    if x < 0:
+    if x > 0:
         # Calculate bit length for the negative number including the sign bit
         x = abs(x)
         count = 1
ts-3-5/test_3-5_0-6_194.py FF                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - assert 3 == 2
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_weight - assert 2 == 1
============================== 2 failed in 0.10s ===============================

27 : Job ID b3a355eee3c643d2affa890de5baf74a
test outcome: killed
hamming_ops.py, start pos: (32, 9), end pos: (32, 10)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -29,7 +29,7 @@
         that are on (1).
     """
     count = 0
-    if x < 0:
+    if x >= 0:
         # Calculate bit length for the negative number including the sign bit
         x = abs(x)
         count = 1
ts-3-5/test_3-5_0-6_194.py FF                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - assert 1 == 0
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_weight - assert 1 == 0
============================== 2 failed in 0.10s ===============================

28 : Job ID ece9952e79d946fba69dc096a85ece76
test outcome: killed
hamming_ops.py, start pos: (32, 7), end pos: (32, 12)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -29,7 +29,7 @@
         that are on (1).
     """
     count = 0
-    if x < 0:
+    if not x < 0:
         # Calculate bit length for the negative number including the sign bit
         x = abs(x)
         count = 1
ts-3-5/test_3-5_0-6_194.py FF                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - assert 1 == 0
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_weight - assert 1 == 0
============================== 2 failed in 0.10s ===============================

29 : Job ID 9a9bb04a1fc54c928494322eb11b1b6c
test outcome: killed
hamming_ops.py, start pos: (36, 10), end pos: (36, 11)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -33,7 +33,7 @@
         # Calculate bit length for the negative number including the sign bit
         x = abs(x)
         count = 1
-    while x:
+    while not x:
         x &= x - 1
         count += 1
     return count
timeout

30 : Job ID 9249763a78f04973b750351eec699f46
test outcome: killed
hamming_ops.py, start pos: (31, 12), end pos: (31, 13)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -28,7 +28,7 @@
         Integer representing the number of bits
         that are on (1).
     """
-    count = 0
+    count = 1
     if x < 0:
         # Calculate bit length for the negative number including the sign bit
         x = abs(x)
ts-3-5/test_3-5_0-6_194.py FF                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - assert 1 == 0
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_weight - assert 1 == 0
============================== 2 failed in 0.10s ===============================

31 : Job ID 0013663e8ed8479d8b6ebc53d6bbf059
test outcome: killed
hamming_ops.py, start pos: (31, 12), end pos: (31, 13)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -28,7 +28,7 @@
         Integer representing the number of bits
         that are on (1).
     """
-    count = 0
+    count = -1
     if x < 0:
         # Calculate bit length for the negative number including the sign bit
         x = abs(x)
ts-3-5/test_3-5_0-6_194.py FF                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - assert -1 == 0
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_weight - assert -1 == 0
============================== 2 failed in 0.10s ===============================

32 : Job ID eaacbfd1c84e4f7a9621f6d540625ae0
test outcome: killed
hamming_ops.py, start pos: (32, 11), end pos: (32, 12)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -29,7 +29,7 @@
         that are on (1).
     """
     count = 0
-    if x < 0:
+    if x < 1:
         # Calculate bit length for the negative number including the sign bit
         x = abs(x)
         count = 1
ts-3-5/test_3-5_0-6_194.py FF                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - assert 1 == 0
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_weight - assert 1 == 0
============================== 2 failed in 0.10s ===============================

33 : Job ID d1387dd85d0941c2b003d1d8c13535fd
SURVIVED
test outcome: survived
hamming_ops.py, start pos: (32, 11), end pos: (32, 12)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -29,7 +29,7 @@
         that are on (1).
     """
     count = 0
-    if x < 0:
+    if x < -1:
         # Calculate bit length for the negative number including the sign bit
         x = abs(x)
         count = 1
ts-3-5/test_3-5_0-6_194.py ..                                            [100%]
============================== 2 passed in 0.10s ===============================

34 : Job ID be257d57a99c44e4a4cf78129ff9fcbf
SURVIVED
test outcome: survived
hamming_ops.py, start pos: (35, 16), end pos: (35, 17)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -32,7 +32,7 @@
     if x < 0:
         # Calculate bit length for the negative number including the sign bit
         x = abs(x)
-        count = 1
+        count = 2
     while x:
         x &= x - 1
         count += 1
ts-3-5/test_3-5_0-6_194.py ..                                            [100%]
============================== 2 passed in 0.10s ===============================

35 : Job ID d6e14803e3b345fc9a2d5248d37c885b
SURVIVED
test outcome: survived
hamming_ops.py, start pos: (35, 16), end pos: (35, 17)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -32,7 +32,7 @@
     if x < 0:
         # Calculate bit length for the negative number including the sign bit
         x = abs(x)
-        count = 1
+        count = 0
     while x:
         x &= x - 1
         count += 1
ts-3-5/test_3-5_0-6_194.py ..                                            [100%]
============================== 2 passed in 0.10s ===============================

36 : Job ID d44bbf0c6b85432699781d011b720237
test outcome: killed
hamming_ops.py, start pos: (37, 17), end pos: (37, 18)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -34,7 +34,7 @@
         x = abs(x)
         count = 1
     while x:
-        x &= x - 1
+        x &= x - 2
         count += 1
     return count
timeout

37 : Job ID b7496204e7c44a1aa063d170d0221c02
test outcome: killed
hamming_ops.py, start pos: (37, 17), end pos: (37, 18)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -34,7 +34,7 @@
         x = abs(x)
         count = 1
     while x:
-        x &= x - 1
+        x &= x - 0
         count += 1
     return count
timeout

38 : Job ID d65c07f8728942f9a7e7053fde0bf22c
test outcome: killed
hamming_ops.py, start pos: (38, 17), end pos: (38, 18)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -35,7 +35,7 @@
         count = 1
     while x:
         x &= x - 1
-        count += 1
+        count += 2
     return count
ts-3-5/test_3-5_0-6_194.py FF                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - assert 4 == 2
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_weight - assert 2 == 1
============================== 2 failed in 0.10s ===============================

39 : Job ID faaf827471a54870b32dd3fae0bcc568
test outcome: killed
hamming_ops.py, start pos: (38, 17), end pos: (38, 18)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- ahamming_ops.py
+++ bhamming_ops.py
@@ -35,7 +35,7 @@
         count = 1
     while x:
         x &= x - 1
-        count += 1
+        count += 0
     return count
ts-3-5/test_3-5_0-6_194.py FF                                            [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_distance - assert 0 == 2
FAILED ts-3-5/test_3-5_0-6_194.py::test_hamming_weight - assert 0 == 1
============================== 2 failed in 0.10s ===============================
