1 : Job ID 74f7e0340ea444038587433c3cf8f75a
test outcome: killed
hash_map.py, start pos: (104, 28), end pos: (104, 29)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 5) - hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

2 : Job ID edb7acb5ae2047b1aa6de1224933ad07
test outcome: killed
hash_map.py, start pos: (104, 36), end pos: (104, 37)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 5) + hash) - ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

3 : Job ID 43d895d6f1854ac8beb56c85c5e289ed
test outcome: killed
hash_map.py, start pos: (118, 27), end pos: (118, 28)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) - (hash << 6) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

4 : Job ID 237c5f77ed164a48935c857592a76099
test outcome: killed
hash_map.py, start pos: (118, 41), end pos: (118, 42)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 3
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) - (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

5 : Job ID 0da2a8036f61423999d49432a0a5d74c
test outcome: killed
hash_map.py, start pos: (104, 28), end pos: (104, 29)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 5) * hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

6 : Job ID 15c45f78f78e4f25a82836d3aa9619da
test outcome: killed
hash_map.py, start pos: (104, 36), end pos: (104, 37)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 5) + hash) * ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

7 : Job ID c4c81f9b63324edea01ca4d9177bbe10
test outcome: killed
hash_map.py, start pos: (118, 27), end pos: (118, 28)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) * (hash << 6) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

8 : Job ID 01181dac2468462d850b3cf3c6ea4fcc
test outcome: killed
hash_map.py, start pos: (118, 41), end pos: (118, 42)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 3
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) * (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

9 : Job ID fe4ea0f3d18945f5b01333d44e0661f5
test outcome: killed
hash_map.py, start pos: (104, 28), end pos: (104, 29)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 5) / hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - TypeError: unsup...
========================= 1 failed, 7 passed in 0.14s ==========================

10 : Job ID 701dfb6fef4044dca12a987c2a4b8ecc
test outcome: killed
hash_map.py, start pos: (104, 36), end pos: (104, 37)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 5) + hash) / ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - TypeError: unsup...
========================= 1 failed, 7 passed in 0.14s ==========================

11 : Job ID 8d0b9a6050f240eab7bacc5c052622b6
test outcome: killed
hash_map.py, start pos: (118, 27), end pos: (118, 28)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) / (hash << 6) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - ZeroDivisionErro...
========================= 1 failed, 7 passed in 0.15s ==========================

12 : Job ID 6aa37da59a6d48439ec18a8cd9b968a4
test outcome: killed
hash_map.py, start pos: (118, 41), end pos: (118, 42)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 3
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) / (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - ZeroDivisionErro...
========================= 1 failed, 7 passed in 0.15s ==========================

13 : Job ID e1b655f8bafa4d7bbd3c7a7c4c47922a
test outcome: killed
hash_map.py, start pos: (104, 28), end pos: (104, 29)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 5) // hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

14 : Job ID 139ed3b422f94376a6f5e4d6f4bb3040
test outcome: killed
hash_map.py, start pos: (104, 36), end pos: (104, 37)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 5) + hash) // ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

15 : Job ID f35e8699439448d397f63bdc32f34a9b
test outcome: killed
hash_map.py, start pos: (118, 27), end pos: (118, 28)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) // (hash << 6) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - ZeroDivisionErro...
========================= 1 failed, 7 passed in 0.14s ==========================

16 : Job ID 88dd83fd7f36494195cf913255c40527
test outcome: killed
hash_map.py, start pos: (118, 41), end pos: (118, 42)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 3
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) // (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - ZeroDivisionErro...
========================= 1 failed, 7 passed in 0.15s ==========================

17 : Job ID 6ff04c5e0f214904966857ace8777537
test outcome: killed
hash_map.py, start pos: (104, 28), end pos: (104, 29)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 5) % hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

18 : Job ID 59d839f249a74a43b9d2aaf39882281d
test outcome: killed
hash_map.py, start pos: (104, 36), end pos: (104, 37)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 5) + hash) % ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

19 : Job ID c1310d13e3a145f0b06e59ac5b0d97d9
test outcome: killed
hash_map.py, start pos: (118, 27), end pos: (118, 28)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) % (hash << 6) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - ZeroDivisionErro...
========================= 1 failed, 7 passed in 0.15s ==========================

20 : Job ID 5ed33eb7606346caaf6e87b66298a197
test outcome: killed
hash_map.py, start pos: (118, 41), end pos: (118, 42)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 3
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) % (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - ZeroDivisionErro...
========================= 1 failed, 7 passed in 0.14s ==========================

21 : Job ID 127536ab0d2d447ca8479474ff1582da
test outcome: killed
hash_map.py, start pos: (104, 28), end pos: (104, 29)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 5) ** hash) + ord(letter)
     return hash
timeout

22 : Job ID 094fee48c8454c82b6dc8f4726b41e7e
test outcome: killed
hash_map.py, start pos: (104, 36), end pos: (104, 37)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 5) + hash) ** ord(letter)
     return hash
timeout

23 : Job ID 7195fc9d23084c28a3afe8bf0557503e
test outcome: killed
hash_map.py, start pos: (118, 27), end pos: (118, 28)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) ** (hash << 6) + (hash << 16) - hash
     return hash
timeout

24 : Job ID 3eab1c1540f14b3983e51f22395a84ad
test outcome: killed
hash_map.py, start pos: (118, 41), end pos: (118, 42)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 3
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) ** (hash << 16) - hash
     return hash
timeout

25 : Job ID 715a88aee78e46d88d94029ec8fd474f
test outcome: killed
hash_map.py, start pos: (104, 28), end pos: (104, 29)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 5) >> hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

26 : Job ID 8f64490904e142daaed75b8b7adf2061
test outcome: killed
hash_map.py, start pos: (104, 36), end pos: (104, 37)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 5) + hash) >> ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

27 : Job ID b4bdb901b72449e9beea0660da13a364
test outcome: killed
hash_map.py, start pos: (118, 27), end pos: (118, 28)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) >> (hash << 6) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

28 : Job ID 031cc14d4e9a4a0392757ead82433a9b
test outcome: killed
hash_map.py, start pos: (118, 41), end pos: (118, 42)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 3
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) >> (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

29 : Job ID 9d97b062fb684671846856b6191a6520
test outcome: killed
hash_map.py, start pos: (104, 28), end pos: (104, 29)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 5) << hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - OverflowError: t...
========================= 1 failed, 7 passed in 0.15s ==========================

30 : Job ID e8d15cb5edf94fd693c117df4c968a15
test outcome: killed
hash_map.py, start pos: (104, 36), end pos: (104, 37)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 5) + hash) << ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

31 : Job ID 86903b90216a40b08723527e9d5783e1
test outcome: killed
hash_map.py, start pos: (118, 27), end pos: (118, 28)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) << (hash << 6) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - OverflowError: t...
========================= 1 failed, 7 passed in 0.15s ==========================

32 : Job ID 250b025a325747f3bd7599c0bfda91db
test outcome: killed
hash_map.py, start pos: (118, 41), end pos: (118, 42)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 3
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) << (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - OverflowError: t...
========================= 1 failed, 7 passed in 0.15s ==========================

33 : Job ID 557851e43b67428e8b53796b378eba11
test outcome: killed
hash_map.py, start pos: (104, 28), end pos: (104, 29)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 5) | hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

34 : Job ID ba9b4fe5cb2c42769981dc93c2b7d833
test outcome: killed
hash_map.py, start pos: (104, 36), end pos: (104, 37)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 5) + hash) | ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

35 : Job ID 724dd870fe794752ad081b45ecdd43b8
test outcome: killed
hash_map.py, start pos: (118, 27), end pos: (118, 28)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) | (hash << 6) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

36 : Job ID d1d8699d72894cc4b55cf4b40ac00da4
test outcome: killed
hash_map.py, start pos: (118, 41), end pos: (118, 42)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 3
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) | (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

37 : Job ID 942d131f9f3f42869bc3006af37c450a
test outcome: killed
hash_map.py, start pos: (104, 28), end pos: (104, 29)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 5) & hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

38 : Job ID 85a8499842cc439e9dc958b8c2af453f
test outcome: killed
hash_map.py, start pos: (104, 36), end pos: (104, 37)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 5) + hash) & ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

39 : Job ID 4b134ce2ee3c4c9f9eade6383323b6b2
test outcome: killed
hash_map.py, start pos: (118, 27), end pos: (118, 28)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) & (hash << 6) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.16s ==========================

40 : Job ID 5bc38c9a7b4d474687faf58c82886f61
test outcome: killed
hash_map.py, start pos: (118, 41), end pos: (118, 42)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 3
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) & (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

41 : Job ID 53583ec0ce1a42e2982c23f68575d09c
test outcome: killed
hash_map.py, start pos: (104, 28), end pos: (104, 29)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 5) ^ hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================
