42 : Job ID 1b2fd85b6bde4d93bc2da95d6df90ec0
test outcome: killed
hash_map.py, start pos: (104, 36), end pos: (104, 37)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 5) + hash) ^ ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

43 : Job ID 20300e6916e449428e4cdb94397e59e5
test outcome: killed
hash_map.py, start pos: (118, 27), end pos: (118, 28)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) ^ (hash << 6) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

44 : Job ID 83bf0f7fade2448e8bda0885793fe27e
test outcome: killed
hash_map.py, start pos: (118, 41), end pos: (118, 42)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 3
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) ^ (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

45 : Job ID c519e55a0eb547bbb581b9305de4880e
test outcome: killed
hash_map.py, start pos: (118, 56), end pos: (118, 57)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash << 16) + hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

46 : Job ID e9a6ce55b6eb4384b2c320f6a99dccab
test outcome: killed
hash_map.py, start pos: (118, 56), end pos: (118, 57)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash << 16) * hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

47 : Job ID b80c308260b94d5aa206e2c408c96b1a
test outcome: killed
hash_map.py, start pos: (118, 56), end pos: (118, 57)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash << 16) / hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - ZeroDivisionErro...
========================= 1 failed, 7 passed in 0.14s ==========================

48 : Job ID 52b1b37d6c334d2ea6d2aca44e24c6a6
test outcome: killed
hash_map.py, start pos: (118, 56), end pos: (118, 57)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash << 16) // hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - ZeroDivisionErro...
========================= 1 failed, 7 passed in 0.14s ==========================

49 : Job ID 5912519b129e44e0821797c8bd0b5878
test outcome: killed
hash_map.py, start pos: (118, 56), end pos: (118, 57)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash << 16) % hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - ZeroDivisionErro...
========================= 1 failed, 7 passed in 0.14s ==========================

50 : Job ID f44dedc199f14c84a2fccbca9b8da734
test outcome: killed
hash_map.py, start pos: (118, 56), end pos: (118, 57)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash << 16) ** hash
     return hash
timeout

51 : Job ID fbae89e37c8d427a94945a8e1ff9bf86
test outcome: killed
hash_map.py, start pos: (118, 56), end pos: (118, 57)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash << 16) >> hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

52 : Job ID 62546bb922e44ccfad189bcc129c0d97
test outcome: killed
hash_map.py, start pos: (118, 56), end pos: (118, 57)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash << 16) << hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - OverflowError: t...
========================= 1 failed, 7 passed in 0.15s ==========================

53 : Job ID 9c5cbc6758af4c95ae354c44224933b6
test outcome: killed
hash_map.py, start pos: (118, 56), end pos: (118, 57)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash << 16) | hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

54 : Job ID 9fc88099ec6e4dc7aaa6ea52a92128a1
test outcome: killed
hash_map.py, start pos: (118, 56), end pos: (118, 57)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash << 16) & hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

55 : Job ID da8584a9487a4ac39760a60dfa51f89e
test outcome: killed
hash_map.py, start pos: (118, 56), end pos: (118, 57)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash << 16) ^ hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

56 : Job ID 76556201f05f4a4cbf2d4b15331d06e6
test outcome: killed
hash_map.py, start pos: (30, 43), end pos: (30, 44)
operator: core/ReplaceBinaryOperator_Mod_Add, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -27,7 +27,7 @@
             None 
         """
         # hash the key and map that hash to a bucket
-        hash_key = self.hash_function(key) % len(self.buckets)
+        hash_key = self.hash_function(key) + len(self.buckets)
         bucket = self.buckets[hash_key]
ts-3-5/test_3-5_0-4_125.py FF.F....                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_and_get - IndexError: list ind...
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - IndexError: list in...
FAILED ts-3-5/test_3-5_0-4_125.py::test_delete - IndexError: list index out o...
========================= 3 failed, 5 passed in 0.14s ==========================

59 : Job ID 8c84703dd1c5486983b311fdc874a94b
test outcome: killed
hash_map.py, start pos: (30, 43), end pos: (30, 44)
operator: core/ReplaceBinaryOperator_Mod_Sub, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -27,7 +27,7 @@
             None 
         """
         # hash the key and map that hash to a bucket
-        hash_key = self.hash_function(key) % len(self.buckets)
+        hash_key = self.hash_function(key) - len(self.buckets)
         bucket = self.buckets[hash_key]
ts-3-5/test_3-5_0-4_125.py FF.F....                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_and_get - IndexError: list ind...
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - IndexError: list in...
FAILED ts-3-5/test_3-5_0-4_125.py::test_delete - IndexError: list index out o...
========================= 3 failed, 5 passed in 0.15s ==========================

62 : Job ID 91b30976f22a4c0790cb0cc1cc2ba4f6
test outcome: killed
hash_map.py, start pos: (30, 43), end pos: (30, 44)
operator: core/ReplaceBinaryOperator_Mod_Mul, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -27,7 +27,7 @@
             None 
         """
         # hash the key and map that hash to a bucket
-        hash_key = self.hash_function(key) % len(self.buckets)
+        hash_key = self.hash_function(key) * len(self.buckets)
         bucket = self.buckets[hash_key]
ts-3-5/test_3-5_0-4_125.py FF.F....                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_and_get - IndexError: cannot f...
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - IndexError: cannot ...
FAILED ts-3-5/test_3-5_0-4_125.py::test_delete - IndexError: cannot fit 'int'...
========================= 3 failed, 5 passed in 0.15s ==========================

65 : Job ID 16ff299b579c408eb6fc4a561b4372b8
test outcome: killed
hash_map.py, start pos: (30, 43), end pos: (30, 44)
operator: core/ReplaceBinaryOperator_Mod_Div, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -27,7 +27,7 @@
             None 
         """
         # hash the key and map that hash to a bucket
-        hash_key = self.hash_function(key) % len(self.buckets)
+        hash_key = self.hash_function(key) / len(self.buckets)
         bucket = self.buckets[hash_key]
ts-3-5/test_3-5_0-4_125.py FF.F....                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_and_get - TypeError: list indi...
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - TypeError: list ind...
FAILED ts-3-5/test_3-5_0-4_125.py::test_delete - TypeError: list indices must...
========================= 3 failed, 5 passed in 0.14s ==========================

68 : Job ID aedade97a82b41efade8b090e7fca551
test outcome: killed
hash_map.py, start pos: (30, 43), end pos: (30, 44)
operator: core/ReplaceBinaryOperator_Mod_FloorDiv, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -27,7 +27,7 @@
             None 
         """
         # hash the key and map that hash to a bucket
-        hash_key = self.hash_function(key) % len(self.buckets)
+        hash_key = self.hash_function(key) // len(self.buckets)
         bucket = self.buckets[hash_key]
ts-3-5/test_3-5_0-4_125.py FF.F....                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_and_get - IndexError: list ind...
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - IndexError: list in...
FAILED ts-3-5/test_3-5_0-4_125.py::test_delete - IndexError: list index out o...
========================= 3 failed, 5 passed in 0.14s ==========================

71 : Job ID 8b21a552d50443de9d264f638abc3e45
test outcome: killed
hash_map.py, start pos: (30, 43), end pos: (30, 44)
operator: core/ReplaceBinaryOperator_Mod_Pow, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -27,7 +27,7 @@
             None 
         """
         # hash the key and map that hash to a bucket
-        hash_key = self.hash_function(key) % len(self.buckets)
+        hash_key = self.hash_function(key) ** len(self.buckets)
         bucket = self.buckets[hash_key]
ts-3-5/test_3-5_0-4_125.py FF.F....                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_and_get - IndexError: cannot f...
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - IndexError: cannot ...
FAILED ts-3-5/test_3-5_0-4_125.py::test_delete - IndexError: cannot fit 'int'...
========================= 3 failed, 5 passed in 0.14s ==========================

74 : Job ID d673725e39d648eeb81604c633a9d0fa
test outcome: killed
hash_map.py, start pos: (30, 43), end pos: (30, 44)
operator: core/ReplaceBinaryOperator_Mod_RShift, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -27,7 +27,7 @@
             None 
         """
         # hash the key and map that hash to a bucket
-        hash_key = self.hash_function(key) % len(self.buckets)
+        hash_key = self.hash_function(key) >> len(self.buckets)
         bucket = self.buckets[hash_key]
ts-3-5/test_3-5_0-4_125.py FF.F....                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_and_get - KeyError
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - KeyError
FAILED ts-3-5/test_3-5_0-4_125.py::test_delete - KeyError
========================= 3 failed, 5 passed in 0.14s ==========================

77 : Job ID 4923c2f18fbb4eb6bc3aabfe53b11031
test outcome: killed
hash_map.py, start pos: (30, 43), end pos: (30, 44)
operator: core/ReplaceBinaryOperator_Mod_LShift, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -27,7 +27,7 @@
             None 
         """
         # hash the key and map that hash to a bucket
-        hash_key = self.hash_function(key) % len(self.buckets)
+        hash_key = self.hash_function(key) << len(self.buckets)
         bucket = self.buckets[hash_key]
ts-3-5/test_3-5_0-4_125.py FF.F....                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_and_get - IndexError: cannot f...
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - IndexError: cannot ...
FAILED ts-3-5/test_3-5_0-4_125.py::test_delete - IndexError: cannot fit 'int'...
========================= 3 failed, 5 passed in 0.14s ==========================

80 : Job ID 6dbe1d3f53d044c2a18f05a6d07f9439
test outcome: killed
hash_map.py, start pos: (30, 43), end pos: (30, 44)
operator: core/ReplaceBinaryOperator_Mod_BitOr, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -27,7 +27,7 @@
             None 
         """
         # hash the key and map that hash to a bucket
-        hash_key = self.hash_function(key) % len(self.buckets)
+        hash_key = self.hash_function(key) | len(self.buckets)
         bucket = self.buckets[hash_key]
ts-3-5/test_3-5_0-4_125.py FF.F....                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_and_get - IndexError: list ind...
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - IndexError: list in...
FAILED ts-3-5/test_3-5_0-4_125.py::test_delete - IndexError: list index out o...
========================= 3 failed, 5 passed in 0.15s ==========================

83 : Job ID 604f649fec864df0899dd710cedeb0c9
test outcome: killed
hash_map.py, start pos: (30, 43), end pos: (30, 44)
operator: core/ReplaceBinaryOperator_Mod_BitAnd, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -27,7 +27,7 @@
             None 
         """
         # hash the key and map that hash to a bucket
-        hash_key = self.hash_function(key) % len(self.buckets)
+        hash_key = self.hash_function(key) & len(self.buckets)
         bucket = self.buckets[hash_key]
ts-3-5/test_3-5_0-4_125.py FF.F....                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_and_get - IndexError: list ind...
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - IndexError: list in...
FAILED ts-3-5/test_3-5_0-4_125.py::test_delete - IndexError: list index out o...
========================= 3 failed, 5 passed in 0.14s ==========================

86 : Job ID 78976548af9a4d3da4f24e0674070bc2
test outcome: killed
hash_map.py, start pos: (30, 43), end pos: (30, 44)
operator: core/ReplaceBinaryOperator_Mod_BitXor, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -27,7 +27,7 @@
             None 
         """
         # hash the key and map that hash to a bucket
-        hash_key = self.hash_function(key) % len(self.buckets)
+        hash_key = self.hash_function(key) ^ len(self.buckets)
         bucket = self.buckets[hash_key]
ts-3-5/test_3-5_0-4_125.py FF.F....                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_and_get - IndexError: list ind...
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - IndexError: list in...
FAILED ts-3-5/test_3-5_0-4_125.py::test_delete - IndexError: list index out o...
========================= 3 failed, 5 passed in 0.14s ==========================

89 : Job ID 5815dd59405e4c6fad70bc6d0bb8ab25
test outcome: killed
hash_map.py, start pos: (104, 22), end pos: (104, 24)
operator: core/ReplaceBinaryOperator_LShift_Add, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash + 5) + hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

90 : Job ID 805a979a588b47679b03207047c348b4
test outcome: killed
hash_map.py, start pos: (118, 35), end pos: (118, 37)
operator: core/ReplaceBinaryOperator_LShift_Add, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash + 6) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

91 : Job ID 561fcaf2e8584a208dc3e3c3716e89e0
test outcome: killed
hash_map.py, start pos: (118, 49), end pos: (118, 51)
operator: core/ReplaceBinaryOperator_LShift_Add, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash + 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

92 : Job ID 1f1eb4783f7f4de1bbd3bde3a86a956c
test outcome: killed
hash_map.py, start pos: (104, 22), end pos: (104, 24)
operator: core/ReplaceBinaryOperator_LShift_Sub, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash - 5) + hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

93 : Job ID 198c2af267c549e99186ad0d72b82ab4
test outcome: killed
hash_map.py, start pos: (118, 35), end pos: (118, 37)
operator: core/ReplaceBinaryOperator_LShift_Sub, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash - 6) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

94 : Job ID 286dec608afe456bb5653206db85c3fe
test outcome: killed
hash_map.py, start pos: (118, 49), end pos: (118, 51)
operator: core/ReplaceBinaryOperator_LShift_Sub, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash - 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

95 : Job ID a91f01b8f2ac4f5f9ece70609fa22cec
test outcome: killed
hash_map.py, start pos: (104, 22), end pos: (104, 24)
operator: core/ReplaceBinaryOperator_LShift_Mul, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash * 5) + hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

96 : Job ID 904576be3ffe4cfa8440cb486b17b4f5
test outcome: killed
hash_map.py, start pos: (118, 35), end pos: (118, 37)
operator: core/ReplaceBinaryOperator_LShift_Mul, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash * 6) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

97 : Job ID 8f2b8b73024a42dca0a0c33c8b9d420d
test outcome: killed
hash_map.py, start pos: (118, 49), end pos: (118, 51)
operator: core/ReplaceBinaryOperator_LShift_Mul, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash * 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

98 : Job ID 41575b60ae5346f096aec09e51d160d5
test outcome: killed
hash_map.py, start pos: (104, 22), end pos: (104, 24)
operator: core/ReplaceBinaryOperator_LShift_Div, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash / 5) + hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

99 : Job ID 23cd80656e8f4633a50d0e129196e0e1
test outcome: killed
hash_map.py, start pos: (118, 35), end pos: (118, 37)
operator: core/ReplaceBinaryOperator_LShift_Div, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash / 6) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - TypeError: unsup...
========================= 1 failed, 7 passed in 0.15s ==========================
