100 : Job ID 74f49c28849c4739b221548099ccb267
test outcome: killed
hash_map.py, start pos: (118, 49), end pos: (118, 51)
operator: core/ReplaceBinaryOperator_LShift_Div, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash / 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - TypeError: unsup...
========================= 1 failed, 7 passed in 0.14s ==========================

101 : Job ID 4b307083957147428e4aec2278bb901d
test outcome: killed
hash_map.py, start pos: (104, 22), end pos: (104, 24)
operator: core/ReplaceBinaryOperator_LShift_FloorDiv, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash // 5) + hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

102 : Job ID 7f091c0fb45b45b4920e46ace36215ad
test outcome: killed
hash_map.py, start pos: (118, 35), end pos: (118, 37)
operator: core/ReplaceBinaryOperator_LShift_FloorDiv, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash // 6) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

103 : Job ID 1a25e1030e5f44449c98ced9e99486a4
test outcome: killed
hash_map.py, start pos: (118, 49), end pos: (118, 51)
operator: core/ReplaceBinaryOperator_LShift_FloorDiv, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash // 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

104 : Job ID 7e8fa90467734ea9ae2d7e9ec2902d43
test outcome: killed
hash_map.py, start pos: (104, 22), end pos: (104, 24)
operator: core/ReplaceBinaryOperator_LShift_Mod, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash % 5) + hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

105 : Job ID 4d14715190494f9d9f5553e8de77f379
test outcome: killed
hash_map.py, start pos: (118, 35), end pos: (118, 37)
operator: core/ReplaceBinaryOperator_LShift_Mod, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash % 6) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

106 : Job ID 174c3ed6ac8340ef9be3838a054001d0
test outcome: killed
hash_map.py, start pos: (118, 49), end pos: (118, 51)
operator: core/ReplaceBinaryOperator_LShift_Mod, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash % 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

107 : Job ID 632e4c0aeb1e4103a8c6d02daa136b92
test outcome: killed
hash_map.py, start pos: (104, 22), end pos: (104, 24)
operator: core/ReplaceBinaryOperator_LShift_Pow, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash ** 5) + hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

108 : Job ID 192587d538744dadaeea3e514db1c58a
test outcome: killed
hash_map.py, start pos: (118, 35), end pos: (118, 37)
operator: core/ReplaceBinaryOperator_LShift_Pow, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash ** 6) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

109 : Job ID d8ad83cefa6847a1a920a7beaea72c0d
test outcome: killed
hash_map.py, start pos: (118, 49), end pos: (118, 51)
operator: core/ReplaceBinaryOperator_LShift_Pow, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash ** 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

110 : Job ID 7468c0da9e984a8b89ca3b323ce69820
test outcome: killed
hash_map.py, start pos: (104, 22), end pos: (104, 24)
operator: core/ReplaceBinaryOperator_LShift_RShift, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash >> 5) + hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

111 : Job ID 03189c4094f0436ca262d59c883317bb
test outcome: killed
hash_map.py, start pos: (118, 35), end pos: (118, 37)
operator: core/ReplaceBinaryOperator_LShift_RShift, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash >> 6) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.17s ==========================

112 : Job ID 6d9dc89766a14ef1bbad33f636fa0ec5
test outcome: killed
hash_map.py, start pos: (118, 49), end pos: (118, 51)
operator: core/ReplaceBinaryOperator_LShift_RShift, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash >> 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

113 : Job ID c4b598afa01242c1b29f94211f599ca9
test outcome: killed
hash_map.py, start pos: (104, 22), end pos: (104, 24)
operator: core/ReplaceBinaryOperator_LShift_BitOr, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash | 5) + hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

114 : Job ID 1b874ad940e645d6a83fde5e33fe333f
test outcome: killed
hash_map.py, start pos: (118, 35), end pos: (118, 37)
operator: core/ReplaceBinaryOperator_LShift_BitOr, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash | 6) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

115 : Job ID 95a94d51ca264d04b2b955567ec7b9b5
test outcome: killed
hash_map.py, start pos: (118, 49), end pos: (118, 51)
operator: core/ReplaceBinaryOperator_LShift_BitOr, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash | 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

116 : Job ID e6800e3279754ba69ee3d938f3ca8dd2
test outcome: killed
hash_map.py, start pos: (104, 22), end pos: (104, 24)
operator: core/ReplaceBinaryOperator_LShift_BitAnd, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash & 5) + hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

117 : Job ID 4ea54003dd034506af4bca1fa16476ca
test outcome: killed
hash_map.py, start pos: (118, 35), end pos: (118, 37)
operator: core/ReplaceBinaryOperator_LShift_BitAnd, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash & 6) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

118 : Job ID 069991cb474442f19b4a91984aefcd6f
test outcome: killed
hash_map.py, start pos: (118, 49), end pos: (118, 51)
operator: core/ReplaceBinaryOperator_LShift_BitAnd, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash & 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

119 : Job ID 94a752e0aac44eab922e94240ce68274
test outcome: killed
hash_map.py, start pos: (104, 22), end pos: (104, 24)
operator: core/ReplaceBinaryOperator_LShift_BitXor, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash ^ 5) + hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

120 : Job ID be0ec63f08704805a4b922868a56239c
test outcome: killed
hash_map.py, start pos: (118, 35), end pos: (118, 37)
operator: core/ReplaceBinaryOperator_LShift_BitXor, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash ^ 6) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

121 : Job ID a5de79f3727c469bbc7321162e9cd067
test outcome: killed
hash_map.py, start pos: (118, 49), end pos: (118, 51)
operator: core/ReplaceBinaryOperator_LShift_BitXor, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash ^ 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

122 : Job ID 38eba644e8854f828de1f2ff38592b79
test outcome: killed
hash_map.py, start pos: (36, 22), end pos: (36, 24)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -33,7 +33,7 @@
         for i, val in enumerate(bucket):
             # check if exists, and override if so
-            if val[0] == key:
+            if val[0] != key:
                 bucket[i] = (key, value)
                 return
         # insert new
ts-3-5/test_3-5_0-4_125.py .F......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - AssertionError: ass...
========================= 1 failed, 7 passed in 0.15s ==========================

123 : Job ID 250883d11465438daed5c5b95f2ab060
test outcome: killed
hash_map.py, start pos: (63, 22), end pos: (63, 24)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -60,7 +60,7 @@
         # find that key in the bucket
         for val in bucket:
-            if val[0] == key:
+            if val[0] != key:
                 return val[1]
         raise KeyError
ts-3-5/test_3-5_0-4_125.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_and_get - KeyError
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - KeyError
========================= 2 failed, 6 passed in 0.15s ==========================

124 : Job ID 79f01cc84b75451db0cb289114362056
test outcome: killed
hash_map.py, start pos: (88, 22), end pos: (88, 24)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -85,7 +85,7 @@
         # find the key in the bucket, delete it, and return it
         for i, val in enumerate(bucket):
-            if val[0] == key:
+            if val[0] != key:
                 del bucket[i]
                 return val
ts-3-5/test_3-5_0-4_125.py ...F....                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_delete - KeyError
========================= 1 failed, 7 passed in 0.14s ==========================

125 : Job ID 21be566e940346c08d7e95627f729f3b
test outcome: killed
hash_map.py, start pos: (36, 22), end pos: (36, 24)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -33,7 +33,7 @@
         for i, val in enumerate(bucket):
             # check if exists, and override if so
-            if val[0] == key:
+            if val[0] < key:
                 bucket[i] = (key, value)
                 return
         # insert new
ts-3-5/test_3-5_0-4_125.py .F......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - AssertionError: ass...
========================= 1 failed, 7 passed in 0.14s ==========================

126 : Job ID 9da47b32b51f4ec185b0eca33c503a98
test outcome: killed
hash_map.py, start pos: (63, 22), end pos: (63, 24)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -60,7 +60,7 @@
         # find that key in the bucket
         for val in bucket:
-            if val[0] == key:
+            if val[0] < key:
                 return val[1]
         raise KeyError
ts-3-5/test_3-5_0-4_125.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_and_get - KeyError
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - KeyError
========================= 2 failed, 6 passed in 0.15s ==========================

127 : Job ID a95752d9a53b47a794572a7d62f0b1a7
test outcome: killed
hash_map.py, start pos: (88, 22), end pos: (88, 24)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -85,7 +85,7 @@
         # find the key in the bucket, delete it, and return it
         for i, val in enumerate(bucket):
-            if val[0] == key:
+            if val[0] < key:
                 del bucket[i]
                 return val
ts-3-5/test_3-5_0-4_125.py ...F....                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_delete - KeyError
========================= 1 failed, 7 passed in 0.14s ==========================

128 : Job ID b47e5d04b43f4bfb950568342ed4f456
SURVIVED
test outcome: survived
hash_map.py, start pos: (36, 22), end pos: (36, 24)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -33,7 +33,7 @@
         for i, val in enumerate(bucket):
             # check if exists, and override if so
-            if val[0] == key:
+            if val[0] <= key:
                 bucket[i] = (key, value)
                 return
         # insert new
ts-3-5/test_3-5_0-4_125.py ........                                      [100%]
============================== 8 passed in 0.15s ===============================

129 : Job ID 3d19297171c148a8b905c11358099624
SURVIVED
test outcome: survived
hash_map.py, start pos: (63, 22), end pos: (63, 24)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -60,7 +60,7 @@
         # find that key in the bucket
         for val in bucket:
-            if val[0] == key:
+            if val[0] <= key:
                 return val[1]
         raise KeyError
ts-3-5/test_3-5_0-4_125.py ........                                      [100%]
============================== 8 passed in 0.14s ===============================

130 : Job ID beef29f100654c91a658b96682ef755c
SURVIVED
test outcome: survived
hash_map.py, start pos: (88, 22), end pos: (88, 24)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -85,7 +85,7 @@
         # find the key in the bucket, delete it, and return it
         for i, val in enumerate(bucket):
-            if val[0] == key:
+            if val[0] <= key:
                 del bucket[i]
                 return val
ts-3-5/test_3-5_0-4_125.py ........                                      [100%]
============================== 8 passed in 0.14s ===============================

131 : Job ID 23962d6fccee4715887b3616c1cb60bd
test outcome: killed
hash_map.py, start pos: (36, 22), end pos: (36, 24)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -33,7 +33,7 @@
         for i, val in enumerate(bucket):
             # check if exists, and override if so
-            if val[0] == key:
+            if val[0] > key:
                 bucket[i] = (key, value)
                 return
         # insert new
ts-3-5/test_3-5_0-4_125.py .F......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - AssertionError: ass...
========================= 1 failed, 7 passed in 0.15s ==========================

132 : Job ID e661d990b37446c995c8e5be961d1ab1
test outcome: killed
hash_map.py, start pos: (63, 22), end pos: (63, 24)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -60,7 +60,7 @@
         # find that key in the bucket
         for val in bucket:
-            if val[0] == key:
+            if val[0] > key:
                 return val[1]
         raise KeyError
ts-3-5/test_3-5_0-4_125.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_and_get - KeyError
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - KeyError
========================= 2 failed, 6 passed in 0.15s ==========================

133 : Job ID aef3d2d712874fe5bf608271b6d90c3f
test outcome: killed
hash_map.py, start pos: (88, 22), end pos: (88, 24)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -85,7 +85,7 @@
         # find the key in the bucket, delete it, and return it
         for i, val in enumerate(bucket):
-            if val[0] == key:
+            if val[0] > key:
                 del bucket[i]
                 return val
ts-3-5/test_3-5_0-4_125.py ...F....                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_delete - KeyError
========================= 1 failed, 7 passed in 0.14s ==========================

134 : Job ID 55c9cd580ae942de9e221c13faee324a
SURVIVED
test outcome: survived
hash_map.py, start pos: (36, 22), end pos: (36, 24)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -33,7 +33,7 @@
         for i, val in enumerate(bucket):
             # check if exists, and override if so
-            if val[0] == key:
+            if val[0] >= key:
                 bucket[i] = (key, value)
                 return
         # insert new
ts-3-5/test_3-5_0-4_125.py ........                                      [100%]
============================== 8 passed in 0.15s ===============================

135 : Job ID af9ade800a0941d380df48363bf3552e
SURVIVED
test outcome: survived
hash_map.py, start pos: (63, 22), end pos: (63, 24)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -60,7 +60,7 @@
         # find that key in the bucket
         for val in bucket:
-            if val[0] == key:
+            if val[0] >= key:
                 return val[1]
         raise KeyError
ts-3-5/test_3-5_0-4_125.py ........                                      [100%]
============================== 8 passed in 0.14s ===============================

136 : Job ID 88fafdd29d074a6db6a4d538ef254698
SURVIVED
test outcome: survived
hash_map.py, start pos: (88, 22), end pos: (88, 24)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -85,7 +85,7 @@
         # find the key in the bucket, delete it, and return it
         for i, val in enumerate(bucket):
-            if val[0] == key:
+            if val[0] >= key:
                 del bucket[i]
                 return val
ts-3-5/test_3-5_0-4_125.py ........                                      [100%]
============================== 8 passed in 0.14s ===============================

137 : Job ID cbc25e0207514146b62e120e5776001a
SURVIVED
test outcome: survived
hash_map.py, start pos: (36, 22), end pos: (36, 24)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -33,7 +33,7 @@
         for i, val in enumerate(bucket):
             # check if exists, and override if so
-            if val[0] == key:
+            if val[0] is key:
                 bucket[i] = (key, value)
                 return
         # insert new
ts-3-5/test_3-5_0-4_125.py ........                                      [100%]
============================== 8 passed in 0.14s ===============================

138 : Job ID 6c12933853644300b6eaeb24365b622d
SURVIVED
test outcome: survived
hash_map.py, start pos: (63, 22), end pos: (63, 24)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -60,7 +60,7 @@
         # find that key in the bucket
         for val in bucket:
-            if val[0] == key:
+            if val[0] is key:
                 return val[1]
         raise KeyError
ts-3-5/test_3-5_0-4_125.py ........                                      [100%]
============================== 8 passed in 0.14s ===============================

139 : Job ID cebea1f8d45e4963866a190cd95e9a5d
SURVIVED
test outcome: survived
hash_map.py, start pos: (88, 22), end pos: (88, 24)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -85,7 +85,7 @@
         # find the key in the bucket, delete it, and return it
         for i, val in enumerate(bucket):
-            if val[0] == key:
+            if val[0] is key:
                 del bucket[i]
                 return val
ts-3-5/test_3-5_0-4_125.py ........                                      [100%]
============================== 8 passed in 0.14s ===============================
