140 : Job ID 27951b635e564ababfef848a0bf914cc
test outcome: killed
hash_map.py, start pos: (36, 22), end pos: (36, 24)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -33,7 +33,7 @@
         for i, val in enumerate(bucket):
             # check if exists, and override if so
-            if val[0] == key:
+            if val[0] is not key:
                 bucket[i] = (key, value)
                 return
         # insert new
ts-3-5/test_3-5_0-4_125.py .F......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - AssertionError: ass...
========================= 1 failed, 7 passed in 0.14s ==========================

141 : Job ID d8c329161c2743859e49d526d8c7560e
test outcome: killed
hash_map.py, start pos: (63, 22), end pos: (63, 24)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -60,7 +60,7 @@
         # find that key in the bucket
         for val in bucket:
-            if val[0] == key:
+            if val[0] is not key:
                 return val[1]
         raise KeyError
ts-3-5/test_3-5_0-4_125.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_and_get - KeyError
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - KeyError
========================= 2 failed, 6 passed in 0.14s ==========================

142 : Job ID e5adff427bef42339f867b1b4117ca6d
test outcome: killed
hash_map.py, start pos: (88, 22), end pos: (88, 24)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -85,7 +85,7 @@
         # find the key in the bucket, delete it, and return it
         for i, val in enumerate(bucket):
-            if val[0] == key:
+            if val[0] is not key:
                 del bucket[i]
                 return val
ts-3-5/test_3-5_0-4_125.py ...F....                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_delete - KeyError
========================= 1 failed, 7 passed in 0.14s ==========================

143 : Job ID aaa7439efea144629861349f5494d797
test outcome: killed
hash_map.py, start pos: (36, 15), end pos: (36, 28)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -33,7 +33,7 @@
         for i, val in enumerate(bucket):
             # check if exists, and override if so
-            if val[0] == key:
+            if not val[0] == key:
                 bucket[i] = (key, value)
                 return
         # insert new
ts-3-5/test_3-5_0-4_125.py .F......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - AssertionError: ass...
========================= 1 failed, 7 passed in 0.15s ==========================

144 : Job ID 642f1d558cfb444ab504b858cd0ba563
test outcome: killed
hash_map.py, start pos: (63, 15), end pos: (63, 28)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -60,7 +60,7 @@
         # find that key in the bucket
         for val in bucket:
-            if val[0] == key:
+            if not val[0] == key:
                 return val[1]
         raise KeyError
ts-3-5/test_3-5_0-4_125.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_and_get - KeyError
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - KeyError
========================= 2 failed, 6 passed in 0.14s ==========================

145 : Job ID 30032e84e33f47d3bd2744de8ebbc756
test outcome: killed
hash_map.py, start pos: (88, 15), end pos: (88, 28)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -85,7 +85,7 @@
         # find the key in the bucket, delete it, and return it
         for i, val in enumerate(bucket):
-            if val[0] == key:
+            if not val[0] == key:
                 del bucket[i]
                 return val
ts-3-5/test_3-5_0-4_125.py ...F....                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_delete - KeyError
========================= 1 failed, 7 passed in 0.14s ==========================

146 : Job ID 28bc011687b64a758c9a981f0432a4c3
SURVIVED
test outcome: survived
hash_map.py, start pos: (6, 31), end pos: (6, 34)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -3,7 +3,7 @@
     Data structure that stores key:value pairs.
     """
-    def __init__(self, buckets=256, hash_function=lambda key: hash(key)):
+    def __init__(self, buckets= 257, hash_function=lambda key: hash(key)):
         self.buckets = [[] for i in range(buckets)]
         self.hash_function = hash_function
ts-3-5/test_3-5_0-4_125.py ........                                      [100%]
============================== 8 passed in 0.15s ===============================

147 : Job ID 8f961d04646f4596a65216158c8b8593
SURVIVED
test outcome: survived
hash_map.py, start pos: (6, 31), end pos: (6, 34)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -3,7 +3,7 @@
     Data structure that stores key:value pairs.
     """
-    def __init__(self, buckets=256, hash_function=lambda key: hash(key)):
+    def __init__(self, buckets= 255, hash_function=lambda key: hash(key)):
         self.buckets = [[] for i in range(buckets)]
         self.hash_function = hash_function
ts-3-5/test_3-5_0-4_125.py ........                                      [100%]
============================== 8 passed in 0.15s ===============================

148 : Job ID 8b0f54ec2c124400b5ec3524b849a6cc
test outcome: killed
hash_map.py, start pos: (36, 19), end pos: (36, 20)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -33,7 +33,7 @@
         for i, val in enumerate(bucket):
             # check if exists, and override if so
-            if val[0] == key:
+            if val[ 1] == key:
                 bucket[i] = (key, value)
                 return
         # insert new
ts-3-5/test_3-5_0-4_125.py .F......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - AssertionError: ass...
========================= 1 failed, 7 passed in 0.15s ==========================

149 : Job ID e2e9d92a534b4b798018d5a69d3927e8
test outcome: killed
hash_map.py, start pos: (36, 19), end pos: (36, 20)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -33,7 +33,7 @@
         for i, val in enumerate(bucket):
             # check if exists, and override if so
-            if val[0] == key:
+            if val[ -1] == key:
                 bucket[i] = (key, value)
                 return
         # insert new
ts-3-5/test_3-5_0-4_125.py .F......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - AssertionError: ass...
========================= 1 failed, 7 passed in 0.14s ==========================

150 : Job ID bcef5fa0ad8d49bcb64aa19f1c38f002
test outcome: killed
hash_map.py, start pos: (63, 19), end pos: (63, 20)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -60,7 +60,7 @@
         # find that key in the bucket
         for val in bucket:
-            if val[0] == key:
+            if val[ 1] == key:
                 return val[1]
         raise KeyError
ts-3-5/test_3-5_0-4_125.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_and_get - KeyError
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - KeyError
========================= 2 failed, 6 passed in 0.15s ==========================

151 : Job ID 6aded27bf3854cf08a4892cca60ea6e1
test outcome: killed
hash_map.py, start pos: (63, 19), end pos: (63, 20)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -60,7 +60,7 @@
         # find that key in the bucket
         for val in bucket:
-            if val[0] == key:
+            if val[ -1] == key:
                 return val[1]
         raise KeyError
ts-3-5/test_3-5_0-4_125.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_and_get - KeyError
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - KeyError
========================= 2 failed, 6 passed in 0.15s ==========================

152 : Job ID 452a1d8dd9d44dcf9a0beede8f74b7f5
test outcome: killed
hash_map.py, start pos: (64, 27), end pos: (64, 28)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -61,7 +61,7 @@
         # find that key in the bucket
         for val in bucket:
             if val[0] == key:
-                return val[1]
+                return val[ 2]
         raise KeyError
ts-3-5/test_3-5_0-4_125.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_and_get - IndexError: tuple in...
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - IndexError: tuple i...
========================= 2 failed, 6 passed in 0.15s ==========================

153 : Job ID 88b69ee640df4619828341a832c72594
test outcome: killed
hash_map.py, start pos: (64, 27), end pos: (64, 28)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -61,7 +61,7 @@
         # find that key in the bucket
         for val in bucket:
             if val[0] == key:
-                return val[1]
+                return val[ 0]
         raise KeyError
ts-3-5/test_3-5_0-4_125.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_and_get - AssertionError: asse...
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - AssertionError: ass...
========================= 2 failed, 6 passed in 0.15s ==========================

154 : Job ID 4dc13e94ce1146628bbd9219303856bc
test outcome: killed
hash_map.py, start pos: (88, 19), end pos: (88, 20)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -85,7 +85,7 @@
         # find the key in the bucket, delete it, and return it
         for i, val in enumerate(bucket):
-            if val[0] == key:
+            if val[ 1] == key:
                 del bucket[i]
                 return val
ts-3-5/test_3-5_0-4_125.py ...F....                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_delete - KeyError
========================= 1 failed, 7 passed in 0.15s ==========================

155 : Job ID 91f23168e46d4cd4b3a945152d2b1100
test outcome: killed
hash_map.py, start pos: (88, 19), end pos: (88, 20)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -85,7 +85,7 @@
         # find the key in the bucket, delete it, and return it
         for i, val in enumerate(bucket):
-            if val[0] == key:
+            if val[ -1] == key:
                 del bucket[i]
                 return val
ts-3-5/test_3-5_0-4_125.py ...F....                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_delete - KeyError
========================= 1 failed, 7 passed in 0.15s ==========================

156 : Job ID b005d5d8374d4eb98c881dd057238558
test outcome: killed
hash_map.py, start pos: (101, 11), end pos: (101, 15)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -98,7 +98,7 @@
     This algorithm (k=33) was first reported 
     by dan bernstein many years ago in comp.lang.c.
     """
-    hash = 5381
+    hash = 5382
     for letter in str(key):
         hash = ((hash << 5) + hash) + ord(letter)
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

157 : Job ID 6a872c5a4b2d44379bfe2492e53c36c4
test outcome: killed
hash_map.py, start pos: (101, 11), end pos: (101, 15)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -98,7 +98,7 @@
     This algorithm (k=33) was first reported 
     by dan bernstein many years ago in comp.lang.c.
     """
-    hash = 5381
+    hash = 5380
     for letter in str(key):
         hash = ((hash << 5) + hash) + ord(letter)
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

158 : Job ID 1e8e671198ee4d698dd6872cfab7adcf
test outcome: killed
hash_map.py, start pos: (104, 25), end pos: (104, 26)
operator: core/NumberReplacer, occurrence: 12
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 6) + hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

159 : Job ID 81b254cb82134abbb2cc66d17d556bb5
test outcome: killed
hash_map.py, start pos: (104, 25), end pos: (104, 26)
operator: core/NumberReplacer, occurrence: 13
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -101,7 +101,7 @@
     hash = 5381
     for letter in str(key):
-        hash = ((hash << 5) + hash) + ord(letter)
+        hash = ((hash << 4) + hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

160 : Job ID e49d67052ebf4f6dbfe789f75e9d68d6
test outcome: killed
hash_map.py, start pos: (115, 11), end pos: (115, 12)
operator: core/NumberReplacer, occurrence: 14
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -112,7 +112,7 @@
     This algorithm was created for sdbm (a public-domain
      reimplementation of ndbm) database library.
     """
-    hash = 0
+    hash = 1
     for letter in str(key):
         hash = ord(letter) + (hash << 6) + (hash << 16) - hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

161 : Job ID 99db3a6339e54e8cad08fb8881477708
test outcome: killed
hash_map.py, start pos: (115, 11), end pos: (115, 12)
operator: core/NumberReplacer, occurrence: 15
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -112,7 +112,7 @@
     This algorithm was created for sdbm (a public-domain
      reimplementation of ndbm) database library.
     """
-    hash = 0
+    hash = -1
     for letter in str(key):
         hash = ord(letter) + (hash << 6) + (hash << 16) - hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

162 : Job ID 785d009324664482abb8aa233d30e3d1
test outcome: killed
hash_map.py, start pos: (118, 38), end pos: (118, 39)
operator: core/NumberReplacer, occurrence: 16
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 7) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

163 : Job ID 20610503119d430693285045219fccda
test outcome: killed
hash_map.py, start pos: (118, 38), end pos: (118, 39)
operator: core/NumberReplacer, occurrence: 17
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 5) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

164 : Job ID dbda5e6e1dfa4489b01cb1de6ab481aa
test outcome: killed
hash_map.py, start pos: (118, 52), end pos: (118, 54)
operator: core/NumberReplacer, occurrence: 18
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash << 17) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

165 : Job ID c3d21c19ec404fa1826ac9a753600f7c
test outcome: killed
hash_map.py, start pos: (118, 52), end pos: (118, 54)
operator: core/NumberReplacer, occurrence: 19
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -115,7 +115,7 @@
     hash = 0
     for letter in str(key):
-        hash = ord(letter) + (hash << 6) + (hash << 16) - hash
+        hash = ord(letter) + (hash << 6) + (hash << 15) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.14s ==========================

168 : Job ID 979a7b5112004f0193390294c69cb315
test outcome: killed
hash_map.py, start pos: (34, 22), end pos: (34, 39)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -31,7 +31,7 @@
         bucket = self.buckets[hash_key]
-        for i, val in enumerate(bucket):
+        for i, val in []:
             # check if exists, and override if so
             if val[0] == key:
                 bucket[i] = (key, value)
ts-3-5/test_3-5_0-4_125.py .F......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - AssertionError: ass...
========================= 1 failed, 7 passed in 0.15s ==========================

169 : Job ID 65ccb2ca08a64011b81f05c48a971981
test outcome: killed
hash_map.py, start pos: (62, 19), end pos: (62, 25)
operator: core/ZeroIterationForLoop, occurrence: 1
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -59,7 +59,7 @@
         bucket = self.buckets[hash_key]
         # find that key in the bucket
-        for val in bucket:
+        for val in []:
             if val[0] == key:
                 return val[1]
ts-3-5/test_3-5_0-4_125.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_and_get - KeyError
FAILED ts-3-5/test_3-5_0-4_125.py::test_insert_override - KeyError
========================= 2 failed, 6 passed in 0.15s ==========================

170 : Job ID aee811d38a2d4970910b8df84a3c7e54
test outcome: killed
hash_map.py, start pos: (87, 22), end pos: (87, 39)
operator: core/ZeroIterationForLoop, occurrence: 2
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -84,7 +84,7 @@
         bucket = self.buckets[hash_key]
         # find the key in the bucket, delete it, and return it
-        for i, val in enumerate(bucket):
+        for i, val in []:
             if val[0] == key:
                 del bucket[i]
                 return val
ts-3-5/test_3-5_0-4_125.py ...F....                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_delete - KeyError
========================= 1 failed, 7 passed in 0.14s ==========================

171 : Job ID 09708a1976fe43a9a3a631654420052d
test outcome: killed
hash_map.py, start pos: (103, 18), end pos: (103, 26)
operator: core/ZeroIterationForLoop, occurrence: 3
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -100,7 +100,7 @@
     """
     hash = 5381
-    for letter in str(key):
+    for letter in []:
         hash = ((hash << 5) + hash) + ord(letter)
     return hash
ts-3-5/test_3-5_0-4_125.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_djb2_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================

172 : Job ID 0c7e1e08f25f44c38cfa5770e83cfa3d
test outcome: killed
hash_map.py, start pos: (117, 18), end pos: (117, 26)
operator: core/ZeroIterationForLoop, occurrence: 4
--- mutation diff ---
--- ahash_map.py
+++ bhash_map.py
@@ -114,7 +114,7 @@
     """
     hash = 0
-    for letter in str(key):
+    for letter in []:
         hash = ord(letter) + (hash << 6) + (hash << 16) - hash
     return hash
ts-3-5/test_3-5_0-4_125.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-4_125.py::test_sdbm_hash_function - AssertionError: ...
========================= 1 failed, 7 passed in 0.15s ==========================
