   - [#   1] AOR hash_map: 
--------------------------------------------------------------------------------
   26:         Returns:
   27:             None 
   28:         """
   29:         
-  30:         hash_key = self.hash_function(key) % len(self.buckets)
+  30:         hash_key = self.hash_function(key) * len(self.buckets)
   31:         
   32:         bucket = self.buckets[hash_key]
   33:         
   34:         for (i, val) in enumerate(bucket):
--------------------------------------------------------------------------------
[0.20989 s] killed by ts-3-5/test_3-5_0-5_180.py::test_hashmap_insert

hashmap = <hash_map.HashMap object at 0x78452ead0370>

    def test_hashmap_insert(hashmap):
>       hashmap.insert('key1', 'value1')

ts-3-5/test_3-5_0-5_180.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <hash_map.HashMap object at 0x78452ead0370>, key = 'key1'
value = 'value1'

>   ???
E   IndexError: cannot fit 'int' into an index-sized integer

hash_map:32: IndexError

   - [#   6] AOR hash_map: 
--------------------------------------------------------------------------------
  114:     '''
  115:     hash = 0
  116:     
  117:     for letter in str(key):
- 118:         hash = ((ord(letter) + (hash << 6)) + (hash << 16)) - hash
+ 118:         hash = ((ord(letter) - (hash << 6)) + (hash << 16)) - hash
  119:     
  120:     return hash
  121: 
  122: def lose_lose(key):
--------------------------------------------------------------------------------
[0.20608 s] killed by ts-3-5/test_3-5_0-5_180.py::test_sdbm_hash_function

def test_sdbm_hash_function():
>       assert sdbm('test') == 32745785343201586
E       AssertionError

ts-3-5/test_3-5_0-5_180.py:43: AssertionError

   - [#   7] AOR hash_map: 
--------------------------------------------------------------------------------
  114:     '''
  115:     hash = 0
  116:     
  117:     for letter in str(key):
- 118:         hash = ((ord(letter) + (hash << 6)) + (hash << 16)) - hash
+ 118:         hash = ((ord(letter) + (hash << 6)) - (hash << 16)) - hash
  119:     
  120:     return hash
  121: 
  122: def lose_lose(key):
--------------------------------------------------------------------------------
[0.22335 s] killed by ts-3-5/test_3-5_0-5_180.py::test_sdbm_hash_function

def test_sdbm_hash_function():
>       assert sdbm('test') == 32745785343201586
E       AssertionError

ts-3-5/test_3-5_0-5_180.py:43: AssertionError

   - [#   8] AOR hash_map: 
--------------------------------------------------------------------------------
  114:     '''
  115:     hash = 0
  116:     
  117:     for letter in str(key):
- 118:         hash = ((ord(letter) + (hash << 6)) + (hash << 16)) - hash
+ 118:         hash = ((ord(letter) + (hash << 6)) + (hash << 16)) + hash
  119:     
  120:     return hash
  121: 
  122: def lose_lose(key):
--------------------------------------------------------------------------------
[0.20608 s] killed by ts-3-5/test_3-5_0-5_180.py::test_sdbm_hash_function

def test_sdbm_hash_function():
>       assert sdbm('test') == 32745785343201586
E       AssertionError

ts-3-5/test_3-5_0-5_180.py:43: AssertionError

   - [#   9] ASR hash_map: 
--------------------------------------------------------------------------------
  129:     '''
  130:     hash = 0
  131:     
  132:     for letter in str(key):
- 133:         hash += ord(letter)
+ 133:         hash -= ord(letter)
  134:     
  135:     return hash
--------------------------------------------------------------------------------
[0.21076 s] killed by ts-3-5/test_3-5_0-5_180.py::test_lose_lose_hash_function

def test_lose_lose_hash_function():
>       assert lose_lose('test') == 448
E       AssertionError

ts-3-5/test_3-5_0-5_180.py:46: AssertionError

   - [#  11] CDI hash_map: 
--------------------------------------------------------------------------------
    6:     def __init__(self, buckets=256, hash_function=lambda key: (hash(key))):
    7:         self.buckets = [[] for i in range(buckets)]
    8:         self.hash_function = hash_function
    9:     
-  10:     def insert(self, key, value):
-  11:         """
-  12:         Insert a key into the hash map.
-  13: 
-  14:         Insert a key into the map.  Internally the
-  15:         key is hashed with the internal hashing_function
-  16:         and placed into a bucket.  If the bucket  contains
-  17:         an element with the same key that keys value 
-  18:         will be overridden.
-  19: 
-  20:         Args:
-  21:             key: the key that will be hashed to index 
-  22:                 the value 
-  23:             value: the value that will be stored at
-  24:                 the index of 'key'
-  25: 
-  26:         Returns:
-  27:             None 
-  28:         """
-  29:         
-  30:         hash_key = self.hash_function(key) % len(self.buckets)
-  31:         
-  32:         bucket = self.buckets[hash_key]
-  33:         
-  34:         for (i, val) in enumerate(bucket):
-  35:             
-  36:             if val[0] == key:
-  37:                 bucket[i] = (key, value)
-  38:                 return
-  39:         
-  40:         bucket.append((key, value))
-  41:     
+  10:     @classmethod
+  11:     def insert(self, key, value):
+  12:         """
+  13:         Insert a key into the hash map.
+  14: 
+  15:         Insert a key into the map.  Internally the
+  16:         key is hashed with the internal hashing_function

   - [#  12] CDI hash_map: 
--------------------------------------------------------------------------------
   38:                 return
   39:         
   40:         bucket.append((key, value))
   41:     
-  42:     def get(self, key):
-  43:         '''
-  44:         Get a value from the map.
-  45: 
-  46:         Args:
-  47:             key: the identifying key which will have its
-  48:                 value returned
-  49:         
-  50:         Returns:
-  51:             The value that is stored within key.
-  52: 
-  53:         Raises:
-  54:             KeyError: Raised when key cannot be found.
-  55:         '''
-  56:         
-  57:         hash_key = self.hash_function(key) % len(self.buckets)
-  58:         
-  59:         bucket = self.buckets[hash_key]
-  60:         
+  42:     @classmethod
+  43:     def get(self, key):
+  44:         '''
+  45:         Get a value from the map.
+  46: 
+  47:         Args:
+  48:             key: the identifying key which will have its
+  49:                 value returned
+  50:         
+  51:         Returns:
+  52:             The value that is stored within key.
+  53: 
+  54:         Raises:
+  55:             KeyError: Raised when key cannot be found.
+  56:         '''
+  57:         
+  58:         hash_key = self.hash_function(key) % len(self.buckets)
+  59:         
+  60:         bucket = self.buckets[hash_key]
   61:

   - [#  13] CDI hash_map: 
--------------------------------------------------------------------------------
   64:                 return val[1]
   65:         
   66:         raise KeyError
   67:     
-  68:     def delete(self, key):
-  69:         '''
-  70:         Delete a key from the map.
-  71: 
-  72:         Args:
-  73:             key: the key to delete
-  74:         
-  75:         Returns:
-  76:             The value of the key that was deleted.
-  77: 
-  78:         Raises:
-  79:             KeyError: Raised when the key cannot be found.
-  80:         '''
-  81:         
-  82:         hash_key = self.hash_function(key) % len(self.buckets)
-  83:         
-  84:         bucket = self.buckets[hash_key]
-  85:         
+  68:     @classmethod
+  69:     def delete(self, key):
+  70:         '''
+  71:         Delete a key from the map.
+  72: 
+  73:         Args:
+  74:             key: the key to delete
+  75:         
+  76:         Returns:
+  77:             The value of the key that was deleted.
+  78: 
+  79:         Raises:
+  80:             KeyError: Raised when the key cannot be found.
+  81:         '''
+  82:         
+  83:         hash_key = self.hash_function(key) % len(self.buckets)
+  84:         
+  85:         bucket = self.buckets[hash_key]
   86:         
-  87:         for (i, val) in enumerate(bucket):
-  88:             if val[0] == key:

   - [#  14] COI hash_map: 
--------------------------------------------------------------------------------
   32:         bucket = self.buckets[hash_key]
   33:         
   34:         for (i, val) in enumerate(bucket):
   35:             
-  36:             if val[0] == key:
+  36:             if not (val[0] == key):
   37:                 bucket[i] = (key, value)
   38:                 return
   39:         
   40:         bucket.append((key, value))
--------------------------------------------------------------------------------
[0.20249 s] killed by ts-3-5/test_3-5_0-5_180.py::test_hashmap_insert_override

hashmap = <hash_map.HashMap object at 0x78452e911660>

    def test_hashmap_insert_override(hashmap):
        hashmap.insert('key2', 'value2')
        hashmap.insert('key2', 'new_value2')
>       assert hashmap.get('key2') == 'new_value2'
E       AssertionError

ts-3-5/test_3-5_0-5_180.py:22: AssertionError

   - [#  15] COI hash_map: 
--------------------------------------------------------------------------------
   59:         bucket = self.buckets[hash_key]
   60:         
   61:         
   62:         for val in bucket:
-  63:             if val[0] == key:
+  63:             if not (val[0] == key):
   64:                 return val[1]
   65:         
   66:         raise KeyError
   67:     
--------------------------------------------------------------------------------
[0.22512 s] killed by ts-3-5/test_3-5_0-5_180.py::test_hashmap_insert

hashmap = <hash_map.HashMap object at 0x78452e3e85e0>

    def test_hashmap_insert(hashmap):
        hashmap.insert('key1', 'value1')
>       assert hashmap.get('key1') == 'value1'

ts-3-5/test_3-5_0-5_180.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <hash_map.HashMap object at 0x78452e3e85e0>, key = 'key1'

>   ???
E   KeyError

hash_map:66: KeyError

   - [#  16] COI hash_map: 
--------------------------------------------------------------------------------
   84:         bucket = self.buckets[hash_key]
   85:         
   86:         
   87:         for (i, val) in enumerate(bucket):
-  88:             if val[0] == key:
+  88:             if not (val[0] == key):
   89:                 del bucket[i]
   90:                 return val
   91:         
   92:         raise KeyError
--------------------------------------------------------------------------------
[0.19534 s] killed by ts-3-5/test_3-5_0-5_180.py::test_hashmap_delete

hashmap = <hash_map.HashMap object at 0x78452e9b6f50>

    def test_hashmap_delete(hashmap):
        hashmap.insert('key3', 'value3')
>       deleted_value = hashmap.delete('key3')

ts-3-5/test_3-5_0-5_180.py:30: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <hash_map.HashMap object at 0x78452e9b6f50>, key = 'key3'

>   ???
E   KeyError

hash_map:92: KeyError

   - [#  18] LOR hash_map: 
--------------------------------------------------------------------------------
  114:     '''
  115:     hash = 0
  116:     
  117:     for letter in str(key):
- 118:         hash = ((ord(letter) + (hash << 6)) + (hash << 16)) - hash
+ 118:         hash = ((ord(letter) + (hash >> 6)) + (hash << 16)) - hash
  119:     
  120:     return hash
  121: 
  122: def lose_lose(key):
--------------------------------------------------------------------------------
[0.20627 s] killed by ts-3-5/test_3-5_0-5_180.py::test_sdbm_hash_function

def test_sdbm_hash_function():
>       assert sdbm('test') == 32745785343201586
E       AssertionError

ts-3-5/test_3-5_0-5_180.py:43: AssertionError

   - [#  19] LOR hash_map: 
--------------------------------------------------------------------------------
  114:     '''
  115:     hash = 0
  116:     
  117:     for letter in str(key):
- 118:         hash = ((ord(letter) + (hash << 6)) + (hash << 16)) - hash
+ 118:         hash = ((ord(letter) + (hash << 6)) + (hash >> 16)) - hash
  119:     
  120:     return hash
  121: 
  122: def lose_lose(key):
--------------------------------------------------------------------------------
[0.20456 s] killed by ts-3-5/test_3-5_0-5_180.py::test_sdbm_hash_function

def test_sdbm_hash_function():
>       assert sdbm('test') == 32745785343201586
E       AssertionError

ts-3-5/test_3-5_0-5_180.py:43: AssertionError

   - [#  20] OIL hash_map: 
--------------------------------------------------------------------------------
   35:             
   36:             if val[0] == key:
   37:                 bucket[i] = (key, value)
   38:                 return
-  39:         
+  39:             break
   40:         bucket.append((key, value))
   41:     
   42:     def get(self, key):
   43:         '''
--------------------------------------------------------------------------------
[0.18218 s] survived

   - [#  21] OIL hash_map: 
--------------------------------------------------------------------------------
   61:         
   62:         for val in bucket:
   63:             if val[0] == key:
   64:                 return val[1]
-  65:         
+  65:             break
   66:         raise KeyError
   67:     
   68:     def delete(self, key):
   69:         '''
--------------------------------------------------------------------------------
[0.18646 s] survived

   - [#  22] OIL hash_map: 
--------------------------------------------------------------------------------
   87:         for (i, val) in enumerate(bucket):
   88:             if val[0] == key:
   89:                 del bucket[i]
   90:                 return val
-  91:         
+  91:             break
   92:         raise KeyError
   93: 
   94: def djb2(key):
   95:     '''
--------------------------------------------------------------------------------
[0.17546 s] survived

   - [#  23] OIL hash_map: 
--------------------------------------------------------------------------------
  101:     hash = 5381
  102:     
  103:     for letter in str(key):
  104:         hash = ((hash << 5) + hash) + ord(letter)
- 105:     
+ 105:         break
  106:     return hash
  107: 
  108: def sdbm(key):
  109:     '''
--------------------------------------------------------------------------------
[0.20578 s] killed by ts-3-5/test_3-5_0-5_180.py::test_djb2_hash_function

def test_djb2_hash_function():
>       assert djb2('test') == 6385723493
E       AssertionError

ts-3-5/test_3-5_0-5_180.py:40: AssertionError

   - [#  24] OIL hash_map: 
--------------------------------------------------------------------------------
  115:     hash = 0
  116:     
  117:     for letter in str(key):
  118:         hash = ((ord(letter) + (hash << 6)) + (hash << 16)) - hash
- 119:     
+ 119:         break
  120:     return hash
  121: 
  122: def lose_lose(key):
  123:     '''
--------------------------------------------------------------------------------
[0.20813 s] killed by ts-3-5/test_3-5_0-5_180.py::test_sdbm_hash_function

def test_sdbm_hash_function():
>       assert sdbm('test') == 32745785343201586
E       AssertionError

ts-3-5/test_3-5_0-5_180.py:43: AssertionError

   - [#  25] OIL hash_map: 
--------------------------------------------------------------------------------
  130:     hash = 0
  131:     
  132:     for letter in str(key):
  133:         hash += ord(letter)
- 134:     
+ 134:         break
  135:     return hash
--------------------------------------------------------------------------------
[0.20257 s] killed by ts-3-5/test_3-5_0-5_180.py::test_lose_lose_hash_function

def test_lose_lose_hash_function():
>       assert lose_lose('test') == 448
E       AssertionError

ts-3-5/test_3-5_0-5_180.py:46: AssertionError

   - [#  27] RIL hash_map: 
--------------------------------------------------------------------------------
   58:         
   59:         bucket = self.buckets[hash_key]
   60:         
   61:         
-  62:         for val in bucket:
+  62:         for val in reversed(bucket):
   63:             if val[0] == key:
   64:                 return val[1]
   65:         
   66:         raise KeyError
--------------------------------------------------------------------------------
[0.18551 s] survived

   - [#  29] RIL hash_map: 
--------------------------------------------------------------------------------
   99:     by dan bernstein many years ago in comp.lang.c.
  100:     '''
  101:     hash = 5381
  102:     
- 103:     for letter in str(key):
+ 103:     for letter in reversed(str(key)):
  104:         hash = ((hash << 5) + hash) + ord(letter)
  105:     
  106:     return hash
  107: 
--------------------------------------------------------------------------------
[0.19883 s] killed by ts-3-5/test_3-5_0-5_180.py::test_djb2_hash_function

def test_djb2_hash_function():
>       assert djb2('test') == 6385723493
E       AssertionError

ts-3-5/test_3-5_0-5_180.py:40: AssertionError

   - [#  32] ROR hash_map: 
--------------------------------------------------------------------------------
   32:         bucket = self.buckets[hash_key]
   33:         
   34:         for (i, val) in enumerate(bucket):
   35:             
-  36:             if val[0] == key:
+  36:             if val[0] != key:
   37:                 bucket[i] = (key, value)
   38:                 return
   39:         
   40:         bucket.append((key, value))
--------------------------------------------------------------------------------
[0.20252 s] killed by ts-3-5/test_3-5_0-5_180.py::test_hashmap_insert_override

hashmap = <hash_map.HashMap object at 0x78452e912410>

    def test_hashmap_insert_override(hashmap):
        hashmap.insert('key2', 'value2')
        hashmap.insert('key2', 'new_value2')
>       assert hashmap.get('key2') == 'new_value2'
E       AssertionError

ts-3-5/test_3-5_0-5_180.py:22: AssertionError

   - [#  34] ROR hash_map: 
--------------------------------------------------------------------------------
   84:         bucket = self.buckets[hash_key]
   85:         
   86:         
   87:         for (i, val) in enumerate(bucket):
-  88:             if val[0] == key:
+  88:             if val[0] != key:
   89:                 del bucket[i]
   90:                 return val
   91:         
   92:         raise KeyError
--------------------------------------------------------------------------------
[0.20870 s] killed by ts-3-5/test_3-5_0-5_180.py::test_hashmap_delete

hashmap = <hash_map.HashMap object at 0x78452e5596f0>

    def test_hashmap_delete(hashmap):
        hashmap.insert('key3', 'value3')
>       deleted_value = hashmap.delete('key3')

ts-3-5/test_3-5_0-5_180.py:30: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <hash_map.HashMap object at 0x78452e5596f0>, key = 'key3'

>   ???
E   KeyError

hash_map:92: KeyError

   - [#  39] SDL hash_map: 
--------------------------------------------------------------------------------
    3:     Data structure that stores key:value pairs.
    4:     '''
    5:     
    6:     def __init__(self, buckets=256, hash_function=lambda key: (hash(key))):
-   7:         self.buckets = [[] for i in range(buckets)]
+   7:         pass
    8:         self.hash_function = hash_function
    9:     
   10:     def insert(self, key, value):
   11:         """
--------------------------------------------------------------------------------
[0.20082 s] killed by ts-3-5/test_3-5_0-5_180.py::test_hashmap_insert

hashmap = <hash_map.HashMap object at 0x78452e6d4a00>

    def test_hashmap_insert(hashmap):
>       hashmap.insert('key1', 'value1')

ts-3-5/test_3-5_0-5_180.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <hash_map.HashMap object at 0x78452e6d4a00>, key = 'key1'
value = 'value1'

>   ???
E   AttributeError: 'HashMap' object has no attribute 'buckets'

hash_map:30: AttributeError

   - [#  40] SDL hash_map: 
--------------------------------------------------------------------------------
    4:     '''
    5:     
    6:     def __init__(self, buckets=256, hash_function=lambda key: (hash(key))):
    7:         self.buckets = [[] for i in range(buckets)]
-   8:         self.hash_function = hash_function
+   8:         pass
    9:     
   10:     def insert(self, key, value):
   11:         """
   12:         Insert a key into the hash map.
--------------------------------------------------------------------------------
[0.21241 s] killed by ts-3-5/test_3-5_0-5_180.py::test_hashmap_insert

hashmap = <hash_map.HashMap object at 0x78452e6d6f80>

    def test_hashmap_insert(hashmap):
>       hashmap.insert('key1', 'value1')

ts-3-5/test_3-5_0-5_180.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <hash_map.HashMap object at 0x78452e6d6f80>, key = 'key1'
value = 'value1'

>   ???
E   AttributeError: 'HashMap' object has no attribute 'hash_function'

hash_map:30: AttributeError

   - [#  41] SDL hash_map: 
--------------------------------------------------------------------------------
   26:         Returns:
   27:             None 
   28:         """
   29:         
-  30:         hash_key = self.hash_function(key) % len(self.buckets)
+  30:         pass
   31:         
   32:         bucket = self.buckets[hash_key]
   33:         
   34:         for (i, val) in enumerate(bucket):
--------------------------------------------------------------------------------
[0.20726 s] killed by ts-3-5/test_3-5_0-5_180.py::test_hashmap_insert

hashmap = <hash_map.HashMap object at 0x78452e9057b0>

    def test_hashmap_insert(hashmap):
>       hashmap.insert('key1', 'value1')

ts-3-5/test_3-5_0-5_180.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <hash_map.HashMap object at 0x78452e9057b0>, key = 'key1'
value = 'value1'

>   ???
E   NameError: name 'hash_key' is not defined

hash_map:32: NameError

   - [#  42] SDL hash_map: 
--------------------------------------------------------------------------------
   28:         """
   29:         
   30:         hash_key = self.hash_function(key) % len(self.buckets)
   31:         
-  32:         bucket = self.buckets[hash_key]
+  32:         pass
   33:         
   34:         for (i, val) in enumerate(bucket):
   35:             
   36:             if val[0] == key:
--------------------------------------------------------------------------------
[0.20722 s] killed by ts-3-5/test_3-5_0-5_180.py::test_hashmap_insert

hashmap = <hash_map.HashMap object at 0x78452e5a14e0>

    def test_hashmap_insert(hashmap):
>       hashmap.insert('key1', 'value1')

ts-3-5/test_3-5_0-5_180.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <hash_map.HashMap object at 0x78452e5a14e0>, key = 'key1'
value = 'value1'

>   ???
E   NameError: name 'bucket' is not defined

hash_map:34: NameError

   - [#  43] SDL hash_map: 
--------------------------------------------------------------------------------
   33:         
   34:         for (i, val) in enumerate(bucket):
   35:             
   36:             if val[0] == key:
-  37:                 bucket[i] = (key, value)
+  37:                 pass
   38:                 return
   39:         
   40:         bucket.append((key, value))
   41:     
--------------------------------------------------------------------------------
[0.20467 s] killed by ts-3-5/test_3-5_0-5_180.py::test_hashmap_insert_override

hashmap = <hash_map.HashMap object at 0x78452e653610>

    def test_hashmap_insert_override(hashmap):
        hashmap.insert('key2', 'value2')
        hashmap.insert('key2', 'new_value2')
>       assert hashmap.get('key2') == 'new_value2'
E       AssertionError

ts-3-5/test_3-5_0-5_180.py:22: AssertionError

   - [#  44] SDL hash_map: 
--------------------------------------------------------------------------------
   34:         for (i, val) in enumerate(bucket):
   35:             
   36:             if val[0] == key:
   37:                 bucket[i] = (key, value)
-  38:                 return
+  38:                 pass
   39:         
   40:         bucket.append((key, value))
   41:     
   42:     def get(self, key):
--------------------------------------------------------------------------------
[0.19686 s] survived

   - [#  45] SDL hash_map: 
--------------------------------------------------------------------------------
   36:             if val[0] == key:
   37:                 bucket[i] = (key, value)
   38:                 return
   39:         
-  40:         bucket.append((key, value))
+  40:         pass
   41:     
   42:     def get(self, key):
   43:         '''
   44:         Get a value from the map.
--------------------------------------------------------------------------------
[0.20208 s] killed by ts-3-5/test_3-5_0-5_180.py::test_hashmap_insert

hashmap = <hash_map.HashMap object at 0x78452eb74460>

    def test_hashmap_insert(hashmap):
        hashmap.insert('key1', 'value1')
>       assert hashmap.get('key1') == 'value1'

ts-3-5/test_3-5_0-5_180.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <hash_map.HashMap object at 0x78452eb74460>, key = 'key1'

>   ???
E   KeyError

hash_map:66: KeyError

   - [#  48] SDL hash_map: 
--------------------------------------------------------------------------------
   60:         
   61:         
   62:         for val in bucket:
   63:             if val[0] == key:
-  64:                 return val[1]
+  64:                 pass
   65:         
   66:         raise KeyError
   67:     
   68:     def delete(self, key):
--------------------------------------------------------------------------------
[0.22187 s] killed by ts-3-5/test_3-5_0-5_180.py::test_hashmap_insert

hashmap = <hash_map.HashMap object at 0x78452e5b9e70>

    def test_hashmap_insert(hashmap):
        hashmap.insert('key1', 'value1')
>       assert hashmap.get('key1') == 'value1'

ts-3-5/test_3-5_0-5_180.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <hash_map.HashMap object at 0x78452e5b9e70>, key = 'key1'

>   ???
E   KeyError

hash_map:66: KeyError

   - [#  51] SDL hash_map: 
--------------------------------------------------------------------------------
   86:         
   87:         for (i, val) in enumerate(bucket):
   88:             if val[0] == key:
   89:                 del bucket[i]
-  90:                 return val
+  90:                 pass
   91:         
   92:         raise KeyError
   93: 
   94: def djb2(key):
--------------------------------------------------------------------------------
[0.20192 s] killed by ts-3-5/test_3-5_0-5_180.py::test_hashmap_delete

hashmap = <hash_map.HashMap object at 0x78452e960880>

    def test_hashmap_delete(hashmap):
        hashmap.insert('key3', 'value3')
>       deleted_value = hashmap.delete('key3')

ts-3-5/test_3-5_0-5_180.py:30: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <hash_map.HashMap object at 0x78452e960880>, key = 'key3'

>   ???
E   KeyError

hash_map:92: KeyError

   - [#  52] SDL hash_map: 
--------------------------------------------------------------------------------
   97: 
   98:     This algorithm (k=33) was first reported 
   99:     by dan bernstein many years ago in comp.lang.c.
  100:     '''
- 101:     hash = 5381
+ 101:     pass
  102:     
  103:     for letter in str(key):
  104:         hash = ((hash << 5) + hash) + ord(letter)
  105:     
--------------------------------------------------------------------------------
[0.21445 s] killed by ts-3-5/test_3-5_0-5_180.py::test_djb2_hash_function

def test_djb2_hash_function():
>       assert djb2('test') == 6385723493

ts-3-5/test_3-5_0-5_180.py:40: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

key = 'test'

>   ???
E   UnboundLocalError: local variable 'hash' referenced before assignment

hash_map:104: UnboundLocalError

   - [#  53] SDL hash_map: 
--------------------------------------------------------------------------------
  100:     '''
  101:     hash = 5381
  102:     
  103:     for letter in str(key):
- 104:         hash = ((hash << 5) + hash) + ord(letter)
+ 104:         pass
  105:     
  106:     return hash
  107: 
  108: def sdbm(key):
--------------------------------------------------------------------------------
[0.19454 s] killed by ts-3-5/test_3-5_0-5_180.py::test_djb2_hash_function

def test_djb2_hash_function():
>       assert djb2('test') == 6385723493
E       AssertionError

ts-3-5/test_3-5_0-5_180.py:40: AssertionError

   - [#  54] SDL hash_map: 
--------------------------------------------------------------------------------
  102:     
  103:     for letter in str(key):
  104:         hash = ((hash << 5) + hash) + ord(letter)
  105:     
- 106:     return hash
+ 106:     pass
  107: 
  108: def sdbm(key):
  109:     '''
  110:     This function is a good bit scrambling function.
--------------------------------------------------------------------------------
[0.20799 s] killed by ts-3-5/test_3-5_0-5_180.py::test_djb2_hash_function

def test_djb2_hash_function():
>       assert djb2('test') == 6385723493
E       AssertionError

ts-3-5/test_3-5_0-5_180.py:40: AssertionError
