   - [#  55] SDL hash_map: 
--------------------------------------------------------------------------------
  111: 
  112:     This algorithm was created for sdbm (a public-domain
  113:      reimplementation of ndbm) database library.
  114:     '''
- 115:     hash = 0
+ 115:     pass
  116:     
  117:     for letter in str(key):
  118:         hash = ((ord(letter) + (hash << 6)) + (hash << 16)) - hash
  119:     
--------------------------------------------------------------------------------
[0.21123 s] killed by ts-3-5/test_3-5_0-5_180.py::test_sdbm_hash_function

def test_sdbm_hash_function():
>       assert sdbm('test') == 32745785343201586

ts-3-5/test_3-5_0-5_180.py:43: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

key = 'test'

>   ???
E   UnboundLocalError: local variable 'hash' referenced before assignment

hash_map:118: UnboundLocalError

   - [#  56] SDL hash_map: 
--------------------------------------------------------------------------------
  114:     '''
  115:     hash = 0
  116:     
  117:     for letter in str(key):
- 118:         hash = ((ord(letter) + (hash << 6)) + (hash << 16)) - hash
+ 118:         pass
  119:     
  120:     return hash
  121: 
  122: def lose_lose(key):
--------------------------------------------------------------------------------
[0.20649 s] killed by ts-3-5/test_3-5_0-5_180.py::test_sdbm_hash_function

def test_sdbm_hash_function():
>       assert sdbm('test') == 32745785343201586
E       AssertionError

ts-3-5/test_3-5_0-5_180.py:43: AssertionError

   - [#  62] SVD hash_map: 
--------------------------------------------------------------------------------
   26:         Returns:
   27:             None 
   28:         """
   29:         
-  30:         hash_key = self.hash_function(key) % len(self.buckets)
+  30:         hash_key = hash_function(key) % len(self.buckets)
   31:         
   32:         bucket = self.buckets[hash_key]
   33:         
   34:         for (i, val) in enumerate(bucket):
--------------------------------------------------------------------------------
[0.20119 s] killed by ts-3-5/test_3-5_0-5_180.py::test_hashmap_insert

hashmap = <hash_map.HashMap object at 0x78452ead2dd0>

    def test_hashmap_insert(hashmap):
>       hashmap.insert('key1', 'value1')

ts-3-5/test_3-5_0-5_180.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <hash_map.HashMap object at 0x78452ead2dd0>, key = 'key1'
value = 'value1'

>   ???
E   NameError: name 'hash_function' is not defined

hash_map:30: NameError

   - [#  63] SVD hash_map: 
--------------------------------------------------------------------------------
   26:         Returns:
   27:             None 
   28:         """
   29:         
-  30:         hash_key = self.hash_function(key) % len(self.buckets)
+  30:         hash_key = self.hash_function(key) % len(buckets)
   31:         
   32:         bucket = self.buckets[hash_key]
   33:         
   34:         for (i, val) in enumerate(bucket):
--------------------------------------------------------------------------------
[0.19927 s] killed by ts-3-5/test_3-5_0-5_180.py::test_hashmap_insert

hashmap = <hash_map.HashMap object at 0x78452e55b2b0>

    def test_hashmap_insert(hashmap):
>       hashmap.insert('key1', 'value1')

ts-3-5/test_3-5_0-5_180.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <hash_map.HashMap object at 0x78452e55b2b0>, key = 'key1'
value = 'value1'

>   ???
E   NameError: name 'buckets' is not defined

hash_map:30: NameError

   - [#  64] SVD hash_map: 
--------------------------------------------------------------------------------
   28:         """
   29:         
   30:         hash_key = self.hash_function(key) % len(self.buckets)
   31:         
-  32:         bucket = self.buckets[hash_key]
+  32:         bucket = buckets[hash_key]
   33:         
   34:         for (i, val) in enumerate(bucket):
   35:             
   36:             if val[0] == key:
--------------------------------------------------------------------------------
[0.19872 s] killed by ts-3-5/test_3-5_0-5_180.py::test_hashmap_insert

hashmap = <hash_map.HashMap object at 0x78452e905120>

    def test_hashmap_insert(hashmap):
>       hashmap.insert('key1', 'value1')

ts-3-5/test_3-5_0-5_180.py:16: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <hash_map.HashMap object at 0x78452e905120>, key = 'key1'
value = 'value1'

>   ???
E   NameError: name 'buckets' is not defined

hash_map:32: NameError

   - [#  71] ZIL hash_map: 
--------------------------------------------------------------------------------
   32:         bucket = self.buckets[hash_key]
   33:         
   34:         for (i, val) in enumerate(bucket):
   35:             
-  36:             if val[0] == key:
-  37:                 bucket[i] = (key, value)
-  38:                 return
+  36:             break
+  37:         
+  38:         
   39:         
   40:         bucket.append((key, value))
   41:     
   42:     def get(self, key):
--------------------------------------------------------------------------------
[0.22034 s] killed by ts-3-5/test_3-5_0-5_180.py::test_hashmap_insert_override

hashmap = <hash_map.HashMap object at 0x78452e449f00>

    def test_hashmap_insert_override(hashmap):
        hashmap.insert('key2', 'value2')
        hashmap.insert('key2', 'new_value2')
>       assert hashmap.get('key2') == 'new_value2'
E       AssertionError

ts-3-5/test_3-5_0-5_180.py:22: AssertionError

   - [#  72] ZIL hash_map: 
--------------------------------------------------------------------------------
   59:         bucket = self.buckets[hash_key]
   60:         
   61:         
   62:         for val in bucket:
-  63:             if val[0] == key:
-  64:                 return val[1]
+  63:             break
+  64:         
   65:         
   66:         raise KeyError
   67:     
   68:     def delete(self, key):
--------------------------------------------------------------------------------
[0.21406 s] killed by ts-3-5/test_3-5_0-5_180.py::test_hashmap_insert

hashmap = <hash_map.HashMap object at 0x78452e61e320>

    def test_hashmap_insert(hashmap):
        hashmap.insert('key1', 'value1')
>       assert hashmap.get('key1') == 'value1'

ts-3-5/test_3-5_0-5_180.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <hash_map.HashMap object at 0x78452e61e320>, key = 'key1'

>   ???
E   KeyError

hash_map:66: KeyError

   - [#  73] ZIL hash_map: 
--------------------------------------------------------------------------------
   84:         bucket = self.buckets[hash_key]
   85:         
   86:         
   87:         for (i, val) in enumerate(bucket):
-  88:             if val[0] == key:
-  89:                 del bucket[i]
-  90:                 return val
+  88:             break
+  89:         
+  90:         
   91:         
   92:         raise KeyError
   93: 
   94: def djb2(key):
--------------------------------------------------------------------------------
[0.22271 s] killed by ts-3-5/test_3-5_0-5_180.py::test_hashmap_delete

hashmap = <hash_map.HashMap object at 0x78452e9b47c0>

    def test_hashmap_delete(hashmap):
        hashmap.insert('key3', 'value3')
>       deleted_value = hashmap.delete('key3')

ts-3-5/test_3-5_0-5_180.py:30: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <hash_map.HashMap object at 0x78452e9b47c0>, key = 'key3'

>   ???
E   KeyError

hash_map:92: KeyError

   - [#  74] ZIL hash_map: 
--------------------------------------------------------------------------------
  100:     '''
  101:     hash = 5381
  102:     
  103:     for letter in str(key):
- 104:         hash = ((hash << 5) + hash) + ord(letter)
+ 104:         break
  105:     
  106:     return hash
  107: 
  108: def sdbm(key):
--------------------------------------------------------------------------------
[0.21364 s] killed by ts-3-5/test_3-5_0-5_180.py::test_djb2_hash_function

def test_djb2_hash_function():
>       assert djb2('test') == 6385723493
E       AssertionError

ts-3-5/test_3-5_0-5_180.py:40: AssertionError

   - [#  75] ZIL hash_map: 
--------------------------------------------------------------------------------
  114:     '''
  115:     hash = 0
  116:     
  117:     for letter in str(key):
- 118:         hash = ((ord(letter) + (hash << 6)) + (hash << 16)) - hash
+ 118:         break
  119:     
  120:     return hash
  121: 
  122: def lose_lose(key):
--------------------------------------------------------------------------------
[0.21406 s] killed by ts-3-5/test_3-5_0-5_180.py::test_sdbm_hash_function

def test_sdbm_hash_function():
>       assert sdbm('test') == 32745785343201586
E       AssertionError

ts-3-5/test_3-5_0-5_180.py:43: AssertionError

   - [#  76] ZIL hash_map: 
--------------------------------------------------------------------------------
  129:     '''
  130:     hash = 0
  131:     
  132:     for letter in str(key):
- 133:         hash += ord(letter)
+ 133:         break
  134:     
  135:     return hash
--------------------------------------------------------------------------------
[0.21203 s] killed by ts-3-5/test_3-5_0-5_180.py::test_lose_lose_hash_function

def test_lose_lose_hash_function():
>       assert lose_lose('test') == 448
E       AssertionError

ts-3-5/test_3-5_0-5_180.py:46: AssertionError
