   - [#  46] CDI heap: 
--------------------------------------------------------------------------------
  48:         self.heap_list[1] = self.heap_list.pop()
  49:         self.sift(1)
  50:         return min_val
  51:     
- 52:     def build(self, lst: list):
- 53:         i = len(lst) // 2
- 54:         self.heap_list = [0] + lst
- 55:         while i > 0:
- 56:             self.sift(i)
- 57:             i -= 1
- 58:     
+ 52:     @classmethod
+ 53:     def build(self, lst: list):
+ 54:         i = len(lst) // 2
+ 55:         self.heap_list = [0] + lst
+ 56:         while i > 0:
+ 57:             self.sift(i)
+ 58:             i -= 1
  59:     def size(self):
  60:         return len(self.heap_list) - 1
--------------------------------------------------------------------------------
[0.09107 s] killed by ALL-SMART/test_heap_MOSA.py::test_case_3

def test_case_3():
        bytes_0 = b'}\x88A'
        bool_0 = False
        list_0 = [bytes_0]
        heap_0 = module_0.Heap()
        assert heap_0.heap_list == [0]
        var_0 = heap_0.build(list_0)
>       assert heap_0.heap_list == [0, b'}\x88A']
E       AssertionError

ALL-SMART/test_heap_MOSA.py:37: AssertionError

   - [#  52] COI heap: 
--------------------------------------------------------------------------------
  21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
  22:             i = mc_i
  23:     
  24:     def find_min_child_index(self, i):
- 25:         if i * 2 > self.size():
+ 25:         if not (i * 2 > self.size()):
  26:             return None
  27:         if (i * 2) + 1 > self.size():
  28:             return i * 2
  29:         
--------------------------------------------------------------------------------
[0.09255 s] killed by ALL-SMART/test_heap_MOSA.py::test_case_11

def test_case_11():
        bool_0 = False
        int_0 = -1604
        heap_0 = module_0.Heap()
        assert heap_0.heap_list == [0]
        var_0 = heap_0.find_min_child_index(bool_0)
>       assert var_0 == 0
E       AssertionError

ALL-SMART/test_heap_MOSA.py:96: AssertionError

   - [#  71] ROR heap: 
--------------------------------------------------------------------------------
  21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
  22:             i = mc_i
  23:     
  24:     def find_min_child_index(self, i):
- 25:         if i * 2 > self.size():
+ 25:         if i * 2 >= self.size():
  26:             return None
  27:         if (i * 2) + 1 > self.size():
  28:             return i * 2
  29:         
--------------------------------------------------------------------------------
[0.09306 s] killed by ALL-SMART/test_heap_MOSA.py::test_case_11

def test_case_11():
        bool_0 = False
        int_0 = -1604
        heap_0 = module_0.Heap()
        assert heap_0.heap_list == [0]
        var_0 = heap_0.find_min_child_index(bool_0)
>       assert var_0 == 0
E       AssertionError

ALL-SMART/test_heap_MOSA.py:96: AssertionError

   - [# 101] SDL heap: 
--------------------------------------------------------------------------------
  24:     def find_min_child_index(self, i):
  25:         if i * 2 > self.size():
  26:             return None
  27:         if (i * 2) + 1 > self.size():
- 28:             return i * 2
+ 28:             pass
  29:         
  30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
  31:             return i * 2
  32:         else:
--------------------------------------------------------------------------------
[0.09202 s] killed by ALL-SMART/test_heap_MOSA.py::test_case_11

def test_case_11():
        bool_0 = False
        int_0 = -1604
        heap_0 = module_0.Heap()
        assert heap_0.heap_list == [0]
        var_0 = heap_0.find_min_child_index(bool_0)
>       assert var_0 == 0
E       AssertionError

ALL-SMART/test_heap_MOSA.py:96: AssertionError
