1 : Job ID c49848442d474fa1bdc6639421be46d7
test outcome: killed
heap.py, start pos: (27, 19), end pos: (27, 20)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i * 2) - 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.13s ==========================

2 : Job ID 38bc061f93ab4efdb41a756348f1bdab
test outcome: killed
heap.py, start pos: (30, 60), end pos: (30, 61)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i * 2 - 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 5, 6, 7, 9, 4, ......
========================= 1 failed, 7 passed in 0.13s ==========================

3 : Job ID fc7fdb8ee6e342d98dbf75141e01726a
test outcome: killed
heap.py, start pos: (33, 29), end pos: (33, 30)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i * 2 - 1
     def min(self):
         if len(self.heap_list) > 1:
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 3 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 10, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 6, 7, 9, 5, 4, ......
========================= 3 failed, 5 passed in 0.14s ==========================

4 : Job ID 4b19e6cca7b6443b80be78d32ba2a518
test outcome: killed
heap.py, start pos: (54, 29), end pos: (54, 30)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -51,7 +51,7 @@
     def build(self, lst:list):
         i = len(lst) // 2
-        self.heap_list = [0] + lst
+        self.heap_list = [0] - lst
         while i > 0:
             self.sift(i)
             i -= 1
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: unsupported operan...
========================= 1 failed, 7 passed in 0.13s ==========================

5 : Job ID 9d68b951211a4107b4fba0754fa70ac3
test outcome: killed
heap.py, start pos: (27, 19), end pos: (27, 20)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i * 2) * 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.13s ==========================

6 : Job ID aa6360b9478e48aa8022dffb998cb000
test outcome: killed
heap.py, start pos: (30, 60), end pos: (30, 61)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i * 2 * 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 4, 9, 5, 6, ......
========================= 2 failed, 6 passed in 0.13s ==========================

7 : Job ID 569e8e43ba5b45cb98605993e049ba5c
test outcome: killed
heap.py, start pos: (33, 29), end pos: (33, 30)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i * 2 * 1
     def min(self):
         if len(self.heap_list) > 1:
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 15, 10, 18...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 5, 6, 7, 9, 4, ......
========================= 3 failed, 5 passed in 0.14s ==========================

8 : Job ID 627d7635b9a94196a63e78aa9f120463
test outcome: killed
heap.py, start pos: (54, 29), end pos: (54, 30)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -51,7 +51,7 @@
     def build(self, lst:list):
         i = len(lst) // 2
-        self.heap_list = [0] + lst
+        self.heap_list = [0] * lst
         while i > 0:
             self.sift(i)
             i -= 1
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: can't multiply seq...
========================= 1 failed, 7 passed in 0.13s ==========================

9 : Job ID 4b64cc808c744d09bdef252c661af254
test outcome: killed
heap.py, start pos: (27, 19), end pos: (27, 20)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i * 2) / 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.13s ==========================

10 : Job ID 5407e7c6f9a740aebc04ce4e5bc08546
test outcome: killed
heap.py, start pos: (30, 60), end pos: (30, 61)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i * 2 / 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ..FF.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - TypeError: lis...
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - TypeError: list indices ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 4 failed, 4 passed in 0.14s ==========================

11 : Job ID 467e3f7c96894d7b9149bd5721a8f076
test outcome: killed
heap.py, start pos: (33, 29), end pos: (33, 30)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i * 2 / 1
     def min(self):
         if len(self.heap_list) > 1:
ts-3-5/test_3-5_0-8_264.py ..FF.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4.0 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - TypeError: list indices ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 4 failed, 4 passed in 0.13s ==========================

12 : Job ID 7474569aa4974f088806340d533fbc20
test outcome: killed
heap.py, start pos: (54, 29), end pos: (54, 30)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -51,7 +51,7 @@
     def build(self, lst:list):
         i = len(lst) // 2
-        self.heap_list = [0] + lst
+        self.heap_list = [0] / lst
         while i > 0:
             self.sift(i)
             i -= 1
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: unsupported operan...
========================= 1 failed, 7 passed in 0.14s ==========================

13 : Job ID d3a48f91dbdd47379615fadfbab97e79
test outcome: killed
heap.py, start pos: (27, 19), end pos: (27, 20)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i * 2) // 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.13s ==========================

14 : Job ID 4c80fbb2f2614c968454d2be47e5e75c
test outcome: killed
heap.py, start pos: (30, 60), end pos: (30, 61)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i * 2 // 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 4, 9, 5, 6, ......
========================= 2 failed, 6 passed in 0.13s ==========================

15 : Job ID 64d1243158554aa4abb809caac5a5ad8
test outcome: killed
heap.py, start pos: (33, 29), end pos: (33, 30)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i * 2 // 1
     def min(self):
         if len(self.heap_list) > 1:
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 15, 10, 18...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 5, 6, 7, 9, 4, ......
========================= 3 failed, 5 passed in 0.13s ==========================

16 : Job ID e360d7ff86974688be07dc2449ccac70
test outcome: killed
heap.py, start pos: (54, 29), end pos: (54, 30)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -51,7 +51,7 @@
     def build(self, lst:list):
         i = len(lst) // 2
-        self.heap_list = [0] + lst
+        self.heap_list = [0] // lst
         while i > 0:
             self.sift(i)
             i -= 1
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: unsupported operan...
========================= 1 failed, 7 passed in 0.13s ==========================

17 : Job ID 1b191d6e160141db9f5496e2772f4b51
test outcome: killed
heap.py, start pos: (27, 19), end pos: (27, 20)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i * 2) % 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.13s ==========================

18 : Job ID 0b792a518dfd4711a1080f61d42c02a0
test outcome: killed
heap.py, start pos: (30, 60), end pos: (30, 61)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i * 2 % 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 4, 9, 5, 6, ......
========================= 2 failed, 6 passed in 0.13s ==========================

19 : Job ID a51ad0b2e632454ba3d90b22ea55eb5f
test outcome: killed
heap.py, start pos: (33, 29), end pos: (33, 30)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i * 2 % 1
     def min(self):
         if len(self.heap_list) > 1:
timeout

20 : Job ID 61681cad571f4160a62439d035dee443
test outcome: killed
heap.py, start pos: (54, 29), end pos: (54, 30)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -51,7 +51,7 @@
     def build(self, lst:list):
         i = len(lst) // 2
-        self.heap_list = [0] + lst
+        self.heap_list = [0] % lst
         while i > 0:
             self.sift(i)
             i -= 1
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: unsupported operan...
========================= 1 failed, 7 passed in 0.13s ==========================

21 : Job ID 13ff35e0a071481eba9a8a9747e20552
test outcome: killed
heap.py, start pos: (27, 19), end pos: (27, 20)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i * 2) ** 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.13s ==========================

22 : Job ID 0eaa9e3e9c7642b99062940d0f7bfc33
test outcome: killed
heap.py, start pos: (30, 60), end pos: (30, 61)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i * 2 ** 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 4, 9, 5, 6, ......
========================= 2 failed, 6 passed in 0.14s ==========================

23 : Job ID 0d29a19be5ee4721b2bfc6fa9987ee2f
test outcome: killed
heap.py, start pos: (33, 29), end pos: (33, 30)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i * 2 ** 1
     def min(self):
         if len(self.heap_list) > 1:
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 15, 10, 18...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 5, 6, 7, 9, 4, ......
========================= 3 failed, 5 passed in 0.13s ==========================

24 : Job ID bb4a5c980bc44d75a5b16fcd33b203c3
test outcome: killed
heap.py, start pos: (54, 29), end pos: (54, 30)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -51,7 +51,7 @@
     def build(self, lst:list):
         i = len(lst) // 2
-        self.heap_list = [0] + lst
+        self.heap_list = [0] ** lst
         while i > 0:
             self.sift(i)
             i -= 1
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: unsupported operan...
========================= 1 failed, 7 passed in 0.13s ==========================

25 : Job ID b25893d008f4477d9a28915f334d1704
test outcome: killed
heap.py, start pos: (27, 19), end pos: (27, 20)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i * 2) >> 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.13s ==========================

26 : Job ID d8a0944b90e844f6954656fd09b1d09a
test outcome: killed
heap.py, start pos: (30, 60), end pos: (30, 61)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i * 2 >> 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 15, 10, 18...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 5, 6, 7, 9, 4, ......
========================= 2 failed, 6 passed in 0.14s ==========================

27 : Job ID 3990f2bef87342fab202195f0ce94e52
test outcome: killed
heap.py, start pos: (33, 29), end pos: (33, 30)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i * 2 >> 1
     def min(self):
         if len(self.heap_list) > 1:
timeout

28 : Job ID 1d24ed2ad81645fd993773ff85cbe6be
test outcome: killed
heap.py, start pos: (54, 29), end pos: (54, 30)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -51,7 +51,7 @@
     def build(self, lst:list):
         i = len(lst) // 2
-        self.heap_list = [0] + lst
+        self.heap_list = [0] >> lst
         while i > 0:
             self.sift(i)
             i -= 1
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: unsupported operan...
========================= 1 failed, 7 passed in 0.13s ==========================

29 : Job ID 28a2c82ee5c046b7af8559472a3f5bcb
test outcome: killed
heap.py, start pos: (27, 19), end pos: (27, 20)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i * 2) << 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 15, 10, 18...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 5, 6, 7, 9, 4, ......
========================= 3 failed, 5 passed in 0.13s ==========================

30 : Job ID 5c4f5b7456bb4361bf04bd3d1f8997fd
test outcome: killed
heap.py, start pos: (30, 60), end pos: (30, 61)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i * 2 << 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ..FF.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - IndexError: li...
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - IndexError: list index o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 4 failed, 4 passed in 0.13s ==========================

31 : Job ID 714b4edc2a71458295a5ac7c4a909604
test outcome: killed
heap.py, start pos: (33, 29), end pos: (33, 30)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i * 2 << 1
     def min(self):
         if len(self.heap_list) > 1:
ts-3-5/test_3-5_0-8_264.py ..FF.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 8 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - IndexError: list index o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 4 failed, 4 passed in 0.13s ==========================

32 : Job ID 6cfb5718eead4d40912867fc96b33e4b
test outcome: killed
heap.py, start pos: (54, 29), end pos: (54, 30)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -51,7 +51,7 @@
     def build(self, lst:list):
         i = len(lst) // 2
-        self.heap_list = [0] + lst
+        self.heap_list = [0] << lst
         while i > 0:
             self.sift(i)
             i -= 1
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: unsupported operan...
========================= 1 failed, 7 passed in 0.14s ==========================

33 : Job ID d6657ddcff5d42d384630cdf70da3762
SURVIVED
test outcome: survived
heap.py, start pos: (27, 19), end pos: (27, 20)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i * 2) | 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

34 : Job ID a6f27d397be24fc993833c678c39d9ef
SURVIVED
test outcome: survived
heap.py, start pos: (30, 60), end pos: (30, 61)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i * 2 | 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

35 : Job ID 76ead616c6d844848d6f1a0e8727935a
SURVIVED
test outcome: survived
heap.py, start pos: (33, 29), end pos: (33, 30)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i * 2 | 1
     def min(self):
         if len(self.heap_list) > 1:
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================
