36 : Job ID 4352183848fc4c59beadca62c772f05b
test outcome: killed
heap.py, start pos: (54, 29), end pos: (54, 30)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -51,7 +51,7 @@
     def build(self, lst:list):
         i = len(lst) // 2
-        self.heap_list = [0] + lst
+        self.heap_list = [0] | lst
         while i > 0:
             self.sift(i)
             i -= 1
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: unsupported operan...
========================= 1 failed, 7 passed in 0.13s ==========================

37 : Job ID 8e4e802b17884e3e916b178129c6f8fd
test outcome: killed
heap.py, start pos: (27, 19), end pos: (27, 20)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i * 2) & 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.13s ==========================

38 : Job ID 9928cefff24742c7b02ccad250fe02e2
test outcome: killed
heap.py, start pos: (30, 60), end pos: (30, 61)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i * 2 & 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 4, 9, 5, 6, ......
========================= 2 failed, 6 passed in 0.13s ==========================

39 : Job ID e31b1be9f4944b9783055a2b446306df
test outcome: killed
heap.py, start pos: (33, 29), end pos: (33, 30)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i * 2 & 1
     def min(self):
         if len(self.heap_list) > 1:
timeout

40 : Job ID eddd943795f24bc2bada87ea49e2c029
test outcome: killed
heap.py, start pos: (54, 29), end pos: (54, 30)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -51,7 +51,7 @@
     def build(self, lst:list):
         i = len(lst) // 2
-        self.heap_list = [0] + lst
+        self.heap_list = [0] & lst
         while i > 0:
             self.sift(i)
             i -= 1
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: unsupported operan...
========================= 1 failed, 7 passed in 0.13s ==========================

41 : Job ID 12ec310f0eda462a9fb19a959a3e22a5
SURVIVED
test outcome: survived
heap.py, start pos: (27, 19), end pos: (27, 20)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i * 2) ^ 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

42 : Job ID d574b04496144f358a69f0eebbdc7eef
SURVIVED
test outcome: survived
heap.py, start pos: (30, 60), end pos: (30, 61)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i * 2 ^ 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

43 : Job ID 2a3f73bbadaa4ce0b585577b0c9e12fa
SURVIVED
test outcome: survived
heap.py, start pos: (33, 29), end pos: (33, 30)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i * 2 ^ 1
     def min(self):
         if len(self.heap_list) > 1:
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

44 : Job ID d3958b3ef1d848b09b4a76f12f9d0fb2
test outcome: killed
heap.py, start pos: (54, 29), end pos: (54, 30)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -51,7 +51,7 @@
     def build(self, lst:list):
         i = len(lst) // 2
-        self.heap_list = [0] + lst
+        self.heap_list = [0] ^ lst
         while i > 0:
             self.sift(i)
             i -= 1
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: unsupported operan...
========================= 1 failed, 7 passed in 0.13s ==========================

45 : Job ID cb05e3db8053488c93cb14c302b25c9f
test outcome: killed
heap.py, start pos: (60, 35), end pos: (60, 36)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -57,5 +57,5 @@
             i -= 1
     def size(self):
-        return len(self.heap_list) - 1
+        return len(self.heap_list) + 1
ts-3-5/test_3-5_0-8_264.py F.....FF                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - IndexError: list index out o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
FAILED ts-3-5/test_3-5_0-8_264.py::test_size - assert 9 == 7
========================= 3 failed, 5 passed in 0.13s ==========================

46 : Job ID 44e65e24ed8a4a48bb60ac1b7e9b3a3f
test outcome: killed
heap.py, start pos: (60, 35), end pos: (60, 36)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -57,5 +57,5 @@
             i -= 1
     def size(self):
-        return len(self.heap_list) - 1
+        return len(self.heap_list) * 1
ts-3-5/test_3-5_0-8_264.py F.....FF                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - IndexError: list index out o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
FAILED ts-3-5/test_3-5_0-8_264.py::test_size - assert 8 == 7
========================= 3 failed, 5 passed in 0.13s ==========================

47 : Job ID 5543308fa781417da7b1d4969bc835f0
test outcome: killed
heap.py, start pos: (60, 35), end pos: (60, 36)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -57,5 +57,5 @@
             i -= 1
     def size(self):
-        return len(self.heap_list) - 1
+        return len(self.heap_list) / 1
ts-3-5/test_3-5_0-8_264.py F.....FF                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - TypeError: list indices must...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
FAILED ts-3-5/test_3-5_0-8_264.py::test_size - assert 8.0 == 7
========================= 3 failed, 5 passed in 0.13s ==========================

48 : Job ID cbe20171b3994c93bd8d841fd073f396
test outcome: killed
heap.py, start pos: (60, 35), end pos: (60, 36)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -57,5 +57,5 @@
             i -= 1
     def size(self):
-        return len(self.heap_list) - 1
+        return len(self.heap_list) // 1
ts-3-5/test_3-5_0-8_264.py F.....FF                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - IndexError: list index out o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
FAILED ts-3-5/test_3-5_0-8_264.py::test_size - assert 8 == 7
========================= 3 failed, 5 passed in 0.13s ==========================

49 : Job ID 249cbea6cbb847d0bbd8edbd45dc587b
test outcome: killed
heap.py, start pos: (60, 35), end pos: (60, 36)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -57,5 +57,5 @@
             i -= 1
     def size(self):
-        return len(self.heap_list) - 1
+        return len(self.heap_list) % 1
ts-3-5/test_3-5_0-8_264.py F..F.FFF                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [0, 5, 2] == [0, 2, 5]
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert None == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert None == 3
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 9, 6, 12, 5, 4, .....
FAILED ts-3-5/test_3-5_0-8_264.py::test_size - assert 0 == 7
========================= 5 failed, 3 passed in 0.14s ==========================

50 : Job ID a242ce1d4a3a4ce497551cb5b8293642
test outcome: killed
heap.py, start pos: (60, 35), end pos: (60, 36)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -57,5 +57,5 @@
             i -= 1
     def size(self):
-        return len(self.heap_list) - 1
+        return len(self.heap_list) ** 1
ts-3-5/test_3-5_0-8_264.py F.....FF                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - IndexError: list index out o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
FAILED ts-3-5/test_3-5_0-8_264.py::test_size - assert 8 == 7
========================= 3 failed, 5 passed in 0.13s ==========================

51 : Job ID 36708563d0494275826451d5d98db89b
test outcome: killed
heap.py, start pos: (60, 35), end pos: (60, 36)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -57,5 +57,5 @@
             i -= 1
     def size(self):
-        return len(self.heap_list) - 1
+        return len(self.heap_list) >> 1
ts-3-5/test_3-5_0-8_264.py F..F.FFF                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [0, 5, 2] == [0, 2, 5]
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 18, 10, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 6, 9, 12, 5, 4, .....
FAILED ts-3-5/test_3-5_0-8_264.py::test_size - assert 4 == 7
========================= 5 failed, 3 passed in 0.14s ==========================

52 : Job ID e23ca74150fa473f84eec0551926f3ff
test outcome: killed
heap.py, start pos: (60, 35), end pos: (60, 36)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -57,5 +57,5 @@
             i -= 1
     def size(self):
-        return len(self.heap_list) - 1
+        return len(self.heap_list) << 1
ts-3-5/test_3-5_0-8_264.py F.F..FFF                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - IndexError: list index out o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - IndexError: list index o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
FAILED ts-3-5/test_3-5_0-8_264.py::test_size - assert 16 == 7
========================= 5 failed, 3 passed in 0.13s ==========================

53 : Job ID 205460ab98ac4905884555cd509433eb
test outcome: killed
heap.py, start pos: (60, 35), end pos: (60, 36)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -57,5 +57,5 @@
             i -= 1
     def size(self):
-        return len(self.heap_list) - 1
+        return len(self.heap_list) | 1
ts-3-5/test_3-5_0-8_264.py F.....FF                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - IndexError: list index out o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
FAILED ts-3-5/test_3-5_0-8_264.py::test_size - assert 9 == 7
========================= 3 failed, 5 passed in 0.13s ==========================

54 : Job ID 659cb6e2178848d980f0b7433e577d13
test outcome: killed
heap.py, start pos: (60, 35), end pos: (60, 36)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -57,5 +57,5 @@
             i -= 1
     def size(self):
-        return len(self.heap_list) - 1
+        return len(self.heap_list) & 1
ts-3-5/test_3-5_0-8_264.py F..F.FFF                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [0, 5, 2] == [0, 2, 5]
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert None == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert None == 3
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 9, 6, 12, 5, 4, .....
FAILED ts-3-5/test_3-5_0-8_264.py::test_size - assert 0 == 7
========================= 5 failed, 3 passed in 0.13s ==========================

55 : Job ID 491c26fee5cc46d59f71fb35b3c02aad
test outcome: killed
heap.py, start pos: (60, 35), end pos: (60, 36)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -57,5 +57,5 @@
             i -= 1
     def size(self):
-        return len(self.heap_list) - 1
+        return len(self.heap_list) ^ 1
ts-3-5/test_3-5_0-8_264.py F......F                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - IndexError: list index out o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_size - assert 9 == 7
========================= 2 failed, 6 passed in 0.13s ==========================

56 : Job ID bdf75941455f444a86943483f80f56d9
test outcome: killed
heap.py, start pos: (18, 17), end pos: (18, 18)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -15,7 +15,7 @@
             i = i // 2
     def sift(self, i):
-        while (i * 2) <= self.size():
+        while (i + 2) <= self.size():
             mc_i = self.find_min_child_index(i)
             if self.heap_list[i] > self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py ..F...F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 2 failed, 6 passed in 0.13s ==========================

57 : Job ID 63147f097f324ed9ab9c6aafb4747e7a
SURVIVED
test outcome: survived
heap.py, start pos: (25, 14), end pos: (25, 15)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -22,7 +22,7 @@
             i = mc_i
     def find_min_child_index(self, i):
-        if (i * 2) > self.size():
+        if (i + 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
             return i * 2
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

58 : Job ID e1be601fddb748baa4744661e848c710
test outcome: killed
heap.py, start pos: (27, 14), end pos: (27, 15)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i + 2) + 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.13s ==========================

59 : Job ID 3c5e6e852092433eaf25499c396bcaaf
test outcome: killed
heap.py, start pos: (28, 21), end pos: (28, 22)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -25,7 +25,7 @@
         if (i * 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
-            return i * 2
+            return i + 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 4, 5, 9, 6, 12, .....
========================= 1 failed, 7 passed in 0.13s ==========================

60 : Job ID 33f073e1b32b4699899941ec1d6bb663
test outcome: killed
heap.py, start pos: (30, 32), end pos: (30, 33)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 4
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i + 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 4, 9, 5, 6, ......
========================= 2 failed, 6 passed in 0.13s ==========================

61 : Job ID a9fe1aaa28f540099db44894da663e05
SURVIVED
test outcome: survived
heap.py, start pos: (30, 56), end pos: (30, 57)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 5
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i + 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

62 : Job ID 3b3fcb277a5240d780755324b11b7998
test outcome: killed
heap.py, start pos: (31, 25), end pos: (31, 26)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 6
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -28,7 +28,7 @@
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
-                return i * 2
+                return i + 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 4, 9, 5, 6, ......
========================= 2 failed, 6 passed in 0.13s ==========================

63 : Job ID 1b2c15de23704163a8112479d696b78f
SURVIVED
test outcome: survived
heap.py, start pos: (33, 25), end pos: (33, 26)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 7
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i + 2 + 1
     def min(self):
         if len(self.heap_list) > 1:
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

64 : Job ID 632f4af97dd240f7924c7ba72eac08ae
test outcome: killed
heap.py, start pos: (18, 17), end pos: (18, 18)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -15,7 +15,7 @@
             i = i // 2
     def sift(self, i):
-        while (i * 2) <= self.size():
+        while (i - 2) <= self.size():
             mc_i = self.find_min_child_index(i)
             if self.heap_list[i] > self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py ..F..FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - TypeError: list indices ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 3 failed, 5 passed in 0.13s ==========================

65 : Job ID 7e68013b9c7644f1b1a8dbfe42c7a7b5
SURVIVED
test outcome: survived
heap.py, start pos: (25, 14), end pos: (25, 15)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -22,7 +22,7 @@
             i = mc_i
     def find_min_child_index(self, i):
-        if (i * 2) > self.size():
+        if (i - 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
             return i * 2
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

66 : Job ID ff931827a71a4c608877221c6a68f050
test outcome: killed
heap.py, start pos: (27, 14), end pos: (27, 15)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i - 2) + 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.13s ==========================

67 : Job ID f679adc515564c6ca1efd21776cb96b2
test outcome: killed
heap.py, start pos: (28, 21), end pos: (28, 22)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -25,7 +25,7 @@
         if (i * 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
-            return i * 2
+            return i - 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 4, 5, 9, 6, 12, .....
========================= 1 failed, 7 passed in 0.13s ==========================

68 : Job ID df38b663846948f2b258526e6e2b50e8
test outcome: killed
heap.py, start pos: (30, 32), end pos: (30, 33)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 4
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i - 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 5, 9, 6, 4, ......
========================= 3 failed, 5 passed in 0.13s ==========================

69 : Job ID 8f734a42599f4da5937ff345eb490337
test outcome: killed
heap.py, start pos: (30, 56), end pos: (30, 57)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 5
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i - 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 5, 9, 6, 4, ......
========================= 2 failed, 6 passed in 0.13s ==========================

70 : Job ID a5efa1f969104fcbb80ed9f9bff97b5e
test outcome: killed
heap.py, start pos: (31, 25), end pos: (31, 26)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 6
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -28,7 +28,7 @@
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
-                return i * 2
+                return i - 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ..F..FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - IndexError: list index o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 3 failed, 5 passed in 0.13s ==========================

71 : Job ID 611e85bd69934383a2a8b77975ae36fd
test outcome: killed
heap.py, start pos: (33, 25), end pos: (33, 26)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 7
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i - 2 + 1
     def min(self):
         if len(self.heap_list) > 1:
timeout
