72 : Job ID 2b492a4179b94e19890a2273f516b76c
test outcome: killed
heap.py, start pos: (18, 17), end pos: (18, 18)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -15,7 +15,7 @@
             i = i // 2
     def sift(self, i):
-        while (i * 2) <= self.size():
+        while (i / 2) <= self.size():
             mc_i = self.find_min_child_index(i)
             if self.heap_list[i] > self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py ..F..FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - TypeError: list indices ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 3 failed, 5 passed in 0.13s ==========================

73 : Job ID 2193c3fb9610459d9473d4d405a31e91
SURVIVED
test outcome: survived
heap.py, start pos: (25, 14), end pos: (25, 15)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -22,7 +22,7 @@
             i = mc_i
     def find_min_child_index(self, i):
-        if (i * 2) > self.size():
+        if (i / 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
             return i * 2
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

74 : Job ID f34107fa22094a6c9dd89724f0864b52
test outcome: killed
heap.py, start pos: (27, 14), end pos: (27, 15)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i / 2) + 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.13s ==========================

75 : Job ID 9a2625b2c7164a9d8999831dbede94c9
test outcome: killed
heap.py, start pos: (28, 21), end pos: (28, 22)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -25,7 +25,7 @@
         if (i * 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
-            return i * 2
+            return i / 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 1 failed, 7 passed in 0.13s ==========================

76 : Job ID 159b2c6f58af42f2b4a29169a0f14ac7
test outcome: killed
heap.py, start pos: (30, 32), end pos: (30, 33)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 4
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i / 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ..FF.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - TypeError: lis...
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - TypeError: list indices ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 4 failed, 4 passed in 0.13s ==========================

77 : Job ID 215a19cde28445ac925de90be498c6a5
test outcome: killed
heap.py, start pos: (30, 56), end pos: (30, 57)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 5
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i / 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ..FF.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - TypeError: lis...
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - TypeError: list indices ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 4 failed, 4 passed in 0.13s ==========================

78 : Job ID c0ebae1d1b724b2db3881ba6327bc877
test outcome: killed
heap.py, start pos: (31, 25), end pos: (31, 26)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 6
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -28,7 +28,7 @@
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
-                return i * 2
+                return i / 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ..F..FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - TypeError: list indices ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 3 failed, 5 passed in 0.13s ==========================

79 : Job ID 06620ac8f3714c93b80f708b5ad4662e
test outcome: killed
heap.py, start pos: (33, 25), end pos: (33, 26)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 7
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i / 2 + 1
     def min(self):
         if len(self.heap_list) > 1:
ts-3-5/test_3-5_0-8_264.py ..FF.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 2.0 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - TypeError: list indices ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 4 failed, 4 passed in 0.14s ==========================

80 : Job ID f36b2a2159c44f18a21373791147478a
test outcome: killed
heap.py, start pos: (18, 17), end pos: (18, 18)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -15,7 +15,7 @@
             i = i // 2
     def sift(self, i):
-        while (i * 2) <= self.size():
+        while (i // 2) <= self.size():
             mc_i = self.find_min_child_index(i)
             if self.heap_list[i] > self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py ..F..FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - TypeError: list indices ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 3 failed, 5 passed in 0.13s ==========================

81 : Job ID 2bc24616e40d4195bec0f6c30562652f
SURVIVED
test outcome: survived
heap.py, start pos: (25, 14), end pos: (25, 15)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -22,7 +22,7 @@
             i = mc_i
     def find_min_child_index(self, i):
-        if (i * 2) > self.size():
+        if (i // 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
             return i * 2
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

82 : Job ID cb51dd4f5b7647fea8d62beb798d4798
test outcome: killed
heap.py, start pos: (27, 14), end pos: (27, 15)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i // 2) + 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.14s ==========================

83 : Job ID 8660754ca5e54d8c98014977bb4f1a05
test outcome: killed
heap.py, start pos: (28, 21), end pos: (28, 22)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -25,7 +25,7 @@
         if (i * 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
-            return i * 2
+            return i // 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 4, 5, 9, 6, 12, .....
========================= 1 failed, 7 passed in 0.13s ==========================

84 : Job ID ff70ce9ba65f4f24977710f79c6ed17c
test outcome: killed
heap.py, start pos: (30, 32), end pos: (30, 33)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 4
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i // 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ...F.F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 15, 10, 18...
========================= 2 failed, 6 passed in 0.13s ==========================

85 : Job ID 60afda19a46e4981b8841f263f47fdc9
test outcome: killed
heap.py, start pos: (30, 56), end pos: (30, 57)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 5
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i // 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 15, 10, 18...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 5, 6, 7, 9, 4, ......
========================= 2 failed, 6 passed in 0.13s ==========================

86 : Job ID 742b887340914840b011c5352e6fe56b
test outcome: killed
heap.py, start pos: (31, 25), end pos: (31, 26)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 6
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -28,7 +28,7 @@
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
-                return i * 2
+                return i // 2
             else:
                 return i * 2 + 1
timeout

87 : Job ID af5c593a7349407a8858241cc1c2ef97
test outcome: killed
heap.py, start pos: (33, 25), end pos: (33, 26)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 7
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i // 2 + 1
     def min(self):
         if len(self.heap_list) > 1:
timeout

88 : Job ID 1d70c8f5e8bd4a389410b0524d0e40b9
test outcome: killed
heap.py, start pos: (18, 17), end pos: (18, 18)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -15,7 +15,7 @@
             i = i // 2
     def sift(self, i):
-        while (i * 2) <= self.size():
+        while (i % 2) <= self.size():
             mc_i = self.find_min_child_index(i)
             if self.heap_list[i] > self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py ..F..FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - TypeError: list indices ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 3 failed, 5 passed in 0.13s ==========================

89 : Job ID 463ef4e2c87a41338cc2069bd3875857
SURVIVED
test outcome: survived
heap.py, start pos: (25, 14), end pos: (25, 15)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -22,7 +22,7 @@
             i = mc_i
     def find_min_child_index(self, i):
-        if (i * 2) > self.size():
+        if (i % 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
             return i * 2
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

90 : Job ID e27ac03e85b24fc3ae4795af5f07a1bb
test outcome: killed
heap.py, start pos: (27, 14), end pos: (27, 15)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i % 2) + 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.13s ==========================

91 : Job ID 3fa7627ce2dd4446bb2ac239481741d5
test outcome: killed
heap.py, start pos: (28, 21), end pos: (28, 22)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -25,7 +25,7 @@
         if (i * 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
-            return i * 2
+            return i % 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 4, 5, 9, 6, 12, .....
========================= 1 failed, 7 passed in 0.13s ==========================

92 : Job ID 6989223b222143fda4cc534e83baab15
test outcome: killed
heap.py, start pos: (30, 32), end pos: (30, 33)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 4
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i % 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 5, 9, 6, 4, ......
========================= 3 failed, 5 passed in 0.14s ==========================

93 : Job ID d6ff1237409e401e9b032cca6542aa2b
test outcome: killed
heap.py, start pos: (30, 56), end pos: (30, 57)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 5
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i % 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 5, 9, 6, 4, ......
========================= 2 failed, 6 passed in 0.13s ==========================

94 : Job ID 381abf3462d4402781d21867c1bb253e
test outcome: killed
heap.py, start pos: (31, 25), end pos: (31, 26)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 6
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -28,7 +28,7 @@
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
-                return i * 2
+                return i % 2
             else:
                 return i * 2 + 1
timeout

95 : Job ID 7c87a3e50474474db8c72473ef060b7e
test outcome: killed
heap.py, start pos: (33, 25), end pos: (33, 26)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 7
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i % 2 + 1
     def min(self):
         if len(self.heap_list) > 1:
timeout

96 : Job ID 5f908df191c846baa7c178ba937cb246
test outcome: killed
heap.py, start pos: (18, 17), end pos: (18, 18)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -15,7 +15,7 @@
             i = i // 2
     def sift(self, i):
-        while (i * 2) <= self.size():
+        while (i ** 2) <= self.size():
             mc_i = self.find_min_child_index(i)
             if self.heap_list[i] > self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 4, 5, 12, 9, 6, .....
========================= 1 failed, 7 passed in 0.13s ==========================

97 : Job ID c8edf399f63d426f9a4aaffc9fb86079
test outcome: killed
heap.py, start pos: (25, 14), end pos: (25, 15)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -22,7 +22,7 @@
             i = mc_i
     def find_min_child_index(self, i):
-        if (i * 2) > self.size():
+        if (i ** 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
             return i * 2
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 1 failed, 7 passed in 0.13s ==========================

98 : Job ID e89a4b3cf4ab4e238245d3a89fc2d61a
SURVIVED
test outcome: survived
heap.py, start pos: (27, 14), end pos: (27, 15)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i ** 2) + 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

99 : Job ID c77769e2132541ee962fb24d007d0df6
test outcome: killed
heap.py, start pos: (28, 21), end pos: (28, 22)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -25,7 +25,7 @@
         if (i * 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
-            return i * 2
+            return i ** 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.13s ==========================

100 : Job ID 89da250839784641bd51c8f4815787c8
test outcome: killed
heap.py, start pos: (30, 32), end pos: (30, 33)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 4
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i ** 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 4, 9, 5, 6, ......
========================= 2 failed, 6 passed in 0.13s ==========================

101 : Job ID 93eaf5f351a7400ba2bfbc07a35dd77b
test outcome: killed
heap.py, start pos: (30, 56), end pos: (30, 57)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 5
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i ** 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ..F..FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 4, 9, 5, 6, ......
========================= 3 failed, 5 passed in 0.13s ==========================

102 : Job ID 8891a23b188241fe914258515bdd3906
test outcome: killed
heap.py, start pos: (31, 25), end pos: (31, 26)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 6
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -28,7 +28,7 @@
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
-                return i * 2
+                return i ** 2
             else:
                 return i * 2 + 1
timeout

103 : Job ID 11e1222c63af4f5d8a97a282647eac24
SURVIVED
test outcome: survived
heap.py, start pos: (33, 25), end pos: (33, 26)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 7
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i ** 2 + 1
     def min(self):
         if len(self.heap_list) > 1:
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

104 : Job ID 21bf2db646134c92b48c37191405b973
test outcome: killed
heap.py, start pos: (18, 17), end pos: (18, 18)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -15,7 +15,7 @@
             i = i // 2
     def sift(self, i):
-        while (i * 2) <= self.size():
+        while (i >> 2) <= self.size():
             mc_i = self.find_min_child_index(i)
             if self.heap_list[i] > self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py ..F..FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - TypeError: list indices ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 3 failed, 5 passed in 0.13s ==========================

105 : Job ID d14e52e222a84ea493f836aba77e22c1
SURVIVED
test outcome: survived
heap.py, start pos: (25, 14), end pos: (25, 15)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -22,7 +22,7 @@
             i = mc_i
     def find_min_child_index(self, i):
-        if (i * 2) > self.size():
+        if (i >> 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
             return i * 2
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

106 : Job ID ce39e4fc97f1407294c866adc9b9fefd
test outcome: killed
heap.py, start pos: (27, 14), end pos: (27, 15)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i >> 2) + 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.13s ==========================

107 : Job ID 4799290d04c54e3699e38f61c2b7d4c9
test outcome: killed
heap.py, start pos: (28, 21), end pos: (28, 22)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -25,7 +25,7 @@
         if (i * 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
-            return i * 2
+            return i >> 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 4, 5, 9, 6, 12, .....
========================= 1 failed, 7 passed in 0.13s ==========================
