108 : Job ID 636b8651c224487da65717612ab12e70
test outcome: killed
heap.py, start pos: (30, 32), end pos: (30, 33)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 4
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i >> 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 15, 10, 18...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 5, 6, 7, 9, 4, ......
========================= 3 failed, 5 passed in 0.13s ==========================

109 : Job ID fef51e82678b4688ba96a9c20e77274a
test outcome: killed
heap.py, start pos: (30, 56), end pos: (30, 57)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 5
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i >> 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 4, 9, 5, 6, ......
========================= 2 failed, 6 passed in 0.14s ==========================

110 : Job ID 89d26368a6ae4f62a5f82b0eb6966aa8
test outcome: killed
heap.py, start pos: (31, 25), end pos: (31, 26)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 6
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -28,7 +28,7 @@
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
-                return i * 2
+                return i >> 2
             else:
                 return i * 2 + 1
timeout

111 : Job ID cfd1dea9e2a848598dc0d5c8ef2ce096
test outcome: killed
heap.py, start pos: (33, 25), end pos: (33, 26)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 7
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i >> 2 + 1
     def min(self):
         if len(self.heap_list) > 1:
timeout

112 : Job ID d85cea0e4c584c2e8dfebac665454ec1
test outcome: killed
heap.py, start pos: (18, 17), end pos: (18, 18)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -15,7 +15,7 @@
             i = i // 2
     def sift(self, i):
-        while (i * 2) <= self.size():
+        while (i << 2) <= self.size():
             mc_i = self.find_min_child_index(i)
             if self.heap_list[i] > self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 18, 10, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 6, 9, 12, 5, 4, .....
========================= 2 failed, 6 passed in 0.13s ==========================

113 : Job ID ab0d8fd1a0924fca88cfdaf96f7015d0
test outcome: killed
heap.py, start pos: (25, 14), end pos: (25, 15)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -22,7 +22,7 @@
             i = mc_i
     def find_min_child_index(self, i):
-        if (i * 2) > self.size():
+        if (i << 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
             return i * 2
ts-3-5/test_3-5_0-8_264.py ..FF.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert None == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - TypeError: list indices ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 4 failed, 4 passed in 0.13s ==========================

114 : Job ID b9d4a469df744ce1bbd3cd6421f7e613
test outcome: killed
heap.py, start pos: (27, 14), end pos: (27, 15)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i << 2) + 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 15, 10, 18...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 5, 6, 7, 9, 4, ......
========================= 3 failed, 5 passed in 0.14s ==========================

115 : Job ID 5c1618dff477409fbeb2fdee26fa1a92
test outcome: killed
heap.py, start pos: (28, 21), end pos: (28, 22)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -25,7 +25,7 @@
         if (i * 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
-            return i * 2
+            return i << 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.13s ==========================

116 : Job ID 159aa66434a246368f135d0178d0d07c
test outcome: killed
heap.py, start pos: (30, 32), end pos: (30, 33)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 4
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i << 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ..FF.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - IndexError: li...
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 4 failed, 4 passed in 0.13s ==========================

117 : Job ID dc71580522904479b44b911c217b511e
test outcome: killed
heap.py, start pos: (30, 56), end pos: (30, 57)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 5
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i << 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ..FF.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - IndexError: li...
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - IndexError: list index o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 4 failed, 4 passed in 0.13s ==========================

118 : Job ID 01ef172751964aa7a597ba06b84718f9
test outcome: killed
heap.py, start pos: (31, 25), end pos: (31, 26)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 6
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -28,7 +28,7 @@
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
-                return i * 2
+                return i << 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 15, 7, 10, 18...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 5, 4, 7, 9, 6, ......
========================= 2 failed, 6 passed in 0.13s ==========================

119 : Job ID 2b1aba8641bd4b8888e44a83ea3550fd
test outcome: killed
heap.py, start pos: (33, 25), end pos: (33, 26)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 7
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i << 2 + 1
     def min(self):
         if len(self.heap_list) > 1:
ts-3-5/test_3-5_0-8_264.py ..FF.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 16 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - IndexError: list index o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 4 failed, 4 passed in 0.13s ==========================

120 : Job ID 3978df2756a048d7ba8ca58d5b30cb89
test outcome: killed
heap.py, start pos: (18, 17), end pos: (18, 18)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -15,7 +15,7 @@
             i = i // 2
     def sift(self, i):
-        while (i * 2) <= self.size():
+        while (i | 2) <= self.size():
             mc_i = self.find_min_child_index(i)
             if self.heap_list[i] > self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py ..F...F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 2 failed, 6 passed in 0.13s ==========================

121 : Job ID 8ebf6f42725946d4a92bd5fb0767f67e
SURVIVED
test outcome: survived
heap.py, start pos: (25, 14), end pos: (25, 15)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -22,7 +22,7 @@
             i = mc_i
     def find_min_child_index(self, i):
-        if (i * 2) > self.size():
+        if (i | 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
             return i * 2
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

122 : Job ID 82ca4965dcf941629b877672db2c33ec
test outcome: killed
heap.py, start pos: (27, 14), end pos: (27, 15)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i | 2) + 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.13s ==========================

123 : Job ID aefd7c1438da47b28e162b1128034404
test outcome: killed
heap.py, start pos: (28, 21), end pos: (28, 22)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -25,7 +25,7 @@
         if (i * 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
-            return i * 2
+            return i | 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
timeout

124 : Job ID 78f199e591054ca6999a1a0cff149ee7
test outcome: killed
heap.py, start pos: (30, 32), end pos: (30, 33)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 4
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i | 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 4, 9, 5, 6, ......
========================= 3 failed, 5 passed in 0.14s ==========================

125 : Job ID e9a692346d074445a87bb4214f545b35
test outcome: killed
heap.py, start pos: (30, 56), end pos: (30, 57)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 5
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i | 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 5, 6, 7, 9, 4, ......
========================= 1 failed, 7 passed in 0.13s ==========================

126 : Job ID 2bd5c93253184a71b631b60d35ab14b5
test outcome: killed
heap.py, start pos: (31, 25), end pos: (31, 26)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 6
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -28,7 +28,7 @@
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
-                return i * 2
+                return i | 2
             else:
                 return i * 2 + 1
timeout

127 : Job ID 52c86ccd644842a891fd6e35f34b7132
test outcome: killed
heap.py, start pos: (33, 25), end pos: (33, 26)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 7
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i | 2 + 1
     def min(self):
         if len(self.heap_list) > 1:
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 3 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 10, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 6, 7, 9, 5, 4, ......
========================= 3 failed, 5 passed in 0.14s ==========================

128 : Job ID 0315a0fd052f431f89b910a476f0ce41
test outcome: killed
heap.py, start pos: (18, 17), end pos: (18, 18)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -15,7 +15,7 @@
             i = i // 2
     def sift(self, i):
-        while (i * 2) <= self.size():
+        while (i & 2) <= self.size():
             mc_i = self.find_min_child_index(i)
             if self.heap_list[i] > self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py ..F..FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - TypeError: list indices ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 3 failed, 5 passed in 0.13s ==========================

129 : Job ID 2de4c5c3da454ca287d277159830bc73
SURVIVED
test outcome: survived
heap.py, start pos: (25, 14), end pos: (25, 15)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -22,7 +22,7 @@
             i = mc_i
     def find_min_child_index(self, i):
-        if (i * 2) > self.size():
+        if (i & 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
             return i * 2
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

130 : Job ID b17c8f74f21d4969939b15572a57d84a
test outcome: killed
heap.py, start pos: (27, 14), end pos: (27, 15)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i & 2) + 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.13s ==========================

131 : Job ID 388102e651554ddf994f8fa555f395cd
test outcome: killed
heap.py, start pos: (28, 21), end pos: (28, 22)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -25,7 +25,7 @@
         if (i * 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
-            return i * 2
+            return i & 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 4, 5, 6, 9, 12, .....
========================= 1 failed, 7 passed in 0.13s ==========================

132 : Job ID a32cc1fba3eb4c60b4aebfb0e8991cdf
test outcome: killed
heap.py, start pos: (30, 32), end pos: (30, 33)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 4
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i & 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ...F..F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 4, 6, 7, 5, 9, ......
========================= 2 failed, 6 passed in 0.13s ==========================

133 : Job ID 87760e473ffb4c9189a5d0baa790c282
test outcome: killed
heap.py, start pos: (30, 56), end pos: (30, 57)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 5
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i & 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 15, 10, 18...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 5, 6, 7, 9, 4, ......
========================= 2 failed, 6 passed in 0.13s ==========================

134 : Job ID 0c8cc2aadacc4c548d47215d554a7f1c
test outcome: killed
heap.py, start pos: (31, 25), end pos: (31, 26)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 6
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -28,7 +28,7 @@
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
-                return i * 2
+                return i & 2
             else:
                 return i * 2 + 1
timeout

135 : Job ID 68f2d5a3fa154211b22c5295ab517bab
test outcome: killed
heap.py, start pos: (33, 25), end pos: (33, 26)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 7
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i & 2 + 1
     def min(self):
         if len(self.heap_list) > 1:
timeout

136 : Job ID 8148110449fe46a5abc8836b78cc20e6
test outcome: killed
heap.py, start pos: (18, 17), end pos: (18, 18)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -15,7 +15,7 @@
             i = i // 2
     def sift(self, i):
-        while (i * 2) <= self.size():
+        while (i ^ 2) <= self.size():
             mc_i = self.find_min_child_index(i)
             if self.heap_list[i] > self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py ..F...F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 2 failed, 6 passed in 0.13s ==========================

137 : Job ID d26854cc39654220b54b11819e77a908
SURVIVED
test outcome: survived
heap.py, start pos: (25, 14), end pos: (25, 15)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -22,7 +22,7 @@
             i = mc_i
     def find_min_child_index(self, i):
-        if (i * 2) > self.size():
+        if (i ^ 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
             return i * 2
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

138 : Job ID cbbfc9223a7e4a6ca1174144fc423e79
test outcome: killed
heap.py, start pos: (27, 14), end pos: (27, 15)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i ^ 2) + 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.13s ==========================

139 : Job ID 147084079fe64c29af3909a151546583
test outcome: killed
heap.py, start pos: (28, 21), end pos: (28, 22)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -25,7 +25,7 @@
         if (i * 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
-            return i * 2
+            return i ^ 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 4, 5, 9, 6, 12, .....
========================= 1 failed, 7 passed in 0.13s ==========================

140 : Job ID 37de7e85748c492491e0d3abf8bf4744
test outcome: killed
heap.py, start pos: (30, 32), end pos: (30, 33)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 4
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i ^ 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 5, 9, 6, 4, ......
========================= 3 failed, 5 passed in 0.14s ==========================

141 : Job ID 199b9356a04246a282dfa9f2f0069701
test outcome: killed
heap.py, start pos: (30, 56), end pos: (30, 57)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 5
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i ^ 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 5, 9, 6, 4, ......
========================= 2 failed, 6 passed in 0.13s ==========================

142 : Job ID c09c504b9e3c4e828b4847571d3592f1
test outcome: killed
heap.py, start pos: (31, 25), end pos: (31, 26)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 6
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -28,7 +28,7 @@
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
-                return i * 2
+                return i ^ 2
             else:
                 return i * 2 + 1
timeout

143 : Job ID c88c9d7e9fb5462792473011a0fecb90
test outcome: killed
heap.py, start pos: (33, 25), end pos: (33, 26)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 7
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i ^ 2 + 1
     def min(self):
         if len(self.heap_list) > 1:
timeout
