144 : Job ID 74c86fa7ccf244889350f9211cb9a528
test outcome: killed
heap.py, start pos: (11, 16), end pos: (11, 18)
operator: core/ReplaceBinaryOperator_FloorDiv_Add, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -8,7 +8,7 @@
         self.percolate(self.size())
     def percolate(self, i):
-        while i // 2 > 0:
+        while i + 2 > 0:
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
timeout

145 : Job ID ff32d4faef5e469c87e94a7a98a27d18
test outcome: killed
heap.py, start pos: (12, 23), end pos: (12, 25)
operator: core/ReplaceBinaryOperator_FloorDiv_Add, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -9,7 +9,7 @@
     def percolate(self, i):
         while i // 2 > 0:
-            parent = i // 2
+            parent = i + 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
             i = i // 2
ts-3-5/test_3-5_0-8_264.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - IndexError: list index out o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_percolate - assert [0, 3, 15, 10, 7, ...
========================= 2 failed, 6 passed in 0.13s ==========================

146 : Job ID d73699cd2c374c93aa7bd3c673c0ed3c
test outcome: killed
heap.py, start pos: (15, 18), end pos: (15, 20)
operator: core/ReplaceBinaryOperator_FloorDiv_Add, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -12,7 +12,7 @@
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
-            i = i // 2
+            i = i + 2
     def sift(self, i):
         while (i * 2) <= self.size():
ts-3-5/test_3-5_0-8_264.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - IndexError: list index out o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_percolate - IndexError: list index ou...
========================= 2 failed, 6 passed in 0.14s ==========================

147 : Job ID 969c7c61238b4e6aa3e15cf6e57576e1
SURVIVED
test outcome: survived
heap.py, start pos: (53, 21), end pos: (53, 23)
operator: core/ReplaceBinaryOperator_FloorDiv_Add, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -50,7 +50,7 @@
         return min_val
     def build(self, lst:list):
-        i = len(lst) // 2
+        i = len(lst) + 2
         self.heap_list = [0] + lst
         while i > 0:
             self.sift(i)
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

148 : Job ID 4684aa2291194e3cb1f37b4e3b8ac7fb
test outcome: killed
heap.py, start pos: (11, 16), end pos: (11, 18)
operator: core/ReplaceBinaryOperator_FloorDiv_Sub, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -8,7 +8,7 @@
         self.percolate(self.size())
     def percolate(self, i):
-        while i // 2 > 0:
+        while i - 2 > 0:
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py F.......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [0, 5, 2] == [0, 2, 5]
========================= 1 failed, 7 passed in 0.13s ==========================

149 : Job ID c8a10d55d50546cca4faf79aa2c387b1
test outcome: killed
heap.py, start pos: (12, 23), end pos: (12, 25)
operator: core/ReplaceBinaryOperator_FloorDiv_Sub, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -9,7 +9,7 @@
     def percolate(self, i):
         while i // 2 > 0:
-            parent = i // 2
+            parent = i - 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
             i = i // 2
ts-3-5/test_3-5_0-8_264.py F.......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [0, 5, 2] == [0, 2, 5]
========================= 1 failed, 7 passed in 0.13s ==========================

150 : Job ID 98c10099cf8e49b5bf64743c9f8519ac
SURVIVED
test outcome: survived
heap.py, start pos: (15, 18), end pos: (15, 20)
operator: core/ReplaceBinaryOperator_FloorDiv_Sub, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -12,7 +12,7 @@
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
-            i = i // 2
+            i = i - 2
     def sift(self, i):
         while (i * 2) <= self.size():
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

151 : Job ID 923e08e4487e40b18f12906438e351aa
SURVIVED
test outcome: survived
heap.py, start pos: (53, 21), end pos: (53, 23)
operator: core/ReplaceBinaryOperator_FloorDiv_Sub, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -50,7 +50,7 @@
         return min_val
     def build(self, lst:list):
-        i = len(lst) // 2
+        i = len(lst) - 2
         self.heap_list = [0] + lst
         while i > 0:
             self.sift(i)
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

152 : Job ID 1c63b7c8db9d4b04a997055ae5673eb1
SURVIVED
test outcome: survived
heap.py, start pos: (11, 16), end pos: (11, 18)
operator: core/ReplaceBinaryOperator_FloorDiv_Mul, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -8,7 +8,7 @@
         self.percolate(self.size())
     def percolate(self, i):
-        while i // 2 > 0:
+        while i * 2 > 0:
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

153 : Job ID ea3d3eb400cc4c11a86d0c789828b762
test outcome: killed
heap.py, start pos: (12, 23), end pos: (12, 25)
operator: core/ReplaceBinaryOperator_FloorDiv_Mul, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -9,7 +9,7 @@
     def percolate(self, i):
         while i // 2 > 0:
-            parent = i // 2
+            parent = i * 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
             i = i // 2
ts-3-5/test_3-5_0-8_264.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - IndexError: list index out o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_percolate - IndexError: list index ou...
========================= 2 failed, 6 passed in 0.14s ==========================

154 : Job ID a2f3de2408c34f1098b941cee7b36db1
test outcome: killed
heap.py, start pos: (15, 18), end pos: (15, 20)
operator: core/ReplaceBinaryOperator_FloorDiv_Mul, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -12,7 +12,7 @@
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
-            i = i // 2
+            i = i * 2
     def sift(self, i):
         while (i * 2) <= self.size():
ts-3-5/test_3-5_0-8_264.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - IndexError: list index out o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_percolate - IndexError: list index ou...
========================= 2 failed, 6 passed in 0.13s ==========================

155 : Job ID d1c83e9c11be45b0850433ad75026bf2
SURVIVED
test outcome: survived
heap.py, start pos: (53, 21), end pos: (53, 23)
operator: core/ReplaceBinaryOperator_FloorDiv_Mul, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -50,7 +50,7 @@
         return min_val
     def build(self, lst:list):
-        i = len(lst) // 2
+        i = len(lst) * 2
         self.heap_list = [0] + lst
         while i > 0:
             self.sift(i)
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

156 : Job ID 182290bdd0814eaebc84fecef9d8a752
SURVIVED
test outcome: survived
heap.py, start pos: (11, 16), end pos: (11, 18)
operator: core/ReplaceBinaryOperator_FloorDiv_Div, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -8,7 +8,7 @@
         self.percolate(self.size())
     def percolate(self, i):
-        while i // 2 > 0:
+        while i / 2 > 0:
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

157 : Job ID af1eaf4e3a384e2fb21b6ea73052bef8
test outcome: killed
heap.py, start pos: (12, 23), end pos: (12, 25)
operator: core/ReplaceBinaryOperator_FloorDiv_Div, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -9,7 +9,7 @@
     def percolate(self, i):
         while i // 2 > 0:
-            parent = i // 2
+            parent = i / 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
             i = i // 2
ts-3-5/test_3-5_0-8_264.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - TypeError: list indices must...
FAILED ts-3-5/test_3-5_0-8_264.py::test_percolate - TypeError: list indices m...
========================= 2 failed, 6 passed in 0.13s ==========================

158 : Job ID a88f2d4d5418438c9dfb93f89ee1844d
test outcome: killed
heap.py, start pos: (15, 18), end pos: (15, 20)
operator: core/ReplaceBinaryOperator_FloorDiv_Div, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -12,7 +12,7 @@
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
-            i = i // 2
+            i = i / 2
     def sift(self, i):
         while (i * 2) <= self.size():
ts-3-5/test_3-5_0-8_264.py .F......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_percolate - TypeError: list indices m...
========================= 1 failed, 7 passed in 0.13s ==========================

159 : Job ID 45023a2c952e40cabfd7b9978e8890c1
test outcome: killed
heap.py, start pos: (53, 21), end pos: (53, 23)
operator: core/ReplaceBinaryOperator_FloorDiv_Div, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -50,7 +50,7 @@
         return min_val
     def build(self, lst:list):
-        i = len(lst) // 2
+        i = len(lst) / 2
         self.heap_list = [0] + lst
         while i > 0:
             self.sift(i)
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 1 failed, 7 passed in 0.13s ==========================

160 : Job ID f44034b078bc4bb0bc8f1f8fe8dd52f4
test outcome: killed
heap.py, start pos: (11, 16), end pos: (11, 18)
operator: core/ReplaceBinaryOperator_FloorDiv_Mod, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -8,7 +8,7 @@
         self.percolate(self.size())
     def percolate(self, i):
-        while i // 2 > 0:
+        while i % 2 > 0:
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py F.......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [0, 5, 2] == [0, 2, 5]
========================= 1 failed, 7 passed in 0.13s ==========================

161 : Job ID d7cf3ac3f45a491196d9e8f57fd182ee
test outcome: killed
heap.py, start pos: (12, 23), end pos: (12, 25)
operator: core/ReplaceBinaryOperator_FloorDiv_Mod, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -9,7 +9,7 @@
     def percolate(self, i):
         while i // 2 > 0:
-            parent = i // 2
+            parent = i % 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
             i = i // 2
ts-3-5/test_3-5_0-8_264.py F.......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [0, 5, 2] == [0, 2, 5]
========================= 1 failed, 7 passed in 0.13s ==========================

162 : Job ID 9b5c12b2dda34aa2a37c124f1f9da571
SURVIVED
test outcome: survived
heap.py, start pos: (15, 18), end pos: (15, 20)
operator: core/ReplaceBinaryOperator_FloorDiv_Mod, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -12,7 +12,7 @@
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
-            i = i // 2
+            i = i % 2
     def sift(self, i):
         while (i * 2) <= self.size():
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

163 : Job ID 34c43aa59c8b4e9a86aee2ccfac42707
test outcome: killed
heap.py, start pos: (53, 21), end pos: (53, 23)
operator: core/ReplaceBinaryOperator_FloorDiv_Mod, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -50,7 +50,7 @@
         return min_val
     def build(self, lst:list):
-        i = len(lst) // 2
+        i = len(lst) % 2
         self.heap_list = [0] + lst
         while i > 0:
             self.sift(i)
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 9, 6, 12, 5, 4, .....
========================= 1 failed, 7 passed in 0.13s ==========================

164 : Job ID ba131c233645437180b60708fafb3b57
SURVIVED
test outcome: survived
heap.py, start pos: (11, 16), end pos: (11, 18)
operator: core/ReplaceBinaryOperator_FloorDiv_Pow, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -8,7 +8,7 @@
         self.percolate(self.size())
     def percolate(self, i):
-        while i // 2 > 0:
+        while i ** 2 > 0:
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

165 : Job ID 0e2381bcca1d44bb94f8fed6ce786f47
test outcome: killed
heap.py, start pos: (12, 23), end pos: (12, 25)
operator: core/ReplaceBinaryOperator_FloorDiv_Pow, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -9,7 +9,7 @@
     def percolate(self, i):
         while i // 2 > 0:
-            parent = i // 2
+            parent = i ** 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
             i = i // 2
ts-3-5/test_3-5_0-8_264.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - IndexError: list index out o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_percolate - IndexError: list index ou...
========================= 2 failed, 6 passed in 0.13s ==========================

166 : Job ID 97c7c571717f42b9979c7cfad61d07a8
test outcome: killed
heap.py, start pos: (15, 18), end pos: (15, 20)
operator: core/ReplaceBinaryOperator_FloorDiv_Pow, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -12,7 +12,7 @@
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
-            i = i // 2
+            i = i ** 2
     def sift(self, i):
         while (i * 2) <= self.size():
ts-3-5/test_3-5_0-8_264.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - IndexError: list index out o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_percolate - IndexError: list index ou...
========================= 2 failed, 6 passed in 0.13s ==========================

167 : Job ID b962494a6866473086afdb28e015e4a7
SURVIVED
test outcome: survived
heap.py, start pos: (53, 21), end pos: (53, 23)
operator: core/ReplaceBinaryOperator_FloorDiv_Pow, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -50,7 +50,7 @@
         return min_val
     def build(self, lst:list):
-        i = len(lst) // 2
+        i = len(lst) ** 2
         self.heap_list = [0] + lst
         while i > 0:
             self.sift(i)
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

168 : Job ID c47512c154fa454db5875cfe2bef6e7a
test outcome: killed
heap.py, start pos: (11, 16), end pos: (11, 18)
operator: core/ReplaceBinaryOperator_FloorDiv_RShift, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -8,7 +8,7 @@
         self.percolate(self.size())
     def percolate(self, i):
-        while i // 2 > 0:
+        while i >> 2 > 0:
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py F.......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [0, 5, 2] == [0, 2, 5]
========================= 1 failed, 7 passed in 0.13s ==========================

169 : Job ID 852d8ec70b644f4cbcec707d28eb6fb1
test outcome: killed
heap.py, start pos: (12, 23), end pos: (12, 25)
operator: core/ReplaceBinaryOperator_FloorDiv_RShift, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -9,7 +9,7 @@
     def percolate(self, i):
         while i // 2 > 0:
-            parent = i // 2
+            parent = i >> 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
             i = i // 2
ts-3-5/test_3-5_0-8_264.py F.......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [0, 5, 2] == [0, 2, 5]
========================= 1 failed, 7 passed in 0.13s ==========================

170 : Job ID 4eaaf958fb6e4ab8922370473f4801c2
SURVIVED
test outcome: survived
heap.py, start pos: (15, 18), end pos: (15, 20)
operator: core/ReplaceBinaryOperator_FloorDiv_RShift, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -12,7 +12,7 @@
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
-            i = i // 2
+            i = i >> 2
     def sift(self, i):
         while (i * 2) <= self.size():
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

171 : Job ID 09ee0824cff44e95aaa10d2a0dce57f0
test outcome: killed
heap.py, start pos: (53, 21), end pos: (53, 23)
operator: core/ReplaceBinaryOperator_FloorDiv_RShift, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -50,7 +50,7 @@
         return min_val
     def build(self, lst:list):
-        i = len(lst) // 2
+        i = len(lst) >> 2
         self.heap_list = [0] + lst
         while i > 0:
             self.sift(i)
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 6, 4, 12, 5, 9, .....
========================= 1 failed, 7 passed in 0.13s ==========================

172 : Job ID 05099ae042ad4c1ba857d2b937546872
SURVIVED
test outcome: survived
heap.py, start pos: (11, 16), end pos: (11, 18)
operator: core/ReplaceBinaryOperator_FloorDiv_LShift, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -8,7 +8,7 @@
         self.percolate(self.size())
     def percolate(self, i):
-        while i // 2 > 0:
+        while i << 2 > 0:
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

173 : Job ID 14d330aaa7ec46128890148769754f88
test outcome: killed
heap.py, start pos: (12, 23), end pos: (12, 25)
operator: core/ReplaceBinaryOperator_FloorDiv_LShift, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -9,7 +9,7 @@
     def percolate(self, i):
         while i // 2 > 0:
-            parent = i // 2
+            parent = i << 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
             i = i // 2
ts-3-5/test_3-5_0-8_264.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - IndexError: list index out o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_percolate - IndexError: list index ou...
========================= 2 failed, 6 passed in 0.13s ==========================

174 : Job ID 10047f1a76604138adc97c54ff919b23
test outcome: killed
heap.py, start pos: (15, 18), end pos: (15, 20)
operator: core/ReplaceBinaryOperator_FloorDiv_LShift, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -12,7 +12,7 @@
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
-            i = i // 2
+            i = i << 2
     def sift(self, i):
         while (i * 2) <= self.size():
ts-3-5/test_3-5_0-8_264.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - IndexError: list index out o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_percolate - IndexError: list index ou...
========================= 2 failed, 6 passed in 0.13s ==========================

175 : Job ID b78dba31d494488ea8e1c30ac31e7ccb
SURVIVED
test outcome: survived
heap.py, start pos: (53, 21), end pos: (53, 23)
operator: core/ReplaceBinaryOperator_FloorDiv_LShift, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -50,7 +50,7 @@
         return min_val
     def build(self, lst:list):
-        i = len(lst) // 2
+        i = len(lst) << 2
         self.heap_list = [0] + lst
         while i > 0:
             self.sift(i)
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

176 : Job ID 39e0cba4843645cf9fa0ad5808214daa
test outcome: killed
heap.py, start pos: (11, 16), end pos: (11, 18)
operator: core/ReplaceBinaryOperator_FloorDiv_BitOr, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -8,7 +8,7 @@
         self.percolate(self.size())
     def percolate(self, i):
-        while i // 2 > 0:
+        while i | 2 > 0:
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
timeout

177 : Job ID 3300290567e34d5fa839f93eb6188d42
test outcome: killed
heap.py, start pos: (12, 23), end pos: (12, 25)
operator: core/ReplaceBinaryOperator_FloorDiv_BitOr, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -9,7 +9,7 @@
     def percolate(self, i):
         while i // 2 > 0:
-            parent = i // 2
+            parent = i | 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
             i = i // 2
ts-3-5/test_3-5_0-8_264.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [0, 5, 2] == [0, 2, 5]
FAILED ts-3-5/test_3-5_0-8_264.py::test_percolate - assert [0, 3, 7, 10, 15, ...
========================= 2 failed, 6 passed in 0.14s ==========================

178 : Job ID 12893a22dfbf408081bc67f8095cc5c2
test outcome: killed
heap.py, start pos: (15, 18), end pos: (15, 20)
operator: core/ReplaceBinaryOperator_FloorDiv_BitOr, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -12,7 +12,7 @@
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
-            i = i // 2
+            i = i | 2
     def sift(self, i):
         while (i * 2) <= self.size():
timeout

179 : Job ID 38d966f7fb554e07b7fd6958505780a5
SURVIVED
test outcome: survived
heap.py, start pos: (53, 21), end pos: (53, 23)
operator: core/ReplaceBinaryOperator_FloorDiv_BitOr, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -50,7 +50,7 @@
         return min_val
     def build(self, lst:list):
-        i = len(lst) // 2
+        i = len(lst) | 2
         self.heap_list = [0] + lst
         while i > 0:
             self.sift(i)
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

180 : Job ID a9c762f5963e4aef93188aadf69c3769
SURVIVED
test outcome: survived
heap.py, start pos: (11, 16), end pos: (11, 18)
operator: core/ReplaceBinaryOperator_FloorDiv_BitAnd, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -8,7 +8,7 @@
         self.percolate(self.size())
     def percolate(self, i):
-        while i // 2 > 0:
+        while i & 2 > 0:
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

181 : Job ID 44eb157cba5c4222b131debd708277d5
test outcome: killed
heap.py, start pos: (12, 23), end pos: (12, 25)
operator: core/ReplaceBinaryOperator_FloorDiv_BitAnd, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -9,7 +9,7 @@
     def percolate(self, i):
         while i // 2 > 0:
-            parent = i // 2
+            parent = i & 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
             i = i // 2
ts-3-5/test_3-5_0-8_264.py F.......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [0, 5, 2] == [0, 2, 5]
========================= 1 failed, 7 passed in 0.13s ==========================
