182 : Job ID f0b13aed68294386b750e333038eaf67
test outcome: killed
heap.py, start pos: (15, 18), end pos: (15, 20)
operator: core/ReplaceBinaryOperator_FloorDiv_BitAnd, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -12,7 +12,7 @@
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
-            i = i // 2
+            i = i & 2
     def sift(self, i):
         while (i * 2) <= self.size():
timeout

183 : Job ID 4154541f5bfc4f2c8ec5aa12adec1e96
test outcome: killed
heap.py, start pos: (53, 21), end pos: (53, 23)
operator: core/ReplaceBinaryOperator_FloorDiv_BitAnd, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -50,7 +50,7 @@
         return min_val
     def build(self, lst:list):
-        i = len(lst) // 2
+        i = len(lst) & 2
         self.heap_list = [0] + lst
         while i > 0:
             self.sift(i)
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 4, 5, 12, 9, 6, .....
========================= 1 failed, 7 passed in 0.13s ==========================

184 : Job ID 1570dcb414f242a4becdd04e8fe0a864
test outcome: killed
heap.py, start pos: (11, 16), end pos: (11, 18)
operator: core/ReplaceBinaryOperator_FloorDiv_BitXor, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -8,7 +8,7 @@
         self.percolate(self.size())
     def percolate(self, i):
-        while i // 2 > 0:
+        while i ^ 2 > 0:
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
timeout

185 : Job ID 8273e44ed06f4d2e97f187301854b870
test outcome: killed
heap.py, start pos: (12, 23), end pos: (12, 25)
operator: core/ReplaceBinaryOperator_FloorDiv_BitXor, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -9,7 +9,7 @@
     def percolate(self, i):
         while i // 2 > 0:
-            parent = i // 2
+            parent = i ^ 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
             i = i // 2
ts-3-5/test_3-5_0-8_264.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [0, 5, 2] == [0, 2, 5]
FAILED ts-3-5/test_3-5_0-8_264.py::test_percolate - assert [0, 3, 7, 10, 15, ...
========================= 2 failed, 6 passed in 0.13s ==========================

186 : Job ID 0a02afb3d62c42a1bfab1c26defaabab
test outcome: killed
heap.py, start pos: (15, 18), end pos: (15, 20)
operator: core/ReplaceBinaryOperator_FloorDiv_BitXor, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -12,7 +12,7 @@
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
-            i = i // 2
+            i = i ^ 2
     def sift(self, i):
         while (i * 2) <= self.size():
timeout

187 : Job ID 73afb6ffcd644f6dad7002f650197723
SURVIVED
test outcome: survived
heap.py, start pos: (53, 21), end pos: (53, 23)
operator: core/ReplaceBinaryOperator_FloorDiv_BitXor, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -50,7 +50,7 @@
         return min_val
     def build(self, lst:list):
-        i = len(lst) // 2
+        i = len(lst) ^ 2
         self.heap_list = [0] + lst
         while i > 0:
             self.sift(i)
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

188 : Job ID dc5dfd50b50d4ca29437df248cca2543
test outcome: killed
heap.py, start pos: (42, 23), end pos: (42, 25)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -39,7 +39,7 @@
             return None
     def delete_min(self):
-        if self.size() == 0:
+        if self.size() != 0:
             return None
         if self.size() == 1:
             return self.heap_list.pop()
ts-3-5/test_3-5_0-8_264.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert None == 3
========================= 1 failed, 7 passed in 0.13s ==========================

189 : Job ID 3850cf44815645ed83cd935e0817cadf
test outcome: killed
heap.py, start pos: (44, 23), end pos: (44, 25)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -41,7 +41,7 @@
     def delete_min(self):
         if self.size() == 0:
             return None
-        if self.size() == 1:
+        if self.size() != 1:
             return self.heap_list.pop()
         min_val = self.heap_list[1]
ts-3-5/test_3-5_0-8_264.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert 18 == 3
========================= 1 failed, 7 passed in 0.13s ==========================

190 : Job ID 535f0fc82f5c45eeacfac586fd93b3c1
SURVIVED
test outcome: survived
heap.py, start pos: (42, 23), end pos: (42, 25)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -39,7 +39,7 @@
             return None
     def delete_min(self):
-        if self.size() == 0:
+        if self.size() < 0:
             return None
         if self.size() == 1:
             return self.heap_list.pop()
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

191 : Job ID 82e2e5a767ce4763bcb7a8f91a8382bc
SURVIVED
test outcome: survived
heap.py, start pos: (44, 23), end pos: (44, 25)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -41,7 +41,7 @@
     def delete_min(self):
         if self.size() == 0:
             return None
-        if self.size() == 1:
+        if self.size() < 1:
             return self.heap_list.pop()
         min_val = self.heap_list[1]
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

192 : Job ID d7e9e037a0384fa1a7eef08c91c1b8c4
SURVIVED
test outcome: survived
heap.py, start pos: (42, 23), end pos: (42, 25)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -39,7 +39,7 @@
             return None
     def delete_min(self):
-        if self.size() == 0:
+        if self.size() <= 0:
             return None
         if self.size() == 1:
             return self.heap_list.pop()
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

193 : Job ID be560668f8fa486bbabc382fa4192f7a
SURVIVED
test outcome: survived
heap.py, start pos: (44, 23), end pos: (44, 25)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -41,7 +41,7 @@
     def delete_min(self):
         if self.size() == 0:
             return None
-        if self.size() == 1:
+        if self.size() <= 1:
             return self.heap_list.pop()
         min_val = self.heap_list[1]
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

194 : Job ID 05280b6ee862453a8d827e872dbdcef4
test outcome: killed
heap.py, start pos: (42, 23), end pos: (42, 25)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -39,7 +39,7 @@
             return None
     def delete_min(self):
-        if self.size() == 0:
+        if self.size() > 0:
             return None
         if self.size() == 1:
             return self.heap_list.pop()
ts-3-5/test_3-5_0-8_264.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert None == 3
========================= 1 failed, 7 passed in 0.14s ==========================

195 : Job ID 57261d65eee342ed8d8e567ad4a73adb
test outcome: killed
heap.py, start pos: (44, 23), end pos: (44, 25)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -41,7 +41,7 @@
     def delete_min(self):
         if self.size() == 0:
             return None
-        if self.size() == 1:
+        if self.size() > 1:
             return self.heap_list.pop()
         min_val = self.heap_list[1]
ts-3-5/test_3-5_0-8_264.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert 18 == 3
========================= 1 failed, 7 passed in 0.13s ==========================

196 : Job ID 7e03a4bd31324eca873182e31cbe8167
test outcome: killed
heap.py, start pos: (42, 23), end pos: (42, 25)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -39,7 +39,7 @@
             return None
     def delete_min(self):
-        if self.size() == 0:
+        if self.size() >= 0:
             return None
         if self.size() == 1:
             return self.heap_list.pop()
ts-3-5/test_3-5_0-8_264.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert None == 3
========================= 1 failed, 7 passed in 0.13s ==========================

197 : Job ID d9b272390aee48c5ac08457ca40a08ea
test outcome: killed
heap.py, start pos: (44, 23), end pos: (44, 25)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -41,7 +41,7 @@
     def delete_min(self):
         if self.size() == 0:
             return None
-        if self.size() == 1:
+        if self.size() >= 1:
             return self.heap_list.pop()
         min_val = self.heap_list[1]
ts-3-5/test_3-5_0-8_264.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert 18 == 3
========================= 1 failed, 7 passed in 0.13s ==========================

198 : Job ID 09d6f43c5e624a1c84edfeef4f20a36f
test outcome: killed
heap.py, start pos: (13, 33), end pos: (13, 34)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -10,7 +10,7 @@
     def percolate(self, i):
         while i // 2 > 0:
             parent = i // 2
-            if self.heap_list[i] < self.heap_list[parent]:
+            if self.heap_list[i] == self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
             i = i // 2
ts-3-5/test_3-5_0-8_264.py F.......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [0, 5, 2] == [0, 2, 5]
========================= 1 failed, 7 passed in 0.13s ==========================

199 : Job ID dbdad56f7131429295a18811291b1ce7
test outcome: killed
heap.py, start pos: (30, 37), end pos: (30, 38)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] == self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 4, 9, 5, 6, ......
========================= 2 failed, 6 passed in 0.15s ==========================

200 : Job ID 31ac7acb31664f40a473e1aebc049f30
test outcome: killed
heap.py, start pos: (13, 33), end pos: (13, 34)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -10,7 +10,7 @@
     def percolate(self, i):
         while i // 2 > 0:
             parent = i // 2
-            if self.heap_list[i] < self.heap_list[parent]:
+            if self.heap_list[i] != self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
             i = i // 2
ts-3-5/test_3-5_0-8_264.py .F......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_percolate - assert [0, 11, 3, 10, 15,...
========================= 1 failed, 7 passed in 0.13s ==========================

201 : Job ID 5953e936d2d44ded9cbc2153d9cd09f9
test outcome: killed
heap.py, start pos: (30, 37), end pos: (30, 38)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] != self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 15, 10, 18...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 5, 6, 7, 9, 4, ......
========================= 3 failed, 5 passed in 0.13s ==========================

202 : Job ID a37e8509f9f14300af63bd0f67321989
SURVIVED
test outcome: survived
heap.py, start pos: (13, 33), end pos: (13, 34)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -10,7 +10,7 @@
     def percolate(self, i):
         while i // 2 > 0:
             parent = i // 2
-            if self.heap_list[i] < self.heap_list[parent]:
+            if self.heap_list[i] <= self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
             i = i // 2
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

203 : Job ID 812e2cc1bbca4f94a12b59c070142110
SURVIVED
test outcome: survived
heap.py, start pos: (30, 37), end pos: (30, 38)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] <= self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

204 : Job ID 62ed2303816941b6bbc0857530a354f9
test outcome: killed
heap.py, start pos: (13, 33), end pos: (13, 34)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -10,7 +10,7 @@
     def percolate(self, i):
         while i // 2 > 0:
             parent = i // 2
-            if self.heap_list[i] < self.heap_list[parent]:
+            if self.heap_list[i] > self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
             i = i // 2
ts-3-5/test_3-5_0-8_264.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [0, 5, 2] == [0, 2, 5]
FAILED ts-3-5/test_3-5_0-8_264.py::test_percolate - assert [0, 11, 3, 10, 15,...
========================= 2 failed, 6 passed in 0.13s ==========================

205 : Job ID 633ff0da34034033899471f848cf228a
test outcome: killed
heap.py, start pos: (30, 37), end pos: (30, 38)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] > self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 5, 9, 6, 4, ......
========================= 3 failed, 5 passed in 0.13s ==========================

206 : Job ID b08b75bd73bc47029e8e1cf0f391bd11
test outcome: killed
heap.py, start pos: (13, 33), end pos: (13, 34)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -10,7 +10,7 @@
     def percolate(self, i):
         while i // 2 > 0:
             parent = i // 2
-            if self.heap_list[i] < self.heap_list[parent]:
+            if self.heap_list[i] >= self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
             i = i // 2
ts-3-5/test_3-5_0-8_264.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [0, 5, 2] == [0, 2, 5]
FAILED ts-3-5/test_3-5_0-8_264.py::test_percolate - assert [0, 11, 3, 10, 15,...
========================= 2 failed, 6 passed in 0.13s ==========================

207 : Job ID 4b84699a077345aca5365a0caedf4f07
test outcome: killed
heap.py, start pos: (30, 37), end pos: (30, 38)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] >= self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 5, 9, 6, 4, ......
========================= 3 failed, 5 passed in 0.13s ==========================

208 : Job ID 095ecdb7282d4349bd1064b1a2b8a00e
test outcome: killed
heap.py, start pos: (13, 33), end pos: (13, 34)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -10,7 +10,7 @@
     def percolate(self, i):
         while i // 2 > 0:
             parent = i // 2
-            if self.heap_list[i] < self.heap_list[parent]:
+            if self.heap_list[i] is self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
             i = i // 2
ts-3-5/test_3-5_0-8_264.py F.......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [0, 5, 2] == [0, 2, 5]
========================= 1 failed, 7 passed in 0.13s ==========================

209 : Job ID 5d63f3f16942437e93022967c1373167
test outcome: killed
heap.py, start pos: (30, 37), end pos: (30, 38)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] is self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 4, 9, 5, 6, ......
========================= 2 failed, 6 passed in 0.14s ==========================

210 : Job ID 2d18910e8201445681aaec2ddc2049f0
test outcome: killed
heap.py, start pos: (13, 33), end pos: (13, 34)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -10,7 +10,7 @@
     def percolate(self, i):
         while i // 2 > 0:
             parent = i // 2
-            if self.heap_list[i] < self.heap_list[parent]:
+            if self.heap_list[i] is not self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
             i = i // 2
ts-3-5/test_3-5_0-8_264.py .F......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_percolate - assert [0, 11, 3, 10, 15,...
========================= 1 failed, 7 passed in 0.13s ==========================

211 : Job ID e7c0a32177f440659b6725103c90ddb5
test outcome: killed
heap.py, start pos: (30, 37), end pos: (30, 38)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] is not self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 15, 10, 18...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 5, 6, 7, 9, 4, ......
========================= 3 failed, 5 passed in 0.13s ==========================

212 : Job ID f902b1d252794421bfd61afd88cc3ebf
test outcome: killed
heap.py, start pos: (18, 22), end pos: (18, 24)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -15,7 +15,7 @@
             i = i // 2
     def sift(self, i):
-        while (i * 2) <= self.size():
+        while (i * 2) == self.size():
             mc_i = self.find_min_child_index(i)
             if self.heap_list[i] > self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 18, 7, 10, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 9, 6, 7, 5, 4, ......
========================= 2 failed, 6 passed in 0.13s ==========================

213 : Job ID 77683399d25c40609cbf2c14e682a0f7
test outcome: killed
heap.py, start pos: (18, 22), end pos: (18, 24)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -15,7 +15,7 @@
             i = i // 2
     def sift(self, i):
-        while (i * 2) <= self.size():
+        while (i * 2) != self.size():
             mc_i = self.find_min_child_index(i)
             if self.heap_list[i] > self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py ..F..FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - TypeError: list indices ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 3 failed, 5 passed in 0.14s ==========================

214 : Job ID 5653e59abb524cfe8077a7e7d003c706
test outcome: killed
heap.py, start pos: (18, 22), end pos: (18, 24)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -15,7 +15,7 @@
             i = i // 2
     def sift(self, i):
-        while (i * 2) <= self.size():
+        while (i * 2) < self.size():
             mc_i = self.find_min_child_index(i)
             if self.heap_list[i] > self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 4, 5, 12, 9, 6, .....
========================= 1 failed, 7 passed in 0.13s ==========================

215 : Job ID 1e312559b33d4a4c8c02bc0cf5a140d5
test outcome: killed
heap.py, start pos: (18, 22), end pos: (18, 24)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -15,7 +15,7 @@
             i = i // 2
     def sift(self, i):
-        while (i * 2) <= self.size():
+        while (i * 2) > self.size():
             mc_i = self.find_min_child_index(i)
             if self.heap_list[i] > self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 18, 7, 10, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 9, 6, 12, 5, 4, .....
========================= 2 failed, 6 passed in 0.14s ==========================

216 : Job ID 245bb7ec78b24801a9153d9509d2b24a
test outcome: killed
heap.py, start pos: (18, 22), end pos: (18, 24)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -15,7 +15,7 @@
             i = i // 2
     def sift(self, i):
-        while (i * 2) <= self.size():
+        while (i * 2) >= self.size():
             mc_i = self.find_min_child_index(i)
             if self.heap_list[i] > self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 18, 7, 10, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 2 failed, 6 passed in 0.13s ==========================
