217 : Job ID 0f17f5042cbd4c76a943940e74f2f10a
test outcome: killed
heap.py, start pos: (18, 22), end pos: (18, 24)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -15,7 +15,7 @@
             i = i // 2
     def sift(self, i):
-        while (i * 2) <= self.size():
+        while (i * 2) is self.size():
             mc_i = self.find_min_child_index(i)
             if self.heap_list[i] > self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 18, 7, 10, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 9, 6, 7, 5, 4, ......
========================= 2 failed, 6 passed in 0.13s ==========================

218 : Job ID 47e046b49afe4efab52dbf4cf850b649
test outcome: killed
heap.py, start pos: (18, 22), end pos: (18, 24)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -15,7 +15,7 @@
             i = i // 2
     def sift(self, i):
-        while (i * 2) <= self.size():
+        while (i * 2) is not self.size():
             mc_i = self.find_min_child_index(i)
             if self.heap_list[i] > self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py ..F..FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - TypeError: list indices ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 3 failed, 5 passed in 0.13s ==========================

219 : Job ID 286e8c9105274c60818a4407f1c77b41
test outcome: killed
heap.py, start pos: (11, 21), end pos: (11, 22)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -8,7 +8,7 @@
         self.percolate(self.size())
     def percolate(self, i):
-        while i // 2 > 0:
+        while i // 2 == 0:
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
timeout

220 : Job ID db8f1294ca144b49af0e5a51f4244e0d
test outcome: killed
heap.py, start pos: (20, 33), end pos: (20, 34)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -17,7 +17,7 @@
     def sift(self, i):
         while (i * 2) <= self.size():
             mc_i = self.find_min_child_index(i)
-            if self.heap_list[i] > self.heap_list[mc_i]:
+            if self.heap_list[i] == self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
             i = mc_i
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 18, 7, 10, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 9, 6, 12, 5, 4, .....
========================= 2 failed, 6 passed in 0.13s ==========================

221 : Job ID 8b4c6ed35bd945c1b02be3a09851d3ef
test outcome: killed
heap.py, start pos: (25, 19), end pos: (25, 20)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -22,7 +22,7 @@
             i = mc_i
     def find_min_child_index(self, i):
-        if (i * 2) > self.size():
+        if (i * 2) == self.size():
             return None
         if (i * 2) + 1 > self.size():
             return i * 2
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 1 failed, 7 passed in 0.13s ==========================

222 : Job ID b66056bd47894df4a4d757406fac889d
test outcome: killed
heap.py, start pos: (27, 23), end pos: (27, 24)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i * 2) + 1 == self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.13s ==========================

223 : Job ID c14bac2623a2461180f0b6f180bf04ea
test outcome: killed
heap.py, start pos: (36, 31), end pos: (36, 32)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 4
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -33,7 +33,7 @@
                 return i * 2 + 1
     def min(self):
-        if len(self.heap_list) > 1:
+        if len(self.heap_list) == 1:
             return self.heap_list[1]
         else:
             return None
ts-3-5/test_3-5_0-8_264.py ....F...                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_min - assert None == 3
========================= 1 failed, 7 passed in 0.13s ==========================

224 : Job ID dfbe6739a5c74a5bb0115210f3a0edd7
test outcome: killed
heap.py, start pos: (55, 16), end pos: (55, 17)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 5
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -52,7 +52,7 @@
     def build(self, lst:list):
         i = len(lst) // 2
         self.heap_list = [0] + lst
-        while i > 0:
+        while i == 0:
             self.sift(i)
             i -= 1
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 9, 6, 12, 5, 4, .....
========================= 1 failed, 7 passed in 0.13s ==========================

225 : Job ID 72f12296f19741169db604b600edccf5
SURVIVED
test outcome: survived
heap.py, start pos: (11, 21), end pos: (11, 22)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -8,7 +8,7 @@
         self.percolate(self.size())
     def percolate(self, i):
-        while i // 2 > 0:
+        while i // 2 != 0:
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

226 : Job ID 1073909a37ac4b7d8349ab7e3a1a30d9
test outcome: killed
heap.py, start pos: (20, 33), end pos: (20, 34)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -17,7 +17,7 @@
     def sift(self, i):
         while (i * 2) <= self.size():
             mc_i = self.find_min_child_index(i)
-            if self.heap_list[i] > self.heap_list[mc_i]:
+            if self.heap_list[i] != self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
             i = mc_i
ts-3-5/test_3-5_0-8_264.py ..F.....                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - assert [0, 7, 11, 10, 15, 3, ....
========================= 1 failed, 7 passed in 0.13s ==========================

227 : Job ID 944e04d77fea4232aa467f68ee84e79f
test outcome: killed
heap.py, start pos: (25, 19), end pos: (25, 20)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -22,7 +22,7 @@
             i = mc_i
     def find_min_child_index(self, i):
-        if (i * 2) > self.size():
+        if (i * 2) != self.size():
             return None
         if (i * 2) + 1 > self.size():
             return i * 2
ts-3-5/test_3-5_0-8_264.py ..FF.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert None == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - TypeError: list indices ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 4 failed, 4 passed in 0.14s ==========================

228 : Job ID 8a3ce4073514472997c7cca66fa292ec
test outcome: killed
heap.py, start pos: (27, 23), end pos: (27, 24)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i * 2) + 1 != self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 15, 10, 18...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 5, 6, 7, 9, 4, ......
========================= 3 failed, 5 passed in 0.13s ==========================

229 : Job ID 144cea79336c4bbab7536e2e800c1f7b
SURVIVED
test outcome: survived
heap.py, start pos: (36, 31), end pos: (36, 32)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 4
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -33,7 +33,7 @@
                 return i * 2 + 1
     def min(self):
-        if len(self.heap_list) > 1:
+        if len(self.heap_list) != 1:
             return self.heap_list[1]
         else:
             return None
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

230 : Job ID 466cb78a19784a9491038bcba4d9b4b0
SURVIVED
test outcome: survived
heap.py, start pos: (55, 16), end pos: (55, 17)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 5
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -52,7 +52,7 @@
     def build(self, lst:list):
         i = len(lst) // 2
         self.heap_list = [0] + lst
-        while i > 0:
+        while i != 0:
             self.sift(i)
             i -= 1
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

231 : Job ID 2d0e13779f444660859e90ba1c512c45
test outcome: killed
heap.py, start pos: (11, 21), end pos: (11, 22)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -8,7 +8,7 @@
         self.percolate(self.size())
     def percolate(self, i):
-        while i // 2 > 0:
+        while i // 2 < 0:
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py F.......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [0, 5, 2] == [0, 2, 5]
========================= 1 failed, 7 passed in 0.13s ==========================

232 : Job ID 716036fb85a4495ca70cadc2b1835345
test outcome: killed
heap.py, start pos: (20, 33), end pos: (20, 34)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -17,7 +17,7 @@
     def sift(self, i):
         while (i * 2) <= self.size():
             mc_i = self.find_min_child_index(i)
-            if self.heap_list[i] > self.heap_list[mc_i]:
+            if self.heap_list[i] < self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
             i = mc_i
ts-3-5/test_3-5_0-8_264.py ..F..FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - assert [0, 7, 11, 10, 15, 3, ....
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 18, 11, 10, 1...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 9, 6, 12, 5, 4, .....
========================= 3 failed, 5 passed in 0.13s ==========================

233 : Job ID b64d432571ae4fcca08fb30ad3b3ba86
test outcome: killed
heap.py, start pos: (25, 19), end pos: (25, 20)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -22,7 +22,7 @@
             i = mc_i
     def find_min_child_index(self, i):
-        if (i * 2) > self.size():
+        if (i * 2) < self.size():
             return None
         if (i * 2) + 1 > self.size():
             return i * 2
ts-3-5/test_3-5_0-8_264.py ..FF.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert None == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - TypeError: list indices ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 4 failed, 4 passed in 0.14s ==========================

234 : Job ID a9968beafc0141a984323529f7f876bf
test outcome: killed
heap.py, start pos: (27, 23), end pos: (27, 24)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i * 2) + 1 < self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 15, 10, 18...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 3 failed, 5 passed in 0.13s ==========================

235 : Job ID 5fac7739ed944d1892ae955ab57ecedb
test outcome: killed
heap.py, start pos: (36, 31), end pos: (36, 32)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 4
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -33,7 +33,7 @@
                 return i * 2 + 1
     def min(self):
-        if len(self.heap_list) > 1:
+        if len(self.heap_list) < 1:
             return self.heap_list[1]
         else:
             return None
ts-3-5/test_3-5_0-8_264.py ....F...                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_min - assert None == 3
========================= 1 failed, 7 passed in 0.14s ==========================

236 : Job ID 83f1c399e3c7457c91bc406b47964d97
test outcome: killed
heap.py, start pos: (55, 16), end pos: (55, 17)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 5
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -52,7 +52,7 @@
     def build(self, lst:list):
         i = len(lst) // 2
         self.heap_list = [0] + lst
-        while i > 0:
+        while i < 0:
             self.sift(i)
             i -= 1
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 9, 6, 12, 5, 4, .....
========================= 1 failed, 7 passed in 0.13s ==========================

237 : Job ID ec6adc442c5c4b8d9ffdf83ebac0b0d8
test outcome: killed
heap.py, start pos: (11, 21), end pos: (11, 22)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -8,7 +8,7 @@
         self.percolate(self.size())
     def percolate(self, i):
-        while i // 2 > 0:
+        while i // 2 <= 0:
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
timeout

238 : Job ID 11320d31bc5040efaf7ba2d4a8b1f234
test outcome: killed
heap.py, start pos: (20, 33), end pos: (20, 34)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -17,7 +17,7 @@
     def sift(self, i):
         while (i * 2) <= self.size():
             mc_i = self.find_min_child_index(i)
-            if self.heap_list[i] > self.heap_list[mc_i]:
+            if self.heap_list[i] <= self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
             i = mc_i
ts-3-5/test_3-5_0-8_264.py ..F..FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - assert [0, 7, 11, 10, 15, 3, ....
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 18, 11, 10, 1...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 9, 6, 12, 5, 4, .....
========================= 3 failed, 5 passed in 0.14s ==========================

239 : Job ID 3499020a08e644f18d459faddb68b49d
test outcome: killed
heap.py, start pos: (25, 19), end pos: (25, 20)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -22,7 +22,7 @@
             i = mc_i
     def find_min_child_index(self, i):
-        if (i * 2) > self.size():
+        if (i * 2) <= self.size():
             return None
         if (i * 2) + 1 > self.size():
             return i * 2
ts-3-5/test_3-5_0-8_264.py ..FF.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert None == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - TypeError: list indices ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 4 failed, 4 passed in 0.13s ==========================

240 : Job ID 2cd83e7ab7524f55a5fce0d434b4cbaf
test outcome: killed
heap.py, start pos: (27, 23), end pos: (27, 24)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i * 2) + 1 <= self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 15, 10, 18...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 3 failed, 5 passed in 0.13s ==========================

241 : Job ID 51d348201f674c058c33551bcf03bf3e
test outcome: killed
heap.py, start pos: (36, 31), end pos: (36, 32)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 4
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -33,7 +33,7 @@
                 return i * 2 + 1
     def min(self):
-        if len(self.heap_list) > 1:
+        if len(self.heap_list) <= 1:
             return self.heap_list[1]
         else:
             return None
ts-3-5/test_3-5_0-8_264.py ....F...                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_min - assert None == 3
========================= 1 failed, 7 passed in 0.13s ==========================

242 : Job ID c207a5eff7f546f1bb24593daace88a7
test outcome: killed
heap.py, start pos: (55, 16), end pos: (55, 17)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 5
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -52,7 +52,7 @@
     def build(self, lst:list):
         i = len(lst) // 2
         self.heap_list = [0] + lst
-        while i > 0:
+        while i <= 0:
             self.sift(i)
             i -= 1
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 9, 6, 12, 5, 4, .....
========================= 1 failed, 7 passed in 0.13s ==========================

243 : Job ID d7ab2ba22c2f4b43a340149b4d650da7
test outcome: killed
heap.py, start pos: (11, 21), end pos: (11, 22)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -8,7 +8,7 @@
         self.percolate(self.size())
     def percolate(self, i):
-        while i // 2 > 0:
+        while i // 2 >= 0:
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
timeout

244 : Job ID 488f067ec06941c38e4d0a05414786f7
SURVIVED
test outcome: survived
heap.py, start pos: (20, 33), end pos: (20, 34)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -17,7 +17,7 @@
     def sift(self, i):
         while (i * 2) <= self.size():
             mc_i = self.find_min_child_index(i)
-            if self.heap_list[i] > self.heap_list[mc_i]:
+            if self.heap_list[i] >= self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
             i = mc_i
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

245 : Job ID 00ffccebd3be4f048b0ed08f3d8cc2aa
test outcome: killed
heap.py, start pos: (25, 19), end pos: (25, 20)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -22,7 +22,7 @@
             i = mc_i
     def find_min_child_index(self, i):
-        if (i * 2) > self.size():
+        if (i * 2) >= self.size():
             return None
         if (i * 2) + 1 > self.size():
             return i * 2
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 1 failed, 7 passed in 0.13s ==========================

246 : Job ID ad0789aa71fc4d3e90723c8bb3a7b77f
SURVIVED
test outcome: survived
heap.py, start pos: (27, 23), end pos: (27, 24)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i * 2) + 1 >= self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

247 : Job ID 149e10846907433aa118f7862312c68e
SURVIVED
test outcome: survived
heap.py, start pos: (36, 31), end pos: (36, 32)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 4
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -33,7 +33,7 @@
                 return i * 2 + 1
     def min(self):
-        if len(self.heap_list) > 1:
+        if len(self.heap_list) >= 1:
             return self.heap_list[1]
         else:
             return None
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

248 : Job ID 34731c8daa11423ca88476c9253b762e
test outcome: killed
heap.py, start pos: (55, 16), end pos: (55, 17)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 5
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -52,7 +52,7 @@
     def build(self, lst:list):
         i = len(lst) // 2
         self.heap_list = [0] + lst
-        while i > 0:
+        while i >= 0:
             self.sift(i)
             i -= 1
timeout

249 : Job ID 4e384501d5f94fa784e3b1340511726f
test outcome: killed
heap.py, start pos: (20, 33), end pos: (20, 34)
operator: core/ReplaceComparisonOperator_Gt_Is, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -17,7 +17,7 @@
     def sift(self, i):
         while (i * 2) <= self.size():
             mc_i = self.find_min_child_index(i)
-            if self.heap_list[i] > self.heap_list[mc_i]:
+            if self.heap_list[i] is self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
             i = mc_i
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 18, 7, 10, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 9, 6, 12, 5, 4, .....
========================= 2 failed, 6 passed in 0.13s ==========================

250 : Job ID 0d3a92684eff4fc3bc9b3ae4b41f4e69
test outcome: killed
heap.py, start pos: (25, 19), end pos: (25, 20)
operator: core/ReplaceComparisonOperator_Gt_Is, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -22,7 +22,7 @@
             i = mc_i
     def find_min_child_index(self, i):
-        if (i * 2) > self.size():
+        if (i * 2) is self.size():
             return None
         if (i * 2) + 1 > self.size():
             return i * 2
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 1 failed, 7 passed in 0.13s ==========================

251 : Job ID f649a8bfacde4b2cbfd0e5b59c750f16
test outcome: killed
heap.py, start pos: (27, 23), end pos: (27, 24)
operator: core/ReplaceComparisonOperator_Gt_Is, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i * 2) + 1 is self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.13s ==========================

252 : Job ID 6b4d07d1fdbf489a9cf5d61c51040aec
test outcome: killed
heap.py, start pos: (20, 33), end pos: (20, 34)
operator: core/ReplaceComparisonOperator_Gt_IsNot, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -17,7 +17,7 @@
     def sift(self, i):
         while (i * 2) <= self.size():
             mc_i = self.find_min_child_index(i)
-            if self.heap_list[i] > self.heap_list[mc_i]:
+            if self.heap_list[i] is not self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
             i = mc_i
ts-3-5/test_3-5_0-8_264.py ..F.....                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - assert [0, 7, 11, 10, 15, 3, ....
========================= 1 failed, 7 passed in 0.13s ==========================
