253 : Job ID 53687c4804b14706a87421575dc874cc
test outcome: killed
heap.py, start pos: (25, 19), end pos: (25, 20)
operator: core/ReplaceComparisonOperator_Gt_IsNot, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -22,7 +22,7 @@
             i = mc_i
     def find_min_child_index(self, i):
-        if (i * 2) > self.size():
+        if (i * 2) is not self.size():
             return None
         if (i * 2) + 1 > self.size():
             return i * 2
ts-3-5/test_3-5_0-8_264.py ..FF.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert None == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - TypeError: list indices ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 4 failed, 4 passed in 0.13s ==========================

254 : Job ID e14096fd0f6743e78792d02c7f9e7af9
test outcome: killed
heap.py, start pos: (27, 23), end pos: (27, 24)
operator: core/ReplaceComparisonOperator_Gt_IsNot, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i * 2) + 1 is not self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 15, 10, 18...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 5, 6, 7, 9, 4, ......
========================= 3 failed, 5 passed in 0.13s ==========================

255 : Job ID c70734e5cbbc4e32a41930817c10afee
test outcome: killed
heap.py, start pos: (11, 14), end pos: (11, 24)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -8,7 +8,7 @@
         self.percolate(self.size())
     def percolate(self, i):
-        while i // 2 > 0:
+        while not i // 2 > 0:
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
timeout

256 : Job ID 3474087301dc43469427a92526b0da79
test outcome: killed
heap.py, start pos: (13, 15), end pos: (13, 57)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -10,7 +10,7 @@
     def percolate(self, i):
         while i // 2 > 0:
             parent = i // 2
-            if self.heap_list[i] < self.heap_list[parent]:
+            if not self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
             i = i // 2
ts-3-5/test_3-5_0-8_264.py FF......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [0, 5, 2] == [0, 2, 5]
FAILED ts-3-5/test_3-5_0-8_264.py::test_percolate - assert [0, 11, 3, 10, 15,...
========================= 2 failed, 6 passed in 0.13s ==========================

257 : Job ID ecdc5b9bd1ad40cd9df6de0b4669fea2
test outcome: killed
heap.py, start pos: (18, 14), end pos: (18, 36)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -15,7 +15,7 @@
             i = i // 2
     def sift(self, i):
-        while (i * 2) <= self.size():
+        while not (i * 2) <= self.size():
             mc_i = self.find_min_child_index(i)
             if self.heap_list[i] > self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 18, 7, 10, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 9, 6, 12, 5, 4, .....
========================= 2 failed, 6 passed in 0.13s ==========================

258 : Job ID 4ed7fbd2615846d491ed662198708008
test outcome: killed
heap.py, start pos: (20, 15), end pos: (20, 55)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -17,7 +17,7 @@
     def sift(self, i):
         while (i * 2) <= self.size():
             mc_i = self.find_min_child_index(i)
-            if self.heap_list[i] > self.heap_list[mc_i]:
+            if not self.heap_list[i] > self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
             i = mc_i
ts-3-5/test_3-5_0-8_264.py ..F..FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - assert [0, 7, 11, 10, 15, 3, ....
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 18, 11, 10, 1...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 9, 6, 12, 5, 4, .....
========================= 3 failed, 5 passed in 0.14s ==========================

259 : Job ID 58139f9905db4adb814feed12dc530d3
test outcome: killed
heap.py, start pos: (25, 11), end pos: (25, 32)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -22,7 +22,7 @@
             i = mc_i
     def find_min_child_index(self, i):
-        if (i * 2) > self.size():
+        if not (i * 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
             return i * 2
ts-3-5/test_3-5_0-8_264.py ..FF.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert None == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - TypeError: list indices ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 4 failed, 4 passed in 0.13s ==========================

260 : Job ID 7410b0a6c632416da129295ff18029db
test outcome: killed
heap.py, start pos: (27, 11), end pos: (27, 36)
operator: core/AddNot, occurrence: 5
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if not (i * 2) + 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 15, 10, 18...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 3 failed, 5 passed in 0.13s ==========================

261 : Job ID 04c4afc3a3604f81a643947ab4aff3ea
test outcome: killed
heap.py, start pos: (30, 15), end pos: (30, 64)
operator: core/AddNot, occurrence: 6
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if not self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 5, 9, 6, 4, ......
========================= 3 failed, 5 passed in 0.13s ==========================

262 : Job ID fc37fbda55804186a8cc4407f01b58b3
test outcome: killed
heap.py, start pos: (36, 11), end pos: (36, 34)
operator: core/AddNot, occurrence: 7
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -33,7 +33,7 @@
                 return i * 2 + 1
     def min(self):
-        if len(self.heap_list) > 1:
+        if not len(self.heap_list) > 1:
             return self.heap_list[1]
         else:
             return None
ts-3-5/test_3-5_0-8_264.py ....F...                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_min - assert None == 3
========================= 1 failed, 7 passed in 0.13s ==========================

263 : Job ID f54fdc5714b64631806aedcd8b82aaec
test outcome: killed
heap.py, start pos: (42, 11), end pos: (42, 27)
operator: core/AddNot, occurrence: 8
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -39,7 +39,7 @@
             return None
     def delete_min(self):
-        if self.size() == 0:
+        if not self.size() == 0:
             return None
         if self.size() == 1:
             return self.heap_list.pop()
ts-3-5/test_3-5_0-8_264.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert None == 3
========================= 1 failed, 7 passed in 0.15s ==========================

264 : Job ID 666cf46efd6f4c1f903aa5ffe9cd9e79
test outcome: killed
heap.py, start pos: (44, 11), end pos: (44, 27)
operator: core/AddNot, occurrence: 9
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -41,7 +41,7 @@
     def delete_min(self):
         if self.size() == 0:
             return None
-        if self.size() == 1:
+        if not self.size() == 1:
             return self.heap_list.pop()
         min_val = self.heap_list[1]
ts-3-5/test_3-5_0-8_264.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert 18 == 3
========================= 1 failed, 7 passed in 0.13s ==========================

265 : Job ID 91d43c108c164af2b9edd3489038a50c
test outcome: killed
heap.py, start pos: (55, 14), end pos: (55, 19)
operator: core/AddNot, occurrence: 10
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -52,7 +52,7 @@
     def build(self, lst:list):
         i = len(lst) // 2
         self.heap_list = [0] + lst
-        while i > 0:
+        while not i > 0:
             self.sift(i)
             i -= 1
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 9, 6, 12, 5, 4, .....
========================= 1 failed, 7 passed in 0.13s ==========================

266 : Job ID 55b45caf292f4fdaa788b923ab4703e6
test outcome: killed
heap.py, start pos: (4, 26), end pos: (4, 27)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -1,7 +1,7 @@
 class Heap():
     def __init__(self):
-        self.heap_list = [0]
+        self.heap_list = [ 1]
     def insert(self, value: int):
         self.heap_list.append(value)
ts-3-5/test_3-5_0-8_264.py F.......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [1, 5] == [0, 5]
========================= 1 failed, 7 passed in 0.13s ==========================

267 : Job ID 1d493f41640d4a5189dce818bcee2ba8
test outcome: killed
heap.py, start pos: (4, 26), end pos: (4, 27)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -1,7 +1,7 @@
 class Heap():
     def __init__(self):
-        self.heap_list = [0]
+        self.heap_list = [ -1]
     def insert(self, value: int):
         self.heap_list.append(value)
ts-3-5/test_3-5_0-8_264.py F.......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [-1, 5] == [0, 5]
========================= 1 failed, 7 passed in 0.13s ==========================

268 : Job ID bc0154251407448e89c825e510284e1c
test outcome: killed
heap.py, start pos: (11, 19), end pos: (11, 20)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -8,7 +8,7 @@
         self.percolate(self.size())
     def percolate(self, i):
-        while i // 2 > 0:
+        while i // 3 > 0:
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py F.......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [0, 5, 2] == [0, 2, 5]
========================= 1 failed, 7 passed in 0.13s ==========================

269 : Job ID f86d8663fd48447a90d51439a50496b5
SURVIVED
test outcome: survived
heap.py, start pos: (11, 19), end pos: (11, 20)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -8,7 +8,7 @@
         self.percolate(self.size())
     def percolate(self, i):
-        while i // 2 > 0:
+        while i // 1 > 0:
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

270 : Job ID 8046691e09bc47f0ad65b7589b82d992
test outcome: killed
heap.py, start pos: (11, 23), end pos: (11, 24)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -8,7 +8,7 @@
         self.percolate(self.size())
     def percolate(self, i):
-        while i // 2 > 0:
+        while i // 2 > 1:
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py F.......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [0, 5, 2] == [0, 2, 5]
========================= 1 failed, 7 passed in 0.14s ==========================

271 : Job ID 013b272fdf3d41868ee97bfc35c351da
test outcome: killed
heap.py, start pos: (11, 23), end pos: (11, 24)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -8,7 +8,7 @@
         self.percolate(self.size())
     def percolate(self, i):
-        while i // 2 > 0:
+        while i // 2 > -1:
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
timeout

272 : Job ID edc94e298b2c4c0aa8349f8e1aed5788
test outcome: killed
heap.py, start pos: (12, 26), end pos: (12, 27)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -9,7 +9,7 @@
     def percolate(self, i):
         while i // 2 > 0:
-            parent = i // 2
+            parent = i // 3
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
             i = i // 2
ts-3-5/test_3-5_0-8_264.py F.......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [0, 5, 2] == [0, 2, 5]
========================= 1 failed, 7 passed in 0.13s ==========================

273 : Job ID cc4f04307b5b46c6b02cc983d8f3c348
test outcome: killed
heap.py, start pos: (12, 26), end pos: (12, 27)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -9,7 +9,7 @@
     def percolate(self, i):
         while i // 2 > 0:
-            parent = i // 2
+            parent = i // 1
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
             i = i // 2
ts-3-5/test_3-5_0-8_264.py F.......                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [0, 5, 2] == [0, 2, 5]
========================= 1 failed, 7 passed in 0.13s ==========================

274 : Job ID 8f497fa0b4a44377b8da940c930f60c0
SURVIVED
test outcome: survived
heap.py, start pos: (15, 21), end pos: (15, 22)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -12,7 +12,7 @@
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
-            i = i // 2
+            i = i // 3
     def sift(self, i):
         while (i * 2) <= self.size():
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

275 : Job ID 8291305b4ce04d789c1da50ebae5c3de
test outcome: killed
heap.py, start pos: (15, 21), end pos: (15, 22)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -12,7 +12,7 @@
             parent = i // 2
             if self.heap_list[i] < self.heap_list[parent]:
                 self.heap_list[i], self.heap_list[parent] = self.heap_list[parent], self.heap_list[i]
-            i = i // 2
+            i = i // 1
     def sift(self, i):
         while (i * 2) <= self.size():
timeout

276 : Job ID 990a692b35754fd1b0499aa1ab245b45
test outcome: killed
heap.py, start pos: (18, 19), end pos: (18, 20)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -15,7 +15,7 @@
             i = i // 2
     def sift(self, i):
-        while (i * 2) <= self.size():
+        while (i * 3) <= self.size():
             mc_i = self.find_min_child_index(i)
             if self.heap_list[i] > self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 4, 5, 12, 9, 6, .....
========================= 1 failed, 7 passed in 0.13s ==========================

277 : Job ID 6d9aea19f36e42158a4091ee82ef7d04
test outcome: killed
heap.py, start pos: (18, 19), end pos: (18, 20)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -15,7 +15,7 @@
             i = i // 2
     def sift(self, i):
-        while (i * 2) <= self.size():
+        while (i * 1) <= self.size():
             mc_i = self.find_min_child_index(i)
             if self.heap_list[i] > self.heap_list[mc_i]:
                 self.heap_list[i], self.heap_list[mc_i] = self.heap_list[mc_i], self.heap_list[i]
ts-3-5/test_3-5_0-8_264.py ..F..FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - TypeError: list indices must b...
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - TypeError: list indices ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 3 failed, 5 passed in 0.13s ==========================

278 : Job ID b16eb4c8fbf24a789a547728783da308
test outcome: killed
heap.py, start pos: (25, 16), end pos: (25, 17)
operator: core/NumberReplacer, occurrence: 12
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -22,7 +22,7 @@
             i = mc_i
     def find_min_child_index(self, i):
-        if (i * 2) > self.size():
+        if (i * 3) > self.size():
             return None
         if (i * 2) + 1 > self.size():
             return i * 2
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - TypeError: list indices must ...
========================= 1 failed, 7 passed in 0.13s ==========================

279 : Job ID a637da78a1124222b13c199238297fe8
SURVIVED
test outcome: survived
heap.py, start pos: (25, 16), end pos: (25, 17)
operator: core/NumberReplacer, occurrence: 13
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -22,7 +22,7 @@
             i = mc_i
     def find_min_child_index(self, i):
-        if (i * 2) > self.size():
+        if (i * 1) > self.size():
             return None
         if (i * 2) + 1 > self.size():
             return i * 2
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

280 : Job ID 8103082cac9e458d95cbf4f95037b105
test outcome: killed
heap.py, start pos: (27, 16), end pos: (27, 17)
operator: core/NumberReplacer, occurrence: 14
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i * 3) + 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 15, 10, 18...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 5, 6, 7, 9, 4, ......
========================= 2 failed, 6 passed in 0.14s ==========================

281 : Job ID d0ed5ffb99824af783fc32a0cf804e45
test outcome: killed
heap.py, start pos: (27, 16), end pos: (27, 17)
operator: core/NumberReplacer, occurrence: 15
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i * 1) + 1 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.13s ==========================

282 : Job ID fd672dac88b14a629b662fa6ba94dfe0
SURVIVED
test outcome: survived
heap.py, start pos: (27, 21), end pos: (27, 22)
operator: core/NumberReplacer, occurrence: 16
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i * 2) + 2 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

283 : Job ID f9d7461ee29640b5b5da2e3092ede6d5
test outcome: killed
heap.py, start pos: (27, 21), end pos: (27, 22)
operator: core/NumberReplacer, occurrence: 17
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -24,7 +24,7 @@
     def find_min_child_index(self, i):
         if (i * 2) > self.size():
             return None
-        if (i * 2) + 1 > self.size():
+        if (i * 2) + 0 > self.size():
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.13s ==========================

284 : Job ID 5a530957a6284c40a23f083d776c3e7d
test outcome: killed
heap.py, start pos: (28, 23), end pos: (28, 24)
operator: core/NumberReplacer, occurrence: 18
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -25,7 +25,7 @@
         if (i * 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
-            return i * 2
+            return i * 3
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 1 failed, 7 passed in 0.13s ==========================

285 : Job ID 65dae9c85548472cb24cdabbf9148e62
test outcome: killed
heap.py, start pos: (28, 23), end pos: (28, 24)
operator: core/NumberReplacer, occurrence: 19
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -25,7 +25,7 @@
         if (i * 2) > self.size():
             return None
         if (i * 2) + 1 > self.size():
-            return i * 2
+            return i * 1
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
timeout

286 : Job ID a903149f47364dcb9a7d1121bab36835
test outcome: killed
heap.py, start pos: (30, 34), end pos: (30, 35)
operator: core/NumberReplacer, occurrence: 20
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 3] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ..F..FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 4, 9, 5, 6, ......
========================= 3 failed, 5 passed in 0.13s ==========================

287 : Job ID 8213f89a89aa487ab7b83f587e903b57
test outcome: killed
heap.py, start pos: (30, 34), end pos: (30, 35)
operator: core/NumberReplacer, occurrence: 21
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 1] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 4, 9, 5, 6, ......
========================= 3 failed, 5 passed in 0.13s ==========================

288 : Job ID 597f24871c40463ab29766eb63f6abb5
test outcome: killed
heap.py, start pos: (30, 58), end pos: (30, 59)
operator: core/NumberReplacer, occurrence: 22
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i * 3 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - IndexError: list index o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 3 failed, 5 passed in 0.13s ==========================
