289 : Job ID 491c25615ab54244aa2f538a9f67eddc
test outcome: killed
heap.py, start pos: (30, 58), end pos: (30, 59)
operator: core/NumberReplacer, occurrence: 23
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i * 1 + 1]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 5, 9, 6, 4, ......
========================= 2 failed, 6 passed in 0.13s ==========================

290 : Job ID 2d861a31098041b78d9fda9534dc5790
test outcome: killed
heap.py, start pos: (30, 62), end pos: (30, 63)
operator: core/NumberReplacer, occurrence: 24
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i * 2 + 2]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 5, 6, 7, 9, 4, ......
========================= 1 failed, 7 passed in 0.13s ==========================

291 : Job ID 865c745fa5f84324b016c0870593ba0e
test outcome: killed
heap.py, start pos: (30, 62), end pos: (30, 63)
operator: core/NumberReplacer, occurrence: 25
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -27,7 +27,7 @@
         if (i * 2) + 1 > self.size():
             return i * 2
         else:
-            if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
+            if self.heap_list[i * 2] < self.heap_list[i * 2 + 0]:
                 return i * 2
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py .....FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 4, 9, 5, 6, ......
========================= 2 failed, 6 passed in 0.13s ==========================

292 : Job ID 562ead4b98194e48b0b32cd65c5805b9
test outcome: killed
heap.py, start pos: (31, 27), end pos: (31, 28)
operator: core/NumberReplacer, occurrence: 26
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -28,7 +28,7 @@
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
-                return i * 2
+                return i * 3
             else:
                 return i * 2 + 1
ts-3-5/test_3-5_0-8_264.py ..F..FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_sift - IndexError: list index out of ...
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 10, 7, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 7, 4, 9, 5, 6, ......
========================= 3 failed, 5 passed in 0.13s ==========================

293 : Job ID df9b3d36d42a46c8a58c7f9135d93eea
test outcome: killed
heap.py, start pos: (31, 27), end pos: (31, 28)
operator: core/NumberReplacer, occurrence: 27
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -28,7 +28,7 @@
             return i * 2
         else:
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
-                return i * 2
+                return i * 1
             else:
                 return i * 2 + 1
timeout

294 : Job ID 0e49e267938447e39735929b470aea50
test outcome: killed
heap.py, start pos: (33, 27), end pos: (33, 28)
operator: core/NumberReplacer, occurrence: 28
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i * 3 + 1
     def min(self):
         if len(self.heap_list) > 1:
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 7 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - IndexError: list index o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
========================= 3 failed, 5 passed in 0.13s ==========================

295 : Job ID 8e55c59605bd48a49b8b3c86c4671d84
test outcome: killed
heap.py, start pos: (33, 27), end pos: (33, 28)
operator: core/NumberReplacer, occurrence: 29
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i * 1 + 1
     def min(self):
         if len(self.heap_list) > 1:
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 3 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 10, 12, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 6, 7, 9, 5, 4, ......
========================= 3 failed, 5 passed in 0.13s ==========================

296 : Job ID e57ac083831a41f18f3ded0a9293f57f
test outcome: killed
heap.py, start pos: (33, 31), end pos: (33, 32)
operator: core/NumberReplacer, occurrence: 30
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i * 2 + 2
     def min(self):
         if len(self.heap_list) > 1:
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 6 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 12, 10, 15...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 6, 9, 7, 5, 4, ......
========================= 3 failed, 5 passed in 0.14s ==========================

297 : Job ID 8b508dc44b96443998eb1a3e75532afb
test outcome: killed
heap.py, start pos: (33, 31), end pos: (33, 32)
operator: core/NumberReplacer, occurrence: 31
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -30,7 +30,7 @@
             if self.heap_list[i * 2] < self.heap_list[i * 2 + 1]:
                 return i * 2
             else:
-                return i * 2 + 1
+                return i * 2 + 0
     def min(self):
         if len(self.heap_list) > 1:
ts-3-5/test_3-5_0-8_264.py ...F.FF.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_find_min_child_index - assert 4 == 5
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 7, 15, 10, 18...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 5, 6, 7, 9, 4, ......
========================= 3 failed, 5 passed in 0.13s ==========================

298 : Job ID d31f4d9d38c4416e956e50916d1eb2f8
SURVIVED
test outcome: survived
heap.py, start pos: (36, 33), end pos: (36, 34)
operator: core/NumberReplacer, occurrence: 32
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -33,7 +33,7 @@
                 return i * 2 + 1
     def min(self):
-        if len(self.heap_list) > 1:
+        if len(self.heap_list) > 2:
             return self.heap_list[1]
         else:
             return None
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

299 : Job ID a86b134b54f84405a814913c2a788ef3
SURVIVED
test outcome: survived
heap.py, start pos: (36, 33), end pos: (36, 34)
operator: core/NumberReplacer, occurrence: 33
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -33,7 +33,7 @@
                 return i * 2 + 1
     def min(self):
-        if len(self.heap_list) > 1:
+        if len(self.heap_list) > 0:
             return self.heap_list[1]
         else:
             return None
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

300 : Job ID 650f9cb2bbb747669362d65f2054636c
test outcome: killed
heap.py, start pos: (37, 34), end pos: (37, 35)
operator: core/NumberReplacer, occurrence: 34
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -34,7 +34,7 @@
     def min(self):
         if len(self.heap_list) > 1:
-            return self.heap_list[1]
+            return self.heap_list[ 2]
         else:
             return None
ts-3-5/test_3-5_0-8_264.py ....F...                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_min - assert 7 == 3
========================= 1 failed, 7 passed in 0.13s ==========================

301 : Job ID a858ed6060304fb9b191184518dbdc33
test outcome: killed
heap.py, start pos: (37, 34), end pos: (37, 35)
operator: core/NumberReplacer, occurrence: 35
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -34,7 +34,7 @@
     def min(self):
         if len(self.heap_list) > 1:
-            return self.heap_list[1]
+            return self.heap_list[ 0]
         else:
             return None
ts-3-5/test_3-5_0-8_264.py ....F...                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_min - assert 0 == 3
========================= 1 failed, 7 passed in 0.13s ==========================

302 : Job ID 874a9bb1704e49248fb038e97a4faf98
SURVIVED
test outcome: survived
heap.py, start pos: (42, 26), end pos: (42, 27)
operator: core/NumberReplacer, occurrence: 36
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -39,7 +39,7 @@
             return None
     def delete_min(self):
-        if self.size() == 0:
+        if self.size() == 1:
             return None
         if self.size() == 1:
             return self.heap_list.pop()
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

303 : Job ID d216ee1318574ac9995f574cd42a5e66
SURVIVED
test outcome: survived
heap.py, start pos: (42, 26), end pos: (42, 27)
operator: core/NumberReplacer, occurrence: 37
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -39,7 +39,7 @@
             return None
     def delete_min(self):
-        if self.size() == 0:
+        if self.size() == -1:
             return None
         if self.size() == 1:
             return self.heap_list.pop()
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

304 : Job ID e733759ff6cc408fa993d97541a65aaa
SURVIVED
test outcome: survived
heap.py, start pos: (44, 26), end pos: (44, 27)
operator: core/NumberReplacer, occurrence: 38
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -41,7 +41,7 @@
     def delete_min(self):
         if self.size() == 0:
             return None
-        if self.size() == 1:
+        if self.size() == 2:
             return self.heap_list.pop()
         min_val = self.heap_list[1]
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

305 : Job ID 79be58e0148c428c8cbca56314280e32
SURVIVED
test outcome: survived
heap.py, start pos: (44, 26), end pos: (44, 27)
operator: core/NumberReplacer, occurrence: 39
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -41,7 +41,7 @@
     def delete_min(self):
         if self.size() == 0:
             return None
-        if self.size() == 1:
+        if self.size() == 0:
             return self.heap_list.pop()
         min_val = self.heap_list[1]
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.13s ===============================

306 : Job ID 3a749db2dac24b7e8a9b083daa456567
test outcome: killed
heap.py, start pos: (47, 33), end pos: (47, 34)
operator: core/NumberReplacer, occurrence: 40
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -44,7 +44,7 @@
         if self.size() == 1:
             return self.heap_list.pop()
-        min_val = self.heap_list[1]
+        min_val = self.heap_list[ 2]
         self.heap_list[1] = self.heap_list.pop()
         self.sift(1)
         return min_val
ts-3-5/test_3-5_0-8_264.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert 7 == 3
========================= 1 failed, 7 passed in 0.13s ==========================

307 : Job ID 7ef1e501e0324378a409a7cf2c5bd449
test outcome: killed
heap.py, start pos: (47, 33), end pos: (47, 34)
operator: core/NumberReplacer, occurrence: 41
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -44,7 +44,7 @@
         if self.size() == 1:
             return self.heap_list.pop()
-        min_val = self.heap_list[1]
+        min_val = self.heap_list[ 0]
         self.heap_list[1] = self.heap_list.pop()
         self.sift(1)
         return min_val
ts-3-5/test_3-5_0-8_264.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert 0 == 3
========================= 1 failed, 7 passed in 0.13s ==========================

308 : Job ID e170f697df6c4a928d79420151ac4bef
test outcome: killed
heap.py, start pos: (48, 23), end pos: (48, 24)
operator: core/NumberReplacer, occurrence: 42
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -45,7 +45,7 @@
             return self.heap_list.pop()
         min_val = self.heap_list[1]
-        self.heap_list[1] = self.heap_list.pop()
+        self.heap_list[ 2] = self.heap_list.pop()
         self.sift(1)
         return min_val
ts-3-5/test_3-5_0-8_264.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 3, 18, 10, 15...
========================= 1 failed, 7 passed in 0.13s ==========================

309 : Job ID 555c240db2c34751b83bd2fd4fe949f7
test outcome: killed
heap.py, start pos: (48, 23), end pos: (48, 24)
operator: core/NumberReplacer, occurrence: 43
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -45,7 +45,7 @@
             return self.heap_list.pop()
         min_val = self.heap_list[1]
-        self.heap_list[1] = self.heap_list.pop()
+        self.heap_list[ 0] = self.heap_list.pop()
         self.sift(1)
         return min_val
ts-3-5/test_3-5_0-8_264.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [18, 3, 7, 10, 15...
========================= 1 failed, 7 passed in 0.13s ==========================

310 : Job ID ee0f1e616748418fbdcf638998e1251b
test outcome: killed
heap.py, start pos: (49, 18), end pos: (49, 19)
operator: core/NumberReplacer, occurrence: 44
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -46,7 +46,7 @@
         min_val = self.heap_list[1]
         self.heap_list[1] = self.heap_list.pop()
-        self.sift(1)
+        self.sift( 2)
         return min_val
     def build(self, lst:list):
ts-3-5/test_3-5_0-8_264.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_delete_min - assert [0, 18, 7, 10, 15...
========================= 1 failed, 7 passed in 0.13s ==========================

311 : Job ID a292158697aa4e75a779cfcbc6411965
test outcome: killed
heap.py, start pos: (49, 18), end pos: (49, 19)
operator: core/NumberReplacer, occurrence: 45
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -46,7 +46,7 @@
         min_val = self.heap_list[1]
         self.heap_list[1] = self.heap_list.pop()
-        self.sift(1)
+        self.sift( 0)
         return min_val
     def build(self, lst:list):
timeout

312 : Job ID 2192aa15dfaf4baf8319ca2b14d4d7d5
test outcome: killed
heap.py, start pos: (53, 24), end pos: (53, 25)
operator: core/NumberReplacer, occurrence: 46
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -50,7 +50,7 @@
         return min_val
     def build(self, lst:list):
-        i = len(lst) // 2
+        i = len(lst) // 3
         self.heap_list = [0] + lst
         while i > 0:
             self.sift(i)
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 4, 5, 12, 9, 6, .....
========================= 1 failed, 7 passed in 0.13s ==========================

313 : Job ID 1232c781e22e4bed9819b0cbc070fe72
SURVIVED
test outcome: survived
heap.py, start pos: (53, 24), end pos: (53, 25)
operator: core/NumberReplacer, occurrence: 47
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -50,7 +50,7 @@
         return min_val
     def build(self, lst:list):
-        i = len(lst) // 2
+        i = len(lst) // 1
         self.heap_list = [0] + lst
         while i > 0:
             self.sift(i)
ts-3-5/test_3-5_0-8_264.py ........                                      [100%]
============================== 8 passed in 0.14s ===============================

314 : Job ID ced4e9c00adf403ead5186b5472cfb24
test outcome: killed
heap.py, start pos: (54, 26), end pos: (54, 27)
operator: core/NumberReplacer, occurrence: 48
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -51,7 +51,7 @@
     def build(self, lst:list):
         i = len(lst) // 2
-        self.heap_list = [0] + lst
+        self.heap_list = [ 1] + lst
         while i > 0:
             self.sift(i)
             i -= 1
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [1, 4, 5, 7, 9, 6, ......
========================= 1 failed, 7 passed in 0.13s ==========================

315 : Job ID 6dcae4331b7d4714858c5c6cd8dd0f9f
test outcome: killed
heap.py, start pos: (54, 26), end pos: (54, 27)
operator: core/NumberReplacer, occurrence: 49
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -51,7 +51,7 @@
     def build(self, lst:list):
         i = len(lst) // 2
-        self.heap_list = [0] + lst
+        self.heap_list = [ -1] + lst
         while i > 0:
             self.sift(i)
             i -= 1
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [-1, 4, 5, 7, 9, 6, .....
========================= 1 failed, 7 passed in 0.13s ==========================

316 : Job ID 9976f8300b7a4236af32739ae83c2d3e
test outcome: killed
heap.py, start pos: (55, 18), end pos: (55, 19)
operator: core/NumberReplacer, occurrence: 50
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -52,7 +52,7 @@
     def build(self, lst:list):
         i = len(lst) // 2
         self.heap_list = [0] + lst
-        while i > 0:
+        while i > 1:
             self.sift(i)
             i -= 1
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 9, 4, 7, 5, 6, ......
========================= 1 failed, 7 passed in 0.13s ==========================

317 : Job ID 4edc48326ccc45f89d5ab851095da5eb
test outcome: killed
heap.py, start pos: (55, 18), end pos: (55, 19)
operator: core/NumberReplacer, occurrence: 51
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -52,7 +52,7 @@
     def build(self, lst:list):
         i = len(lst) // 2
         self.heap_list = [0] + lst
-        while i > 0:
+        while i > -1:
             self.sift(i)
             i -= 1
timeout

318 : Job ID 2b5779e5183d4a2b8b118672c289e1b5
test outcome: killed
heap.py, start pos: (57, 17), end pos: (57, 18)
operator: core/NumberReplacer, occurrence: 52
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -54,7 +54,7 @@
         self.heap_list = [0] + lst
         while i > 0:
             self.sift(i)
-            i -= 1
+            i -= 2
     def size(self):
         return len(self.heap_list) - 1
ts-3-5/test_3-5_0-8_264.py ......F.                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 6, 4, 7, 5, 9, ......
========================= 1 failed, 7 passed in 0.13s ==========================

319 : Job ID b830d47d18454fb4a76153df03a15c3c
test outcome: killed
heap.py, start pos: (57, 17), end pos: (57, 18)
operator: core/NumberReplacer, occurrence: 53
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -54,7 +54,7 @@
         self.heap_list = [0] + lst
         while i > 0:
             self.sift(i)
-            i -= 1
+            i -= 0
     def size(self):
         return len(self.heap_list) - 1
timeout

320 : Job ID 806613b7f38341beaea8d85a617d8a99
test outcome: killed
heap.py, start pos: (60, 37), end pos: (60, 38)
operator: core/NumberReplacer, occurrence: 54
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -57,5 +57,5 @@
             i -= 1
     def size(self):
-        return len(self.heap_list) - 1
+        return len(self.heap_list) - 2
ts-3-5/test_3-5_0-8_264.py F.....FF                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - assert [0, 5, 2] == [0, 2, 5]
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - assert [0, 4, 5, 12, 9, 6, .....
FAILED ts-3-5/test_3-5_0-8_264.py::test_size - assert 6 == 7
========================= 3 failed, 5 passed in 0.13s ==========================

321 : Job ID d877d090b129464185fddbf7f1136905
test outcome: killed
heap.py, start pos: (60, 37), end pos: (60, 38)
operator: core/NumberReplacer, occurrence: 55
--- mutation diff ---
--- aheap.py
+++ bheap.py
@@ -57,5 +57,5 @@
             i -= 1
     def size(self):
-        return len(self.heap_list) - 1
+        return len(self.heap_list) - 0
ts-3-5/test_3-5_0-8_264.py F.....FF                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_264.py::test_insert - IndexError: list index out o...
FAILED ts-3-5/test_3-5_0-8_264.py::test_build - IndexError: list index out of...
FAILED ts-3-5/test_3-5_0-8_264.py::test_size - assert 8 == 7
========================= 3 failed, 5 passed in 0.13s ==========================
