   - [#   5] AOR heap: 
--------------------------------------------------------------------------------
  11:         while i // 2 > 0:
  12:             parent = i // 2
  13:             if self.heap_list[i] < self.heap_list[parent]:
  14:                 (self.heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
- 15:             i = i // 2
+ 15:             i = i / 2
  16:     
  17:     def sift(self, i):
  18:         while i * 2 <= self.size():
  19:             mc_i = self.find_min_child_index(i)
--------------------------------------------------------------------------------
[0.16349 s] survived
