   - [#   6] AOR heap: 
--------------------------------------------------------------------------------
  11:         while i // 2 > 0:
  12:             parent = i // 2
  13:             if self.heap_list[i] < self.heap_list[parent]:
  14:                 (self.heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
- 15:             i = i // 2
+ 15:             i = i * 2
  16:     
  17:     def sift(self, i):
  18:         while i * 2 <= self.size():
  19:             mc_i = self.find_min_child_index(i)
--------------------------------------------------------------------------------
[0.17715 s] killed by ts-3-5/test_3-5_0-4_143.py::test_percolate

empty_heap = <heap.Heap object at 0x7bcbf5ed48e0>

    def test_percolate(empty_heap):
        empty_heap.heap_list = [0, 3, 5]
>       empty_heap.percolate(2)

ts-3-5/test_3-5_0-4_143.py:30: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5ed48e0>, i = 4

>   ???
E   IndexError: list index out of range

heap:13: IndexError

   - [#   9] AOR heap: 
--------------------------------------------------------------------------------
  14:                 (self.heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
  15:             i = i // 2
  16:     
  17:     def sift(self, i):
- 18:         while i * 2 <= self.size():
+ 18:         while i ** 2 <= self.size():
  19:             mc_i = self.find_min_child_index(i)
  20:             if self.heap_list[i] > self.heap_list[mc_i]:
  21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
  22:             i = mc_i
--------------------------------------------------------------------------------
[0.15562 s] survived

   - [#  10] AOR heap: 
--------------------------------------------------------------------------------
  21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
  22:             i = mc_i
  23:     
  24:     def find_min_child_index(self, i):
- 25:         if i * 2 > self.size():
+ 25:         if i / 2 > self.size():
  26:             return None
  27:         if (i * 2) + 1 > self.size():
  28:             return i * 2
  29:         
--------------------------------------------------------------------------------
[0.16131 s] survived

   - [#  11] AOR heap: 
--------------------------------------------------------------------------------
  21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
  22:             i = mc_i
  23:     
  24:     def find_min_child_index(self, i):
- 25:         if i * 2 > self.size():
+ 25:         if i // 2 > self.size():
  26:             return None
  27:         if (i * 2) + 1 > self.size():
  28:             return i * 2
  29:         
--------------------------------------------------------------------------------
[0.15525 s] survived

   - [#  12] AOR heap: 
--------------------------------------------------------------------------------
  21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
  22:             i = mc_i
  23:     
  24:     def find_min_child_index(self, i):
- 25:         if i * 2 > self.size():
+ 25:         if i ** 2 > self.size():
  26:             return None
  27:         if (i * 2) + 1 > self.size():
  28:             return i * 2
  29:         
--------------------------------------------------------------------------------
[0.16096 s] survived

   - [#  21] AOR heap: 
--------------------------------------------------------------------------------
  26:             return None
  27:         if (i * 2) + 1 > self.size():
  28:             return i * 2
  29:         
- 30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
+ 30:         elif self.heap_list[i // 2] < self.heap_list[(i * 2) + 1]:
  31:             return i * 2
  32:         else:
  33:             return (i * 2) + 1
  34:     
--------------------------------------------------------------------------------
[0.18249 s] killed by ts-3-5/test_3-5_0-4_143.py::test_build

empty_heap = <heap.Heap object at 0x7bcbf5ed7040>

    def test_build(empty_heap):
        empty_heap.build([4, 2, 6, 1, 3])
>       assert empty_heap.heap_list == [0, 1, 2, 6, 4, 3]
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:49: AssertionError

   - [#  22] AOR heap: 
--------------------------------------------------------------------------------
  26:             return None
  27:         if (i * 2) + 1 > self.size():
  28:             return i * 2
  29:         
- 30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
+ 30:         elif self.heap_list[i ** 2] < self.heap_list[(i * 2) + 1]:
  31:             return i * 2
  32:         else:
  33:             return (i * 2) + 1
  34:     
--------------------------------------------------------------------------------
[0.15943 s] survived

   - [#  24] AOR heap: 
--------------------------------------------------------------------------------
  26:             return None
  27:         if (i * 2) + 1 > self.size():
  28:             return i * 2
  29:         
- 30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
+ 30:         elif self.heap_list[i * 2] < self.heap_list[(i // 2) + 1]:
  31:             return i * 2
  32:         else:
  33:             return (i * 2) + 1
  34:     
--------------------------------------------------------------------------------
[0.18190 s] killed by ts-3-5/test_3-5_0-4_143.py::test_find_min_child_index

filled_heap = <heap.Heap object at 0x7bcbf5f779d0>

    def test_find_min_child_index(filled_heap):
>       assert filled_heap.find_min_child_index(1) == 2
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:38: AssertionError

   - [#  25] AOR heap: 
--------------------------------------------------------------------------------
  26:             return None
  27:         if (i * 2) + 1 > self.size():
  28:             return i * 2
  29:         
- 30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
+ 30:         elif self.heap_list[i * 2] < self.heap_list[(i ** 2) + 1]:
  31:             return i * 2
  32:         else:
  33:             return (i * 2) + 1
  34:     
--------------------------------------------------------------------------------
[0.18419 s] killed by ts-3-5/test_3-5_0-4_143.py::test_find_min_child_index

filled_heap = <heap.Heap object at 0x7bcbf5ad8fa0>

    def test_find_min_child_index(filled_heap):
>       assert filled_heap.find_min_child_index(1) == 2
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:38: AssertionError

   - [#  26] AOR heap: 
--------------------------------------------------------------------------------
  26:             return None
  27:         if (i * 2) + 1 > self.size():
  28:             return i * 2
  29:         
- 30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
+ 30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) - 1]:
  31:             return i * 2
  32:         else:
  33:             return (i * 2) + 1
  34:     
--------------------------------------------------------------------------------
[0.17672 s] killed by ts-3-5/test_3-5_0-4_143.py::test_find_min_child_index

filled_heap = <heap.Heap object at 0x7bcbf5bcc9d0>

    def test_find_min_child_index(filled_heap):
>       assert filled_heap.find_min_child_index(1) == 2
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:38: AssertionError

   - [#  28] AOR heap: 
--------------------------------------------------------------------------------
  27:         if (i * 2) + 1 > self.size():
  28:             return i * 2
  29:         
  30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
- 31:             return i * 2
+ 31:             return i // 2
  32:         else:
  33:             return (i * 2) + 1
  34:     
  35:     def min(self):
--------------------------------------------------------------------------------
[5.00674 s] timeout

   - [#  29] AOR heap: 
--------------------------------------------------------------------------------
  27:         if (i * 2) + 1 > self.size():
  28:             return i * 2
  29:         
  30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
- 31:             return i * 2
+ 31:             return i ** 2
  32:         else:
  33:             return (i * 2) + 1
  34:     
  35:     def min(self):
--------------------------------------------------------------------------------
[5.00678 s] timeout

   - [#  30] AOR heap: 
--------------------------------------------------------------------------------
  29:         
  30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
  31:             return i * 2
  32:         else:
- 33:             return (i * 2) + 1
+ 33:             return (i / 2) + 1
  34:     
  35:     def min(self):
  36:         if len(self.heap_list) > 1:
  37:             return self.heap_list[1]
--------------------------------------------------------------------------------
[0.15573 s] survived

   - [#  31] AOR heap: 
--------------------------------------------------------------------------------
  29:         
  30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
  31:             return i * 2
  32:         else:
- 33:             return (i * 2) + 1
+ 33:             return (i // 2) + 1
  34:     
  35:     def min(self):
  36:         if len(self.heap_list) > 1:
  37:             return self.heap_list[1]
--------------------------------------------------------------------------------
[0.15580 s] survived

   - [#  32] AOR heap: 
--------------------------------------------------------------------------------
  29:         
  30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
  31:             return i * 2
  32:         else:
- 33:             return (i * 2) + 1
+ 33:             return (i ** 2) + 1
  34:     
  35:     def min(self):
  36:         if len(self.heap_list) > 1:
  37:             return self.heap_list[1]
--------------------------------------------------------------------------------
[0.15558 s] survived

   - [#  33] AOR heap: 
--------------------------------------------------------------------------------
  29:         
  30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
  31:             return i * 2
  32:         else:
- 33:             return (i * 2) + 1
+ 33:             return (i * 2) - 1
  34:     
  35:     def min(self):
  36:         if len(self.heap_list) > 1:
  37:             return self.heap_list[1]
--------------------------------------------------------------------------------
[0.15816 s] survived

   - [#  38] ASR heap: 
--------------------------------------------------------------------------------
  53:         i = len(lst) // 2
  54:         self.heap_list = [0] + lst
  55:         while i > 0:
  56:             self.sift(i)
- 57:             i -= 1
+ 57:             i += 1
  58:     
  59:     def size(self):
  60:         return len(self.heap_list) - 1
--------------------------------------------------------------------------------
[5.00643 s] timeout

   - [#  39] CDI heap: 
--------------------------------------------------------------------------------
   1: class Heap:
   2:     
-  3:     def __init__(self):
-  4:         self.heap_list = [0]
-  5:     
+  3:     @classmethod
+  4:     def __init__(self):
+  5:         self.heap_list = [0]
   6:     def insert(self, value: int):
   7:         self.heap_list.append(value)
   8:         self.percolate(self.size())
   9:     
--------------------------------------------------------------------------------
[0.15570 s] survived

   - [#  40] CDI heap: 
--------------------------------------------------------------------------------
   2:     
   3:     def __init__(self):
   4:         self.heap_list = [0]
   5:     
-  6:     def insert(self, value: int):
-  7:         self.heap_list.append(value)
-  8:         self.percolate(self.size())
-  9:     
+  6:     @classmethod
+  7:     def insert(self, value: int):
+  8:         self.heap_list.append(value)
+  9:         self.percolate(self.size())
  10:     def percolate(self, i):
  11:         while i // 2 > 0:
  12:             parent = i // 2
  13:             if self.heap_list[i] < self.heap_list[parent]:
--------------------------------------------------------------------------------
[0.17697 s] killed by ts-3-5/test_3-5_0-4_143.py::test_insert

empty_heap = <heap.Heap object at 0x7bcbf5a85fc0>

    def test_insert(empty_heap):
>       empty_heap.insert(5)

ts-3-5/test_3-5_0-4_143.py:25: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'heap.Heap'>, value = 5

>   ???
E   AttributeError: type object 'Heap' has no attribute 'heap_list'

heap:8: AttributeError

   - [#  41] CDI heap: 
--------------------------------------------------------------------------------
   6:     def insert(self, value: int):
   7:         self.heap_list.append(value)
   8:         self.percolate(self.size())
   9:     
- 10:     def percolate(self, i):
- 11:         while i // 2 > 0:
- 12:             parent = i // 2
- 13:             if self.heap_list[i] < self.heap_list[parent]:
- 14:                 (self.heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
- 15:             i = i // 2
- 16:     
+ 10:     @classmethod
+ 11:     def percolate(self, i):
+ 12:         while i // 2 > 0:
+ 13:             parent = i // 2
+ 14:             if self.heap_list[i] < self.heap_list[parent]:
+ 15:                 (self.heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
+ 16:             i = i // 2
  17:     def sift(self, i):
  18:         while i * 2 <= self.size():
  19:             mc_i = self.find_min_child_index(i)
  20:             if self.heap_list[i] > self.heap_list[mc_i]:
--------------------------------------------------------------------------------
[0.19212 s] killed by ts-3-5/test_3-5_0-4_143.py::test_percolate

empty_heap = <heap.Heap object at 0x7bcbf5afbc70>

    def test_percolate(empty_heap):
        empty_heap.heap_list = [0, 3, 5]
>       empty_heap.percolate(2)

ts-3-5/test_3-5_0-4_143.py:30: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'heap.Heap'>, i = 2

>   ???
E   AttributeError: type object 'Heap' has no attribute 'heap_list'

heap:14: AttributeError

   - [#  44] CDI heap: 
--------------------------------------------------------------------------------
  31:             return i * 2
  32:         else:
  33:             return (i * 2) + 1
  34:     
- 35:     def min(self):
- 36:         if len(self.heap_list) > 1:
- 37:             return self.heap_list[1]
- 38:         else:
- 39:             return None
- 40:     
+ 35:     @classmethod
+ 36:     def min(self):
+ 37:         if len(self.heap_list) > 1:
+ 38:             return self.heap_list[1]
+ 39:         else:
+ 40:             return None
  41:     def delete_min(self):
  42:         if self.size() == 0:
  43:             return None
  44:         if self.size() == 1:
--------------------------------------------------------------------------------
[0.18057 s] killed by ts-3-5/test_3-5_0-4_143.py::test_min

filled_heap = <heap.Heap object at 0x7bcbf5f8c5e0>

    def test_min(filled_heap):
>       assert filled_heap.min() == 1

ts-3-5/test_3-5_0-4_143.py:41: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'heap.Heap'>

>   ???
E   AttributeError: type object 'Heap' has no attribute 'heap_list'

heap:37: AttributeError

   - [#  47] CDI heap: 
--------------------------------------------------------------------------------
  55:         while i > 0:
  56:             self.sift(i)
  57:             i -= 1
  58:     
- 59:     def size(self):
- 60:         return len(self.heap_list) - 1
+ 59:     @classmethod
+ 60:     def size(self):
+ 61:         return len(self.heap_list) - 1
--------------------------------------------------------------------------------
[0.17714 s] killed by ts-3-5/test_3-5_0-4_143.py::test_insert

empty_heap = <heap.Heap object at 0x7bcbf5a9d1e0>

    def test_insert(empty_heap):
>       empty_heap.insert(5)

ts-3-5/test_3-5_0-4_143.py:25: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
heap:8: in insert
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'heap.Heap'>

>   ???
E   AttributeError: type object 'Heap' has no attribute 'heap_list'

heap:61: AttributeError

   - [#  48] COI heap: 
--------------------------------------------------------------------------------
   7:         self.heap_list.append(value)
   8:         self.percolate(self.size())
   9:     
  10:     def percolate(self, i):
- 11:         while i // 2 > 0:
+ 11:         while not (i // 2 > 0):
  12:             parent = i // 2
  13:             if self.heap_list[i] < self.heap_list[parent]:
  14:                 (self.heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
  15:             i = i // 2
--------------------------------------------------------------------------------
[5.00613 s] timeout

   - [#  49] COI heap: 
--------------------------------------------------------------------------------
   9:     
  10:     def percolate(self, i):
  11:         while i // 2 > 0:
  12:             parent = i // 2
- 13:             if self.heap_list[i] < self.heap_list[parent]:
+ 13:             if not (self.heap_list[i] < self.heap_list[parent]):
  14:                 (self.heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
  15:             i = i // 2
  16:     
  17:     def sift(self, i):
--------------------------------------------------------------------------------
[0.17620 s] killed by ts-3-5/test_3-5_0-4_143.py::test_percolate

empty_heap = <heap.Heap object at 0x7bcbf5aa2f20>

    def test_percolate(empty_heap):
        empty_heap.heap_list = [0, 3, 5]
        empty_heap.percolate(2)
>       assert empty_heap.heap_list == [0, 3, 5]
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:31: AssertionError

   - [#  50] COI heap: 
--------------------------------------------------------------------------------
  14:                 (self.heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
  15:             i = i // 2
  16:     
  17:     def sift(self, i):
- 18:         while i * 2 <= self.size():
+ 18:         while not (i * 2 <= self.size()):
  19:             mc_i = self.find_min_child_index(i)
  20:             if self.heap_list[i] > self.heap_list[mc_i]:
  21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
  22:             i = mc_i
--------------------------------------------------------------------------------
[0.17982 s] killed by ts-3-5/test_3-5_0-4_143.py::test_delete_min

filled_heap = <heap.Heap object at 0x7bcbf5b01690>

    def test_delete_min(filled_heap):
        assert filled_heap.delete_min() == 1
>       assert filled_heap.heap_list == [0, 3, 5, 7]
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:45: AssertionError

   - [#  51] COI heap: 
--------------------------------------------------------------------------------
  16:     
  17:     def sift(self, i):
  18:         while i * 2 <= self.size():
  19:             mc_i = self.find_min_child_index(i)
- 20:             if self.heap_list[i] > self.heap_list[mc_i]:
+ 20:             if not (self.heap_list[i] > self.heap_list[mc_i]):
  21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
  22:             i = mc_i
  23:     
  24:     def find_min_child_index(self, i):
--------------------------------------------------------------------------------
[0.17909 s] killed by ts-3-5/test_3-5_0-4_143.py::test_sift

filled_heap = <heap.Heap object at 0x7bcbf598c3d0>

    def test_sift(filled_heap):
        filled_heap.sift(1)
>       assert filled_heap.heap_list == [0, 1, 3, 7, 5]
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:35: AssertionError

   - [#  53] COI heap: 
--------------------------------------------------------------------------------
  23:     
  24:     def find_min_child_index(self, i):
  25:         if i * 2 > self.size():
  26:             return None
- 27:         if (i * 2) + 1 > self.size():
+ 27:         if not ((i * 2) + 1 > self.size()):
  28:             return i * 2
  29:         
  30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
  31:             return i * 2
--------------------------------------------------------------------------------
[0.17468 s] killed by ts-3-5/test_3-5_0-4_143.py::test_sift

filled_heap = <heap.Heap object at 0x7bcbf5d50d00>

    def test_sift(filled_heap):
>       filled_heap.sift(1)

ts-3-5/test_3-5_0-4_143.py:34: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
heap:19: in sift
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5d50d00>, i = 2

>   ???
E   IndexError: list index out of range

heap:30: IndexError

   - [#  54] COI heap: 
--------------------------------------------------------------------------------
  26:             return None
  27:         if (i * 2) + 1 > self.size():
  28:             return i * 2
  29:         
- 30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
+ 30:         elif not (self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]):
  31:             return i * 2
  32:         else:
  33:             return (i * 2) + 1
  34:     
--------------------------------------------------------------------------------
[0.18065 s] killed by ts-3-5/test_3-5_0-4_143.py::test_find_min_child_index

filled_heap = <heap.Heap object at 0x7bcbf5d4e1a0>

    def test_find_min_child_index(filled_heap):
>       assert filled_heap.find_min_child_index(1) == 2
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:38: AssertionError

   - [#  55] COI heap: 
--------------------------------------------------------------------------------
  32:         else:
  33:             return (i * 2) + 1
  34:     
  35:     def min(self):
- 36:         if len(self.heap_list) > 1:
+ 36:         if not (len(self.heap_list) > 1):
  37:             return self.heap_list[1]
  38:         else:
  39:             return None
  40:     
--------------------------------------------------------------------------------
[0.18928 s] killed by ts-3-5/test_3-5_0-4_143.py::test_min

filled_heap = <heap.Heap object at 0x7bcbf5d538b0>

    def test_min(filled_heap):
>       assert filled_heap.min() == 1
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:41: AssertionError

   - [#  56] COI heap: 
--------------------------------------------------------------------------------
  38:         else:
  39:             return None
  40:     
  41:     def delete_min(self):
- 42:         if self.size() == 0:
+ 42:         if not (self.size() == 0):
  43:             return None
  44:         if self.size() == 1:
  45:             return self.heap_list.pop()
  46:         
--------------------------------------------------------------------------------
[0.18198 s] killed by ts-3-5/test_3-5_0-4_143.py::test_delete_min

filled_heap = <heap.Heap object at 0x7bcbf5f7b8b0>

    def test_delete_min(filled_heap):
>       assert filled_heap.delete_min() == 1
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:44: AssertionError

   - [#  57] COI heap: 
--------------------------------------------------------------------------------
  40:     
  41:     def delete_min(self):
  42:         if self.size() == 0:
  43:             return None
- 44:         if self.size() == 1:
+ 44:         if not (self.size() == 1):
  45:             return self.heap_list.pop()
  46:         
  47:         min_val = self.heap_list[1]
  48:         self.heap_list[1] = self.heap_list.pop()
--------------------------------------------------------------------------------
[0.17719 s] killed by ts-3-5/test_3-5_0-4_143.py::test_delete_min

filled_heap = <heap.Heap object at 0x7bcbf5ed7cd0>

    def test_delete_min(filled_heap):
>       assert filled_heap.delete_min() == 1
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:44: AssertionError

   - [#  58] COI heap: 
--------------------------------------------------------------------------------
  51:     
  52:     def build(self, lst: list):
  53:         i = len(lst) // 2
  54:         self.heap_list = [0] + lst
- 55:         while i > 0:
+ 55:         while not (i > 0):
  56:             self.sift(i)
  57:             i -= 1
  58:     
  59:     def size(self):
--------------------------------------------------------------------------------
[0.18058 s] killed by ts-3-5/test_3-5_0-4_143.py::test_build

empty_heap = <heap.Heap object at 0x7bcbf608ece0>

    def test_build(empty_heap):
        empty_heap.build([4, 2, 6, 1, 3])
>       assert empty_heap.heap_list == [0, 1, 2, 6, 4, 3]
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:49: AssertionError

   - [#  59] OIL heap: 
--------------------------------------------------------------------------------
  12:             parent = i // 2
  13:             if self.heap_list[i] < self.heap_list[parent]:
  14:                 (self.heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
  15:             i = i // 2
- 16:     
+ 16:             break
  17:     def sift(self, i):
  18:         while i * 2 <= self.size():
  19:             mc_i = self.find_min_child_index(i)
  20:             if self.heap_list[i] > self.heap_list[mc_i]:
--------------------------------------------------------------------------------
[0.17970 s] killed by ts-3-5/test_3-5_0-4_143.py::test_min

filled_heap = <heap.Heap object at 0x7bcbf5c0a5f0>

    def test_min(filled_heap):
>       assert filled_heap.min() == 1
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:41: AssertionError

   - [#  60] OIL heap: 
--------------------------------------------------------------------------------
  19:             mc_i = self.find_min_child_index(i)
  20:             if self.heap_list[i] > self.heap_list[mc_i]:
  21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
  22:             i = mc_i
- 23:     
+ 23:             break
  24:     def find_min_child_index(self, i):
  25:         if i * 2 > self.size():
  26:             return None
  27:         if (i * 2) + 1 > self.size():
--------------------------------------------------------------------------------
[0.18183 s] killed by ts-3-5/test_3-5_0-4_143.py::test_build

empty_heap = <heap.Heap object at 0x7bcbf5ff2cb0>

    def test_build(empty_heap):
        empty_heap.build([4, 2, 6, 1, 3])
>       assert empty_heap.heap_list == [0, 1, 2, 6, 4, 3]
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:49: AssertionError

   - [#  61] OIL heap: 
--------------------------------------------------------------------------------
  54:         self.heap_list = [0] + lst
  55:         while i > 0:
  56:             self.sift(i)
  57:             i -= 1
- 58:     
+ 58:             break
  59:     def size(self):
  60:         return len(self.heap_list) - 1
--------------------------------------------------------------------------------
[0.18232 s] killed by ts-3-5/test_3-5_0-4_143.py::test_build

empty_heap = <heap.Heap object at 0x7bcbf5c09450>

    def test_build(empty_heap):
        empty_heap.build([4, 2, 6, 1, 3])
>       assert empty_heap.heap_list == [0, 1, 2, 6, 4, 3]
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:49: AssertionError

   - [#  66] ROR heap: 
--------------------------------------------------------------------------------
  14:                 (self.heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
  15:             i = i // 2
  16:     
  17:     def sift(self, i):
- 18:         while i * 2 <= self.size():
+ 18:         while i * 2 >= self.size():
  19:             mc_i = self.find_min_child_index(i)
  20:             if self.heap_list[i] > self.heap_list[mc_i]:
  21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
  22:             i = mc_i
--------------------------------------------------------------------------------
[0.17851 s] killed by ts-3-5/test_3-5_0-4_143.py::test_delete_min

filled_heap = <heap.Heap object at 0x7bcbf5b9bb20>

    def test_delete_min(filled_heap):
        assert filled_heap.delete_min() == 1
>       assert filled_heap.heap_list == [0, 3, 5, 7]
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:45: AssertionError

   - [#  67] ROR heap: 
--------------------------------------------------------------------------------
  14:                 (self.heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
  15:             i = i // 2
  16:     
  17:     def sift(self, i):
- 18:         while i * 2 <= self.size():
+ 18:         while i * 2 < self.size():
  19:             mc_i = self.find_min_child_index(i)
  20:             if self.heap_list[i] > self.heap_list[mc_i]:
  21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
  22:             i = mc_i
--------------------------------------------------------------------------------
[0.15617 s] survived
