   - [#  74] ROR heap: 
--------------------------------------------------------------------------------
  26:             return None
  27:         if (i * 2) + 1 > self.size():
  28:             return i * 2
  29:         
- 30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
+ 30:         elif self.heap_list[i * 2] > self.heap_list[(i * 2) + 1]:
  31:             return i * 2
  32:         else:
  33:             return (i * 2) + 1
  34:     
--------------------------------------------------------------------------------
[0.17961 s] killed by ts-3-5/test_3-5_0-4_143.py::test_find_min_child_index

filled_heap = <heap.Heap object at 0x7bcbf5f134f0>

    def test_find_min_child_index(filled_heap):
>       assert filled_heap.find_min_child_index(1) == 2
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:38: AssertionError

   - [#  75] ROR heap: 
--------------------------------------------------------------------------------
  26:             return None
  27:         if (i * 2) + 1 > self.size():
  28:             return i * 2
  29:         
- 30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
+ 30:         elif self.heap_list[i * 2] <= self.heap_list[(i * 2) + 1]:
  31:             return i * 2
  32:         else:
  33:             return (i * 2) + 1
  34:     
--------------------------------------------------------------------------------
[0.15812 s] survived

   - [#  91] SDL heap: 
--------------------------------------------------------------------------------
   1: class Heap:
   2:     
   3:     def __init__(self):
-  4:         self.heap_list = [0]
+  4:         pass
   5:     
   6:     def insert(self, value: int):
   7:         self.heap_list.append(value)
   8:         self.percolate(self.size())
--------------------------------------------------------------------------------
[0.17585 s] killed by ts-3-5/test_3-5_0-4_143.py::test_insert

empty_heap = <heap.Heap object at 0x7bcbf5a84970>

    def test_insert(empty_heap):
>       empty_heap.insert(5)

ts-3-5/test_3-5_0-4_143.py:25: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5a84970>, value = 5

>   ???
E   AttributeError: 'Heap' object has no attribute 'heap_list'

heap:7: AttributeError

   - [#  92] SDL heap: 
--------------------------------------------------------------------------------
   3:     def __init__(self):
   4:         self.heap_list = [0]
   5:     
   6:     def insert(self, value: int):
-  7:         self.heap_list.append(value)
+  7:         pass
   8:         self.percolate(self.size())
   9:     
  10:     def percolate(self, i):
  11:         while i // 2 > 0:
--------------------------------------------------------------------------------
[0.17877 s] killed by ts-3-5/test_3-5_0-4_143.py::test_insert

empty_heap = <heap.Heap object at 0x7bcbf5a870a0>

    def test_insert(empty_heap):
        empty_heap.insert(5)
>       assert empty_heap.heap_list == [0, 5]
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:26: AssertionError

   - [#  93] SDL heap: 
--------------------------------------------------------------------------------
   4:         self.heap_list = [0]
   5:     
   6:     def insert(self, value: int):
   7:         self.heap_list.append(value)
-  8:         self.percolate(self.size())
+  8:         pass
   9:     
  10:     def percolate(self, i):
  11:         while i // 2 > 0:
  12:             parent = i // 2
--------------------------------------------------------------------------------
[0.17828 s] killed by ts-3-5/test_3-5_0-4_143.py::test_sift

filled_heap = <heap.Heap object at 0x7bcbf599e4a0>

    def test_sift(filled_heap):
        filled_heap.sift(1)
>       assert filled_heap.heap_list == [0, 1, 3, 7, 5]
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:35: AssertionError

   - [#  94] SDL heap: 
--------------------------------------------------------------------------------
   8:         self.percolate(self.size())
   9:     
  10:     def percolate(self, i):
  11:         while i // 2 > 0:
- 12:             parent = i // 2
+ 12:             pass
  13:             if self.heap_list[i] < self.heap_list[parent]:
  14:                 (self.heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
  15:             i = i // 2
  16:     
--------------------------------------------------------------------------------
[0.17575 s] killed by ts-3-5/test_3-5_0-4_143.py::test_percolate

empty_heap = <heap.Heap object at 0x7bcbf5bfa440>

    def test_percolate(empty_heap):
        empty_heap.heap_list = [0, 3, 5]
>       empty_heap.percolate(2)

ts-3-5/test_3-5_0-4_143.py:30: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5bfa440>, i = 2

>   ???
E   NameError: name 'parent' is not defined

heap:13: NameError

   - [#  95] SDL heap: 
--------------------------------------------------------------------------------
  10:     def percolate(self, i):
  11:         while i // 2 > 0:
  12:             parent = i // 2
  13:             if self.heap_list[i] < self.heap_list[parent]:
- 14:                 (self.heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
+ 14:                 pass
  15:             i = i // 2
  16:     
  17:     def sift(self, i):
  18:         while i * 2 <= self.size():
--------------------------------------------------------------------------------
[0.17911 s] killed by ts-3-5/test_3-5_0-4_143.py::test_sift

filled_heap = <heap.Heap object at 0x7bcbf5ed4820>

    def test_sift(filled_heap):
        filled_heap.sift(1)
>       assert filled_heap.heap_list == [0, 1, 3, 7, 5]
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:35: AssertionError

   - [#  96] SDL heap: 
--------------------------------------------------------------------------------
  11:         while i // 2 > 0:
  12:             parent = i // 2
  13:             if self.heap_list[i] < self.heap_list[parent]:
  14:                 (self.heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
- 15:             i = i // 2
+ 15:             pass
  16:     
  17:     def sift(self, i):
  18:         while i * 2 <= self.size():
  19:             mc_i = self.find_min_child_index(i)
--------------------------------------------------------------------------------
[5.00670 s] timeout

   - [#  97] SDL heap: 
--------------------------------------------------------------------------------
  15:             i = i // 2
  16:     
  17:     def sift(self, i):
  18:         while i * 2 <= self.size():
- 19:             mc_i = self.find_min_child_index(i)
+ 19:             pass
  20:             if self.heap_list[i] > self.heap_list[mc_i]:
  21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
  22:             i = mc_i
  23:     
--------------------------------------------------------------------------------
[0.17569 s] killed by ts-3-5/test_3-5_0-4_143.py::test_sift

filled_heap = <heap.Heap object at 0x7bcbf5a84430>

    def test_sift(filled_heap):
>       filled_heap.sift(1)

ts-3-5/test_3-5_0-4_143.py:34: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5a84430>, i = 1

>   ???
E   NameError: name 'mc_i' is not defined

heap:20: NameError

   - [#  98] SDL heap: 
--------------------------------------------------------------------------------
  17:     def sift(self, i):
  18:         while i * 2 <= self.size():
  19:             mc_i = self.find_min_child_index(i)
  20:             if self.heap_list[i] > self.heap_list[mc_i]:
- 21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
+ 21:                 pass
  22:             i = mc_i
  23:     
  24:     def find_min_child_index(self, i):
  25:         if i * 2 > self.size():
--------------------------------------------------------------------------------
[0.18189 s] killed by ts-3-5/test_3-5_0-4_143.py::test_delete_min

filled_heap = <heap.Heap object at 0x7bcbf608df00>

    def test_delete_min(filled_heap):
        assert filled_heap.delete_min() == 1
>       assert filled_heap.heap_list == [0, 3, 5, 7]
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:45: AssertionError

   - [#  99] SDL heap: 
--------------------------------------------------------------------------------
  18:         while i * 2 <= self.size():
  19:             mc_i = self.find_min_child_index(i)
  20:             if self.heap_list[i] > self.heap_list[mc_i]:
  21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
- 22:             i = mc_i
+ 22:             pass
  23:     
  24:     def find_min_child_index(self, i):
  25:         if i * 2 > self.size():
  26:             return None
--------------------------------------------------------------------------------
[5.00670 s] timeout

   - [# 100] SDL heap: 
--------------------------------------------------------------------------------
  22:             i = mc_i
  23:     
  24:     def find_min_child_index(self, i):
  25:         if i * 2 > self.size():
- 26:             return None
+ 26:             pass
  27:         if (i * 2) + 1 > self.size():
  28:             return i * 2
  29:         
  30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
--------------------------------------------------------------------------------
[0.15755 s] survived

   - [# 103] SDL heap: 
--------------------------------------------------------------------------------
  29:         
  30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
  31:             return i * 2
  32:         else:
- 33:             return (i * 2) + 1
+ 33:             pass
  34:     
  35:     def min(self):
  36:         if len(self.heap_list) > 1:
  37:             return self.heap_list[1]
--------------------------------------------------------------------------------
[0.16113 s] survived

   - [# 104] SDL heap: 
--------------------------------------------------------------------------------
  33:             return (i * 2) + 1
  34:     
  35:     def min(self):
  36:         if len(self.heap_list) > 1:
- 37:             return self.heap_list[1]
+ 37:             pass
  38:         else:
  39:             return None
  40:     
  41:     def delete_min(self):
--------------------------------------------------------------------------------
[0.18412 s] killed by ts-3-5/test_3-5_0-4_143.py::test_min

filled_heap = <heap.Heap object at 0x7bcbf6034700>

    def test_min(filled_heap):
>       assert filled_heap.min() == 1
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:41: AssertionError

   - [# 105] SDL heap: 
--------------------------------------------------------------------------------
  35:     def min(self):
  36:         if len(self.heap_list) > 1:
  37:             return self.heap_list[1]
  38:         else:
- 39:             return None
+ 39:             pass
  40:     
  41:     def delete_min(self):
  42:         if self.size() == 0:
  43:             return None
--------------------------------------------------------------------------------
[0.16098 s] survived

   - [# 106] SDL heap: 
--------------------------------------------------------------------------------
  39:             return None
  40:     
  41:     def delete_min(self):
  42:         if self.size() == 0:
- 43:             return None
+ 43:             pass
  44:         if self.size() == 1:
  45:             return self.heap_list.pop()
  46:         
  47:         min_val = self.heap_list[1]
--------------------------------------------------------------------------------
[0.16108 s] survived

   - [# 107] SDL heap: 
--------------------------------------------------------------------------------
  41:     def delete_min(self):
  42:         if self.size() == 0:
  43:             return None
  44:         if self.size() == 1:
- 45:             return self.heap_list.pop()
+ 45:             pass
  46:         
  47:         min_val = self.heap_list[1]
  48:         self.heap_list[1] = self.heap_list.pop()
  49:         self.sift(1)
--------------------------------------------------------------------------------
[0.16378 s] survived

   - [# 108] SDL heap: 
--------------------------------------------------------------------------------
  43:             return None
  44:         if self.size() == 1:
  45:             return self.heap_list.pop()
  46:         
- 47:         min_val = self.heap_list[1]
+ 47:         pass
  48:         self.heap_list[1] = self.heap_list.pop()
  49:         self.sift(1)
  50:         return min_val
  51:     
--------------------------------------------------------------------------------
[0.18207 s] killed by ts-3-5/test_3-5_0-4_143.py::test_delete_min

filled_heap = <heap.Heap object at 0x7bcbf5ada5c0>

    def test_delete_min(filled_heap):
>       assert filled_heap.delete_min() == 1

ts-3-5/test_3-5_0-4_143.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5ada5c0>

>   ???
E   NameError: name 'min_val' is not defined

heap:50: NameError

   - [# 109] SDL heap: 
--------------------------------------------------------------------------------
  44:         if self.size() == 1:
  45:             return self.heap_list.pop()
  46:         
  47:         min_val = self.heap_list[1]
- 48:         self.heap_list[1] = self.heap_list.pop()
+ 48:         pass
  49:         self.sift(1)
  50:         return min_val
  51:     
  52:     def build(self, lst: list):
--------------------------------------------------------------------------------
[0.18392 s] killed by ts-3-5/test_3-5_0-4_143.py::test_delete_min

filled_heap = <heap.Heap object at 0x7bcbf5b7f5b0>

    def test_delete_min(filled_heap):
        assert filled_heap.delete_min() == 1
>       assert filled_heap.heap_list == [0, 3, 5, 7]
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:45: AssertionError

   - [# 110] SDL heap: 
--------------------------------------------------------------------------------
  45:             return self.heap_list.pop()
  46:         
  47:         min_val = self.heap_list[1]
  48:         self.heap_list[1] = self.heap_list.pop()
- 49:         self.sift(1)
+ 49:         pass
  50:         return min_val
  51:     
  52:     def build(self, lst: list):
  53:         i = len(lst) // 2
--------------------------------------------------------------------------------
[0.18463 s] killed by ts-3-5/test_3-5_0-4_143.py::test_delete_min

filled_heap = <heap.Heap object at 0x7bcbf5a09c30>

    def test_delete_min(filled_heap):
        assert filled_heap.delete_min() == 1
>       assert filled_heap.heap_list == [0, 3, 5, 7]
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:45: AssertionError

   - [# 111] SDL heap: 
--------------------------------------------------------------------------------
  46:         
  47:         min_val = self.heap_list[1]
  48:         self.heap_list[1] = self.heap_list.pop()
  49:         self.sift(1)
- 50:         return min_val
+ 50:         pass
  51:     
  52:     def build(self, lst: list):
  53:         i = len(lst) // 2
  54:         self.heap_list = [0] + lst
--------------------------------------------------------------------------------
[0.17712 s] killed by ts-3-5/test_3-5_0-4_143.py::test_delete_min

filled_heap = <heap.Heap object at 0x7bcbf5b7f310>

    def test_delete_min(filled_heap):
>       assert filled_heap.delete_min() == 1
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:44: AssertionError

   - [# 112] SDL heap: 
--------------------------------------------------------------------------------
  49:         self.sift(1)
  50:         return min_val
  51:     
  52:     def build(self, lst: list):
- 53:         i = len(lst) // 2
+ 53:         pass
  54:         self.heap_list = [0] + lst
  55:         while i > 0:
  56:             self.sift(i)
  57:             i -= 1
--------------------------------------------------------------------------------
[0.17792 s] killed by ts-3-5/test_3-5_0-4_143.py::test_build

empty_heap = <heap.Heap object at 0x7bcbf5af82b0>

    def test_build(empty_heap):
>       empty_heap.build([4, 2, 6, 1, 3])

ts-3-5/test_3-5_0-4_143.py:48: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5af82b0>, lst = [4, 2, 6, 1, 3]

>   ???
E   UnboundLocalError: local variable 'i' referenced before assignment

heap:55: UnboundLocalError

   - [# 113] SDL heap: 
--------------------------------------------------------------------------------
  50:         return min_val
  51:     
  52:     def build(self, lst: list):
  53:         i = len(lst) // 2
- 54:         self.heap_list = [0] + lst
+ 54:         pass
  55:         while i > 0:
  56:             self.sift(i)
  57:             i -= 1
  58:     
--------------------------------------------------------------------------------
[0.18330 s] killed by ts-3-5/test_3-5_0-4_143.py::test_build

empty_heap = <heap.Heap object at 0x7bcbf5d51180>

    def test_build(empty_heap):
        empty_heap.build([4, 2, 6, 1, 3])
>       assert empty_heap.heap_list == [0, 1, 2, 6, 4, 3]
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:49: AssertionError

   - [# 114] SDL heap: 
--------------------------------------------------------------------------------
  52:     def build(self, lst: list):
  53:         i = len(lst) // 2
  54:         self.heap_list = [0] + lst
  55:         while i > 0:
- 56:             self.sift(i)
+ 56:             pass
  57:             i -= 1
  58:     
  59:     def size(self):
  60:         return len(self.heap_list) - 1
--------------------------------------------------------------------------------
[0.18175 s] killed by ts-3-5/test_3-5_0-4_143.py::test_build

empty_heap = <heap.Heap object at 0x7bcbf5d52470>

    def test_build(empty_heap):
        empty_heap.build([4, 2, 6, 1, 3])
>       assert empty_heap.heap_list == [0, 1, 2, 6, 4, 3]
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:49: AssertionError

   - [# 117] SVD heap: 
--------------------------------------------------------------------------------
   3:     def __init__(self):
   4:         self.heap_list = [0]
   5:     
   6:     def insert(self, value: int):
-  7:         self.heap_list.append(value)
+  7:         heap_list.append(value)
   8:         self.percolate(self.size())
   9:     
  10:     def percolate(self, i):
  11:         while i // 2 > 0:
--------------------------------------------------------------------------------
[0.17925 s] killed by ts-3-5/test_3-5_0-4_143.py::test_insert

empty_heap = <heap.Heap object at 0x7bcbf5f7a260>

    def test_insert(empty_heap):
>       empty_heap.insert(5)

ts-3-5/test_3-5_0-4_143.py:25: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5f7a260>, value = 5

>   ???
E   NameError: name 'heap_list' is not defined

heap:7: NameError

   - [# 118] SVD heap: 
--------------------------------------------------------------------------------
   4:         self.heap_list = [0]
   5:     
   6:     def insert(self, value: int):
   7:         self.heap_list.append(value)
-  8:         self.percolate(self.size())
+  8:         percolate(self.size())
   9:     
  10:     def percolate(self, i):
  11:         while i // 2 > 0:
  12:             parent = i // 2
--------------------------------------------------------------------------------
[0.17795 s] killed by ts-3-5/test_3-5_0-4_143.py::test_insert

empty_heap = <heap.Heap object at 0x7bcbf5c71d20>

    def test_insert(empty_heap):
>       empty_heap.insert(5)

ts-3-5/test_3-5_0-4_143.py:25: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5c71d20>, value = 5

>   ???
E   NameError: name 'percolate' is not defined

heap:8: NameError

   - [# 119] SVD heap: 
--------------------------------------------------------------------------------
   4:         self.heap_list = [0]
   5:     
   6:     def insert(self, value: int):
   7:         self.heap_list.append(value)
-  8:         self.percolate(self.size())
+  8:         self.percolate(size())
   9:     
  10:     def percolate(self, i):
  11:         while i // 2 > 0:
  12:             parent = i // 2
--------------------------------------------------------------------------------
[0.17701 s] killed by ts-3-5/test_3-5_0-4_143.py::test_insert

empty_heap = <heap.Heap object at 0x7bcbf617b9d0>

    def test_insert(empty_heap):
>       empty_heap.insert(5)

ts-3-5/test_3-5_0-4_143.py:25: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf617b9d0>, value = 5

>   ???
E   NameError: name 'size' is not defined

heap:8: NameError

   - [# 120] SVD heap: 
--------------------------------------------------------------------------------
   9:     
  10:     def percolate(self, i):
  11:         while i // 2 > 0:
  12:             parent = i // 2
- 13:             if self.heap_list[i] < self.heap_list[parent]:
+ 13:             if heap_list[i] < self.heap_list[parent]:
  14:                 (self.heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
  15:             i = i // 2
  16:     
  17:     def sift(self, i):
--------------------------------------------------------------------------------
[0.18063 s] killed by ts-3-5/test_3-5_0-4_143.py::test_percolate

empty_heap = <heap.Heap object at 0x7bcbf5afaf20>

    def test_percolate(empty_heap):
        empty_heap.heap_list = [0, 3, 5]
>       empty_heap.percolate(2)

ts-3-5/test_3-5_0-4_143.py:30: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5afaf20>, i = 2

>   ???
E   NameError: name 'heap_list' is not defined

heap:13: NameError

   - [# 121] SVD heap: 
--------------------------------------------------------------------------------
   9:     
  10:     def percolate(self, i):
  11:         while i // 2 > 0:
  12:             parent = i // 2
- 13:             if self.heap_list[i] < self.heap_list[parent]:
+ 13:             if self.heap_list[i] < heap_list[parent]:
  14:                 (self.heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
  15:             i = i // 2
  16:     
  17:     def sift(self, i):
--------------------------------------------------------------------------------
[0.17785 s] killed by ts-3-5/test_3-5_0-4_143.py::test_percolate

empty_heap = <heap.Heap object at 0x7bcbf5af8fd0>

    def test_percolate(empty_heap):
        empty_heap.heap_list = [0, 3, 5]
>       empty_heap.percolate(2)

ts-3-5/test_3-5_0-4_143.py:30: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5af8fd0>, i = 2

>   ???
E   NameError: name 'heap_list' is not defined

heap:13: NameError

   - [# 122] SVD heap: 
--------------------------------------------------------------------------------
  10:     def percolate(self, i):
  11:         while i // 2 > 0:
  12:             parent = i // 2
  13:             if self.heap_list[i] < self.heap_list[parent]:
- 14:                 (self.heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
+ 14:                 (heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
  15:             i = i // 2
  16:     
  17:     def sift(self, i):
  18:         while i * 2 <= self.size():
--------------------------------------------------------------------------------
[0.17507 s] killed by ts-3-5/test_3-5_0-4_143.py::test_sift

@pytest.fixture
    def filled_heap():
        heap = Heap()
        heap.insert(5)
>       heap.insert(3)

ts-3-5/test_3-5_0-4_143.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
heap:8: in insert
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5c239d0>, i = 2

>   ???
E   NameError: name 'heap_list' is not defined

heap:14: NameError

   - [# 123] SVD heap: 
--------------------------------------------------------------------------------
  10:     def percolate(self, i):
  11:         while i // 2 > 0:
  12:             parent = i // 2
  13:             if self.heap_list[i] < self.heap_list[parent]:
- 14:                 (self.heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
+ 14:                 (self.heap_list[i], heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
  15:             i = i // 2
  16:     
  17:     def sift(self, i):
  18:         while i * 2 <= self.size():
--------------------------------------------------------------------------------
[0.17714 s] killed by ts-3-5/test_3-5_0-4_143.py::test_sift

@pytest.fixture
    def filled_heap():
        heap = Heap()
        heap.insert(5)
>       heap.insert(3)

ts-3-5/test_3-5_0-4_143.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
heap:8: in insert
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5cc8e50>, i = 2

>   ???
E   NameError: name 'heap_list' is not defined

heap:14: NameError

   - [# 124] SVD heap: 
--------------------------------------------------------------------------------
  10:     def percolate(self, i):
  11:         while i // 2 > 0:
  12:             parent = i // 2
  13:             if self.heap_list[i] < self.heap_list[parent]:
- 14:                 (self.heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
+ 14:                 (self.heap_list[i], self.heap_list[parent]) = (heap_list[parent], self.heap_list[i])
  15:             i = i // 2
  16:     
  17:     def sift(self, i):
  18:         while i * 2 <= self.size():
--------------------------------------------------------------------------------
[0.19610 s] killed by ts-3-5/test_3-5_0-4_143.py::test_sift

@pytest.fixture
    def filled_heap():
        heap = Heap()
        heap.insert(5)
>       heap.insert(3)

ts-3-5/test_3-5_0-4_143.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
heap:8: in insert
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf617afb0>, i = 2

>   ???
E   NameError: name 'heap_list' is not defined

heap:14: NameError

   - [# 125] SVD heap: 
--------------------------------------------------------------------------------
  10:     def percolate(self, i):
  11:         while i // 2 > 0:
  12:             parent = i // 2
  13:             if self.heap_list[i] < self.heap_list[parent]:
- 14:                 (self.heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
+ 14:                 (self.heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], heap_list[i])
  15:             i = i // 2
  16:     
  17:     def sift(self, i):
  18:         while i * 2 <= self.size():
--------------------------------------------------------------------------------
[0.17940 s] killed by ts-3-5/test_3-5_0-4_143.py::test_sift

@pytest.fixture
    def filled_heap():
        heap = Heap()
        heap.insert(5)
>       heap.insert(3)

ts-3-5/test_3-5_0-4_143.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
heap:8: in insert
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5c35d80>, i = 2

>   ???
E   NameError: name 'heap_list' is not defined

heap:14: NameError

   - [# 126] SVD heap: 
--------------------------------------------------------------------------------
  14:                 (self.heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
  15:             i = i // 2
  16:     
  17:     def sift(self, i):
- 18:         while i * 2 <= self.size():
+ 18:         while i * 2 <= size():
  19:             mc_i = self.find_min_child_index(i)
  20:             if self.heap_list[i] > self.heap_list[mc_i]:
  21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
  22:             i = mc_i
--------------------------------------------------------------------------------
[0.18217 s] killed by ts-3-5/test_3-5_0-4_143.py::test_sift

filled_heap = <heap.Heap object at 0x7bcbf5ec1b40>

    def test_sift(filled_heap):
>       filled_heap.sift(1)

ts-3-5/test_3-5_0-4_143.py:34: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5ec1b40>, i = 1

>   ???
E   NameError: name 'size' is not defined

heap:18: NameError
