   - [# 127] SVD heap: 
--------------------------------------------------------------------------------
  15:             i = i // 2
  16:     
  17:     def sift(self, i):
  18:         while i * 2 <= self.size():
- 19:             mc_i = self.find_min_child_index(i)
+ 19:             mc_i = find_min_child_index(i)
  20:             if self.heap_list[i] > self.heap_list[mc_i]:
  21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
  22:             i = mc_i
  23:     
--------------------------------------------------------------------------------
[0.18027 s] killed by ts-3-5/test_3-5_0-4_143.py::test_sift

filled_heap = <heap.Heap object at 0x7bcbf5ec3b50>

    def test_sift(filled_heap):
>       filled_heap.sift(1)

ts-3-5/test_3-5_0-4_143.py:34: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5ec3b50>, i = 1

>   ???
E   NameError: name 'find_min_child_index' is not defined

heap:19: NameError

   - [# 128] SVD heap: 
--------------------------------------------------------------------------------
  16:     
  17:     def sift(self, i):
  18:         while i * 2 <= self.size():
  19:             mc_i = self.find_min_child_index(i)
- 20:             if self.heap_list[i] > self.heap_list[mc_i]:
+ 20:             if heap_list[i] > self.heap_list[mc_i]:
  21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
  22:             i = mc_i
  23:     
  24:     def find_min_child_index(self, i):
--------------------------------------------------------------------------------
[0.19792 s] killed by ts-3-5/test_3-5_0-4_143.py::test_sift

filled_heap = <heap.Heap object at 0x7bcbf5c365c0>

    def test_sift(filled_heap):
>       filled_heap.sift(1)

ts-3-5/test_3-5_0-4_143.py:34: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5c365c0>, i = 1

>   ???
E   NameError: name 'heap_list' is not defined

heap:20: NameError

   - [# 129] SVD heap: 
--------------------------------------------------------------------------------
  16:     
  17:     def sift(self, i):
  18:         while i * 2 <= self.size():
  19:             mc_i = self.find_min_child_index(i)
- 20:             if self.heap_list[i] > self.heap_list[mc_i]:
+ 20:             if self.heap_list[i] > heap_list[mc_i]:
  21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
  22:             i = mc_i
  23:     
  24:     def find_min_child_index(self, i):
--------------------------------------------------------------------------------
[0.17460 s] killed by ts-3-5/test_3-5_0-4_143.py::test_sift

filled_heap = <heap.Heap object at 0x7bcbf5f7bb50>

    def test_sift(filled_heap):
>       filled_heap.sift(1)

ts-3-5/test_3-5_0-4_143.py:34: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5f7bb50>, i = 1

>   ???
E   NameError: name 'heap_list' is not defined

heap:20: NameError

   - [# 130] SVD heap: 
--------------------------------------------------------------------------------
  17:     def sift(self, i):
  18:         while i * 2 <= self.size():
  19:             mc_i = self.find_min_child_index(i)
  20:             if self.heap_list[i] > self.heap_list[mc_i]:
- 21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
+ 21:                 (heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
  22:             i = mc_i
  23:     
  24:     def find_min_child_index(self, i):
  25:         if i * 2 > self.size():
--------------------------------------------------------------------------------
[0.18121 s] killed by ts-3-5/test_3-5_0-4_143.py::test_delete_min

filled_heap = <heap.Heap object at 0x7bcbf5ff35e0>

    def test_delete_min(filled_heap):
>       assert filled_heap.delete_min() == 1

ts-3-5/test_3-5_0-4_143.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
heap:49: in delete_min
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5ff35e0>, i = 1

>   ???
E   NameError: name 'heap_list' is not defined

heap:21: NameError

   - [# 131] SVD heap: 
--------------------------------------------------------------------------------
  17:     def sift(self, i):
  18:         while i * 2 <= self.size():
  19:             mc_i = self.find_min_child_index(i)
  20:             if self.heap_list[i] > self.heap_list[mc_i]:
- 21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
+ 21:                 (self.heap_list[i], heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
  22:             i = mc_i
  23:     
  24:     def find_min_child_index(self, i):
  25:         if i * 2 > self.size():
--------------------------------------------------------------------------------
[0.18864 s] killed by ts-3-5/test_3-5_0-4_143.py::test_delete_min

filled_heap = <heap.Heap object at 0x7bcbf5d5e140>

    def test_delete_min(filled_heap):
>       assert filled_heap.delete_min() == 1

ts-3-5/test_3-5_0-4_143.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
heap:49: in delete_min
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5d5e140>, i = 1

>   ???
E   NameError: name 'heap_list' is not defined

heap:21: NameError

   - [# 132] SVD heap: 
--------------------------------------------------------------------------------
  17:     def sift(self, i):
  18:         while i * 2 <= self.size():
  19:             mc_i = self.find_min_child_index(i)
  20:             if self.heap_list[i] > self.heap_list[mc_i]:
- 21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
+ 21:                 (self.heap_list[i], self.heap_list[mc_i]) = (heap_list[mc_i], self.heap_list[i])
  22:             i = mc_i
  23:     
  24:     def find_min_child_index(self, i):
  25:         if i * 2 > self.size():
--------------------------------------------------------------------------------
[0.18286 s] killed by ts-3-5/test_3-5_0-4_143.py::test_delete_min

filled_heap = <heap.Heap object at 0x7bcbf5eb6890>

    def test_delete_min(filled_heap):
>       assert filled_heap.delete_min() == 1

ts-3-5/test_3-5_0-4_143.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
heap:49: in delete_min
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5eb6890>, i = 1

>   ???
E   NameError: name 'heap_list' is not defined

heap:21: NameError

   - [# 133] SVD heap: 
--------------------------------------------------------------------------------
  17:     def sift(self, i):
  18:         while i * 2 <= self.size():
  19:             mc_i = self.find_min_child_index(i)
  20:             if self.heap_list[i] > self.heap_list[mc_i]:
- 21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
+ 21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], heap_list[i])
  22:             i = mc_i
  23:     
  24:     def find_min_child_index(self, i):
  25:         if i * 2 > self.size():
--------------------------------------------------------------------------------
[0.18292 s] killed by ts-3-5/test_3-5_0-4_143.py::test_delete_min

filled_heap = <heap.Heap object at 0x7bcbf5c72230>

    def test_delete_min(filled_heap):
>       assert filled_heap.delete_min() == 1

ts-3-5/test_3-5_0-4_143.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
heap:49: in delete_min
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5c72230>, i = 1

>   ???
E   NameError: name 'heap_list' is not defined

heap:21: NameError

   - [# 134] SVD heap: 
--------------------------------------------------------------------------------
  21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
  22:             i = mc_i
  23:     
  24:     def find_min_child_index(self, i):
- 25:         if i * 2 > self.size():
+ 25:         if i * 2 > size():
  26:             return None
  27:         if (i * 2) + 1 > self.size():
  28:             return i * 2
  29:         
--------------------------------------------------------------------------------
[0.18197 s] killed by ts-3-5/test_3-5_0-4_143.py::test_sift

filled_heap = <heap.Heap object at 0x7bcbf5ed78b0>

    def test_sift(filled_heap):
>       filled_heap.sift(1)

ts-3-5/test_3-5_0-4_143.py:34: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
heap:19: in sift
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5ed78b0>, i = 1

>   ???
E   NameError: name 'size' is not defined

heap:25: NameError

   - [# 135] SVD heap: 
--------------------------------------------------------------------------------
  23:     
  24:     def find_min_child_index(self, i):
  25:         if i * 2 > self.size():
  26:             return None
- 27:         if (i * 2) + 1 > self.size():
+ 27:         if (i * 2) + 1 > size():
  28:             return i * 2
  29:         
  30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
  31:             return i * 2
--------------------------------------------------------------------------------
[0.18103 s] killed by ts-3-5/test_3-5_0-4_143.py::test_sift

filled_heap = <heap.Heap object at 0x7bcbf5ac44f0>

    def test_sift(filled_heap):
>       filled_heap.sift(1)

ts-3-5/test_3-5_0-4_143.py:34: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
heap:19: in sift
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5ac44f0>, i = 1

>   ???
E   NameError: name 'size' is not defined

heap:27: NameError

   - [# 136] SVD heap: 
--------------------------------------------------------------------------------
  26:             return None
  27:         if (i * 2) + 1 > self.size():
  28:             return i * 2
  29:         
- 30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
+ 30:         elif heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
  31:             return i * 2
  32:         else:
  33:             return (i * 2) + 1
  34:     
--------------------------------------------------------------------------------
[0.17653 s] killed by ts-3-5/test_3-5_0-4_143.py::test_sift

filled_heap = <heap.Heap object at 0x7bcbf5c3c460>

    def test_sift(filled_heap):
>       filled_heap.sift(1)

ts-3-5/test_3-5_0-4_143.py:34: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
heap:19: in sift
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5c3c460>, i = 1

>   ???
E   NameError: name 'heap_list' is not defined

heap:30: NameError

   - [# 137] SVD heap: 
--------------------------------------------------------------------------------
  26:             return None
  27:         if (i * 2) + 1 > self.size():
  28:             return i * 2
  29:         
- 30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
+ 30:         elif self.heap_list[i * 2] < heap_list[(i * 2) + 1]:
  31:             return i * 2
  32:         else:
  33:             return (i * 2) + 1
  34:     
--------------------------------------------------------------------------------
[0.18140 s] killed by ts-3-5/test_3-5_0-4_143.py::test_sift

filled_heap = <heap.Heap object at 0x7bcbf5ec1540>

    def test_sift(filled_heap):
>       filled_heap.sift(1)

ts-3-5/test_3-5_0-4_143.py:34: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
heap:19: in sift
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5ec1540>, i = 1

>   ???
E   NameError: name 'heap_list' is not defined

heap:30: NameError

   - [# 138] SVD heap: 
--------------------------------------------------------------------------------
  32:         else:
  33:             return (i * 2) + 1
  34:     
  35:     def min(self):
- 36:         if len(self.heap_list) > 1:
+ 36:         if len(heap_list) > 1:
  37:             return self.heap_list[1]
  38:         else:
  39:             return None
  40:     
--------------------------------------------------------------------------------
[0.17966 s] killed by ts-3-5/test_3-5_0-4_143.py::test_min

filled_heap = <heap.Heap object at 0x7bcbf5ff3220>

    def test_min(filled_heap):
>       assert filled_heap.min() == 1

ts-3-5/test_3-5_0-4_143.py:41: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5ff3220>

>   ???
E   NameError: name 'heap_list' is not defined

heap:36: NameError

   - [# 139] SVD heap: 
--------------------------------------------------------------------------------
  33:             return (i * 2) + 1
  34:     
  35:     def min(self):
  36:         if len(self.heap_list) > 1:
- 37:             return self.heap_list[1]
+ 37:             return heap_list[1]
  38:         else:
  39:             return None
  40:     
  41:     def delete_min(self):
--------------------------------------------------------------------------------
[0.18619 s] killed by ts-3-5/test_3-5_0-4_143.py::test_min

filled_heap = <heap.Heap object at 0x7bcbf617bc10>

    def test_min(filled_heap):
>       assert filled_heap.min() == 1

ts-3-5/test_3-5_0-4_143.py:41: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf617bc10>

>   ???
E   NameError: name 'heap_list' is not defined

heap:37: NameError

   - [# 140] SVD heap: 
--------------------------------------------------------------------------------
  38:         else:
  39:             return None
  40:     
  41:     def delete_min(self):
- 42:         if self.size() == 0:
+ 42:         if size() == 0:
  43:             return None
  44:         if self.size() == 1:
  45:             return self.heap_list.pop()
  46:         
--------------------------------------------------------------------------------
[0.18311 s] killed by ts-3-5/test_3-5_0-4_143.py::test_delete_min

filled_heap = <heap.Heap object at 0x7bcbf5f75ff0>

    def test_delete_min(filled_heap):
>       assert filled_heap.delete_min() == 1

ts-3-5/test_3-5_0-4_143.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5f75ff0>

>   ???
E   NameError: name 'size' is not defined

heap:42: NameError

   - [# 141] SVD heap: 
--------------------------------------------------------------------------------
  40:     
  41:     def delete_min(self):
  42:         if self.size() == 0:
  43:             return None
- 44:         if self.size() == 1:
+ 44:         if size() == 1:
  45:             return self.heap_list.pop()
  46:         
  47:         min_val = self.heap_list[1]
  48:         self.heap_list[1] = self.heap_list.pop()
--------------------------------------------------------------------------------
[0.18333 s] killed by ts-3-5/test_3-5_0-4_143.py::test_delete_min

filled_heap = <heap.Heap object at 0x7bcbf5f31210>

    def test_delete_min(filled_heap):
>       assert filled_heap.delete_min() == 1

ts-3-5/test_3-5_0-4_143.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5f31210>

>   ???
E   NameError: name 'size' is not defined

heap:44: NameError

   - [# 142] SVD heap: 
--------------------------------------------------------------------------------
  41:     def delete_min(self):
  42:         if self.size() == 0:
  43:             return None
  44:         if self.size() == 1:
- 45:             return self.heap_list.pop()
+ 45:             return heap_list.pop()
  46:         
  47:         min_val = self.heap_list[1]
  48:         self.heap_list[1] = self.heap_list.pop()
  49:         self.sift(1)
--------------------------------------------------------------------------------
[0.16166 s] survived

   - [# 143] SVD heap: 
--------------------------------------------------------------------------------
  43:             return None
  44:         if self.size() == 1:
  45:             return self.heap_list.pop()
  46:         
- 47:         min_val = self.heap_list[1]
+ 47:         min_val = heap_list[1]
  48:         self.heap_list[1] = self.heap_list.pop()
  49:         self.sift(1)
  50:         return min_val
  51:     
--------------------------------------------------------------------------------
[0.17939 s] killed by ts-3-5/test_3-5_0-4_143.py::test_delete_min

filled_heap = <heap.Heap object at 0x7bcbf5b7c0d0>

    def test_delete_min(filled_heap):
>       assert filled_heap.delete_min() == 1

ts-3-5/test_3-5_0-4_143.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5b7c0d0>

>   ???
E   NameError: name 'heap_list' is not defined

heap:47: NameError

   - [# 144] SVD heap: 
--------------------------------------------------------------------------------
  44:         if self.size() == 1:
  45:             return self.heap_list.pop()
  46:         
  47:         min_val = self.heap_list[1]
- 48:         self.heap_list[1] = self.heap_list.pop()
+ 48:         heap_list[1] = self.heap_list.pop()
  49:         self.sift(1)
  50:         return min_val
  51:     
  52:     def build(self, lst: list):
--------------------------------------------------------------------------------
[0.18364 s] killed by ts-3-5/test_3-5_0-4_143.py::test_delete_min

filled_heap = <heap.Heap object at 0x7bcbf5ac6170>

    def test_delete_min(filled_heap):
>       assert filled_heap.delete_min() == 1

ts-3-5/test_3-5_0-4_143.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5ac6170>

>   ???
E   NameError: name 'heap_list' is not defined

heap:48: NameError

   - [# 145] SVD heap: 
--------------------------------------------------------------------------------
  44:         if self.size() == 1:
  45:             return self.heap_list.pop()
  46:         
  47:         min_val = self.heap_list[1]
- 48:         self.heap_list[1] = self.heap_list.pop()
+ 48:         self.heap_list[1] = heap_list.pop()
  49:         self.sift(1)
  50:         return min_val
  51:     
  52:     def build(self, lst: list):
--------------------------------------------------------------------------------
[0.18291 s] killed by ts-3-5/test_3-5_0-4_143.py::test_delete_min

filled_heap = <heap.Heap object at 0x7bcbf5b7e020>

    def test_delete_min(filled_heap):
>       assert filled_heap.delete_min() == 1

ts-3-5/test_3-5_0-4_143.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5b7e020>

>   ???
E   NameError: name 'heap_list' is not defined

heap:48: NameError

   - [# 146] SVD heap: 
--------------------------------------------------------------------------------
  45:             return self.heap_list.pop()
  46:         
  47:         min_val = self.heap_list[1]
  48:         self.heap_list[1] = self.heap_list.pop()
- 49:         self.sift(1)
+ 49:         sift(1)
  50:         return min_val
  51:     
  52:     def build(self, lst: list):
  53:         i = len(lst) // 2
--------------------------------------------------------------------------------
[0.18486 s] killed by ts-3-5/test_3-5_0-4_143.py::test_delete_min

filled_heap = <heap.Heap object at 0x7bcbf5ccaef0>

    def test_delete_min(filled_heap):
>       assert filled_heap.delete_min() == 1

ts-3-5/test_3-5_0-4_143.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5ccaef0>

>   ???
E   NameError: name 'sift' is not defined

heap:49: NameError

   - [# 148] SVD heap: 
--------------------------------------------------------------------------------
  52:     def build(self, lst: list):
  53:         i = len(lst) // 2
  54:         self.heap_list = [0] + lst
  55:         while i > 0:
- 56:             self.sift(i)
+ 56:             sift(i)
  57:             i -= 1
  58:     
  59:     def size(self):
  60:         return len(self.heap_list) - 1
--------------------------------------------------------------------------------
[0.20275 s] killed by ts-3-5/test_3-5_0-4_143.py::test_build

empty_heap = <heap.Heap object at 0x7bcbf5ec0d60>

    def test_build(empty_heap):
>       empty_heap.build([4, 2, 6, 1, 3])

ts-3-5/test_3-5_0-4_143.py:48: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5ec0d60>, lst = [4, 2, 6, 1, 3]

>   ???
E   NameError: name 'sift' is not defined

heap:56: NameError

   - [# 149] SVD heap: 
--------------------------------------------------------------------------------
  56:             self.sift(i)
  57:             i -= 1
  58:     
  59:     def size(self):
- 60:         return len(self.heap_list) - 1
+ 60:         return len(heap_list) - 1
--------------------------------------------------------------------------------
[0.18390 s] killed by ts-3-5/test_3-5_0-4_143.py::test_insert

empty_heap = <heap.Heap object at 0x7bcbf5afbfa0>

    def test_insert(empty_heap):
>       empty_heap.insert(5)

ts-3-5/test_3-5_0-4_143.py:25: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
heap:8: in insert
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <heap.Heap object at 0x7bcbf5afbfa0>

>   ???
E   NameError: name 'heap_list' is not defined

heap:60: NameError

   - [# 150] ZIL heap: 
--------------------------------------------------------------------------------
   8:         self.percolate(self.size())
   9:     
  10:     def percolate(self, i):
  11:         while i // 2 > 0:
- 12:             parent = i // 2
- 13:             if self.heap_list[i] < self.heap_list[parent]:
- 14:                 (self.heap_list[i], self.heap_list[parent]) = (self.heap_list[parent], self.heap_list[i])
- 15:             i = i // 2
+ 12:             break
+ 13:     
+ 14:     
+ 15:     
  16:     
  17:     def sift(self, i):
  18:         while i * 2 <= self.size():
  19:             mc_i = self.find_min_child_index(i)
--------------------------------------------------------------------------------
[0.18442 s] killed by ts-3-5/test_3-5_0-4_143.py::test_sift

filled_heap = <heap.Heap object at 0x7bcbf5ec2e90>

    def test_sift(filled_heap):
        filled_heap.sift(1)
>       assert filled_heap.heap_list == [0, 1, 3, 7, 5]
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:35: AssertionError

   - [# 151] ZIL heap: 
--------------------------------------------------------------------------------
  15:             i = i // 2
  16:     
  17:     def sift(self, i):
  18:         while i * 2 <= self.size():
- 19:             mc_i = self.find_min_child_index(i)
- 20:             if self.heap_list[i] > self.heap_list[mc_i]:
- 21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
- 22:             i = mc_i
+ 19:             break
+ 20:     
+ 21:     
+ 22:     
  23:     
  24:     def find_min_child_index(self, i):
  25:         if i * 2 > self.size():
  26:             return None
--------------------------------------------------------------------------------
[0.18267 s] killed by ts-3-5/test_3-5_0-4_143.py::test_delete_min

filled_heap = <heap.Heap object at 0x7bcbf5b7c790>

    def test_delete_min(filled_heap):
        assert filled_heap.delete_min() == 1
>       assert filled_heap.heap_list == [0, 3, 5, 7]
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:45: AssertionError

   - [# 152] ZIL heap: 
--------------------------------------------------------------------------------
  52:     def build(self, lst: list):
  53:         i = len(lst) // 2
  54:         self.heap_list = [0] + lst
  55:         while i > 0:
- 56:             self.sift(i)
- 57:             i -= 1
+ 56:             break
+ 57:     
  58:     
  59:     def size(self):
  60:         return len(self.heap_list) - 1
--------------------------------------------------------------------------------
[0.18643 s] killed by ts-3-5/test_3-5_0-4_143.py::test_build

empty_heap = <heap.Heap object at 0x7bcbf5b7c970>

    def test_build(empty_heap):
        empty_heap.build([4, 2, 6, 1, 3])
>       assert empty_heap.heap_list == [0, 1, 2, 6, 4, 3]
E       AssertionError

ts-3-5/test_3-5_0-4_143.py:49: AssertionError
