   - [#  27] AOR heap: 
--------------------------------------------------------------------------------
  27:         if (i * 2) + 1 > self.size():
  28:             return i * 2
  29:         
  30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
- 31:             return i * 2
+ 31:             return i / 2
  32:         else:
  33:             return (i * 2) + 1
  34:     
  35:     def min(self):
--------------------------------------------------------------------------------
[0.18703 s] killed by ts-3-5/test_3-5_0-5_163.py::test_find_min_child_index

filled_heap = <heap.Heap object at 0x75789181dab0>

    def test_find_min_child_index(filled_heap):
>       assert filled_heap.find_min_child_index(1) == 2
E       AssertionError

ts-3-5/test_3-5_0-5_163.py:41: AssertionError

   - [#  70] ROR heap: 
--------------------------------------------------------------------------------
  21:                 (self.heap_list[i], self.heap_list[mc_i]) = (self.heap_list[mc_i], self.heap_list[i])
  22:             i = mc_i
  23:     
  24:     def find_min_child_index(self, i):
- 25:         if i * 2 > self.size():
+ 25:         if i * 2 < self.size():
  26:             return None
  27:         if (i * 2) + 1 > self.size():
  28:             return i * 2
  29:         
--------------------------------------------------------------------------------
[0.19111 s] killed by ts-3-5/test_3-5_0-5_163.py::test_find_min_child_index

filled_heap = <heap.Heap object at 0x757891a65990>

    def test_find_min_child_index(filled_heap):
>       assert filled_heap.find_min_child_index(1) == 2
E       AssertionError

ts-3-5/test_3-5_0-5_163.py:41: AssertionError

   - [# 102] SDL heap: 
--------------------------------------------------------------------------------
  27:         if (i * 2) + 1 > self.size():
  28:             return i * 2
  29:         
  30:         elif self.heap_list[i * 2] < self.heap_list[(i * 2) + 1]:
- 31:             return i * 2
+ 31:             pass
  32:         else:
  33:             return (i * 2) + 1
  34:     
  35:     def min(self):
--------------------------------------------------------------------------------
[0.20051 s] killed by ts-3-5/test_3-5_0-5_163.py::test_find_min_child_index

filled_heap = <heap.Heap object at 0x7578919f09a0>

    def test_find_min_child_index(filled_heap):
>       assert filled_heap.find_min_child_index(1) == 2
E       AssertionError

ts-3-5/test_3-5_0-5_163.py:41: AssertionError
