1 : Job ID a2bd2c4946874320a3f8c612c9e04aa3
test outcome: killed
heapsort.py, start pos: (13, 37), end pos: (13, 38)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -10,7 +10,7 @@
 def max_heap_sort(lst:list):
     copy_list = deepcopy(lst)
     # make all elements negative, so heap is a max heap
-    copy_list = list(map(lambda x: x * -1, copy_list))
+    copy_list = list(map(lambda x: x + -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
     copy_list =  list(map(lambda x: x * -1, copy_list))
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [0, -2, -3, -6...
========================= 1 failed, 3 passed in 0.14s ==========================

2 : Job ID 1d7cacc34c75486e86efc78588b6959f
test outcome: killed
heapsort.py, start pos: (16, 38), end pos: (16, 39)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -13,7 +13,7 @@
     copy_list = list(map(lambda x: x * -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
-    copy_list =  list(map(lambda x: x * -1, copy_list))
+    copy_list =  list(map(lambda x: x + -1, copy_list))
     return copy_list
 def custom_heap_sort(lst:list,sort='min'):
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [-10, -8, -5, ...
========================= 1 failed, 3 passed in 0.16s ==========================

3 : Job ID 2fd0132a9742426d92276bf29cdb7397
test outcome: killed
heapsort.py, start pos: (22, 41), end pos: (22, 42)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 2
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -19,7 +19,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
     if sort == 'max':
-        copy_list = list(map(lambda x: x * -1, copy_list))
+        copy_list = list(map(lambda x: x + -1, copy_list))
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [0, -2,...
========================= 1 failed, 3 passed in 0.16s ==========================

4 : Job ID ea1ee8358eb54ec78c8bc88576b8eb6e
test outcome: killed
heapsort.py, start pos: (27, 43), end pos: (27, 44)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 3
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -24,6 +24,6 @@
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
     if sort == 'max':
-        sorted_list = list(map(lambda x: x * -1, sorted_list))
+        sorted_list = list(map(lambda x: x + -1, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [-10, -...
========================= 1 failed, 3 passed in 0.15s ==========================

5 : Job ID d75aec8f25a14f58a1c1223dd4fdd50d
test outcome: killed
heapsort.py, start pos: (13, 37), end pos: (13, 38)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -10,7 +10,7 @@
 def max_heap_sort(lst:list):
     copy_list = deepcopy(lst)
     # make all elements negative, so heap is a max heap
-    copy_list = list(map(lambda x: x * -1, copy_list))
+    copy_list = list(map(lambda x: x - -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
     copy_list =  list(map(lambda x: x * -1, copy_list))
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [-2, -4, -5, -...
========================= 1 failed, 3 passed in 0.16s ==========================

6 : Job ID 80cb012a24454a4892d705c3fffb6c78
test outcome: killed
heapsort.py, start pos: (16, 38), end pos: (16, 39)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -13,7 +13,7 @@
     copy_list = list(map(lambda x: x * -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
-    copy_list =  list(map(lambda x: x * -1, copy_list))
+    copy_list =  list(map(lambda x: x - -1, copy_list))
     return copy_list
 def custom_heap_sort(lst:list,sort='min'):
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [-8, -6, -3, -...
========================= 1 failed, 3 passed in 0.16s ==========================

7 : Job ID 543962150cab45218a5f9f1c9bc6b728
test outcome: killed
heapsort.py, start pos: (22, 41), end pos: (22, 42)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 2
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -19,7 +19,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
     if sort == 'max':
-        copy_list = list(map(lambda x: x * -1, copy_list))
+        copy_list = list(map(lambda x: x - -1, copy_list))
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [-2, -4...
========================= 1 failed, 3 passed in 0.17s ==========================

8 : Job ID 271d87caaf364621998d0f284f1e8436
test outcome: killed
heapsort.py, start pos: (27, 43), end pos: (27, 44)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 3
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -24,6 +24,6 @@
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
     if sort == 'max':
-        sorted_list = list(map(lambda x: x * -1, sorted_list))
+        sorted_list = list(map(lambda x: x - -1, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [-8, -6...
========================= 1 failed, 3 passed in 0.17s ==========================

9 : Job ID 64fbf7ff746048559c7f7d62f19db987
SURVIVED
test outcome: survived
heapsort.py, start pos: (13, 37), end pos: (13, 38)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -10,7 +10,7 @@
 def max_heap_sort(lst:list):
     copy_list = deepcopy(lst)
     # make all elements negative, so heap is a max heap
-    copy_list = list(map(lambda x: x * -1, copy_list))
+    copy_list = list(map(lambda x: x / -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
     copy_list =  list(map(lambda x: x * -1, copy_list))
ts-3-5/test_3-5_0-6_210.py ....                                          [100%]
============================== 4 passed in 0.16s ===============================

10 : Job ID 054518d43e7e4d069ec2351180406b4b
SURVIVED
test outcome: survived
heapsort.py, start pos: (16, 38), end pos: (16, 39)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -13,7 +13,7 @@
     copy_list = list(map(lambda x: x * -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
-    copy_list =  list(map(lambda x: x * -1, copy_list))
+    copy_list =  list(map(lambda x: x / -1, copy_list))
     return copy_list
 def custom_heap_sort(lst:list,sort='min'):
ts-3-5/test_3-5_0-6_210.py ....                                          [100%]
============================== 4 passed in 0.16s ===============================

11 : Job ID 97c3337c4ec341379c8ebc7bbae44b11
SURVIVED
test outcome: survived
heapsort.py, start pos: (22, 41), end pos: (22, 42)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 2
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -19,7 +19,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
     if sort == 'max':
-        copy_list = list(map(lambda x: x * -1, copy_list))
+        copy_list = list(map(lambda x: x / -1, copy_list))
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
ts-3-5/test_3-5_0-6_210.py ....                                          [100%]
============================== 4 passed in 0.15s ===============================

12 : Job ID e732d233b0624e3ba9f7e81ef7b4342c
SURVIVED
test outcome: survived
heapsort.py, start pos: (27, 43), end pos: (27, 44)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 3
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -24,6 +24,6 @@
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
     if sort == 'max':
-        sorted_list = list(map(lambda x: x * -1, sorted_list))
+        sorted_list = list(map(lambda x: x / -1, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ....                                          [100%]
============================== 4 passed in 0.17s ===============================

13 : Job ID e20d1ad4911842de82d1e86b6810662d
SURVIVED
test outcome: survived
heapsort.py, start pos: (13, 37), end pos: (13, 38)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -10,7 +10,7 @@
 def max_heap_sort(lst:list):
     copy_list = deepcopy(lst)
     # make all elements negative, so heap is a max heap
-    copy_list = list(map(lambda x: x * -1, copy_list))
+    copy_list = list(map(lambda x: x // -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
     copy_list =  list(map(lambda x: x * -1, copy_list))
ts-3-5/test_3-5_0-6_210.py ....                                          [100%]
============================== 4 passed in 0.16s ===============================

14 : Job ID ffdb0af81aad42aeb6ed0ae046157e1b
SURVIVED
test outcome: survived
heapsort.py, start pos: (16, 38), end pos: (16, 39)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -13,7 +13,7 @@
     copy_list = list(map(lambda x: x * -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
-    copy_list =  list(map(lambda x: x * -1, copy_list))
+    copy_list =  list(map(lambda x: x // -1, copy_list))
     return copy_list
 def custom_heap_sort(lst:list,sort='min'):
ts-3-5/test_3-5_0-6_210.py ....                                          [100%]
============================== 4 passed in 0.16s ===============================

15 : Job ID 4fde562af73f4c76bc27bbf5b32d43df
SURVIVED
test outcome: survived
heapsort.py, start pos: (22, 41), end pos: (22, 42)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 2
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -19,7 +19,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
     if sort == 'max':
-        copy_list = list(map(lambda x: x * -1, copy_list))
+        copy_list = list(map(lambda x: x // -1, copy_list))
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
ts-3-5/test_3-5_0-6_210.py ....                                          [100%]
============================== 4 passed in 0.15s ===============================

16 : Job ID 95ec806028834987be22b166ff2ce240
SURVIVED
test outcome: survived
heapsort.py, start pos: (27, 43), end pos: (27, 44)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 3
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -24,6 +24,6 @@
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
     if sort == 'max':
-        sorted_list = list(map(lambda x: x * -1, sorted_list))
+        sorted_list = list(map(lambda x: x // -1, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ....                                          [100%]
============================== 4 passed in 0.16s ===============================

17 : Job ID c5681cdb309f487d9fbb7abb48beef6c
test outcome: killed
heapsort.py, start pos: (13, 37), end pos: (13, 38)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -10,7 +10,7 @@
 def max_heap_sort(lst:list):
     copy_list = deepcopy(lst)
     # make all elements negative, so heap is a max heap
-    copy_list = list(map(lambda x: x * -1, copy_list))
+    copy_list = list(map(lambda x: x % -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
     copy_list =  list(map(lambda x: x * -1, copy_list))
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [0, 0, 0, 0, 0...
========================= 1 failed, 3 passed in 0.16s ==========================

18 : Job ID 08c09ccab56e4708b42951fd43a53ca8
test outcome: killed
heapsort.py, start pos: (16, 38), end pos: (16, 39)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -13,7 +13,7 @@
     copy_list = list(map(lambda x: x * -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
-    copy_list =  list(map(lambda x: x * -1, copy_list))
+    copy_list =  list(map(lambda x: x % -1, copy_list))
     return copy_list
 def custom_heap_sort(lst:list,sort='min'):
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [0, 0, 0, 0, 0...
========================= 1 failed, 3 passed in 0.17s ==========================

19 : Job ID e9f886229db64891a53ffc308651d9c1
test outcome: killed
heapsort.py, start pos: (22, 41), end pos: (22, 42)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 2
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -19,7 +19,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
     if sort == 'max':
-        copy_list = list(map(lambda x: x * -1, copy_list))
+        copy_list = list(map(lambda x: x % -1, copy_list))
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [0, 0, ...
========================= 1 failed, 3 passed in 0.16s ==========================

20 : Job ID a1dc4c4fc68f424388f9a23096a16000
test outcome: killed
heapsort.py, start pos: (27, 43), end pos: (27, 44)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 3
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -24,6 +24,6 @@
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
     if sort == 'max':
-        sorted_list = list(map(lambda x: x * -1, sorted_list))
+        sorted_list = list(map(lambda x: x % -1, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [0, 0, ...
========================= 1 failed, 3 passed in 0.16s ==========================

21 : Job ID 956c4b131e3e425b97da2295a3c8f4a1
test outcome: killed
heapsort.py, start pos: (13, 37), end pos: (13, 38)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -10,7 +10,7 @@
 def max_heap_sort(lst:list):
     copy_list = deepcopy(lst)
     # make all elements negative, so heap is a max heap
-    copy_list = list(map(lambda x: x * -1, copy_list))
+    copy_list = list(map(lambda x: x ** -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
     copy_list =  list(map(lambda x: x * -1, copy_list))
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [-0.111111111....
========================= 1 failed, 3 passed in 0.16s ==========================

22 : Job ID f044b85fd17a4be98ae335b3981a7d15
test outcome: killed
heapsort.py, start pos: (16, 38), end pos: (16, 39)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -13,7 +13,7 @@
     copy_list = list(map(lambda x: x * -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
-    copy_list =  list(map(lambda x: x * -1, copy_list))
+    copy_list =  list(map(lambda x: x ** -1, copy_list))
     return copy_list
 def custom_heap_sort(lst:list,sort='min'):
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [-0.111111111....
========================= 1 failed, 3 passed in 0.16s ==========================

23 : Job ID 41565997e1d240579c2e235b60440cba
test outcome: killed
heapsort.py, start pos: (22, 41), end pos: (22, 42)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 2
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -19,7 +19,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
     if sort == 'max':
-        copy_list = list(map(lambda x: x * -1, copy_list))
+        copy_list = list(map(lambda x: x ** -1, copy_list))
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [-0.111...
========================= 1 failed, 3 passed in 0.16s ==========================

24 : Job ID 25f2fe6121934588aaa0ba2636afcc1e
test outcome: killed
heapsort.py, start pos: (27, 43), end pos: (27, 44)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 3
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -24,6 +24,6 @@
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
     if sort == 'max':
-        sorted_list = list(map(lambda x: x * -1, sorted_list))
+        sorted_list = list(map(lambda x: x ** -1, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [-0.111...
========================= 1 failed, 3 passed in 0.16s ==========================

25 : Job ID 8fe02bee37ee42a9814cd6ee9f1058c9
test outcome: killed
heapsort.py, start pos: (13, 37), end pos: (13, 38)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -10,7 +10,7 @@
 def max_heap_sort(lst:list):
     copy_list = deepcopy(lst)
     # make all elements negative, so heap is a max heap
-    copy_list = list(map(lambda x: x * -1, copy_list))
+    copy_list = list(map(lambda x: x >> -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
     copy_list =  list(map(lambda x: x * -1, copy_list))
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - ValueError: negative ...
========================= 1 failed, 3 passed in 0.15s ==========================

26 : Job ID fb932586a18444fca5575cae53a66581
test outcome: killed
heapsort.py, start pos: (16, 38), end pos: (16, 39)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -13,7 +13,7 @@
     copy_list = list(map(lambda x: x * -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
-    copy_list =  list(map(lambda x: x * -1, copy_list))
+    copy_list =  list(map(lambda x: x >> -1, copy_list))
     return copy_list
 def custom_heap_sort(lst:list,sort='min'):
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - ValueError: negative ...
========================= 1 failed, 3 passed in 0.16s ==========================

27 : Job ID 922f8162f03a4c51b616e7972c811711
test outcome: killed
heapsort.py, start pos: (22, 41), end pos: (22, 42)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 2
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -19,7 +19,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
     if sort == 'max':
-        copy_list = list(map(lambda x: x * -1, copy_list))
+        copy_list = list(map(lambda x: x >> -1, copy_list))
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - ValueError: ne...
========================= 1 failed, 3 passed in 0.17s ==========================

28 : Job ID e82d8667ef67449d8f0cac1edd468347
test outcome: killed
heapsort.py, start pos: (27, 43), end pos: (27, 44)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 3
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -24,6 +24,6 @@
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
     if sort == 'max':
-        sorted_list = list(map(lambda x: x * -1, sorted_list))
+        sorted_list = list(map(lambda x: x >> -1, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - ValueError: ne...
========================= 1 failed, 3 passed in 0.16s ==========================

29 : Job ID b05ed91bdc7a47aaa9b800407f238f8e
test outcome: killed
heapsort.py, start pos: (13, 37), end pos: (13, 38)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -10,7 +10,7 @@
 def max_heap_sort(lst:list):
     copy_list = deepcopy(lst)
     # make all elements negative, so heap is a max heap
-    copy_list = list(map(lambda x: x * -1, copy_list))
+    copy_list = list(map(lambda x: x << -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
     copy_list =  list(map(lambda x: x * -1, copy_list))
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - ValueError: negative ...
========================= 1 failed, 3 passed in 0.16s ==========================

30 : Job ID 095085f35a3942caaaf46ce8b9604742
test outcome: killed
heapsort.py, start pos: (16, 38), end pos: (16, 39)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -13,7 +13,7 @@
     copy_list = list(map(lambda x: x * -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
-    copy_list =  list(map(lambda x: x * -1, copy_list))
+    copy_list =  list(map(lambda x: x << -1, copy_list))
     return copy_list
 def custom_heap_sort(lst:list,sort='min'):
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - ValueError: negative ...
========================= 1 failed, 3 passed in 0.16s ==========================

31 : Job ID 365aa846fe734157ae1df08b8efb906f
test outcome: killed
heapsort.py, start pos: (22, 41), end pos: (22, 42)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 2
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -19,7 +19,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
     if sort == 'max':
-        copy_list = list(map(lambda x: x * -1, copy_list))
+        copy_list = list(map(lambda x: x << -1, copy_list))
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - ValueError: ne...
========================= 1 failed, 3 passed in 0.15s ==========================

32 : Job ID d4f3790a251c4314a857ad74fbb77954
test outcome: killed
heapsort.py, start pos: (27, 43), end pos: (27, 44)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 3
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -24,6 +24,6 @@
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
     if sort == 'max':
-        sorted_list = list(map(lambda x: x * -1, sorted_list))
+        sorted_list = list(map(lambda x: x << -1, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - ValueError: ne...
========================= 1 failed, 3 passed in 0.14s ==========================

33 : Job ID 2c40339e860a44879c15ddd40f982370
test outcome: killed
heapsort.py, start pos: (13, 37), end pos: (13, 38)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -10,7 +10,7 @@
 def max_heap_sort(lst:list):
     copy_list = deepcopy(lst)
     # make all elements negative, so heap is a max heap
-    copy_list = list(map(lambda x: x * -1, copy_list))
+    copy_list = list(map(lambda x: x | -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
     copy_list =  list(map(lambda x: x * -1, copy_list))
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [1, 1, 1, 1, 1...
========================= 1 failed, 3 passed in 0.16s ==========================

34 : Job ID 215d2ce9b9a44975bf84d23048a7d368
test outcome: killed
heapsort.py, start pos: (16, 38), end pos: (16, 39)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -13,7 +13,7 @@
     copy_list = list(map(lambda x: x * -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
-    copy_list =  list(map(lambda x: x * -1, copy_list))
+    copy_list =  list(map(lambda x: x | -1, copy_list))
     return copy_list
 def custom_heap_sort(lst:list,sort='min'):
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [-1, -1, -1, -...
========================= 1 failed, 3 passed in 0.16s ==========================
