35 : Job ID 7813729b9eb846f6ba3f99186a07267b
test outcome: killed
heapsort.py, start pos: (22, 41), end pos: (22, 42)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 2
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -19,7 +19,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
     if sort == 'max':
-        copy_list = list(map(lambda x: x * -1, copy_list))
+        copy_list = list(map(lambda x: x | -1, copy_list))
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [1, 1, ...
========================= 1 failed, 3 passed in 0.16s ==========================

36 : Job ID e5571d07a23d4f70ac43bdb3e2748248
test outcome: killed
heapsort.py, start pos: (27, 43), end pos: (27, 44)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 3
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -24,6 +24,6 @@
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
     if sort == 'max':
-        sorted_list = list(map(lambda x: x * -1, sorted_list))
+        sorted_list = list(map(lambda x: x | -1, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [-1, -1...
========================= 1 failed, 3 passed in 0.16s ==========================

37 : Job ID b5a4e49e8aa54938934a08e8d8fef8a4
test outcome: killed
heapsort.py, start pos: (13, 37), end pos: (13, 38)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -10,7 +10,7 @@
 def max_heap_sort(lst:list):
     copy_list = deepcopy(lst)
     # make all elements negative, so heap is a max heap
-    copy_list = list(map(lambda x: x * -1, copy_list))
+    copy_list = list(map(lambda x: x & -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
     copy_list =  list(map(lambda x: x * -1, copy_list))
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [-1, -3, -4, -...
========================= 1 failed, 3 passed in 0.18s ==========================

38 : Job ID 847ad2fc70bf4714b8459d788cbe2098
test outcome: killed
heapsort.py, start pos: (16, 38), end pos: (16, 39)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -13,7 +13,7 @@
     copy_list = list(map(lambda x: x * -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
-    copy_list =  list(map(lambda x: x * -1, copy_list))
+    copy_list =  list(map(lambda x: x & -1, copy_list))
     return copy_list
 def custom_heap_sort(lst:list,sort='min'):
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [-9, -7, -4, -...
========================= 1 failed, 3 passed in 0.16s ==========================

39 : Job ID b52393497c3b403a8166953a9e56e29d
test outcome: killed
heapsort.py, start pos: (22, 41), end pos: (22, 42)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 2
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -19,7 +19,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
     if sort == 'max':
-        copy_list = list(map(lambda x: x * -1, copy_list))
+        copy_list = list(map(lambda x: x & -1, copy_list))
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [-1, -3...
========================= 1 failed, 3 passed in 0.16s ==========================

40 : Job ID 1a40ca4fbd48444189f14b20671235b4
test outcome: killed
heapsort.py, start pos: (27, 43), end pos: (27, 44)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 3
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -24,6 +24,6 @@
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
     if sort == 'max':
-        sorted_list = list(map(lambda x: x * -1, sorted_list))
+        sorted_list = list(map(lambda x: x & -1, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [-9, -7...
========================= 1 failed, 3 passed in 0.17s ==========================

41 : Job ID 8e5dee4cc23d47efbc9dc3c046d5b9e7
test outcome: killed
heapsort.py, start pos: (13, 37), end pos: (13, 38)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -10,7 +10,7 @@
 def max_heap_sort(lst:list):
     copy_list = deepcopy(lst)
     # make all elements negative, so heap is a max heap
-    copy_list = list(map(lambda x: x * -1, copy_list))
+    copy_list = list(map(lambda x: x ^ -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
     copy_list =  list(map(lambda x: x * -1, copy_list))
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [10, 8, 5, 4, ...
========================= 1 failed, 3 passed in 0.17s ==========================

42 : Job ID 27916c4b795c4886b9d4734a1b97c785
test outcome: killed
heapsort.py, start pos: (16, 38), end pos: (16, 39)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -13,7 +13,7 @@
     copy_list = list(map(lambda x: x * -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
-    copy_list =  list(map(lambda x: x * -1, copy_list))
+    copy_list =  list(map(lambda x: x ^ -1, copy_list))
     return copy_list
 def custom_heap_sort(lst:list,sort='min'):
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [8, 6, 3, 2, 0...
========================= 1 failed, 3 passed in 0.17s ==========================

43 : Job ID d7039cbf3a9d48359156717e88015ce3
test outcome: killed
heapsort.py, start pos: (22, 41), end pos: (22, 42)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 2
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -19,7 +19,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
     if sort == 'max':
-        copy_list = list(map(lambda x: x * -1, copy_list))
+        copy_list = list(map(lambda x: x ^ -1, copy_list))
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [10, 8,...
========================= 1 failed, 3 passed in 0.18s ==========================

44 : Job ID 3d86bc330112484bb0c70e8d40178cc6
test outcome: killed
heapsort.py, start pos: (27, 43), end pos: (27, 44)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 3
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -24,6 +24,6 @@
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
     if sort == 'max':
-        sorted_list = list(map(lambda x: x * -1, sorted_list))
+        sorted_list = list(map(lambda x: x ^ -1, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [8, 6, ...
========================= 1 failed, 3 passed in 0.15s ==========================

45 : Job ID 4af1abddc60e4d5a9acd1261b4009472
test outcome: killed
heapsort.py, start pos: (21, 12), end pos: (21, 14)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -18,7 +18,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
-    if sort == 'max':
+    if sort != 'max':
         copy_list = list(map(lambda x: x * -1, copy_list))
     heap = Heap()
     heap.build(copy_list)
ts-3-5/test_3-5_0-6_210.py ..FF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_min - assert [-9, -7...
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [-1, -3...
========================= 2 failed, 2 passed in 0.16s ==========================

46 : Job ID 7a16bc0f289e47b1a3961c805993e4af
test outcome: killed
heapsort.py, start pos: (26, 12), end pos: (26, 14)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -23,7 +23,7 @@
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
-    if sort == 'max':
+    if sort != 'max':
         sorted_list = list(map(lambda x: x * -1, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ..FF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_min - assert [-1, -3...
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [-9, -7...
========================= 2 failed, 2 passed in 0.17s ==========================

47 : Job ID 7c8dac59edc048da943704c48b6f755d
test outcome: killed
heapsort.py, start pos: (21, 12), end pos: (21, 14)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -18,7 +18,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
-    if sort == 'max':
+    if sort < 'max':
         copy_list = list(map(lambda x: x * -1, copy_list))
     heap = Heap()
     heap.build(copy_list)
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [-1, -3...
========================= 1 failed, 3 passed in 0.17s ==========================

48 : Job ID 6619d10684ad4fa5b19c88e9719f8a72
test outcome: killed
heapsort.py, start pos: (26, 12), end pos: (26, 14)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -23,7 +23,7 @@
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
-    if sort == 'max':
+    if sort < 'max':
         sorted_list = list(map(lambda x: x * -1, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [-9, -7...
========================= 1 failed, 3 passed in 0.17s ==========================

49 : Job ID 083b7a9b78e94f82be0d16deb3443afe
SURVIVED
test outcome: survived
heapsort.py, start pos: (21, 12), end pos: (21, 14)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -18,7 +18,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
-    if sort == 'max':
+    if sort <= 'max':
         copy_list = list(map(lambda x: x * -1, copy_list))
     heap = Heap()
     heap.build(copy_list)
ts-3-5/test_3-5_0-6_210.py ....                                          [100%]
============================== 4 passed in 0.16s ===============================

50 : Job ID 9ed0c5b57124405f8a1f677c972d51d9
SURVIVED
test outcome: survived
heapsort.py, start pos: (26, 12), end pos: (26, 14)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -23,7 +23,7 @@
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
-    if sort == 'max':
+    if sort <= 'max':
         sorted_list = list(map(lambda x: x * -1, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ....                                          [100%]
============================== 4 passed in 0.16s ===============================

51 : Job ID ec9cb89932bf4a01b99877c4eac4faf0
test outcome: killed
heapsort.py, start pos: (21, 12), end pos: (21, 14)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -18,7 +18,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
-    if sort == 'max':
+    if sort > 'max':
         copy_list = list(map(lambda x: x * -1, copy_list))
     heap = Heap()
     heap.build(copy_list)
ts-3-5/test_3-5_0-6_210.py ..FF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_min - assert [-9, -7...
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [-1, -3...
========================= 2 failed, 2 passed in 0.17s ==========================

52 : Job ID 2f33d45f38c3452e89dea0526cdf976b
test outcome: killed
heapsort.py, start pos: (26, 12), end pos: (26, 14)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -23,7 +23,7 @@
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
-    if sort == 'max':
+    if sort > 'max':
         sorted_list = list(map(lambda x: x * -1, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ..FF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_min - assert [-1, -3...
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [-9, -7...
========================= 2 failed, 2 passed in 0.17s ==========================

53 : Job ID 0c88a3fa2727448e99ace070e5a5bcdb
test outcome: killed
heapsort.py, start pos: (21, 12), end pos: (21, 14)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -18,7 +18,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
-    if sort == 'max':
+    if sort >= 'max':
         copy_list = list(map(lambda x: x * -1, copy_list))
     heap = Heap()
     heap.build(copy_list)
ts-3-5/test_3-5_0-6_210.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_min - assert [-9, -7...
========================= 1 failed, 3 passed in 0.15s ==========================

54 : Job ID 573a3a7d638b44e588f514d81df6b45e
test outcome: killed
heapsort.py, start pos: (26, 12), end pos: (26, 14)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -23,7 +23,7 @@
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
-    if sort == 'max':
+    if sort >= 'max':
         sorted_list = list(map(lambda x: x * -1, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_min - assert [-1, -3...
========================= 1 failed, 3 passed in 0.16s ==========================

55 : Job ID 5435196c839b4f7aa31ac3bb86bc7ce8
SURVIVED
test outcome: survived
heapsort.py, start pos: (21, 12), end pos: (21, 14)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -18,7 +18,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
-    if sort == 'max':
+    if sort is 'max':
         copy_list = list(map(lambda x: x * -1, copy_list))
     heap = Heap()
     heap.build(copy_list)
ts-3-5/test_3-5_0-6_210.py ....                                          [100%]
=============================== warnings summary ===============================
heapsort.py:21
  /home/lucca/teste/python_experiments2/heapsort/heapsort.py:21: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if sort is 'max':
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
========================= 4 passed, 1 warning in 0.18s =========================

56 : Job ID 6832d64320164df9b64082ded82f1f4a
SURVIVED
test outcome: survived
heapsort.py, start pos: (26, 12), end pos: (26, 14)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -23,7 +23,7 @@
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
-    if sort == 'max':
+    if sort is 'max':
         sorted_list = list(map(lambda x: x * -1, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ....                                          [100%]
=============================== warnings summary ===============================
heapsort.py:26
  /home/lucca/teste/python_experiments2/heapsort/heapsort.py:26: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if sort is 'max':
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
========================= 4 passed, 1 warning in 0.16s =========================

57 : Job ID ec8225b0178f46359288a3036f713e84
test outcome: killed
heapsort.py, start pos: (21, 12), end pos: (21, 14)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -18,7 +18,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
-    if sort == 'max':
+    if sort is not 'max':
         copy_list = list(map(lambda x: x * -1, copy_list))
     heap = Heap()
     heap.build(copy_list)
ts-3-5/test_3-5_0-6_210.py ..FF                                          [100%]
=============================== warnings summary ===============================
heapsort.py:21
  /home/lucca/teste/python_experiments2/heapsort/heapsort.py:21: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if sort is not 'max':
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_min - assert [-9, -7...
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [-1, -3...
==================== 2 failed, 2 passed, 1 warning in 0.14s ====================

58 : Job ID 72775ca5e28b44859be49d926b913083
test outcome: killed
heapsort.py, start pos: (26, 12), end pos: (26, 14)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -23,7 +23,7 @@
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
-    if sort == 'max':
+    if sort is not 'max':
         sorted_list = list(map(lambda x: x * -1, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ..FF                                          [100%]
=============================== warnings summary ===============================
heapsort.py:26
  /home/lucca/teste/python_experiments2/heapsort/heapsort.py:26: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if sort is not 'max':
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_min - assert [-1, -3...
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [-9, -7...
==================== 2 failed, 2 passed, 1 warning in 0.16s ====================

59 : Job ID e334ad66c6ce46e782b761d1cd881857
test outcome: killed
heapsort.py, start pos: (13, 39), end pos: (13, 40)
operator: core/ReplaceUnaryOperator_USub_UAdd, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -10,7 +10,7 @@
 def max_heap_sort(lst:list):
     copy_list = deepcopy(lst)
     # make all elements negative, so heap is a max heap
-    copy_list = list(map(lambda x: x * -1, copy_list))
+    copy_list = list(map(lambda x: x * +1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
     copy_list =  list(map(lambda x: x * -1, copy_list))
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [-1, -3, -4, -...
========================= 1 failed, 3 passed in 0.15s ==========================

60 : Job ID efd42bd7cd0a47c6b843ba1f0316491c
test outcome: killed
heapsort.py, start pos: (16, 40), end pos: (16, 41)
operator: core/ReplaceUnaryOperator_USub_UAdd, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -13,7 +13,7 @@
     copy_list = list(map(lambda x: x * -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
-    copy_list =  list(map(lambda x: x * -1, copy_list))
+    copy_list =  list(map(lambda x: x * +1, copy_list))
     return copy_list
 def custom_heap_sort(lst:list,sort='min'):
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [-9, -7, -4, -...
========================= 1 failed, 3 passed in 0.14s ==========================

61 : Job ID 7200005674954fe68d7e734f94de5f8a
test outcome: killed
heapsort.py, start pos: (22, 43), end pos: (22, 44)
operator: core/ReplaceUnaryOperator_USub_UAdd, occurrence: 2
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -19,7 +19,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
     if sort == 'max':
-        copy_list = list(map(lambda x: x * -1, copy_list))
+        copy_list = list(map(lambda x: x * +1, copy_list))
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [-1, -3...
========================= 1 failed, 3 passed in 0.15s ==========================

62 : Job ID 037a3252090e4681a72f3405f1a31122
test outcome: killed
heapsort.py, start pos: (27, 45), end pos: (27, 46)
operator: core/ReplaceUnaryOperator_USub_UAdd, occurrence: 3
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -24,6 +24,6 @@
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
     if sort == 'max':
-        sorted_list = list(map(lambda x: x * -1, sorted_list))
+        sorted_list = list(map(lambda x: x * +1, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [-9, -7...
========================= 1 failed, 3 passed in 0.16s ==========================

63 : Job ID e56de669e0024afd9b8e101b4744525d
test outcome: killed
heapsort.py, start pos: (13, 39), end pos: (13, 40)
operator: core/ReplaceUnaryOperator_USub_Invert, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -10,7 +10,7 @@
 def max_heap_sort(lst:list):
     copy_list = deepcopy(lst)
     # make all elements negative, so heap is a max heap
-    copy_list = list(map(lambda x: x * -1, copy_list))
+    copy_list = list(map(lambda x: x * ~1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
     copy_list =  list(map(lambda x: x * -1, copy_list))
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [18, 14, 8, 6,...
========================= 1 failed, 3 passed in 0.16s ==========================

64 : Job ID f9c7e5d0cf65476dbe60805d1d064dd3
test outcome: killed
heapsort.py, start pos: (16, 40), end pos: (16, 41)
operator: core/ReplaceUnaryOperator_USub_Invert, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -13,7 +13,7 @@
     copy_list = list(map(lambda x: x * -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
-    copy_list =  list(map(lambda x: x * -1, copy_list))
+    copy_list =  list(map(lambda x: x * ~1, copy_list))
     return copy_list
 def custom_heap_sort(lst:list,sort='min'):
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [18, 14, 8, 6,...
========================= 1 failed, 3 passed in 0.16s ==========================

65 : Job ID d26c8a1d0a5c40b983d4ecbdbc69091e
test outcome: killed
heapsort.py, start pos: (22, 43), end pos: (22, 44)
operator: core/ReplaceUnaryOperator_USub_Invert, occurrence: 2
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -19,7 +19,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
     if sort == 'max':
-        copy_list = list(map(lambda x: x * -1, copy_list))
+        copy_list = list(map(lambda x: x * ~1, copy_list))
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [18, 14...
========================= 1 failed, 3 passed in 0.16s ==========================

66 : Job ID 150a3821be374fadb7f3aed81c9e3c50
test outcome: killed
heapsort.py, start pos: (27, 45), end pos: (27, 46)
operator: core/ReplaceUnaryOperator_USub_Invert, occurrence: 3
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -24,6 +24,6 @@
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
     if sort == 'max':
-        sorted_list = list(map(lambda x: x * -1, sorted_list))
+        sorted_list = list(map(lambda x: x * ~1, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [18, 14...
========================= 1 failed, 3 passed in 0.16s ==========================

67 : Job ID 90a03ed935434b1abc56356c68564d0a
test outcome: killed
heapsort.py, start pos: (13, 39), end pos: (13, 40)
operator: core/ReplaceUnaryOperator_USub_Not, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -10,7 +10,7 @@
 def max_heap_sort(lst:list):
     copy_list = deepcopy(lst)
     # make all elements negative, so heap is a max heap
-    copy_list = list(map(lambda x: x * -1, copy_list))
+    copy_list = list(map(lambda x: x * not 1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
     copy_list =  list(map(lambda x: x * -1, copy_list))
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-6_210.py
!!!!!!!!!!!!!!!!!!!! Interrupted: 1 error during collection !!!!!!!!!!!!!!!!!!!!
=============================== 1 error in 0.33s ===============================
