68 : Job ID 0cdc822a2c0341f7b198f60b667676fb
test outcome: killed
heapsort.py, start pos: (16, 40), end pos: (16, 41)
operator: core/ReplaceUnaryOperator_USub_Not, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -13,7 +13,7 @@
     copy_list = list(map(lambda x: x * -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
-    copy_list =  list(map(lambda x: x * -1, copy_list))
+    copy_list =  list(map(lambda x: x * not 1, copy_list))
     return copy_list
 def custom_heap_sort(lst:list,sort='min'):
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-6_210.py
!!!!!!!!!!!!!!!!!!!! Interrupted: 1 error during collection !!!!!!!!!!!!!!!!!!!!
=============================== 1 error in 0.32s ===============================

69 : Job ID d4906332d2a441b59f02cf5500dd8be6
test outcome: killed
heapsort.py, start pos: (22, 43), end pos: (22, 44)
operator: core/ReplaceUnaryOperator_USub_Not, occurrence: 2
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -19,7 +19,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
     if sort == 'max':
-        copy_list = list(map(lambda x: x * -1, copy_list))
+        copy_list = list(map(lambda x: x * not 1, copy_list))
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-6_210.py
!!!!!!!!!!!!!!!!!!!! Interrupted: 1 error during collection !!!!!!!!!!!!!!!!!!!!
=============================== 1 error in 0.32s ===============================

70 : Job ID cd7218bd659d4457aa28ac437bbf610a
test outcome: killed
heapsort.py, start pos: (27, 45), end pos: (27, 46)
operator: core/ReplaceUnaryOperator_USub_Not, occurrence: 3
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -24,6 +24,6 @@
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
     if sort == 'max':
-        sorted_list = list(map(lambda x: x * -1, sorted_list))
+        sorted_list = list(map(lambda x: x * not 1, sorted_list))
     return sorted_list
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-6_210.py
!!!!!!!!!!!!!!!!!!!! Interrupted: 1 error during collection !!!!!!!!!!!!!!!!!!!!
=============================== 1 error in 0.33s ===============================

71 : Job ID 72d7eb793ab342fd859d7b72d5fb8d17
test outcome: killed
heapsort.py, start pos: (13, 39), end pos: (13, 40)
operator: core/ReplaceUnaryOperator_Delete_USub, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -10,7 +10,7 @@
 def max_heap_sort(lst:list):
     copy_list = deepcopy(lst)
     # make all elements negative, so heap is a max heap
-    copy_list = list(map(lambda x: x * -1, copy_list))
+    copy_list = list(map(lambda x: x * 1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
     copy_list =  list(map(lambda x: x * -1, copy_list))
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [-1, -3, -4, -...
========================= 1 failed, 3 passed in 0.16s ==========================

72 : Job ID 1b7253f8207b47dca2f6aae3e5699440
test outcome: killed
heapsort.py, start pos: (16, 40), end pos: (16, 41)
operator: core/ReplaceUnaryOperator_Delete_USub, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -13,7 +13,7 @@
     copy_list = list(map(lambda x: x * -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
-    copy_list =  list(map(lambda x: x * -1, copy_list))
+    copy_list =  list(map(lambda x: x * 1, copy_list))
     return copy_list
 def custom_heap_sort(lst:list,sort='min'):
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [-9, -7, -4, -...
========================= 1 failed, 3 passed in 0.16s ==========================

73 : Job ID 7ba050865264427bae6fe49620f77e5e
test outcome: killed
heapsort.py, start pos: (22, 43), end pos: (22, 44)
operator: core/ReplaceUnaryOperator_Delete_USub, occurrence: 2
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -19,7 +19,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
     if sort == 'max':
-        copy_list = list(map(lambda x: x * -1, copy_list))
+        copy_list = list(map(lambda x: x * 1, copy_list))
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [-1, -3...
========================= 1 failed, 3 passed in 0.15s ==========================

74 : Job ID 109c2ab51fbf4844b0c49cc3cc0ea0ce
test outcome: killed
heapsort.py, start pos: (27, 45), end pos: (27, 46)
operator: core/ReplaceUnaryOperator_Delete_USub, occurrence: 3
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -24,6 +24,6 @@
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
     if sort == 'max':
-        sorted_list = list(map(lambda x: x * -1, sorted_list))
+        sorted_list = list(map(lambda x: x * 1, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [-9, -7...
========================= 1 failed, 3 passed in 0.16s ==========================

75 : Job ID 7f2856bd70ca46448add6fb16162fdbd
test outcome: killed
heapsort.py, start pos: (21, 7), end pos: (21, 20)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -18,7 +18,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
-    if sort == 'max':
+    if not sort == 'max':
         copy_list = list(map(lambda x: x * -1, copy_list))
     heap = Heap()
     heap.build(copy_list)
ts-3-5/test_3-5_0-6_210.py ..FF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_min - assert [-9, -7...
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [-1, -3...
========================= 2 failed, 2 passed in 0.16s ==========================

76 : Job ID afa4a7ad162d4e978530faafcb539388
test outcome: killed
heapsort.py, start pos: (26, 7), end pos: (26, 20)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -23,7 +23,7 @@
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
-    if sort == 'max':
+    if not sort == 'max':
         sorted_list = list(map(lambda x: x * -1, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ..FF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_min - assert [-1, -3...
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [-9, -7...
========================= 2 failed, 2 passed in 0.16s ==========================

77 : Job ID 710ccafb812c48859a746d9c8e771a5f
test outcome: killed
heapsort.py, start pos: (13, 40), end pos: (13, 41)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -10,7 +10,7 @@
 def max_heap_sort(lst:list):
     copy_list = deepcopy(lst)
     # make all elements negative, so heap is a max heap
-    copy_list = list(map(lambda x: x * -1, copy_list))
+    copy_list = list(map(lambda x: x * - 2, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
     copy_list =  list(map(lambda x: x * -1, copy_list))
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [18, 14, 8, 6,...
========================= 1 failed, 3 passed in 0.16s ==========================

78 : Job ID bdd1e22005ad496b95b1a1aca1ac4fac
test outcome: killed
heapsort.py, start pos: (13, 40), end pos: (13, 41)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -10,7 +10,7 @@
 def max_heap_sort(lst:list):
     copy_list = deepcopy(lst)
     # make all elements negative, so heap is a max heap
-    copy_list = list(map(lambda x: x * -1, copy_list))
+    copy_list = list(map(lambda x: x * - 0, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
     copy_list =  list(map(lambda x: x * -1, copy_list))
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [0, 0, 0, 0, 0...
========================= 1 failed, 3 passed in 0.15s ==========================

79 : Job ID 377ac3cc48174b41a7a4ebbfeaab5d12
test outcome: killed
heapsort.py, start pos: (16, 41), end pos: (16, 42)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -13,7 +13,7 @@
     copy_list = list(map(lambda x: x * -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
-    copy_list =  list(map(lambda x: x * -1, copy_list))
+    copy_list =  list(map(lambda x: x * - 2, copy_list))
     return copy_list
 def custom_heap_sort(lst:list,sort='min'):
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [18, 14, 8, 6,...
========================= 1 failed, 3 passed in 0.15s ==========================

80 : Job ID 95f1f871cf4a4c85b807a33685adf1ed
test outcome: killed
heapsort.py, start pos: (16, 41), end pos: (16, 42)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -13,7 +13,7 @@
     copy_list = list(map(lambda x: x * -1, copy_list))
     heapify(copy_list)
     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
-    copy_list =  list(map(lambda x: x * -1, copy_list))
+    copy_list =  list(map(lambda x: x * - 0, copy_list))
     return copy_list
 def custom_heap_sort(lst:list,sort='min'):
ts-3-5/test_3-5_0-6_210.py .F..                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_max_heap_sort - assert [0, 0, 0, 0, 0...
========================= 1 failed, 3 passed in 0.16s ==========================

81 : Job ID 001dc93eef1349afa544ac8e6b7bc8b7
test outcome: killed
heapsort.py, start pos: (22, 44), end pos: (22, 45)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -19,7 +19,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
     if sort == 'max':
-        copy_list = list(map(lambda x: x * -1, copy_list))
+        copy_list = list(map(lambda x: x * - 2, copy_list))
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [18, 14...
========================= 1 failed, 3 passed in 0.16s ==========================

82 : Job ID d68b869347c24904aade9d316e2d65fa
test outcome: killed
heapsort.py, start pos: (22, 44), end pos: (22, 45)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -19,7 +19,7 @@
 def custom_heap_sort(lst:list,sort='min'):
     copy_list = deepcopy(lst)
     if sort == 'max':
-        copy_list = list(map(lambda x: x * -1, copy_list))
+        copy_list = list(map(lambda x: x * - 0, copy_list))
     heap = Heap()
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [0, 0, ...
========================= 1 failed, 3 passed in 0.16s ==========================

83 : Job ID 7ff299657c774f6bac1d3507fb95b345
test outcome: killed
heapsort.py, start pos: (27, 46), end pos: (27, 47)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -24,6 +24,6 @@
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
     if sort == 'max':
-        sorted_list = list(map(lambda x: x * -1, sorted_list))
+        sorted_list = list(map(lambda x: x * - 2, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [18, 14...
========================= 1 failed, 3 passed in 0.17s ==========================

84 : Job ID 17865ccc84eb4b44a6b81c6fe53aa22d
test outcome: killed
heapsort.py, start pos: (27, 46), end pos: (27, 47)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- aheapsort.py
+++ bheapsort.py
@@ -24,6 +24,6 @@
     heap.build(copy_list)
     sorted_list = [heap.delete_min() for i in range(heap.size())]
     if sort == 'max':
-        sorted_list = list(map(lambda x: x * -1, sorted_list))
+        sorted_list = list(map(lambda x: x * - 0, sorted_list))
     return sorted_list
ts-3-5/test_3-5_0-6_210.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_210.py::test_custom_heap_sort_max - assert [0, 0, ...
========================= 1 failed, 3 passed in 0.17s ==========================
