   - [#   1] AOD heapsort: 
--------------------------------------------------------------------------------
   9: 
  10: def max_heap_sort(lst: list):
  11:     copy_list = deepcopy(lst)
  12:     
- 13:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
+ 13:     copy_list = list(map((lambda x: (x * 1)), copy_list))
  14:     heapify(copy_list)
  15:     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
  16:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
  17:     return copy_list
--------------------------------------------------------------------------------
[0.18911 s] killed by ts-3-5/test_3-5_0-9_273.py::test_max_heap_sort_sorted_list

def test_max_heap_sort_sorted_list():
>       assert max_heap_sort([1, 2, 3, 4, 5]) == [5, 4, 3, 2, 1]
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:25: AssertionError

   - [#   2] AOD heapsort: 
--------------------------------------------------------------------------------
  12:     
  13:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
  14:     heapify(copy_list)
  15:     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
- 16:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
+ 16:     copy_list = list(map((lambda x: (x * 1)), copy_list))
  17:     return copy_list
  18: 
  19: def custom_heap_sort(lst: list, sort='min'):
  20:     copy_list = deepcopy(lst)
--------------------------------------------------------------------------------
[0.20373 s] killed by ts-3-5/test_3-5_0-9_273.py::test_max_heap_sort_sorted_list

def test_max_heap_sort_sorted_list():
>       assert max_heap_sort([1, 2, 3, 4, 5]) == [5, 4, 3, 2, 1]
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:25: AssertionError

   - [#   3] AOD heapsort: 
--------------------------------------------------------------------------------
  18: 
  19: def custom_heap_sort(lst: list, sort='min'):
  20:     copy_list = deepcopy(lst)
  21:     if sort == 'max':
- 22:         copy_list = list(map((lambda x: (x * (-1))), copy_list))
+ 22:         copy_list = list(map((lambda x: (x * 1)), copy_list))
  23:     heap = Heap()
  24:     heap.build(copy_list)
  25:     sorted_list = [heap.delete_min() for i in range(heap.size())]
  26:     if sort == 'max':
--------------------------------------------------------------------------------
[0.18730 s] killed by ts-3-5/test_3-5_0-9_273.py::test_custom_heap_sort_sorted_list_max

def test_custom_heap_sort_sorted_list_max():
>       assert custom_heap_sort([1, 2, 3, 4, 5], sort='max') == [5, 4, 3, 2, 1]
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:39: AssertionError

   - [#   4] AOD heapsort: 
--------------------------------------------------------------------------------
  23:     heap = Heap()
  24:     heap.build(copy_list)
  25:     sorted_list = [heap.delete_min() for i in range(heap.size())]
  26:     if sort == 'max':
- 27:         sorted_list = list(map((lambda x: (x * (-1))), sorted_list))
+ 27:         sorted_list = list(map((lambda x: (x * 1)), sorted_list))
  28:     return sorted_list
--------------------------------------------------------------------------------
[0.19364 s] killed by ts-3-5/test_3-5_0-9_273.py::test_custom_heap_sort_sorted_list_max

def test_custom_heap_sort_sorted_list_max():
>       assert custom_heap_sort([1, 2, 3, 4, 5], sort='max') == [5, 4, 3, 2, 1]
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:39: AssertionError

   - [#   5] AOR heapsort: 
--------------------------------------------------------------------------------
   9: 
  10: def max_heap_sort(lst: list):
  11:     copy_list = deepcopy(lst)
  12:     
- 13:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
+ 13:     copy_list = list(map((lambda x: (x / (-1))), copy_list))
  14:     heapify(copy_list)
  15:     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
  16:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
  17:     return copy_list
--------------------------------------------------------------------------------
[0.17147 s] survived

   - [#   6] AOR heapsort: 
--------------------------------------------------------------------------------
   9: 
  10: def max_heap_sort(lst: list):
  11:     copy_list = deepcopy(lst)
  12:     
- 13:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
+ 13:     copy_list = list(map((lambda x: (x // (-1))), copy_list))
  14:     heapify(copy_list)
  15:     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
  16:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
  17:     return copy_list
--------------------------------------------------------------------------------
[0.17149 s] survived

   - [#   7] AOR heapsort: 
--------------------------------------------------------------------------------
   9: 
  10: def max_heap_sort(lst: list):
  11:     copy_list = deepcopy(lst)
  12:     
- 13:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
+ 13:     copy_list = list(map((lambda x: (x ** (-1))), copy_list))
  14:     heapify(copy_list)
  15:     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
  16:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
  17:     return copy_list
--------------------------------------------------------------------------------
[0.19418 s] killed by ts-3-5/test_3-5_0-9_273.py::test_max_heap_sort_sorted_list

def test_max_heap_sort_sorted_list():
>       assert max_heap_sort([1, 2, 3, 4, 5]) == [5, 4, 3, 2, 1]
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:25: AssertionError

   - [#   8] AOR heapsort: 
--------------------------------------------------------------------------------
   9: 
  10: def max_heap_sort(lst: list):
  11:     copy_list = deepcopy(lst)
  12:     
- 13:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
+ 13:     copy_list = list(map((lambda x: (x * (+1))), copy_list))
  14:     heapify(copy_list)
  15:     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
  16:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
  17:     return copy_list
--------------------------------------------------------------------------------
[0.19323 s] killed by ts-3-5/test_3-5_0-9_273.py::test_max_heap_sort_sorted_list

def test_max_heap_sort_sorted_list():
>       assert max_heap_sort([1, 2, 3, 4, 5]) == [5, 4, 3, 2, 1]
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:25: AssertionError

   - [#   9] AOR heapsort: 
--------------------------------------------------------------------------------
  12:     
  13:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
  14:     heapify(copy_list)
  15:     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
- 16:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
+ 16:     copy_list = list(map((lambda x: (x / (-1))), copy_list))
  17:     return copy_list
  18: 
  19: def custom_heap_sort(lst: list, sort='min'):
  20:     copy_list = deepcopy(lst)
--------------------------------------------------------------------------------
[0.17207 s] survived

   - [#  10] AOR heapsort: 
--------------------------------------------------------------------------------
  12:     
  13:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
  14:     heapify(copy_list)
  15:     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
- 16:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
+ 16:     copy_list = list(map((lambda x: (x // (-1))), copy_list))
  17:     return copy_list
  18: 
  19: def custom_heap_sort(lst: list, sort='min'):
  20:     copy_list = deepcopy(lst)
--------------------------------------------------------------------------------
[0.16847 s] survived

   - [#  11] AOR heapsort: 
--------------------------------------------------------------------------------
  12:     
  13:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
  14:     heapify(copy_list)
  15:     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
- 16:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
+ 16:     copy_list = list(map((lambda x: (x ** (-1))), copy_list))
  17:     return copy_list
  18: 
  19: def custom_heap_sort(lst: list, sort='min'):
  20:     copy_list = deepcopy(lst)
--------------------------------------------------------------------------------
[0.19499 s] killed by ts-3-5/test_3-5_0-9_273.py::test_max_heap_sort_sorted_list

def test_max_heap_sort_sorted_list():
>       assert max_heap_sort([1, 2, 3, 4, 5]) == [5, 4, 3, 2, 1]
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:25: AssertionError

   - [#  12] AOR heapsort: 
--------------------------------------------------------------------------------
  12:     
  13:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
  14:     heapify(copy_list)
  15:     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
- 16:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
+ 16:     copy_list = list(map((lambda x: (x * (+1))), copy_list))
  17:     return copy_list
  18: 
  19: def custom_heap_sort(lst: list, sort='min'):
  20:     copy_list = deepcopy(lst)
--------------------------------------------------------------------------------
[0.19164 s] killed by ts-3-5/test_3-5_0-9_273.py::test_max_heap_sort_sorted_list

def test_max_heap_sort_sorted_list():
>       assert max_heap_sort([1, 2, 3, 4, 5]) == [5, 4, 3, 2, 1]
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:25: AssertionError

   - [#  13] AOR heapsort: 
--------------------------------------------------------------------------------
  18: 
  19: def custom_heap_sort(lst: list, sort='min'):
  20:     copy_list = deepcopy(lst)
  21:     if sort == 'max':
- 22:         copy_list = list(map((lambda x: (x * (-1))), copy_list))
+ 22:         copy_list = list(map((lambda x: (x / (-1))), copy_list))
  23:     heap = Heap()
  24:     heap.build(copy_list)
  25:     sorted_list = [heap.delete_min() for i in range(heap.size())]
  26:     if sort == 'max':
--------------------------------------------------------------------------------
[0.17202 s] survived

   - [#  14] AOR heapsort: 
--------------------------------------------------------------------------------
  18: 
  19: def custom_heap_sort(lst: list, sort='min'):
  20:     copy_list = deepcopy(lst)
  21:     if sort == 'max':
- 22:         copy_list = list(map((lambda x: (x * (-1))), copy_list))
+ 22:         copy_list = list(map((lambda x: (x // (-1))), copy_list))
  23:     heap = Heap()
  24:     heap.build(copy_list)
  25:     sorted_list = [heap.delete_min() for i in range(heap.size())]
  26:     if sort == 'max':
--------------------------------------------------------------------------------
[0.17175 s] survived

   - [#  15] AOR heapsort: 
--------------------------------------------------------------------------------
  18: 
  19: def custom_heap_sort(lst: list, sort='min'):
  20:     copy_list = deepcopy(lst)
  21:     if sort == 'max':
- 22:         copy_list = list(map((lambda x: (x * (-1))), copy_list))
+ 22:         copy_list = list(map((lambda x: (x ** (-1))), copy_list))
  23:     heap = Heap()
  24:     heap.build(copy_list)
  25:     sorted_list = [heap.delete_min() for i in range(heap.size())]
  26:     if sort == 'max':
--------------------------------------------------------------------------------
[0.19482 s] killed by ts-3-5/test_3-5_0-9_273.py::test_custom_heap_sort_sorted_list_max

def test_custom_heap_sort_sorted_list_max():
>       assert custom_heap_sort([1, 2, 3, 4, 5], sort='max') == [5, 4, 3, 2, 1]
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:39: AssertionError

   - [#  16] AOR heapsort: 
--------------------------------------------------------------------------------
  18: 
  19: def custom_heap_sort(lst: list, sort='min'):
  20:     copy_list = deepcopy(lst)
  21:     if sort == 'max':
- 22:         copy_list = list(map((lambda x: (x * (-1))), copy_list))
+ 22:         copy_list = list(map((lambda x: (x * (+1))), copy_list))
  23:     heap = Heap()
  24:     heap.build(copy_list)
  25:     sorted_list = [heap.delete_min() for i in range(heap.size())]
  26:     if sort == 'max':
--------------------------------------------------------------------------------
[0.19262 s] killed by ts-3-5/test_3-5_0-9_273.py::test_custom_heap_sort_sorted_list_max

def test_custom_heap_sort_sorted_list_max():
>       assert custom_heap_sort([1, 2, 3, 4, 5], sort='max') == [5, 4, 3, 2, 1]
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:39: AssertionError

   - [#  17] AOR heapsort: 
--------------------------------------------------------------------------------
  23:     heap = Heap()
  24:     heap.build(copy_list)
  25:     sorted_list = [heap.delete_min() for i in range(heap.size())]
  26:     if sort == 'max':
- 27:         sorted_list = list(map((lambda x: (x * (-1))), sorted_list))
+ 27:         sorted_list = list(map((lambda x: (x / (-1))), sorted_list))
  28:     return sorted_list
--------------------------------------------------------------------------------
[0.17298 s] survived

   - [#  18] AOR heapsort: 
--------------------------------------------------------------------------------
  23:     heap = Heap()
  24:     heap.build(copy_list)
  25:     sorted_list = [heap.delete_min() for i in range(heap.size())]
  26:     if sort == 'max':
- 27:         sorted_list = list(map((lambda x: (x * (-1))), sorted_list))
+ 27:         sorted_list = list(map((lambda x: (x // (-1))), sorted_list))
  28:     return sorted_list
--------------------------------------------------------------------------------
[0.18891 s] survived

   - [#  19] AOR heapsort: 
--------------------------------------------------------------------------------
  23:     heap = Heap()
  24:     heap.build(copy_list)
  25:     sorted_list = [heap.delete_min() for i in range(heap.size())]
  26:     if sort == 'max':
- 27:         sorted_list = list(map((lambda x: (x * (-1))), sorted_list))
+ 27:         sorted_list = list(map((lambda x: (x ** (-1))), sorted_list))
  28:     return sorted_list
--------------------------------------------------------------------------------
[0.19208 s] killed by ts-3-5/test_3-5_0-9_273.py::test_custom_heap_sort_sorted_list_max

def test_custom_heap_sort_sorted_list_max():
>       assert custom_heap_sort([1, 2, 3, 4, 5], sort='max') == [5, 4, 3, 2, 1]
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:39: AssertionError

   - [#  20] AOR heapsort: 
--------------------------------------------------------------------------------
  23:     heap = Heap()
  24:     heap.build(copy_list)
  25:     sorted_list = [heap.delete_min() for i in range(heap.size())]
  26:     if sort == 'max':
- 27:         sorted_list = list(map((lambda x: (x * (-1))), sorted_list))
+ 27:         sorted_list = list(map((lambda x: (x * (+1))), sorted_list))
  28:     return sorted_list
--------------------------------------------------------------------------------
[0.19296 s] killed by ts-3-5/test_3-5_0-9_273.py::test_custom_heap_sort_sorted_list_max

def test_custom_heap_sort_sorted_list_max():
>       assert custom_heap_sort([1, 2, 3, 4, 5], sort='max') == [5, 4, 3, 2, 1]
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:39: AssertionError

   - [#  21] COI heapsort: 
--------------------------------------------------------------------------------
  17:     return copy_list
  18: 
  19: def custom_heap_sort(lst: list, sort='min'):
  20:     copy_list = deepcopy(lst)
- 21:     if sort == 'max':
+ 21:     if not (sort == 'max'):
  22:         copy_list = list(map((lambda x: (x * (-1))), copy_list))
  23:     heap = Heap()
  24:     heap.build(copy_list)
  25:     sorted_list = [heap.delete_min() for i in range(heap.size())]
--------------------------------------------------------------------------------
[0.19451 s] killed by ts-3-5/test_3-5_0-9_273.py::test_custom_heap_sort_sorted_list_min

def test_custom_heap_sort_sorted_list_min():
>       assert custom_heap_sort([1, 2, 3, 4, 5], sort='min') == [1, 2, 3, 4, 5]
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:36: AssertionError

   - [#  22] COI heapsort: 
--------------------------------------------------------------------------------
  22:         copy_list = list(map((lambda x: (x * (-1))), copy_list))
  23:     heap = Heap()
  24:     heap.build(copy_list)
  25:     sorted_list = [heap.delete_min() for i in range(heap.size())]
- 26:     if sort == 'max':
+ 26:     if not (sort == 'max'):
  27:         sorted_list = list(map((lambda x: (x * (-1))), sorted_list))
  28:     return sorted_list
--------------------------------------------------------------------------------
[0.19742 s] killed by ts-3-5/test_3-5_0-9_273.py::test_custom_heap_sort_sorted_list_min

def test_custom_heap_sort_sorted_list_min():
>       assert custom_heap_sort([1, 2, 3, 4, 5], sort='min') == [1, 2, 3, 4, 5]
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:36: AssertionError

   - [#  25] SDL heapsort: 
--------------------------------------------------------------------------------
   2: from heapq import heapify, heappop
   3: from heap import Heap
   4: 
   5: def heap_sort(lst: list):
-  6:     copy_list = deepcopy(lst)
+  6:     pass
   7:     heapify(copy_list)
   8:     return [heappop(copy_list) for i in range(len(copy_list))]
   9: 
  10: def max_heap_sort(lst: list):
--------------------------------------------------------------------------------
[0.20335 s] killed by ts-3-5/test_3-5_0-9_273.py::test_heap_sort_empty_list

def test_heap_sort_empty_list():
>       assert heap_sort([]) == []

ts-3-5/test_3-5_0-9_273.py:12: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

lst = []

>   ???
E   NameError: name 'copy_list' is not defined

heapsort:7: NameError

   - [#  26] SDL heapsort: 
--------------------------------------------------------------------------------
   3: from heap import Heap
   4: 
   5: def heap_sort(lst: list):
   6:     copy_list = deepcopy(lst)
-  7:     heapify(copy_list)
+  7:     pass
   8:     return [heappop(copy_list) for i in range(len(copy_list))]
   9: 
  10: def max_heap_sort(lst: list):
  11:     copy_list = deepcopy(lst)
--------------------------------------------------------------------------------
[0.19649 s] killed by ts-3-5/test_3-5_0-9_273.py::test_heap_sort_reverse_sorted_list

def test_heap_sort_reverse_sorted_list():
>       assert heap_sort([5, 4, 3, 2, 1]) == [1, 2, 3, 4, 5]
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:18: AssertionError

   - [#  27] SDL heapsort: 
--------------------------------------------------------------------------------
   4: 
   5: def heap_sort(lst: list):
   6:     copy_list = deepcopy(lst)
   7:     heapify(copy_list)
-  8:     return [heappop(copy_list) for i in range(len(copy_list))]
+  8:     pass
   9: 
  10: def max_heap_sort(lst: list):
  11:     copy_list = deepcopy(lst)
  12:     
--------------------------------------------------------------------------------
[0.18821 s] killed by ts-3-5/test_3-5_0-9_273.py::test_heap_sort_empty_list

def test_heap_sort_empty_list():
>       assert heap_sort([]) == []
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:12: AssertionError

   - [#  28] SDL heapsort: 
--------------------------------------------------------------------------------
   7:     heapify(copy_list)
   8:     return [heappop(copy_list) for i in range(len(copy_list))]
   9: 
  10: def max_heap_sort(lst: list):
- 11:     copy_list = deepcopy(lst)
+ 11:     pass
  12:     
  13:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
  14:     heapify(copy_list)
  15:     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
--------------------------------------------------------------------------------
[0.19296 s] killed by ts-3-5/test_3-5_0-9_273.py::test_max_heap_sort_empty_list

def test_max_heap_sort_empty_list():
>       assert max_heap_sort([]) == []

ts-3-5/test_3-5_0-9_273.py:22: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

lst = []

>   ???
E   UnboundLocalError: local variable 'copy_list' referenced before assignment

heapsort:13: UnboundLocalError

   - [#  29] SDL heapsort: 
--------------------------------------------------------------------------------
   9: 
  10: def max_heap_sort(lst: list):
  11:     copy_list = deepcopy(lst)
  12:     
- 13:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
+ 13:     pass
  14:     heapify(copy_list)
  15:     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
  16:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
  17:     return copy_list
--------------------------------------------------------------------------------
[0.19128 s] killed by ts-3-5/test_3-5_0-9_273.py::test_max_heap_sort_sorted_list

def test_max_heap_sort_sorted_list():
>       assert max_heap_sort([1, 2, 3, 4, 5]) == [5, 4, 3, 2, 1]
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:25: AssertionError

   - [#  30] SDL heapsort: 
--------------------------------------------------------------------------------
  10: def max_heap_sort(lst: list):
  11:     copy_list = deepcopy(lst)
  12:     
  13:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
- 14:     heapify(copy_list)
+ 14:     pass
  15:     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
  16:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
  17:     return copy_list
  18: 
--------------------------------------------------------------------------------
[0.19390 s] killed by ts-3-5/test_3-5_0-9_273.py::test_max_heap_sort_sorted_list

def test_max_heap_sort_sorted_list():
>       assert max_heap_sort([1, 2, 3, 4, 5]) == [5, 4, 3, 2, 1]
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:25: AssertionError

   - [#  31] SDL heapsort: 
--------------------------------------------------------------------------------
  11:     copy_list = deepcopy(lst)
  12:     
  13:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
  14:     heapify(copy_list)
- 15:     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
+ 15:     pass
  16:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
  17:     return copy_list
  18: 
  19: def custom_heap_sort(lst: list, sort='min'):
--------------------------------------------------------------------------------
[0.19395 s] killed by ts-3-5/test_3-5_0-9_273.py::test_max_heap_sort_sorted_list

def test_max_heap_sort_sorted_list():
>       assert max_heap_sort([1, 2, 3, 4, 5]) == [5, 4, 3, 2, 1]
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:25: AssertionError

   - [#  32] SDL heapsort: 
--------------------------------------------------------------------------------
  12:     
  13:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
  14:     heapify(copy_list)
  15:     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
- 16:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
+ 16:     pass
  17:     return copy_list
  18: 
  19: def custom_heap_sort(lst: list, sort='min'):
  20:     copy_list = deepcopy(lst)
--------------------------------------------------------------------------------
[0.18945 s] killed by ts-3-5/test_3-5_0-9_273.py::test_max_heap_sort_sorted_list

def test_max_heap_sort_sorted_list():
>       assert max_heap_sort([1, 2, 3, 4, 5]) == [5, 4, 3, 2, 1]
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:25: AssertionError

   - [#  33] SDL heapsort: 
--------------------------------------------------------------------------------
  13:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
  14:     heapify(copy_list)
  15:     copy_list = [heappop(copy_list) for i in range(len(copy_list))]
  16:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
- 17:     return copy_list
+ 17:     pass
  18: 
  19: def custom_heap_sort(lst: list, sort='min'):
  20:     copy_list = deepcopy(lst)
  21:     if sort == 'max':
--------------------------------------------------------------------------------
[0.19262 s] killed by ts-3-5/test_3-5_0-9_273.py::test_max_heap_sort_empty_list

def test_max_heap_sort_empty_list():
>       assert max_heap_sort([]) == []
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:22: AssertionError

   - [#  34] SDL heapsort: 
--------------------------------------------------------------------------------
  16:     copy_list = list(map((lambda x: (x * (-1))), copy_list))
  17:     return copy_list
  18: 
  19: def custom_heap_sort(lst: list, sort='min'):
- 20:     copy_list = deepcopy(lst)
+ 20:     pass
  21:     if sort == 'max':
  22:         copy_list = list(map((lambda x: (x * (-1))), copy_list))
  23:     heap = Heap()
  24:     heap.build(copy_list)
--------------------------------------------------------------------------------
[0.19161 s] killed by ts-3-5/test_3-5_0-9_273.py::test_custom_heap_sort_empty_list

def test_custom_heap_sort_empty_list():
>       assert custom_heap_sort([], sort='min') == []

ts-3-5/test_3-5_0-9_273.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

lst = [], sort = 'min'

>   ???
E   UnboundLocalError: local variable 'copy_list' referenced before assignment

heapsort:24: UnboundLocalError

   - [#  35] SDL heapsort: 
--------------------------------------------------------------------------------
  18: 
  19: def custom_heap_sort(lst: list, sort='min'):
  20:     copy_list = deepcopy(lst)
  21:     if sort == 'max':
- 22:         copy_list = list(map((lambda x: (x * (-1))), copy_list))
+ 22:         pass
  23:     heap = Heap()
  24:     heap.build(copy_list)
  25:     sorted_list = [heap.delete_min() for i in range(heap.size())]
  26:     if sort == 'max':
--------------------------------------------------------------------------------
[0.19268 s] killed by ts-3-5/test_3-5_0-9_273.py::test_custom_heap_sort_sorted_list_max

def test_custom_heap_sort_sorted_list_max():
>       assert custom_heap_sort([1, 2, 3, 4, 5], sort='max') == [5, 4, 3, 2, 1]
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:39: AssertionError

   - [#  36] SDL heapsort: 
--------------------------------------------------------------------------------
  19: def custom_heap_sort(lst: list, sort='min'):
  20:     copy_list = deepcopy(lst)
  21:     if sort == 'max':
  22:         copy_list = list(map((lambda x: (x * (-1))), copy_list))
- 23:     heap = Heap()
+ 23:     pass
  24:     heap.build(copy_list)
  25:     sorted_list = [heap.delete_min() for i in range(heap.size())]
  26:     if sort == 'max':
  27:         sorted_list = list(map((lambda x: (x * (-1))), sorted_list))
--------------------------------------------------------------------------------
[0.19273 s] killed by ts-3-5/test_3-5_0-9_273.py::test_custom_heap_sort_empty_list

def test_custom_heap_sort_empty_list():
>       assert custom_heap_sort([], sort='min') == []

ts-3-5/test_3-5_0-9_273.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

lst = [], sort = 'min'

>   ???
E   NameError: name 'heap' is not defined

heapsort:24: NameError

   - [#  37] SDL heapsort: 
--------------------------------------------------------------------------------
  20:     copy_list = deepcopy(lst)
  21:     if sort == 'max':
  22:         copy_list = list(map((lambda x: (x * (-1))), copy_list))
  23:     heap = Heap()
- 24:     heap.build(copy_list)
+ 24:     pass
  25:     sorted_list = [heap.delete_min() for i in range(heap.size())]
  26:     if sort == 'max':
  27:         sorted_list = list(map((lambda x: (x * (-1))), sorted_list))
  28:     return sorted_list
--------------------------------------------------------------------------------
[0.19873 s] killed by ts-3-5/test_3-5_0-9_273.py::test_custom_heap_sort_sorted_list_min

def test_custom_heap_sort_sorted_list_min():
>       assert custom_heap_sort([1, 2, 3, 4, 5], sort='min') == [1, 2, 3, 4, 5]
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:36: AssertionError

   - [#  38] SDL heapsort: 
--------------------------------------------------------------------------------
  21:     if sort == 'max':
  22:         copy_list = list(map((lambda x: (x * (-1))), copy_list))
  23:     heap = Heap()
  24:     heap.build(copy_list)
- 25:     sorted_list = [heap.delete_min() for i in range(heap.size())]
+ 25:     pass
  26:     if sort == 'max':
  27:         sorted_list = list(map((lambda x: (x * (-1))), sorted_list))
  28:     return sorted_list
--------------------------------------------------------------------------------
[0.19575 s] killed by ts-3-5/test_3-5_0-9_273.py::test_custom_heap_sort_empty_list

def test_custom_heap_sort_empty_list():
>       assert custom_heap_sort([], sort='min') == []

ts-3-5/test_3-5_0-9_273.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

lst = [], sort = 'min'

>   ???
E   UnboundLocalError: local variable 'sorted_list' referenced before assignment

heapsort:28: UnboundLocalError

   - [#  39] SDL heapsort: 
--------------------------------------------------------------------------------
  23:     heap = Heap()
  24:     heap.build(copy_list)
  25:     sorted_list = [heap.delete_min() for i in range(heap.size())]
  26:     if sort == 'max':
- 27:         sorted_list = list(map((lambda x: (x * (-1))), sorted_list))
+ 27:         pass
  28:     return sorted_list
--------------------------------------------------------------------------------
[0.19315 s] killed by ts-3-5/test_3-5_0-9_273.py::test_custom_heap_sort_sorted_list_max

def test_custom_heap_sort_sorted_list_max():
>       assert custom_heap_sort([1, 2, 3, 4, 5], sort='max') == [5, 4, 3, 2, 1]
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:39: AssertionError
