   - [#  40] SDL heapsort: 
--------------------------------------------------------------------------------
  24:     heap.build(copy_list)
  25:     sorted_list = [heap.delete_min() for i in range(heap.size())]
  26:     if sort == 'max':
  27:         sorted_list = list(map((lambda x: (x * (-1))), sorted_list))
- 28:     return sorted_list
+ 28:     pass
--------------------------------------------------------------------------------
[0.19242 s] killed by ts-3-5/test_3-5_0-9_273.py::test_custom_heap_sort_empty_list

def test_custom_heap_sort_empty_list():
>       assert custom_heap_sort([], sort='min') == []
E       AssertionError

ts-3-5/test_3-5_0-9_273.py:32: AssertionError
