1 : Job ID b32d9106dba446448be826329bcacaa1
test outcome: killed
linked_list1.py, start pos: (19, 24), end pos: (19, 26)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 0
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -16,7 +16,7 @@
                 slow_pointer = slow_pointer.next
             if fast_pointer and fast_pointer.next:
                 fast_pointer = fast_pointer.next.next
-        if slow_pointer is None:
+        if slow_pointer is not None:
             return False
         else:
             return True
ts-3-5/test_3-5_0-0_27.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_contains_cycle - assert False == True
========================= 1 failed, 3 passed in 0.11s ==========================

3 : Job ID eb894bc2f158425486c55c5364f5516d
SURVIVED
test outcome: survived
linked_list1.py, start pos: (14, 27), end pos: (14, 33)
operator: core/ReplaceComparisonOperator_IsNot_Eq, occurrence: 0
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -11,7 +11,7 @@
         slow_pointer = self.next        
         fast_pointer = self.next.next
-        while slow_pointer is not fast_pointer:
+        while slow_pointer == fast_pointer:
             if slow_pointer:
                 slow_pointer = slow_pointer.next
             if fast_pointer and fast_pointer.next:
ts-3-5/test_3-5_0-0_27.py ....                                           [100%]
============================== 4 passed in 0.11s ===============================

5 : Job ID 5467e81423ce4387a0daec312c19f468
test outcome: killed
linked_list1.py, start pos: (41, 27), end pos: (41, 33)
operator: core/ReplaceComparisonOperator_IsNot_Eq, occurrence: 2
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -38,7 +38,7 @@
         # reset slow pointer
         slow_pointer = self
         # move the pointers again at same speed, will meet at start
-        while slow_pointer is not fast_pointer:
+        while slow_pointer == fast_pointer:
             # print(slow_pointer.val, fast_pointer.val)
             slow_pointer = slow_pointer.next
             fast_pointer = fast_pointer.next
timeout

6 : Job ID 0884596c632c476ab8898bea0893f7cd
SURVIVED
test outcome: survived
linked_list1.py, start pos: (14, 27), end pos: (14, 33)
operator: core/ReplaceComparisonOperator_IsNot_NotEq, occurrence: 0
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -11,7 +11,7 @@
         slow_pointer = self.next        
         fast_pointer = self.next.next
-        while slow_pointer is not fast_pointer:
+        while slow_pointer != fast_pointer:
             if slow_pointer:
                 slow_pointer = slow_pointer.next
             if fast_pointer and fast_pointer.next:
ts-3-5/test_3-5_0-0_27.py ....                                           [100%]
============================== 4 passed in 0.10s ===============================

8 : Job ID 04e36b4d684d4a0e8a3715021052cb2c
SURVIVED
test outcome: survived
linked_list1.py, start pos: (41, 27), end pos: (41, 33)
operator: core/ReplaceComparisonOperator_IsNot_NotEq, occurrence: 2
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -38,7 +38,7 @@
         # reset slow pointer
         slow_pointer = self
         # move the pointers again at same speed, will meet at start
-        while slow_pointer is not fast_pointer:
+        while slow_pointer != fast_pointer:
             # print(slow_pointer.val, fast_pointer.val)
             slow_pointer = slow_pointer.next
             fast_pointer = fast_pointer.next
ts-3-5/test_3-5_0-0_27.py ....                                           [100%]
============================== 4 passed in 0.10s ===============================

9 : Job ID c838cecb9061488181c5957306a2dd54
test outcome: killed
linked_list1.py, start pos: (14, 27), end pos: (14, 33)
operator: core/ReplaceComparisonOperator_IsNot_Lt, occurrence: 0
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -11,7 +11,7 @@
         slow_pointer = self.next        
         fast_pointer = self.next.next
-        while slow_pointer is not fast_pointer:
+        while slow_pointer < fast_pointer:
             if slow_pointer:
                 slow_pointer = slow_pointer.next
             if fast_pointer and fast_pointer.next:
ts-3-5/test_3-5_0-0_27.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_contains_cycle - TypeError: '<' not su...
========================= 1 failed, 3 passed in 0.10s ==========================

11 : Job ID 89c67d391b5844d0b4226a5cf91f7043
test outcome: killed
linked_list1.py, start pos: (41, 27), end pos: (41, 33)
operator: core/ReplaceComparisonOperator_IsNot_Lt, occurrence: 2
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -38,7 +38,7 @@
         # reset slow pointer
         slow_pointer = self
         # move the pointers again at same speed, will meet at start
-        while slow_pointer is not fast_pointer:
+        while slow_pointer < fast_pointer:
             # print(slow_pointer.val, fast_pointer.val)
             slow_pointer = slow_pointer.next
             fast_pointer = fast_pointer.next
ts-3-5/test_3-5_0-0_27.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_get_beginning_of_cycle_if_exists - Typ...
========================= 1 failed, 3 passed in 0.10s ==========================

12 : Job ID 290831c9a17d451c9b1ef758e76b406d
test outcome: killed
linked_list1.py, start pos: (14, 27), end pos: (14, 33)
operator: core/ReplaceComparisonOperator_IsNot_LtE, occurrence: 0
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -11,7 +11,7 @@
         slow_pointer = self.next        
         fast_pointer = self.next.next
-        while slow_pointer is not fast_pointer:
+        while slow_pointer <= fast_pointer:
             if slow_pointer:
                 slow_pointer = slow_pointer.next
             if fast_pointer and fast_pointer.next:
ts-3-5/test_3-5_0-0_27.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_contains_cycle - TypeError: '<=' not s...
========================= 1 failed, 3 passed in 0.10s ==========================

14 : Job ID 6ef7817f375040f38c129b0847bec188
test outcome: killed
linked_list1.py, start pos: (41, 27), end pos: (41, 33)
operator: core/ReplaceComparisonOperator_IsNot_LtE, occurrence: 2
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -38,7 +38,7 @@
         # reset slow pointer
         slow_pointer = self
         # move the pointers again at same speed, will meet at start
-        while slow_pointer is not fast_pointer:
+        while slow_pointer <= fast_pointer:
             # print(slow_pointer.val, fast_pointer.val)
             slow_pointer = slow_pointer.next
             fast_pointer = fast_pointer.next
ts-3-5/test_3-5_0-0_27.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_get_beginning_of_cycle_if_exists - Typ...
========================= 1 failed, 3 passed in 0.11s ==========================

15 : Job ID a26bb8d548804ff3bc3e325b6a9870bb
test outcome: killed
linked_list1.py, start pos: (14, 27), end pos: (14, 33)
operator: core/ReplaceComparisonOperator_IsNot_Gt, occurrence: 0
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -11,7 +11,7 @@
         slow_pointer = self.next        
         fast_pointer = self.next.next
-        while slow_pointer is not fast_pointer:
+        while slow_pointer > fast_pointer:
             if slow_pointer:
                 slow_pointer = slow_pointer.next
             if fast_pointer and fast_pointer.next:
ts-3-5/test_3-5_0-0_27.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_contains_cycle - TypeError: '>' not su...
========================= 1 failed, 3 passed in 0.10s ==========================

17 : Job ID 02ff0f1362b04cde826744f13e6c7944
test outcome: killed
linked_list1.py, start pos: (41, 27), end pos: (41, 33)
operator: core/ReplaceComparisonOperator_IsNot_Gt, occurrence: 2
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -38,7 +38,7 @@
         # reset slow pointer
         slow_pointer = self
         # move the pointers again at same speed, will meet at start
-        while slow_pointer is not fast_pointer:
+        while slow_pointer > fast_pointer:
             # print(slow_pointer.val, fast_pointer.val)
             slow_pointer = slow_pointer.next
             fast_pointer = fast_pointer.next
ts-3-5/test_3-5_0-0_27.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_get_beginning_of_cycle_if_exists - Typ...
========================= 1 failed, 3 passed in 0.10s ==========================

18 : Job ID 21158a1402c24dceb9a63663bba4fe33
test outcome: killed
linked_list1.py, start pos: (14, 27), end pos: (14, 33)
operator: core/ReplaceComparisonOperator_IsNot_GtE, occurrence: 0
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -11,7 +11,7 @@
         slow_pointer = self.next        
         fast_pointer = self.next.next
-        while slow_pointer is not fast_pointer:
+        while slow_pointer >= fast_pointer:
             if slow_pointer:
                 slow_pointer = slow_pointer.next
             if fast_pointer and fast_pointer.next:
ts-3-5/test_3-5_0-0_27.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_contains_cycle - TypeError: '>=' not s...
========================= 1 failed, 3 passed in 0.11s ==========================

20 : Job ID 590397759ae54f4d881acb5845415cb8
test outcome: killed
linked_list1.py, start pos: (41, 27), end pos: (41, 33)
operator: core/ReplaceComparisonOperator_IsNot_GtE, occurrence: 2
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -38,7 +38,7 @@
         # reset slow pointer
         slow_pointer = self
         # move the pointers again at same speed, will meet at start
-        while slow_pointer is not fast_pointer:
+        while slow_pointer >= fast_pointer:
             # print(slow_pointer.val, fast_pointer.val)
             slow_pointer = slow_pointer.next
             fast_pointer = fast_pointer.next
ts-3-5/test_3-5_0-0_27.py .F..                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_get_beginning_of_cycle_if_exists - Typ...
========================= 1 failed, 3 passed in 0.11s ==========================

21 : Job ID 66c69cd009624960a14614674ec148af
SURVIVED
test outcome: survived
linked_list1.py, start pos: (14, 27), end pos: (14, 33)
operator: core/ReplaceComparisonOperator_IsNot_Is, occurrence: 0
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -11,7 +11,7 @@
         slow_pointer = self.next        
         fast_pointer = self.next.next
-        while slow_pointer is not fast_pointer:
+        while slow_pointer is fast_pointer:
             if slow_pointer:
                 slow_pointer = slow_pointer.next
             if fast_pointer and fast_pointer.next:
ts-3-5/test_3-5_0-0_27.py ....                                           [100%]
============================== 4 passed in 0.10s ===============================

23 : Job ID 8e0e63a779a5408c89a875d86a9eb1cf
test outcome: killed
linked_list1.py, start pos: (41, 27), end pos: (41, 33)
operator: core/ReplaceComparisonOperator_IsNot_Is, occurrence: 2
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -38,7 +38,7 @@
         # reset slow pointer
         slow_pointer = self
         # move the pointers again at same speed, will meet at start
-        while slow_pointer is not fast_pointer:
+        while slow_pointer is fast_pointer:
             # print(slow_pointer.val, fast_pointer.val)
             slow_pointer = slow_pointer.next
             fast_pointer = fast_pointer.next
timeout

24 : Job ID 6eb3390c0638408182bace8d52829c49
test outcome: killed
linked_list1.py, start pos: (9, 11), end pos: (9, 14)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 0
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -6,7 +6,7 @@
     def contains_cycle(self):
         # the list is only 1 node long, which cannot contain a cycle
-        if not self.next:
+        if  self.next:
             return False
         slow_pointer = self.next        
         fast_pointer = self.next.next
ts-3-5/test_3-5_0-0_27.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_contains_cycle - AttributeError: 'None...
========================= 1 failed, 3 passed in 0.10s ==========================

26 : Job ID aeacb3398c4a4333bfa98340df98d076
test outcome: killed
linked_list1.py, start pos: (61, 15), end pos: (61, 18)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 2
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -58,7 +58,7 @@
     def reverse_recursive(self):
         def rev(node):
-            if not node.next:
+            if  node.next:
                 rev.head = node
                 return
             rev(node.next)
ts-3-5/test_3-5_0-0_27.py ...F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_reverse_recursive - assert 1 == 3
========================= 1 failed, 3 passed in 0.11s ==========================

27 : Job ID 7cc4a638287146a6a6c9da89c00fb202
test outcome: killed
linked_list1.py, start pos: (9, 11), end pos: (9, 24)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -6,7 +6,7 @@
     def contains_cycle(self):
         # the list is only 1 node long, which cannot contain a cycle
-        if not self.next:
+        if not not self.next:
             return False
         slow_pointer = self.next        
         fast_pointer = self.next.next
ts-3-5/test_3-5_0-0_27.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_contains_cycle - AttributeError: 'None...
========================= 1 failed, 3 passed in 0.10s ==========================

28 : Job ID 27ea4e2c3cf549eca2439f9de43ee8c2
SURVIVED
test outcome: survived
linked_list1.py, start pos: (14, 14), end pos: (14, 46)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -11,7 +11,7 @@
         slow_pointer = self.next        
         fast_pointer = self.next.next
-        while slow_pointer is not fast_pointer:
+        while not slow_pointer is not fast_pointer:
             if slow_pointer:
                 slow_pointer = slow_pointer.next
             if fast_pointer and fast_pointer.next:
ts-3-5/test_3-5_0-0_27.py ....                                           [100%]
============================== 4 passed in 0.10s ===============================

29 : Job ID 1bf2e7bf14d94486972cb46ea9a7a7d6
SURVIVED
test outcome: survived
linked_list1.py, start pos: (15, 15), end pos: (15, 27)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -12,7 +12,7 @@
         fast_pointer = self.next.next
         while slow_pointer is not fast_pointer:
-            if slow_pointer:
+            if not slow_pointer:
                 slow_pointer = slow_pointer.next
             if fast_pointer and fast_pointer.next:
                 fast_pointer = fast_pointer.next.next
ts-3-5/test_3-5_0-0_27.py ....                                           [100%]
============================== 4 passed in 0.10s ===============================

30 : Job ID 844d157b23c34c9fb6dde513bdee8f03
SURVIVED
test outcome: survived
linked_list1.py, start pos: (17, 15), end pos: (17, 49)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -14,7 +14,7 @@
         while slow_pointer is not fast_pointer:
             if slow_pointer:
                 slow_pointer = slow_pointer.next
-            if fast_pointer and fast_pointer.next:
+            if not fast_pointer and fast_pointer.next:
                 fast_pointer = fast_pointer.next.next
         if slow_pointer is None:
             return False
ts-3-5/test_3-5_0-0_27.py ....                                           [100%]
============================== 4 passed in 0.10s ===============================

31 : Job ID 4d813a1c9d7a4cc8b494007ed916e0cb
test outcome: killed
linked_list1.py, start pos: (19, 11), end pos: (19, 31)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -16,7 +16,7 @@
                 slow_pointer = slow_pointer.next
             if fast_pointer and fast_pointer.next:
                 fast_pointer = fast_pointer.next.next
-        if slow_pointer is None:
+        if not slow_pointer is None:
             return False
         else:
             return True
ts-3-5/test_3-5_0-0_27.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_contains_cycle - assert False == True
========================= 1 failed, 3 passed in 0.10s ==========================

37 : Job ID 7090c21397fd4f42ac80a5a519b18738
test outcome: killed
linked_list1.py, start pos: (41, 14), end pos: (41, 46)
operator: core/AddNot, occurrence: 10
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -38,7 +38,7 @@
         # reset slow pointer
         slow_pointer = self
         # move the pointers again at same speed, will meet at start
-        while slow_pointer is not fast_pointer:
+        while not slow_pointer is not fast_pointer:
             # print(slow_pointer.val, fast_pointer.val)
             slow_pointer = slow_pointer.next
             fast_pointer = fast_pointer.next
timeout

38 : Job ID ef40180fa53c4236aa7041e1e5416c5a
test outcome: killed
linked_list1.py, start pos: (51, 14), end pos: (51, 23)
operator: core/AddNot, occurrence: 11
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -48,7 +48,7 @@
     def reverse(self):
         prev = None
         head = self
-        while head.next:
+        while not head.next:
             next_node = head.next
             head.next = prev
             prev = head
ts-3-5/test_3-5_0-0_27.py ..F.                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_reverse - assert 1 == 3
========================= 1 failed, 3 passed in 0.10s ==========================

39 : Job ID debca0ccfb874415addae3212d91d6c0
test outcome: killed
linked_list1.py, start pos: (61, 15), end pos: (61, 28)
operator: core/AddNot, occurrence: 12
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -58,7 +58,7 @@
     def reverse_recursive(self):
         def rev(node):
-            if not node.next:
+            if not not node.next:
                 rev.head = node
                 return
             rev(node.next)
ts-3-5/test_3-5_0-0_27.py ...F                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_reverse_recursive - assert 1 == 3
========================= 1 failed, 3 passed in 0.10s ==========================

41 : Job ID efe3612dc028499f82521d987435c85c
test outcome: killed
linked_list1.py, start pos: (10, 19), end pos: (10, 24)
operator: core/ReplaceFalseWithTrue, occurrence: 0
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -7,7 +7,7 @@
     def contains_cycle(self):
         # the list is only 1 node long, which cannot contain a cycle
         if not self.next:
-            return False
+            return True
         slow_pointer = self.next        
         fast_pointer = self.next.next
ts-3-5/test_3-5_0-0_27.py F...                                           [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_27.py::test_contains_cycle - assert True == False
========================= 1 failed, 3 passed in 0.10s ==========================

42 : Job ID 21f9fd4923974d248174d17858b9850a
SURVIVED
test outcome: survived
linked_list1.py, start pos: (20, 19), end pos: (20, 24)
operator: core/ReplaceFalseWithTrue, occurrence: 1
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -17,7 +17,7 @@
             if fast_pointer and fast_pointer.next:
                 fast_pointer = fast_pointer.next.next
         if slow_pointer is None:
-            return False
+            return True
         else:
             return True
ts-3-5/test_3-5_0-0_27.py ....                                           [100%]
============================== 4 passed in 0.10s ===============================

43 : Job ID ccd93f2fd93342b8813b5af00b2ccdda
SURVIVED
test outcome: survived
linked_list1.py, start pos: (17, 28), end pos: (17, 31)
operator: core/ReplaceAndWithOr, occurrence: 0
--- mutation diff ---
--- alinked_list1.py
+++ blinked_list1.py
@@ -14,7 +14,7 @@
         while slow_pointer is not fast_pointer:
             if slow_pointer:
                 slow_pointer = slow_pointer.next
-            if fast_pointer and fast_pointer.next:
+            if fast_pointer or fast_pointer.next:
                 fast_pointer = fast_pointer.next.next
         if slow_pointer is None:
             return False
ts-3-5/test_3-5_0-0_27.py ....                                           [100%]
============================== 4 passed in 0.10s ===============================
