   - [#   1] CDI linked_list1: 
--------------------------------------------------------------------------------
   1: class ListNode:
   2:     
-  3:     def __init__(self, val, next=None):
-  4:         self.val = val
-  5:         self.next = next
-  6:     
+  3:     @classmethod
+  4:     def __init__(self, val, next=None):
+  5:         self.val = val
+  6:         self.next = next
   7:     def contains_cycle(self):
   8:         
   9:         if not (self.next):
  10:             return False
--------------------------------------------------------------------------------
[0.16374 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse

def test_reverse():
        # Test case for reversing a list
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
        reversed_node = node1.reverse()
        assert reversed_node.val == 3
>       assert reversed_node.next.val == 2
E       AssertionError

ts-3-5/test_3-5_0-2_65.py:49: AssertionError

   - [#   2] CDI linked_list1: 
--------------------------------------------------------------------------------
   3:     def __init__(self, val, next=None):
   4:         self.val = val
   5:         self.next = next
   6:     
-  7:     def contains_cycle(self):
-  8:         
-  9:         if not (self.next):
- 10:             return False
- 11:         slow_pointer = self.next
- 12:         fast_pointer = self.next.next
- 13:         
- 14:         while slow_pointer is not fast_pointer:
- 15:             if slow_pointer:
- 16:                 slow_pointer = slow_pointer.next
- 17:             if (fast_pointer and fast_pointer.next):
- 18:                 fast_pointer = fast_pointer.next.next
- 19:         if slow_pointer is None:
- 20:             return False
- 21:         else:
- 22:             return True
- 23:     
+  7:     @classmethod
+  8:     def contains_cycle(self):
+  9:         
+ 10:         if not (self.next):
+ 11:             return False
+ 12:         slow_pointer = self.next
+ 13:         fast_pointer = self.next.next
+ 14:         
+ 15:         while slow_pointer is not fast_pointer:
+ 16:             if slow_pointer:
+ 17:                 slow_pointer = slow_pointer.next
+ 18:             if (fast_pointer and fast_pointer.next):
+ 19:                 fast_pointer = fast_pointer.next.next
+ 20:         if slow_pointer is None:
+ 21:             return False
+ 22:         else:
+ 23:             return True
  24:     def get_beginning_of_cycle_if_exists(self):
  25:         
  26:         if not (self.next):
  27:             return None
--------------------------------------------------------------------------------

   - [#   3] CDI linked_list1: 
--------------------------------------------------------------------------------
  20:             return False
  21:         else:
  22:             return True
  23:     
- 24:     def get_beginning_of_cycle_if_exists(self):
- 25:         
- 26:         if not (self.next):
- 27:             return None
- 28:         slow_pointer = self.next
- 29:         fast_pointer = self.next.next
- 30:         
- 31:         while slow_pointer is not fast_pointer:
- 32:             if slow_pointer:
- 33:                 slow_pointer = slow_pointer.next
- 34:             if (fast_pointer and fast_pointer.next):
- 35:                 fast_pointer = fast_pointer.next.next
- 36:         if slow_pointer is None:
- 37:             return None
- 38:         
- 39:         slow_pointer = self
- 40:         
- 41:         while slow_pointer is not fast_pointer:
- 42:             
- 43:             slow_pointer = slow_pointer.next
- 44:             fast_pointer = fast_pointer.next
- 45:         
- 46:         return slow_pointer
- 47:     
+ 24:     @classmethod
+ 25:     def get_beginning_of_cycle_if_exists(self):
+ 26:         
+ 27:         if not (self.next):
+ 28:             return None
+ 29:         slow_pointer = self.next
+ 30:         fast_pointer = self.next.next
+ 31:         
+ 32:         while slow_pointer is not fast_pointer:
+ 33:             if slow_pointer:
+ 34:                 slow_pointer = slow_pointer.next
+ 35:             if (fast_pointer and fast_pointer.next):
+ 36:                 fast_pointer = fast_pointer.next.next
+ 37:         if slow_pointer is None:
+ 38:             return None

   - [#   4] CDI linked_list1: 
--------------------------------------------------------------------------------
  44:             fast_pointer = fast_pointer.next
  45:         
  46:         return slow_pointer
  47:     
- 48:     def reverse(self):
- 49:         prev = None
- 50:         head = self
- 51:         while head.next:
- 52:             next_node = head.next
- 53:             head.next = prev
- 54:             prev = head
- 55:             head = next_node
- 56:         head.next = prev
- 57:         return head
- 58:     
+ 48:     @classmethod
+ 49:     def reverse(self):
+ 50:         prev = None
+ 51:         head = self
+ 52:         while head.next:
+ 53:             next_node = head.next
+ 54:             head.next = prev
+ 55:             prev = head
+ 56:             head = next_node
+ 57:         head.next = prev
+ 58:         return head
  59:     def reverse_recursive(self):
  60:         def rev(node):
  61:             if not (node.next):
  62:                 rev.head = node
--------------------------------------------------------------------------------
[0.15179 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse

def test_reverse():
        # Test case for reversing a list
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
>       reversed_node = node1.reverse()

   - [#   5] CDI linked_list1: 
--------------------------------------------------------------------------------
  55:             head = next_node
  56:         head.next = prev
  57:         return head
  58:     
- 59:     def reverse_recursive(self):
- 60:         def rev(node):
- 61:             if not (node.next):
- 62:                 rev.head = node
- 63:                 return
- 64:             rev(node.next)
- 65:             temp = node.next
- 66:             temp.next = node
- 67:             node.next = None
- 68:         rev.head = self
- 69:         rev(self)
- 70:         
- 71:         return rev.head
+ 59:     @classmethod
+ 60:     def reverse_recursive(self):
+ 61:         def rev(node):
+ 62:             if not (node.next):
+ 63:                 rev.head = node
+ 64:                 return
+ 65:             rev(node.next)
+ 66:             temp = node.next
+ 67:             temp.next = node
+ 68:             node.next = None
+ 69:         rev.head = self
+ 70:         rev(self)
+ 71:         
+ 72:         return rev.head
--------------------------------------------------------------------------------
[0.15325 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse_recursive

def test_reverse_recursive():
        # Test case for reversing a list recursively
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
>       reversed_node = node1.reverse_recursive()

   - [#   6] COD linked_list1: 
--------------------------------------------------------------------------------
   5:         self.next = next
   6:     
   7:     def contains_cycle(self):
   8:         
-  9:         if not (self.next):
+  9:         if self.next:
  10:             return False
  11:         slow_pointer = self.next
  12:         fast_pointer = self.next.next
  13:         
--------------------------------------------------------------------------------
[0.15288 s] killed by ts-3-5/test_3-5_0-2_65.py::test_contains_cycle

def test_contains_cycle():
        # Test case for a list with no cycle
        node1 = ListNode(1)
>       assert node1.contains_cycle() == False

ts-3-5/test_3-5_0-2_65.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linked_list1.ListNode object at 0x7d3f4b6a0f10>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

linked_list1:12: AttributeError

   - [#   8] COD linked_list1: 
--------------------------------------------------------------------------------
  57:         return head
  58:     
  59:     def reverse_recursive(self):
  60:         def rev(node):
- 61:             if not (node.next):
+ 61:             if node.next:
  62:                 rev.head = node
  63:                 return
  64:             rev(node.next)
  65:             temp = node.next
--------------------------------------------------------------------------------
[0.15115 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse_recursive

def test_reverse_recursive():
        # Test case for reversing a list recursively
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
        reversed_node = node1.reverse_recursive()
>       assert reversed_node.val == 3
E       AssertionError

ts-3-5/test_3-5_0-2_65.py:61: AssertionError

   - [#   9] COI linked_list1: 
--------------------------------------------------------------------------------
   5:         self.next = next
   6:     
   7:     def contains_cycle(self):
   8:         
-  9:         if not (self.next):
+  9:         if not ((not (self.next))):
  10:             return False
  11:         slow_pointer = self.next
  12:         fast_pointer = self.next.next
  13:         
--------------------------------------------------------------------------------
[0.15361 s] killed by ts-3-5/test_3-5_0-2_65.py::test_contains_cycle

def test_contains_cycle():
        # Test case for a list with no cycle
        node1 = ListNode(1)
>       assert node1.contains_cycle() == False

ts-3-5/test_3-5_0-2_65.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linked_list1.ListNode object at 0x7d3f4b651bd0>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

linked_list1:12: AttributeError

   - [#  10] COI linked_list1: 
--------------------------------------------------------------------------------
  10:             return False
  11:         slow_pointer = self.next
  12:         fast_pointer = self.next.next
  13:         
- 14:         while slow_pointer is not fast_pointer:
+ 14:         while not (slow_pointer is not fast_pointer):
  15:             if slow_pointer:
  16:                 slow_pointer = slow_pointer.next
  17:             if (fast_pointer and fast_pointer.next):
  18:                 fast_pointer = fast_pointer.next.next
--------------------------------------------------------------------------------
[0.13233 s] survived

   - [#  12] COI linked_list1: 
--------------------------------------------------------------------------------
  13:         
  14:         while slow_pointer is not fast_pointer:
  15:             if slow_pointer:
  16:                 slow_pointer = slow_pointer.next
- 17:             if (fast_pointer and fast_pointer.next):
+ 17:             if not ((fast_pointer and fast_pointer.next)):
  18:                 fast_pointer = fast_pointer.next.next
  19:         if slow_pointer is None:
  20:             return False
  21:         else:
--------------------------------------------------------------------------------
[0.13345 s] survived

   - [#  13] COI linked_list1: 
--------------------------------------------------------------------------------
  15:             if slow_pointer:
  16:                 slow_pointer = slow_pointer.next
  17:             if (fast_pointer and fast_pointer.next):
  18:                 fast_pointer = fast_pointer.next.next
- 19:         if slow_pointer is None:
+ 19:         if not (slow_pointer is None):
  20:             return False
  21:         else:
  22:             return True
  23:     
--------------------------------------------------------------------------------
[0.15329 s] killed by ts-3-5/test_3-5_0-2_65.py::test_contains_cycle

def test_contains_cycle():
        # Test case for a list with no cycle
        node1 = ListNode(1)
        assert node1.contains_cycle() == False
    
        # Test case for a list with a cycle
        node2 = ListNode(2)
        node3 = ListNode(3)
        node4 = ListNode(4)
        node2.next = node3
        node3.next = node4
        node4.next = node2
>       assert node2.contains_cycle() == True
E       AssertionError

ts-3-5/test_3-5_0-2_65.py:23: AssertionError

   - [#  20] COI linked_list1: 
--------------------------------------------------------------------------------
  47:     
  48:     def reverse(self):
  49:         prev = None
  50:         head = self
- 51:         while head.next:
+ 51:         while not (head.next):
  52:             next_node = head.next
  53:             head.next = prev
  54:             prev = head
  55:             head = next_node
--------------------------------------------------------------------------------
[0.15080 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse

def test_reverse():
        # Test case for reversing a list
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
        reversed_node = node1.reverse()
>       assert reversed_node.val == 3
E       AssertionError

ts-3-5/test_3-5_0-2_65.py:48: AssertionError

   - [#  21] COI linked_list1: 
--------------------------------------------------------------------------------
  57:         return head
  58:     
  59:     def reverse_recursive(self):
  60:         def rev(node):
- 61:             if not (node.next):
+ 61:             if not ((not (node.next))):
  62:                 rev.head = node
  63:                 return
  64:             rev(node.next)
  65:             temp = node.next
--------------------------------------------------------------------------------
[0.15543 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse_recursive

def test_reverse_recursive():
        # Test case for reversing a list recursively
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
        reversed_node = node1.reverse_recursive()
>       assert reversed_node.val == 3
E       AssertionError

ts-3-5/test_3-5_0-2_65.py:61: AssertionError

   - [#  22] LCR linked_list1: 
--------------------------------------------------------------------------------
  13:         
  14:         while slow_pointer is not fast_pointer:
  15:             if slow_pointer:
  16:                 slow_pointer = slow_pointer.next
- 17:             if (fast_pointer and fast_pointer.next):
+ 17:             if (fast_pointer or fast_pointer.next):
  18:                 fast_pointer = fast_pointer.next.next
  19:         if slow_pointer is None:
  20:             return False
  21:         else:
--------------------------------------------------------------------------------
[0.13193 s] survived

   - [#  24] OIL linked_list1: 
--------------------------------------------------------------------------------
  15:             if slow_pointer:
  16:                 slow_pointer = slow_pointer.next
  17:             if (fast_pointer and fast_pointer.next):
  18:                 fast_pointer = fast_pointer.next.next
- 19:         if slow_pointer is None:
- 20:             return False
- 21:         else:
- 22:             return True
+ 19:             break
+ 20:         if slow_pointer is None:
+ 21:             return False
+ 22:         else:return True
  23:     
  24:     def get_beginning_of_cycle_if_exists(self):
  25:         
  26:         if not (self.next):
--------------------------------------------------------------------------------
[0.13210 s] survived

   - [#  25] OIL linked_list1: 
--------------------------------------------------------------------------------
  32:             if slow_pointer:
  33:                 slow_pointer = slow_pointer.next
  34:             if (fast_pointer and fast_pointer.next):
  35:                 fast_pointer = fast_pointer.next.next
- 36:         if slow_pointer is None:
- 37:             return None
- 38:         
+ 36:             break
+ 37:         if slow_pointer is None:
+ 38:             return None
  39:         slow_pointer = self
  40:         
  41:         while slow_pointer is not fast_pointer:
  42:             
--------------------------------------------------------------------------------
[5.00618 s] timeout

   - [#  26] OIL linked_list1: 
--------------------------------------------------------------------------------
  41:         while slow_pointer is not fast_pointer:
  42:             
  43:             slow_pointer = slow_pointer.next
  44:             fast_pointer = fast_pointer.next
- 45:         
+ 45:             break
  46:         return slow_pointer
  47:     
  48:     def reverse(self):
  49:         prev = None
--------------------------------------------------------------------------------
[0.12775 s] survived

   - [#  27] OIL linked_list1: 
--------------------------------------------------------------------------------
  52:             next_node = head.next
  53:             head.next = prev
  54:             prev = head
  55:             head = next_node
- 56:         head.next = prev
- 57:         return head
- 58:     
+ 56:             break
+ 57:         head.next = prev
+ 58:         return head
  59:     def reverse_recursive(self):
  60:         def rev(node):
  61:             if not (node.next):
  62:                 rev.head = node
--------------------------------------------------------------------------------
[0.15202 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse

def test_reverse():
        # Test case for reversing a list
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
        reversed_node = node1.reverse()
>       assert reversed_node.val == 3
E       AssertionError

ts-3-5/test_3-5_0-2_65.py:48: AssertionError

   - [#  33] SDL linked_list1: 
--------------------------------------------------------------------------------
   1: class ListNode:
   2:     
   3:     def __init__(self, val, next=None):
-  4:         self.val = val
+  4:         pass
   5:         self.next = next
   6:     
   7:     def contains_cycle(self):
   8:         
--------------------------------------------------------------------------------
[0.15570 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse

def test_reverse():
        # Test case for reversing a list
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
        reversed_node = node1.reverse()
>       assert reversed_node.val == 3
E       AttributeError: 'ListNode' object has no attribute 'val'

ts-3-5/test_3-5_0-2_65.py:48: AttributeError

   - [#  34] SDL linked_list1: 
--------------------------------------------------------------------------------
   1: class ListNode:
   2:     
   3:     def __init__(self, val, next=None):
   4:         self.val = val
-  5:         self.next = next
+  5:         pass
   6:     
   7:     def contains_cycle(self):
   8:         
   9:         if not (self.next):
--------------------------------------------------------------------------------
[0.15458 s] killed by ts-3-5/test_3-5_0-2_65.py::test_contains_cycle

def test_contains_cycle():
        # Test case for a list with no cycle
        node1 = ListNode(1)
>       assert node1.contains_cycle() == False

ts-3-5/test_3-5_0-2_65.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linked_list1.ListNode object at 0x7d3f4b54ded0>

>   ???
E   AttributeError: 'ListNode' object has no attribute 'next'

linked_list1:9: AttributeError

   - [#  35] SDL linked_list1: 
--------------------------------------------------------------------------------
   6:     
   7:     def contains_cycle(self):
   8:         
   9:         if not (self.next):
- 10:             return False
+ 10:             pass
  11:         slow_pointer = self.next
  12:         fast_pointer = self.next.next
  13:         
  14:         while slow_pointer is not fast_pointer:
--------------------------------------------------------------------------------
[0.16486 s] killed by ts-3-5/test_3-5_0-2_65.py::test_contains_cycle

def test_contains_cycle():
        # Test case for a list with no cycle
        node1 = ListNode(1)
>       assert node1.contains_cycle() == False

ts-3-5/test_3-5_0-2_65.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linked_list1.ListNode object at 0x7d3f4b591f60>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

linked_list1:12: AttributeError

   - [#  36] SDL linked_list1: 
--------------------------------------------------------------------------------
   7:     def contains_cycle(self):
   8:         
   9:         if not (self.next):
  10:             return False
- 11:         slow_pointer = self.next
+ 11:         pass
  12:         fast_pointer = self.next.next
  13:         
  14:         while slow_pointer is not fast_pointer:
  15:             if slow_pointer:
--------------------------------------------------------------------------------
[0.15540 s] killed by ts-3-5/test_3-5_0-2_65.py::test_contains_cycle

def test_contains_cycle():
        # Test case for a list with no cycle
        node1 = ListNode(1)
        assert node1.contains_cycle() == False
    
        # Test case for a list with a cycle
        node2 = ListNode(2)
        node3 = ListNode(3)
        node4 = ListNode(4)
        node2.next = node3
        node3.next = node4
        node4.next = node2
>       assert node2.contains_cycle() == True

ts-3-5/test_3-5_0-2_65.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linked_list1.ListNode object at 0x7d3f4b704700>

>   ???
E   UnboundLocalError: local variable 'slow_pointer' referenced before assignment

linked_list1:14: UnboundLocalError

   - [#  37] SDL linked_list1: 
--------------------------------------------------------------------------------
   8:         
   9:         if not (self.next):
  10:             return False
  11:         slow_pointer = self.next
- 12:         fast_pointer = self.next.next
+ 12:         pass
  13:         
  14:         while slow_pointer is not fast_pointer:
  15:             if slow_pointer:
  16:                 slow_pointer = slow_pointer.next
--------------------------------------------------------------------------------
[0.15534 s] killed by ts-3-5/test_3-5_0-2_65.py::test_contains_cycle

def test_contains_cycle():
        # Test case for a list with no cycle
        node1 = ListNode(1)
        assert node1.contains_cycle() == False
    
        # Test case for a list with a cycle
        node2 = ListNode(2)
        node3 = ListNode(3)
        node4 = ListNode(4)
        node2.next = node3
        node3.next = node4
        node4.next = node2
>       assert node2.contains_cycle() == True

ts-3-5/test_3-5_0-2_65.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linked_list1.ListNode object at 0x7d3f4b87a140>

>   ???
E   UnboundLocalError: local variable 'fast_pointer' referenced before assignment

linked_list1:14: UnboundLocalError

   - [#  38] SDL linked_list1: 
--------------------------------------------------------------------------------
  12:         fast_pointer = self.next.next
  13:         
  14:         while slow_pointer is not fast_pointer:
  15:             if slow_pointer:
- 16:                 slow_pointer = slow_pointer.next
+ 16:                 pass
  17:             if (fast_pointer and fast_pointer.next):
  18:                 fast_pointer = fast_pointer.next.next
  19:         if slow_pointer is None:
  20:             return False
--------------------------------------------------------------------------------
[0.13297 s] survived

   - [#  39] SDL linked_list1: 
--------------------------------------------------------------------------------
  14:         while slow_pointer is not fast_pointer:
  15:             if slow_pointer:
  16:                 slow_pointer = slow_pointer.next
  17:             if (fast_pointer and fast_pointer.next):
- 18:                 fast_pointer = fast_pointer.next.next
+ 18:                 pass
  19:         if slow_pointer is None:
  20:             return False
  21:         else:
  22:             return True
--------------------------------------------------------------------------------
[0.13470 s] survived

   - [#  40] SDL linked_list1: 
--------------------------------------------------------------------------------
  16:                 slow_pointer = slow_pointer.next
  17:             if (fast_pointer and fast_pointer.next):
  18:                 fast_pointer = fast_pointer.next.next
  19:         if slow_pointer is None:
- 20:             return False
+ 20:             pass
  21:         else:
  22:             return True
  23:     
  24:     def get_beginning_of_cycle_if_exists(self):
--------------------------------------------------------------------------------
[0.13585 s] survived

   - [#  42] SDL linked_list1: 
--------------------------------------------------------------------------------
  23:     
  24:     def get_beginning_of_cycle_if_exists(self):
  25:         
  26:         if not (self.next):
- 27:             return None
+ 27:             pass
  28:         slow_pointer = self.next
  29:         fast_pointer = self.next.next
  30:         
  31:         while slow_pointer is not fast_pointer:
--------------------------------------------------------------------------------
[0.15709 s] killed by ts-3-5/test_3-5_0-2_65.py::test_get_beginning_of_cycle_if_exists

def test_get_beginning_of_cycle_if_exists():
        # Test case for a list with no cycle
        node1 = ListNode(1)
>       assert node1.get_beginning_of_cycle_if_exists() == None

ts-3-5/test_3-5_0-2_65.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linked_list1.ListNode object at 0x7d3f4b8128f0>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

linked_list1:29: AttributeError

   - [#  43] SDL linked_list1: 
--------------------------------------------------------------------------------
  24:     def get_beginning_of_cycle_if_exists(self):
  25:         
  26:         if not (self.next):
  27:             return None
- 28:         slow_pointer = self.next
+ 28:         pass
  29:         fast_pointer = self.next.next
  30:         
  31:         while slow_pointer is not fast_pointer:
  32:             if slow_pointer:
--------------------------------------------------------------------------------
[0.15717 s] killed by ts-3-5/test_3-5_0-2_65.py::test_get_beginning_of_cycle_if_exists

def test_get_beginning_of_cycle_if_exists():
        # Test case for a list with no cycle
        node1 = ListNode(1)
        assert node1.get_beginning_of_cycle_if_exists() == None
    
        # Test case for a list with a cycle
        node2 = ListNode(2)
        node3 = ListNode(3)
        node4 = ListNode(4)
        node2.next = node3
        node3.next = node4
        node4.next = node2
>       assert node2.get_beginning_of_cycle_if_exists() == node2

ts-3-5/test_3-5_0-2_65.py:37: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linked_list1.ListNode object at 0x7d3f4b6407f0>

>   ???
E   UnboundLocalError: local variable 'slow_pointer' referenced before assignment

linked_list1:31: UnboundLocalError

   - [#  47] SDL linked_list1: 
--------------------------------------------------------------------------------
  33:                 slow_pointer = slow_pointer.next
  34:             if (fast_pointer and fast_pointer.next):
  35:                 fast_pointer = fast_pointer.next.next
  36:         if slow_pointer is None:
- 37:             return None
+ 37:             pass
  38:         
  39:         slow_pointer = self
  40:         
  41:         while slow_pointer is not fast_pointer:
--------------------------------------------------------------------------------
[0.13113 s] survived

   - [#  48] SDL linked_list1: 
--------------------------------------------------------------------------------
  35:                 fast_pointer = fast_pointer.next.next
  36:         if slow_pointer is None:
  37:             return None
  38:         
- 39:         slow_pointer = self
+ 39:         pass
  40:         
  41:         while slow_pointer is not fast_pointer:
  42:             
  43:             slow_pointer = slow_pointer.next
--------------------------------------------------------------------------------
[0.13250 s] survived

   - [#  49] SDL linked_list1: 
--------------------------------------------------------------------------------
  39:         slow_pointer = self
  40:         
  41:         while slow_pointer is not fast_pointer:
  42:             
- 43:             slow_pointer = slow_pointer.next
+ 43:             pass
  44:             fast_pointer = fast_pointer.next
  45:         
  46:         return slow_pointer
  47:     
--------------------------------------------------------------------------------
[0.13489 s] survived
