   - [#  50] SDL linked_list1: 
--------------------------------------------------------------------------------
  40:         
  41:         while slow_pointer is not fast_pointer:
  42:             
  43:             slow_pointer = slow_pointer.next
- 44:             fast_pointer = fast_pointer.next
+ 44:             pass
  45:         
  46:         return slow_pointer
  47:     
  48:     def reverse(self):
--------------------------------------------------------------------------------
[0.13373 s] survived

   - [#  51] SDL linked_list1: 
--------------------------------------------------------------------------------
  42:             
  43:             slow_pointer = slow_pointer.next
  44:             fast_pointer = fast_pointer.next
  45:         
- 46:         return slow_pointer
+ 46:         pass
  47:     
  48:     def reverse(self):
  49:         prev = None
  50:         head = self
--------------------------------------------------------------------------------
[0.15738 s] killed by ts-3-5/test_3-5_0-2_65.py::test_get_beginning_of_cycle_if_exists

def test_get_beginning_of_cycle_if_exists():
        # Test case for a list with no cycle
        node1 = ListNode(1)
        assert node1.get_beginning_of_cycle_if_exists() == None
    
        # Test case for a list with a cycle
        node2 = ListNode(2)
        node3 = ListNode(3)
        node4 = ListNode(4)
        node2.next = node3
        node3.next = node4
        node4.next = node2
>       assert node2.get_beginning_of_cycle_if_exists() == node2
E       AssertionError

ts-3-5/test_3-5_0-2_65.py:37: AssertionError

   - [#  52] SDL linked_list1: 
--------------------------------------------------------------------------------
  45:         
  46:         return slow_pointer
  47:     
  48:     def reverse(self):
- 49:         prev = None
+ 49:         pass
  50:         head = self
  51:         while head.next:
  52:             next_node = head.next
  53:             head.next = prev
--------------------------------------------------------------------------------
[0.15504 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse

def test_reverse():
        # Test case for reversing a list
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
>       reversed_node = node1.reverse()

ts-3-5/test_3-5_0-2_65.py:47: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linked_list1.ListNode object at 0x7d3f4b7a8a60>

>   ???
E   UnboundLocalError: local variable 'prev' referenced before assignment

linked_list1:53: UnboundLocalError

   - [#  53] SDL linked_list1: 
--------------------------------------------------------------------------------
  46:         return slow_pointer
  47:     
  48:     def reverse(self):
  49:         prev = None
- 50:         head = self
+ 50:         pass
  51:         while head.next:
  52:             next_node = head.next
  53:             head.next = prev
  54:             prev = head
--------------------------------------------------------------------------------
[0.15079 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse

def test_reverse():
        # Test case for reversing a list
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
>       reversed_node = node1.reverse()

ts-3-5/test_3-5_0-2_65.py:47: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linked_list1.ListNode object at 0x7d3f4b5a5300>

>   ???
E   UnboundLocalError: local variable 'head' referenced before assignment

linked_list1:51: UnboundLocalError

   - [#  54] SDL linked_list1: 
--------------------------------------------------------------------------------
  48:     def reverse(self):
  49:         prev = None
  50:         head = self
  51:         while head.next:
- 52:             next_node = head.next
+ 52:             pass
  53:             head.next = prev
  54:             prev = head
  55:             head = next_node
  56:         head.next = prev
--------------------------------------------------------------------------------
[0.16661 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse

def test_reverse():
        # Test case for reversing a list
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
>       reversed_node = node1.reverse()

ts-3-5/test_3-5_0-2_65.py:47: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linked_list1.ListNode object at 0x7d3f4b593c40>

>   ???
E   NameError: name 'next_node' is not defined

linked_list1:55: NameError

   - [#  55] SDL linked_list1: 
--------------------------------------------------------------------------------
  49:         prev = None
  50:         head = self
  51:         while head.next:
  52:             next_node = head.next
- 53:             head.next = prev
+ 53:             pass
  54:             prev = head
  55:             head = next_node
  56:         head.next = prev
  57:         return head
--------------------------------------------------------------------------------
[0.15496 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse

def test_reverse():
        # Test case for reversing a list
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
        reversed_node = node1.reverse()
        assert reversed_node.val == 3
        assert reversed_node.next.val == 2
>       assert reversed_node.next.next.val == 1
E       AssertionError

ts-3-5/test_3-5_0-2_65.py:50: AssertionError

   - [#  56] SDL linked_list1: 
--------------------------------------------------------------------------------
  50:         head = self
  51:         while head.next:
  52:             next_node = head.next
  53:             head.next = prev
- 54:             prev = head
+ 54:             pass
  55:             head = next_node
  56:         head.next = prev
  57:         return head
  58:     
--------------------------------------------------------------------------------
[0.14943 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse

def test_reverse():
        # Test case for reversing a list
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
        reversed_node = node1.reverse()
        assert reversed_node.val == 3
>       assert reversed_node.next.val == 2
E       AttributeError: 'NoneType' object has no attribute 'val'

ts-3-5/test_3-5_0-2_65.py:49: AttributeError

   - [#  57] SDL linked_list1: 
--------------------------------------------------------------------------------
  51:         while head.next:
  52:             next_node = head.next
  53:             head.next = prev
  54:             prev = head
- 55:             head = next_node
+ 55:             pass
  56:         head.next = prev
  57:         return head
  58:     
  59:     def reverse_recursive(self):
--------------------------------------------------------------------------------
[0.15258 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse

def test_reverse():
        # Test case for reversing a list
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
        reversed_node = node1.reverse()
>       assert reversed_node.val == 3
E       AssertionError

ts-3-5/test_3-5_0-2_65.py:48: AssertionError

   - [#  58] SDL linked_list1: 
--------------------------------------------------------------------------------
  52:             next_node = head.next
  53:             head.next = prev
  54:             prev = head
  55:             head = next_node
- 56:         head.next = prev
+ 56:         pass
  57:         return head
  58:     
  59:     def reverse_recursive(self):
  60:         def rev(node):
--------------------------------------------------------------------------------
[0.15282 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse

def test_reverse():
        # Test case for reversing a list
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
        reversed_node = node1.reverse()
        assert reversed_node.val == 3
>       assert reversed_node.next.val == 2
E       AttributeError: 'NoneType' object has no attribute 'val'

ts-3-5/test_3-5_0-2_65.py:49: AttributeError

   - [#  59] SDL linked_list1: 
--------------------------------------------------------------------------------
  53:             head.next = prev
  54:             prev = head
  55:             head = next_node
  56:         head.next = prev
- 57:         return head
+ 57:         pass
  58:     
  59:     def reverse_recursive(self):
  60:         def rev(node):
  61:             if not (node.next):
--------------------------------------------------------------------------------
[0.15083 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse

def test_reverse():
        # Test case for reversing a list
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
        reversed_node = node1.reverse()
>       assert reversed_node.val == 3
E       AttributeError: 'NoneType' object has no attribute 'val'

ts-3-5/test_3-5_0-2_65.py:48: AttributeError

   - [#  60] SDL linked_list1: 
--------------------------------------------------------------------------------
  58:     
  59:     def reverse_recursive(self):
  60:         def rev(node):
  61:             if not (node.next):
- 62:                 rev.head = node
+ 62:                 pass
  63:                 return
  64:             rev(node.next)
  65:             temp = node.next
  66:             temp.next = node
--------------------------------------------------------------------------------
[0.15066 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse_recursive

def test_reverse_recursive():
        # Test case for reversing a list recursively
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
        reversed_node = node1.reverse_recursive()
>       assert reversed_node.val == 3
E       AssertionError

ts-3-5/test_3-5_0-2_65.py:61: AssertionError

   - [#  61] SDL linked_list1: 
--------------------------------------------------------------------------------
  59:     def reverse_recursive(self):
  60:         def rev(node):
  61:             if not (node.next):
  62:                 rev.head = node
- 63:                 return
+ 63:                 pass
  64:             rev(node.next)
  65:             temp = node.next
  66:             temp.next = node
  67:             node.next = None
--------------------------------------------------------------------------------
[0.15424 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse_recursive

def test_reverse_recursive():
        # Test case for reversing a list recursively
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
>       reversed_node = node1.reverse_recursive()

ts-3-5/test_3-5_0-2_65.py:60: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
linked_list1:69: in reverse_recursive
    ???
linked_list1:64: in rev
    ???
linked_list1:64: in rev
    ???
linked_list1:64: in rev
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

node = None

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

linked_list1:61: AttributeError

   - [#  62] SDL linked_list1: 
--------------------------------------------------------------------------------
  60:         def rev(node):
  61:             if not (node.next):
  62:                 rev.head = node
  63:                 return
- 64:             rev(node.next)
+ 64:             pass
  65:             temp = node.next
  66:             temp.next = node
  67:             node.next = None
  68:         rev.head = self
--------------------------------------------------------------------------------
[0.15201 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse_recursive

def test_reverse_recursive():
        # Test case for reversing a list recursively
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
        reversed_node = node1.reverse_recursive()
>       assert reversed_node.val == 3
E       AssertionError

ts-3-5/test_3-5_0-2_65.py:61: AssertionError

   - [#  63] SDL linked_list1: 
--------------------------------------------------------------------------------
  61:             if not (node.next):
  62:                 rev.head = node
  63:                 return
  64:             rev(node.next)
- 65:             temp = node.next
+ 65:             pass
  66:             temp.next = node
  67:             node.next = None
  68:         rev.head = self
  69:         rev(self)
--------------------------------------------------------------------------------
[0.15668 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse_recursive

def test_reverse_recursive():
        # Test case for reversing a list recursively
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
>       reversed_node = node1.reverse_recursive()

ts-3-5/test_3-5_0-2_65.py:60: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
linked_list1:69: in reverse_recursive
    ???
linked_list1:64: in rev
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

node = <linked_list1.ListNode object at 0x7d3f4b810820>

>   ???
E   NameError: name 'temp' is not defined

linked_list1:66: NameError

   - [#  64] SDL linked_list1: 
--------------------------------------------------------------------------------
  62:                 rev.head = node
  63:                 return
  64:             rev(node.next)
  65:             temp = node.next
- 66:             temp.next = node
+ 66:             pass
  67:             node.next = None
  68:         rev.head = self
  69:         rev(self)
  70:         
--------------------------------------------------------------------------------
[0.15353 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse_recursive

def test_reverse_recursive():
        # Test case for reversing a list recursively
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
        reversed_node = node1.reverse_recursive()
        assert reversed_node.val == 3
>       assert reversed_node.next.val == 2
E       AttributeError: 'NoneType' object has no attribute 'val'

ts-3-5/test_3-5_0-2_65.py:62: AttributeError

   - [#  65] SDL linked_list1: 
--------------------------------------------------------------------------------
  63:                 return
  64:             rev(node.next)
  65:             temp = node.next
  66:             temp.next = node
- 67:             node.next = None
+ 67:             pass
  68:         rev.head = self
  69:         rev(self)
  70:         
  71:         return rev.head
--------------------------------------------------------------------------------
[0.12825 s] survived

   - [#  66] SDL linked_list1: 
--------------------------------------------------------------------------------
  64:             rev(node.next)
  65:             temp = node.next
  66:             temp.next = node
  67:             node.next = None
- 68:         rev.head = self
+ 68:         pass
  69:         rev(self)
  70:         
  71:         return rev.head
--------------------------------------------------------------------------------
[0.13180 s] survived

   - [#  67] SDL linked_list1: 
--------------------------------------------------------------------------------
  65:             temp = node.next
  66:             temp.next = node
  67:             node.next = None
  68:         rev.head = self
- 69:         rev(self)
+ 69:         pass
  70:         
  71:         return rev.head
--------------------------------------------------------------------------------
[0.15223 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse_recursive

def test_reverse_recursive():
        # Test case for reversing a list recursively
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
        reversed_node = node1.reverse_recursive()
>       assert reversed_node.val == 3
E       AssertionError

ts-3-5/test_3-5_0-2_65.py:61: AssertionError

   - [#  68] SDL linked_list1: 
--------------------------------------------------------------------------------
  67:             node.next = None
  68:         rev.head = self
  69:         rev(self)
  70:         
- 71:         return rev.head
+ 71:         pass
--------------------------------------------------------------------------------
[0.15393 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse_recursive

def test_reverse_recursive():
        # Test case for reversing a list recursively
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
        reversed_node = node1.reverse_recursive()
>       assert reversed_node.val == 3
E       AttributeError: 'NoneType' object has no attribute 'val'

ts-3-5/test_3-5_0-2_65.py:61: AttributeError

   - [#  71] SVD linked_list1: 
--------------------------------------------------------------------------------
   5:         self.next = next
   6:     
   7:     def contains_cycle(self):
   8:         
-  9:         if not (self.next):
+  9:         if not next:
  10:             return False
  11:         slow_pointer = self.next
  12:         fast_pointer = self.next.next
  13:         
--------------------------------------------------------------------------------
[0.15451 s] killed by ts-3-5/test_3-5_0-2_65.py::test_contains_cycle

def test_contains_cycle():
        # Test case for a list with no cycle
        node1 = ListNode(1)
>       assert node1.contains_cycle() == False

ts-3-5/test_3-5_0-2_65.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linked_list1.ListNode object at 0x7d3f4b704190>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

linked_list1:12: AttributeError

   - [#  72] SVD linked_list1: 
--------------------------------------------------------------------------------
   7:     def contains_cycle(self):
   8:         
   9:         if not (self.next):
  10:             return False
- 11:         slow_pointer = self.next
+ 11:         slow_pointer = next
  12:         fast_pointer = self.next.next
  13:         
  14:         while slow_pointer is not fast_pointer:
  15:             if slow_pointer:
--------------------------------------------------------------------------------
[0.15654 s] killed by ts-3-5/test_3-5_0-2_65.py::test_contains_cycle

def test_contains_cycle():
        # Test case for a list with no cycle
        node1 = ListNode(1)
        assert node1.contains_cycle() == False
    
        # Test case for a list with a cycle
        node2 = ListNode(2)
        node3 = ListNode(3)
        node4 = ListNode(4)
        node2.next = node3
        node3.next = node4
        node4.next = node2
>       assert node2.contains_cycle() == True

ts-3-5/test_3-5_0-2_65.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linked_list1.ListNode object at 0x7d3f4b555300>

>   ???
E   AttributeError: 'builtin_function_or_method' object has no attribute 'next'

linked_list1:16: AttributeError

   - [#  73] SVD linked_list1: 
--------------------------------------------------------------------------------
   8:         
   9:         if not (self.next):
  10:             return False
  11:         slow_pointer = self.next
- 12:         fast_pointer = self.next.next
+ 12:         fast_pointer = next.next
  13:         
  14:         while slow_pointer is not fast_pointer:
  15:             if slow_pointer:
  16:                 slow_pointer = slow_pointer.next
--------------------------------------------------------------------------------
[0.17096 s] killed by ts-3-5/test_3-5_0-2_65.py::test_contains_cycle

def test_contains_cycle():
        # Test case for a list with no cycle
        node1 = ListNode(1)
        assert node1.contains_cycle() == False
    
        # Test case for a list with a cycle
        node2 = ListNode(2)
        node3 = ListNode(3)
        node4 = ListNode(4)
        node2.next = node3
        node3.next = node4
        node4.next = node2
>       assert node2.contains_cycle() == True

ts-3-5/test_3-5_0-2_65.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linked_list1.ListNode object at 0x7d3f4b5d72e0>

>   ???
E   AttributeError: 'builtin_function_or_method' object has no attribute 'next'

linked_list1:12: AttributeError

   - [#  75] SVD linked_list1: 
--------------------------------------------------------------------------------
  24:     def get_beginning_of_cycle_if_exists(self):
  25:         
  26:         if not (self.next):
  27:             return None
- 28:         slow_pointer = self.next
+ 28:         slow_pointer = next
  29:         fast_pointer = self.next.next
  30:         
  31:         while slow_pointer is not fast_pointer:
  32:             if slow_pointer:
--------------------------------------------------------------------------------
[0.15693 s] killed by ts-3-5/test_3-5_0-2_65.py::test_get_beginning_of_cycle_if_exists

def test_get_beginning_of_cycle_if_exists():
        # Test case for a list with no cycle
        node1 = ListNode(1)
        assert node1.get_beginning_of_cycle_if_exists() == None
    
        # Test case for a list with a cycle
        node2 = ListNode(2)
        node3 = ListNode(3)
        node4 = ListNode(4)
        node2.next = node3
        node3.next = node4
        node4.next = node2
>       assert node2.get_beginning_of_cycle_if_exists() == node2

ts-3-5/test_3-5_0-2_65.py:37: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <linked_list1.ListNode object at 0x7d3f4b610e20>

>   ???
E   AttributeError: 'builtin_function_or_method' object has no attribute 'next'

linked_list1:33: AttributeError

   - [#  77] ZIL linked_list1: 
--------------------------------------------------------------------------------
  11:         slow_pointer = self.next
  12:         fast_pointer = self.next.next
  13:         
  14:         while slow_pointer is not fast_pointer:
- 15:             if slow_pointer:
- 16:                 slow_pointer = slow_pointer.next
- 17:             if (fast_pointer and fast_pointer.next):
- 18:                 fast_pointer = fast_pointer.next.next
+ 15:             break
+ 16:         
+ 17:         
+ 18:         
  19:         if slow_pointer is None:
  20:             return False
  21:         else:
  22:             return True
--------------------------------------------------------------------------------
[0.13591 s] survived

   - [#  79] ZIL linked_list1: 
--------------------------------------------------------------------------------
  39:         slow_pointer = self
  40:         
  41:         while slow_pointer is not fast_pointer:
  42:             
- 43:             slow_pointer = slow_pointer.next
- 44:             fast_pointer = fast_pointer.next
+ 43:             break
+ 44:         
  45:         
  46:         return slow_pointer
  47:     
  48:     def reverse(self):
--------------------------------------------------------------------------------
[0.13013 s] survived

   - [#  80] ZIL linked_list1: 
--------------------------------------------------------------------------------
  48:     def reverse(self):
  49:         prev = None
  50:         head = self
  51:         while head.next:
- 52:             next_node = head.next
- 53:             head.next = prev
- 54:             prev = head
- 55:             head = next_node
+ 52:             break
+ 53:         
+ 54:         
+ 55:         
  56:         head.next = prev
  57:         return head
  58:     
  59:     def reverse_recursive(self):
--------------------------------------------------------------------------------
[0.15739 s] killed by ts-3-5/test_3-5_0-2_65.py::test_reverse

def test_reverse():
        # Test case for reversing a list
        node1 = ListNode(1)
        node2 = ListNode(2)
        node3 = ListNode(3)
        node1.next = node2
        node2.next = node3
    
        reversed_node = node1.reverse()
>       assert reversed_node.val == 3
E       AssertionError

ts-3-5/test_3-5_0-2_65.py:48: AssertionError
