1 : Job ID c09db29983e74a3b856b830bf8eb6996
test outcome: killed
linked_list2.py, start pos: (85, 38), end pos: (85, 39)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -82,7 +82,7 @@
         curr = self.head
         display = '('
         while curr:
-            display += str(curr.data) + ', '
+            display += str(curr.data) - ', '
             curr = curr.next
         return display[:-2] + ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - TypeError: unsup...
========================= 1 failed, 8 passed in 0.15s ==========================

2 : Job ID 670cdc3303de40d9a2d6c1c95f41d06e
test outcome: killed
linked_list2.py, start pos: (87, 28), end pos: (87, 29)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 1
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -84,5 +84,5 @@
         while curr:
             display += str(curr.data) + ', '
             curr = curr.next
-        return display[:-2] + ')'
+        return display[:-2] - ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - TypeError: unsup...
========================= 1 failed, 8 passed in 0.15s ==========================

3 : Job ID b8c7941c279642268b92d32153e7c482
test outcome: killed
linked_list2.py, start pos: (85, 38), end pos: (85, 39)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -82,7 +82,7 @@
         curr = self.head
         display = '('
         while curr:
-            display += str(curr.data) + ', '
+            display += str(curr.data) * ', '
             curr = curr.next
         return display[:-2] + ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - TypeError: can't...
========================= 1 failed, 8 passed in 0.15s ==========================

4 : Job ID dea792cb8224400f911d9151e7b4acbc
test outcome: killed
linked_list2.py, start pos: (87, 28), end pos: (87, 29)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 1
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -84,5 +84,5 @@
         while curr:
             display += str(curr.data) + ', '
             curr = curr.next
-        return display[:-2] + ')'
+        return display[:-2] * ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - TypeError: can't...
========================= 1 failed, 8 passed in 0.14s ==========================

5 : Job ID b9bdedecd3e742e4a0e3ed80b5354e67
test outcome: killed
linked_list2.py, start pos: (85, 38), end pos: (85, 39)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -82,7 +82,7 @@
         curr = self.head
         display = '('
         while curr:
-            display += str(curr.data) + ', '
+            display += str(curr.data) / ', '
             curr = curr.next
         return display[:-2] + ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - TypeError: unsup...
========================= 1 failed, 8 passed in 0.15s ==========================

6 : Job ID 0d050eee76d94f44be3c089c734a62a0
test outcome: killed
linked_list2.py, start pos: (87, 28), end pos: (87, 29)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 1
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -84,5 +84,5 @@
         while curr:
             display += str(curr.data) + ', '
             curr = curr.next
-        return display[:-2] + ')'
+        return display[:-2] / ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - TypeError: unsup...
========================= 1 failed, 8 passed in 0.15s ==========================

7 : Job ID 2a281fd20a944aa3aec2a7b3fd4e4230
test outcome: killed
linked_list2.py, start pos: (85, 38), end pos: (85, 39)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -82,7 +82,7 @@
         curr = self.head
         display = '('
         while curr:
-            display += str(curr.data) + ', '
+            display += str(curr.data) // ', '
             curr = curr.next
         return display[:-2] + ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - TypeError: unsup...
========================= 1 failed, 8 passed in 0.15s ==========================

8 : Job ID 0a9ba695a0e74610973ceef96f57eadf
test outcome: killed
linked_list2.py, start pos: (87, 28), end pos: (87, 29)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 1
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -84,5 +84,5 @@
         while curr:
             display += str(curr.data) + ', '
             curr = curr.next
-        return display[:-2] + ')'
+        return display[:-2] // ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - TypeError: unsup...
========================= 1 failed, 8 passed in 0.15s ==========================

9 : Job ID 1160b82cd3784ecf8ec2e4720f3ec862
test outcome: killed
linked_list2.py, start pos: (85, 38), end pos: (85, 39)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -82,7 +82,7 @@
         curr = self.head
         display = '('
         while curr:
-            display += str(curr.data) + ', '
+            display += str(curr.data) % ', '
             curr = curr.next
         return display[:-2] + ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - TypeError: not a...
========================= 1 failed, 8 passed in 0.15s ==========================

10 : Job ID 096a0a2ef13a40dd992341beadaba69a
test outcome: killed
linked_list2.py, start pos: (87, 28), end pos: (87, 29)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 1
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -84,5 +84,5 @@
         while curr:
             display += str(curr.data) + ', '
             curr = curr.next
-        return display[:-2] + ')'
+        return display[:-2] % ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - TypeError: not a...
========================= 1 failed, 8 passed in 0.15s ==========================

11 : Job ID 46b3f326ea77403d8f73b9edd9a50461
test outcome: killed
linked_list2.py, start pos: (85, 38), end pos: (85, 39)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -82,7 +82,7 @@
         curr = self.head
         display = '('
         while curr:
-            display += str(curr.data) + ', '
+            display += str(curr.data) ** ', '
             curr = curr.next
         return display[:-2] + ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - TypeError: unsup...
========================= 1 failed, 8 passed in 0.15s ==========================

12 : Job ID d9e52f4d8afd4d85b2c042847e6c90fc
test outcome: killed
linked_list2.py, start pos: (87, 28), end pos: (87, 29)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 1
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -84,5 +84,5 @@
         while curr:
             display += str(curr.data) + ', '
             curr = curr.next
-        return display[:-2] + ')'
+        return display[:-2] ** ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - TypeError: unsup...
========================= 1 failed, 8 passed in 0.15s ==========================

13 : Job ID 9eea44bac0d04ad688885be8038c6f2d
test outcome: killed
linked_list2.py, start pos: (85, 38), end pos: (85, 39)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -82,7 +82,7 @@
         curr = self.head
         display = '('
         while curr:
-            display += str(curr.data) + ', '
+            display += str(curr.data) >> ', '
             curr = curr.next
         return display[:-2] + ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - TypeError: unsup...
========================= 1 failed, 8 passed in 0.15s ==========================

14 : Job ID 04bf3f321f114f97a4aa794a96c3556c
test outcome: killed
linked_list2.py, start pos: (87, 28), end pos: (87, 29)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 1
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -84,5 +84,5 @@
         while curr:
             display += str(curr.data) + ', '
             curr = curr.next
-        return display[:-2] + ')'
+        return display[:-2] >> ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - TypeError: unsup...
========================= 1 failed, 8 passed in 0.15s ==========================

15 : Job ID e3a644a377884d42b1c11e5ecdfbd69d
test outcome: killed
linked_list2.py, start pos: (85, 38), end pos: (85, 39)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -82,7 +82,7 @@
         curr = self.head
         display = '('
         while curr:
-            display += str(curr.data) + ', '
+            display += str(curr.data) << ', '
             curr = curr.next
         return display[:-2] + ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - TypeError: unsup...
========================= 1 failed, 8 passed in 0.15s ==========================

16 : Job ID 84c90afa3db34d2682d70c0d5556d729
test outcome: killed
linked_list2.py, start pos: (87, 28), end pos: (87, 29)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 1
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -84,5 +84,5 @@
         while curr:
             display += str(curr.data) + ', '
             curr = curr.next
-        return display[:-2] + ')'
+        return display[:-2] << ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - TypeError: unsup...
========================= 1 failed, 8 passed in 0.15s ==========================

17 : Job ID 80ac50b037144ddbbbe363edf7beeff9
test outcome: killed
linked_list2.py, start pos: (85, 38), end pos: (85, 39)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -82,7 +82,7 @@
         curr = self.head
         display = '('
         while curr:
-            display += str(curr.data) + ', '
+            display += str(curr.data) | ', '
             curr = curr.next
         return display[:-2] + ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - TypeError: unsup...
========================= 1 failed, 8 passed in 0.15s ==========================

18 : Job ID d8d6a6ce4bcd417fb8c8b9762d017f7a
test outcome: killed
linked_list2.py, start pos: (87, 28), end pos: (87, 29)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 1
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -84,5 +84,5 @@
         while curr:
             display += str(curr.data) + ', '
             curr = curr.next
-        return display[:-2] + ')'
+        return display[:-2] | ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - TypeError: unsup...
========================= 1 failed, 8 passed in 0.15s ==========================

19 : Job ID 25df7eea0e3c4e0e897c525a3fcc4873
test outcome: killed
linked_list2.py, start pos: (85, 38), end pos: (85, 39)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -82,7 +82,7 @@
         curr = self.head
         display = '('
         while curr:
-            display += str(curr.data) + ', '
+            display += str(curr.data) & ', '
             curr = curr.next
         return display[:-2] + ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - TypeError: unsup...
========================= 1 failed, 8 passed in 0.15s ==========================

20 : Job ID 7a74ae8d0105491087461d5d1456a216
test outcome: killed
linked_list2.py, start pos: (87, 28), end pos: (87, 29)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 1
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -84,5 +84,5 @@
         while curr:
             display += str(curr.data) + ', '
             curr = curr.next
-        return display[:-2] + ')'
+        return display[:-2] & ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - TypeError: unsup...
========================= 1 failed, 8 passed in 0.16s ==========================

21 : Job ID 2eb38fe3761941f9917521a0facd97d5
test outcome: killed
linked_list2.py, start pos: (85, 38), end pos: (85, 39)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -82,7 +82,7 @@
         curr = self.head
         display = '('
         while curr:
-            display += str(curr.data) + ', '
+            display += str(curr.data) ^ ', '
             curr = curr.next
         return display[:-2] + ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - TypeError: unsup...
========================= 1 failed, 8 passed in 0.15s ==========================

22 : Job ID 894d922501304a5c8b0b60fb38919d3f
test outcome: killed
linked_list2.py, start pos: (87, 28), end pos: (87, 29)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 1
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -84,5 +84,5 @@
         while curr:
             display += str(curr.data) + ', '
             curr = curr.next
-        return display[:-2] + ')'
+        return display[:-2] ^ ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - TypeError: unsup...
========================= 1 failed, 8 passed in 0.15s ==========================

23 : Job ID d1898d6748b54630ae6acc9202d9e6a0
test outcome: killed
linked_list2.py, start pos: (64, 25), end pos: (64, 27)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -61,7 +61,7 @@
         """Return the node containing val."""
         curr = self.head
         while curr:
-            if curr.data == val:
+            if curr.data != val:
                 return curr
             curr = curr.next
ts-3-5/test_3-5_1-0_305.py .....FF..                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_search_found - assert 3 == 2
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_search_not_found - assert ...
========================= 2 failed, 7 passed in 0.15s ==========================

24 : Job ID 4f101f0f137c41fd9e9ca7b5742ab98e
SURVIVED
test outcome: survived
linked_list2.py, start pos: (75, 45), end pos: (75, 47)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 1
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -72,7 +72,7 @@
             self.head = self.head.next
             self._length -= 1
         while curr:
-            if (curr.next and curr.next.data == val):
+            if (curr.next and curr.next.data != val):
                 curr.next = curr.next.next
                 self._length -= 1
             curr = curr.next
ts-3-5/test_3-5_1-0_305.py .........                                     [100%]
============================== 9 passed in 0.15s ===============================

25 : Job ID dd549ce4dacf4048b02a6c6df45a3e1e
test outcome: killed
linked_list2.py, start pos: (64, 25), end pos: (64, 27)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -61,7 +61,7 @@
         """Return the node containing val."""
         curr = self.head
         while curr:
-            if curr.data == val:
+            if curr.data < val:
                 return curr
             curr = curr.next
ts-3-5/test_3-5_1-0_305.py .....FF..                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_search_found - assert 1 == 2
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_search_not_found - assert ...
========================= 2 failed, 7 passed in 0.15s ==========================

26 : Job ID e291d16f0a5249a5820964cf02ee9a30
SURVIVED
test outcome: survived
linked_list2.py, start pos: (75, 45), end pos: (75, 47)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 1
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -72,7 +72,7 @@
             self.head = self.head.next
             self._length -= 1
         while curr:
-            if (curr.next and curr.next.data == val):
+            if (curr.next and curr.next.data < val):
                 curr.next = curr.next.next
                 self._length -= 1
             curr = curr.next
ts-3-5/test_3-5_1-0_305.py .........                                     [100%]
============================== 9 passed in 0.15s ===============================

27 : Job ID 669565038e924340a0687a348a0c624e
test outcome: killed
linked_list2.py, start pos: (64, 25), end pos: (64, 27)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -61,7 +61,7 @@
         """Return the node containing val."""
         curr = self.head
         while curr:
-            if curr.data == val:
+            if curr.data <= val:
                 return curr
             curr = curr.next
ts-3-5/test_3-5_1-0_305.py ......F..                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_search_not_found - assert ...
========================= 1 failed, 8 passed in 0.16s ==========================

28 : Job ID 4494a7f1adc24af998490919c3384949
SURVIVED
test outcome: survived
linked_list2.py, start pos: (75, 45), end pos: (75, 47)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 1
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -72,7 +72,7 @@
             self.head = self.head.next
             self._length -= 1
         while curr:
-            if (curr.next and curr.next.data == val):
+            if (curr.next and curr.next.data <= val):
                 curr.next = curr.next.next
                 self._length -= 1
             curr = curr.next
ts-3-5/test_3-5_1-0_305.py .........                                     [100%]
============================== 9 passed in 0.15s ===============================

29 : Job ID 21ef1a9c5bce4fb4b6283bba903307b5
test outcome: killed
linked_list2.py, start pos: (64, 25), end pos: (64, 27)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -61,7 +61,7 @@
         """Return the node containing val."""
         curr = self.head
         while curr:
-            if curr.data == val:
+            if curr.data > val:
                 return curr
             curr = curr.next
ts-3-5/test_3-5_1-0_305.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_search_found - assert 3 == 2
========================= 1 failed, 8 passed in 0.15s ==========================

30 : Job ID 970ee34b8aff401c847e2f82c7cef8b0
test outcome: killed
linked_list2.py, start pos: (75, 45), end pos: (75, 47)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 1
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -72,7 +72,7 @@
             self.head = self.head.next
             self._length -= 1
         while curr:
-            if (curr.next and curr.next.data == val):
+            if (curr.next and curr.next.data > val):
                 curr.next = curr.next.next
                 self._length -= 1
             curr = curr.next
ts-3-5/test_3-5_1-0_305.py .......F.                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_remove - assert 3 == 2
========================= 1 failed, 8 passed in 0.15s ==========================

31 : Job ID a0fe55f298024d649fb22a986d8fda1e
test outcome: killed
linked_list2.py, start pos: (64, 25), end pos: (64, 27)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -61,7 +61,7 @@
         """Return the node containing val."""
         curr = self.head
         while curr:
-            if curr.data == val:
+            if curr.data >= val:
                 return curr
             curr = curr.next
ts-3-5/test_3-5_1-0_305.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_search_found - assert 3 == 2
========================= 1 failed, 8 passed in 0.15s ==========================

32 : Job ID 9774e86c77df430aab3cb433c110f77b
SURVIVED
test outcome: survived
linked_list2.py, start pos: (75, 45), end pos: (75, 47)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 1
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -72,7 +72,7 @@
             self.head = self.head.next
             self._length -= 1
         while curr:
-            if (curr.next and curr.next.data == val):
+            if (curr.next and curr.next.data >= val):
                 curr.next = curr.next.next
                 self._length -= 1
             curr = curr.next
ts-3-5/test_3-5_1-0_305.py .........                                     [100%]
============================== 9 passed in 0.15s ===============================

33 : Job ID a58379cc10264a48be6ae68ea9afdbb9
SURVIVED
test outcome: survived
linked_list2.py, start pos: (64, 25), end pos: (64, 27)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -61,7 +61,7 @@
         """Return the node containing val."""
         curr = self.head
         while curr:
-            if curr.data == val:
+            if curr.data is val:
                 return curr
             curr = curr.next
ts-3-5/test_3-5_1-0_305.py .........                                     [100%]
============================== 9 passed in 0.15s ===============================

34 : Job ID e9a71e5c14194de1b3d1f2841143d5f8
SURVIVED
test outcome: survived
linked_list2.py, start pos: (75, 45), end pos: (75, 47)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 1
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -72,7 +72,7 @@
             self.head = self.head.next
             self._length -= 1
         while curr:
-            if (curr.next and curr.next.data == val):
+            if (curr.next and curr.next.data is val):
                 curr.next = curr.next.next
                 self._length -= 1
             curr = curr.next
ts-3-5/test_3-5_1-0_305.py .........                                     [100%]
============================== 9 passed in 0.15s ===============================

35 : Job ID f140a64e7f20437a8d74b0549819aad2
test outcome: killed
linked_list2.py, start pos: (64, 25), end pos: (64, 27)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -61,7 +61,7 @@
         """Return the node containing val."""
         curr = self.head
         while curr:
-            if curr.data == val:
+            if curr.data is not val:
                 return curr
             curr = curr.next
ts-3-5/test_3-5_1-0_305.py .....FF..                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_search_found - assert 3 == 2
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_search_not_found - assert ...
========================= 2 failed, 7 passed in 0.15s ==========================

36 : Job ID 72b3b3b841904de2a1df1fac6f5a6bfe
SURVIVED
test outcome: survived
linked_list2.py, start pos: (75, 45), end pos: (75, 47)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 1
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -72,7 +72,7 @@
             self.head = self.head.next
             self._length -= 1
         while curr:
-            if (curr.next and curr.next.data == val):
+            if (curr.next and curr.next.data is not val):
                 curr.next = curr.next.next
                 self._length -= 1
             curr = curr.next
ts-3-5/test_3-5_1-0_305.py .........                                     [100%]
============================== 9 passed in 0.15s ===============================

37 : Job ID c6604d79e6684b8f970a376020062563
SURVIVED
test outcome: survived
linked_list2.py, start pos: (71, 24), end pos: (71, 26)
operator: core/ReplaceComparisonOperator_Is_Eq, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -68,7 +68,7 @@
     def remove(self, val):
         """Remove node from list if exists."""
         curr = self.head
-        if curr and val is self.head.data:
+        if curr and val == self.head.data:
             self.head = self.head.next
             self._length -= 1
         while curr:
ts-3-5/test_3-5_1-0_305.py .........                                     [100%]
============================== 9 passed in 0.15s ===============================
