38 : Job ID 4c984924acf14304965f79527cfd8f63
test outcome: killed
linked_list2.py, start pos: (71, 24), end pos: (71, 26)
operator: core/ReplaceComparisonOperator_Is_NotEq, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -68,7 +68,7 @@
     def remove(self, val):
         """Remove node from list if exists."""
         curr = self.head
-        if curr and val is self.head.data:
+        if curr and val != self.head.data:
             self.head = self.head.next
             self._length -= 1
         while curr:
ts-3-5/test_3-5_1-0_305.py .......F.                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_remove - assert 1 == 2
========================= 1 failed, 8 passed in 0.15s ==========================

39 : Job ID 896ea09a71a1493e9a63b5b3b5d3fb0c
test outcome: killed
linked_list2.py, start pos: (71, 24), end pos: (71, 26)
operator: core/ReplaceComparisonOperator_Is_Lt, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -68,7 +68,7 @@
     def remove(self, val):
         """Remove node from list if exists."""
         curr = self.head
-        if curr and val is self.head.data:
+        if curr and val < self.head.data:
             self.head = self.head.next
             self._length -= 1
         while curr:
ts-3-5/test_3-5_1-0_305.py .......F.                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_remove - assert 1 == 2
========================= 1 failed, 8 passed in 0.14s ==========================

40 : Job ID 74aa09daeb2b4336a36dd397ba15a871
test outcome: killed
linked_list2.py, start pos: (71, 24), end pos: (71, 26)
operator: core/ReplaceComparisonOperator_Is_LtE, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -68,7 +68,7 @@
     def remove(self, val):
         """Remove node from list if exists."""
         curr = self.head
-        if curr and val is self.head.data:
+        if curr and val <= self.head.data:
             self.head = self.head.next
             self._length -= 1
         while curr:
ts-3-5/test_3-5_1-0_305.py .......F.                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_remove - assert 1 == 2
========================= 1 failed, 8 passed in 0.15s ==========================

41 : Job ID e64519c00507433abd19b1d0720277df
SURVIVED
test outcome: survived
linked_list2.py, start pos: (71, 24), end pos: (71, 26)
operator: core/ReplaceComparisonOperator_Is_Gt, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -68,7 +68,7 @@
     def remove(self, val):
         """Remove node from list if exists."""
         curr = self.head
-        if curr and val is self.head.data:
+        if curr and val > self.head.data:
             self.head = self.head.next
             self._length -= 1
         while curr:
ts-3-5/test_3-5_1-0_305.py .........                                     [100%]
============================== 9 passed in 0.15s ===============================

42 : Job ID ae6e12ef024943e9a0d4dbc3307c26c8
SURVIVED
test outcome: survived
linked_list2.py, start pos: (71, 24), end pos: (71, 26)
operator: core/ReplaceComparisonOperator_Is_GtE, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -68,7 +68,7 @@
     def remove(self, val):
         """Remove node from list if exists."""
         curr = self.head
-        if curr and val is self.head.data:
+        if curr and val >= self.head.data:
             self.head = self.head.next
             self._length -= 1
         while curr:
ts-3-5/test_3-5_1-0_305.py .........                                     [100%]
============================== 9 passed in 0.15s ===============================

43 : Job ID 6963652a65f54e2a872970352501229a
test outcome: killed
linked_list2.py, start pos: (71, 24), end pos: (71, 26)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -68,7 +68,7 @@
     def remove(self, val):
         """Remove node from list if exists."""
         curr = self.head
-        if curr and val is self.head.data:
+        if curr and val is not self.head.data:
             self.head = self.head.next
             self._length -= 1
         while curr:
ts-3-5/test_3-5_1-0_305.py .......F.                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_remove - assert 1 == 2
========================= 1 failed, 8 passed in 0.15s ==========================

44 : Job ID d43d401166214eb18bd3dfa2964f5c07
test outcome: killed
linked_list2.py, start pos: (87, 24), end pos: (87, 25)
operator: core/ReplaceUnaryOperator_USub_UAdd, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -84,5 +84,5 @@
         while curr:
             display += str(curr.data) + ', '
             curr = curr.next
-        return display[:-2] + ')'
+        return display[:+2] + ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - AssertionError: ...
========================= 1 failed, 8 passed in 0.15s ==========================

45 : Job ID d6f2d452599e47f6a3bcef44fc5a8c7e
test outcome: killed
linked_list2.py, start pos: (87, 24), end pos: (87, 25)
operator: core/ReplaceUnaryOperator_USub_Invert, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -84,5 +84,5 @@
         while curr:
             display += str(curr.data) + ', '
             curr = curr.next
-        return display[:-2] + ')'
+        return display[:~2] + ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - AssertionError: ...
========================= 1 failed, 8 passed in 0.16s ==========================

46 : Job ID e922c927c6254ba9a466aaeff16671d2
test outcome: killed
linked_list2.py, start pos: (87, 24), end pos: (87, 25)
operator: core/ReplaceUnaryOperator_USub_Not, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -84,5 +84,5 @@
         while curr:
             display += str(curr.data) + ', '
             curr = curr.next
-        return display[:-2] + ')'
+        return display[:not 2] + ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - AssertionError: ...
========================= 1 failed, 8 passed in 0.15s ==========================

47 : Job ID d3768374e4804e85a81e77a9c4657d30
test outcome: killed
linked_list2.py, start pos: (87, 24), end pos: (87, 25)
operator: core/ReplaceUnaryOperator_Delete_USub, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -84,5 +84,5 @@
         while curr:
             display += str(curr.data) + ', '
             curr = curr.next
-        return display[:-2] + ')'
+        return display[:2] + ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - AssertionError: ...
========================= 1 failed, 8 passed in 0.16s ==========================

48 : Job ID 1945a0a9757e4750897df9d61a0b7091
test outcome: killed
linked_list2.py, start pos: (49, 11), end pos: (49, 14)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -46,7 +46,7 @@
     def pop(self):
         """Remove the first value and return it."""
-        if not self.head:
+        if  self.head:
             raise IndexError('Cannot pop from an empty list')
         to_return = self.head
         self.head = self.head.next
ts-3-5/test_3-5_1-0_305.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_pop - IndexError: Cannot p...
========================= 1 failed, 8 passed in 0.15s ==========================

49 : Job ID 9a8400381b6e426e974a3284c345b079
test outcome: killed
linked_list2.py, start pos: (38, 15), end pos: (38, 19)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -35,7 +35,7 @@
             for val in data:
                 self.push(val)
         except TypeError:
-            if data:
+            if not data:
                 self.push(data)
     def push(self, val):
ts-3-5/test_3-5_1-0_305.py .F.......                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_empty - assert <linked_lis...
========================= 1 failed, 8 passed in 0.15s ==========================

50 : Job ID 189c9b09855842e282b01278b587e832
test outcome: killed
linked_list2.py, start pos: (49, 11), end pos: (49, 24)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -46,7 +46,7 @@
     def pop(self):
         """Remove the first value and return it."""
-        if not self.head:
+        if not not self.head:
             raise IndexError('Cannot pop from an empty list')
         to_return = self.head
         self.head = self.head.next
ts-3-5/test_3-5_1-0_305.py ...F.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_pop - IndexError: Cannot p...
========================= 1 failed, 8 passed in 0.15s ==========================

51 : Job ID 4bdeca1a0c694b8496b38bb226d82f3f
test outcome: killed
linked_list2.py, start pos: (63, 14), end pos: (63, 18)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -60,7 +60,7 @@
     def search(self, val):
         """Return the node containing val."""
         curr = self.head
-        while curr:
+        while not curr:
             if curr.data == val:
                 return curr
             curr = curr.next
ts-3-5/test_3-5_1-0_305.py .....F...                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_search_found - AttributeEr...
========================= 1 failed, 8 passed in 0.16s ==========================

52 : Job ID d47fbe83ca414a95a98a40c9083bc36c
test outcome: killed
linked_list2.py, start pos: (64, 15), end pos: (64, 31)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -61,7 +61,7 @@
         """Return the node containing val."""
         curr = self.head
         while curr:
-            if curr.data == val:
+            if not curr.data == val:
                 return curr
             curr = curr.next
ts-3-5/test_3-5_1-0_305.py .....FF..                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_search_found - assert 3 == 2
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_search_not_found - assert ...
========================= 2 failed, 7 passed in 0.15s ==========================

53 : Job ID c17bc9a86e0249e9b29bd10679bae4e9
SURVIVED
test outcome: survived
linked_list2.py, start pos: (71, 11), end pos: (71, 41)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -68,7 +68,7 @@
     def remove(self, val):
         """Remove node from list if exists."""
         curr = self.head
-        if curr and val is self.head.data:
+        if not curr and val is self.head.data:
             self.head = self.head.next
             self._length -= 1
         while curr:
ts-3-5/test_3-5_1-0_305.py .........                                     [100%]
============================== 9 passed in 0.15s ===============================

54 : Job ID 9c1d148939784b5b876fe878892448e5
test outcome: killed
linked_list2.py, start pos: (74, 14), end pos: (74, 18)
operator: core/AddNot, occurrence: 5
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -71,7 +71,7 @@
         if curr and val is self.head.data:
             self.head = self.head.next
             self._length -= 1
-        while curr:
+        while not curr:
             if (curr.next and curr.next.data == val):
                 curr.next = curr.next.next
                 self._length -= 1
ts-3-5/test_3-5_1-0_305.py .......F.                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_remove - assert 3 == 2
========================= 1 failed, 8 passed in 0.15s ==========================

55 : Job ID 867afca014314f1f979402f9c58413cd
SURVIVED
test outcome: survived
linked_list2.py, start pos: (75, 15), end pos: (75, 52)
operator: core/AddNot, occurrence: 6
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -72,7 +72,7 @@
             self.head = self.head.next
             self._length -= 1
         while curr:
-            if (curr.next and curr.next.data == val):
+            if not (curr.next and curr.next.data == val):
                 curr.next = curr.next.next
                 self._length -= 1
             curr = curr.next
ts-3-5/test_3-5_1-0_305.py .........                                     [100%]
============================== 9 passed in 0.15s ===============================

56 : Job ID 5074f71ed1f8482da4e6c081340d2e7a
test outcome: killed
linked_list2.py, start pos: (84, 14), end pos: (84, 18)
operator: core/AddNot, occurrence: 7
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -81,7 +81,7 @@
         """Display list as a tuple."""
         curr = self.head
         display = '('
-        while curr:
+        while not curr:
             display += str(curr.data) + ', '
             curr = curr.next
         return display[:-2] + ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - AssertionError: ...
========================= 1 failed, 8 passed in 0.15s ==========================

57 : Job ID ff4ccd31dd13495880dc9305f06ab844
test outcome: killed
linked_list2.py, start pos: (71, 16), end pos: (71, 19)
operator: core/ReplaceAndWithOr, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -68,7 +68,7 @@
     def remove(self, val):
         """Remove node from list if exists."""
         curr = self.head
-        if curr and val is self.head.data:
+        if curr or val is self.head.data:
             self.head = self.head.next
             self._length -= 1
         while curr:
ts-3-5/test_3-5_1-0_305.py .......F.                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_remove - assert 1 == 2
========================= 1 failed, 8 passed in 0.14s ==========================

58 : Job ID 0eac978168844c0a92351a13d635f15e
test outcome: killed
linked_list2.py, start pos: (75, 26), end pos: (75, 29)
operator: core/ReplaceAndWithOr, occurrence: 1
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -72,7 +72,7 @@
             self.head = self.head.next
             self._length -= 1
         while curr:
-            if (curr.next and curr.next.data == val):
+            if (curr.next or curr.next.data == val):
                 curr.next = curr.next.next
                 self._length -= 1
             curr = curr.next
ts-3-5/test_3-5_1-0_305.py .......F.                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_remove - AttributeError: '...
========================= 1 failed, 8 passed in 0.15s ==========================

59 : Job ID e52f82c993e94f17af70c8b6921c5751
test outcome: killed
linked_list2.py, start pos: (37, 15), end pos: (37, 24)
operator: core/ExceptionReplacer, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -34,7 +34,7 @@
         try:
             for val in data:
                 self.push(val)
-        except TypeError:
+        except CosmicRayTestingException:
             if data:
                 self.push(data)
ts-3-5/test_3-5_1-0_305.py .FFF.....                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_empty - NameError: name 'C...
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_push - NameError: name 'Co...
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_pop - NameError: name 'Cos...
========================= 3 failed, 6 passed in 0.15s ==========================

60 : Job ID b05f514ca3444ddf8a8f51602650ccb1
test outcome: killed
linked_list2.py, start pos: (32, 23), end pos: (32, 24)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -29,7 +29,7 @@
     def __init__(self, data=None):
         """Linked list initialized with head."""
-        self._length = 0
+        self._length = 1
         self.head = None
         try:
             for val in data:
ts-3-5/test_3-5_1-0_305.py .F..F..F.                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_empty - assert 1 == 0
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_size - assert 4 == 3
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_remove - assert 3 == 2
========================= 3 failed, 6 passed in 0.15s ==========================

61 : Job ID c0fab78c74824ce8af1b0be62f54705c
test outcome: killed
linked_list2.py, start pos: (32, 23), end pos: (32, 24)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -29,7 +29,7 @@
     def __init__(self, data=None):
         """Linked list initialized with head."""
-        self._length = 0
+        self._length = -1
         self.head = None
         try:
             for val in data:
ts-3-5/test_3-5_1-0_305.py .F..F..F.                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_empty - assert -1 == 0
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_size - assert 2 == 3
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_remove - assert 1 == 2
========================= 3 failed, 6 passed in 0.21s ==========================

62 : Job ID a2e83467f8b542a3959e7d1e96e1ad04
test outcome: killed
linked_list2.py, start pos: (45, 24), end pos: (45, 25)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -42,7 +42,7 @@
         """Insert a value at the head of the list."""
         old_head = self.head
         self.head = Node(val, old_head)
-        self._length += 1
+        self._length += 2
     def pop(self):
         """Remove the first value and return it."""
ts-3-5/test_3-5_1-0_305.py ....F..F.                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_size - assert 6 == 3
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_remove - assert 5 == 2
========================= 2 failed, 7 passed in 0.16s ==========================

63 : Job ID 2457e941dd304ff18d967bf14405dcd8
test outcome: killed
linked_list2.py, start pos: (45, 24), end pos: (45, 25)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -42,7 +42,7 @@
         """Insert a value at the head of the list."""
         old_head = self.head
         self.head = Node(val, old_head)
-        self._length += 1
+        self._length += 0
     def pop(self):
         """Remove the first value and return it."""
ts-3-5/test_3-5_1-0_305.py ....F..F.                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_size - assert 0 == 3
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_remove - assert -1 == 2
========================= 2 failed, 7 passed in 0.14s ==========================

64 : Job ID e239fdf152d646a68de1f473a8084848
SURVIVED
test outcome: survived
linked_list2.py, start pos: (53, 24), end pos: (53, 25)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -50,7 +50,7 @@
             raise IndexError('Cannot pop from an empty list')
         to_return = self.head
         self.head = self.head.next
-        self._length -= 1
+        self._length -= 2
         return to_return.data
     def size(self):
ts-3-5/test_3-5_1-0_305.py .........                                     [100%]
============================== 9 passed in 0.15s ===============================

65 : Job ID 1633cec7a9974072bb7009aef46842bd
test outcome: killed
linked_list2.py, start pos: (53, 24), end pos: (53, 25)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -50,7 +50,7 @@
             raise IndexError('Cannot pop from an empty list')
         to_return = self.head
         self.head = self.head.next
-        self._length -= 1
+        self._length -= 0
         return to_return.data
     def size(self):

68 : Job ID d49f7054c85749a68f93fac7a8e42d5b
test outcome: killed
linked_list2.py, start pos: (77, 32), end pos: (77, 33)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -74,7 +74,7 @@
         while curr:
             if (curr.next and curr.next.data == val):
                 curr.next = curr.next.next
-                self._length -= 1
+                self._length -= 2
             curr = curr.next
     def display(self):
ts-3-5/test_3-5_1-0_305.py .......F.                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_remove - assert 1 == 2
========================= 1 failed, 8 passed in 0.15s ==========================

69 : Job ID bba825fa267f4668934ede88e7091f30
test outcome: killed
linked_list2.py, start pos: (77, 32), end pos: (77, 33)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -74,7 +74,7 @@
         while curr:
             if (curr.next and curr.next.data == val):
                 curr.next = curr.next.next
-                self._length -= 1
+                self._length -= 0
             curr = curr.next
     def display(self):
ts-3-5/test_3-5_1-0_305.py .......F.                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_remove - assert 3 == 2
========================= 1 failed, 8 passed in 0.15s ==========================

70 : Job ID 0ba38ab30c2e4d0f87f03ac8892d9520
test outcome: killed
linked_list2.py, start pos: (87, 25), end pos: (87, 26)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -84,5 +84,5 @@
         while curr:
             display += str(curr.data) + ', '
             curr = curr.next
-        return display[:-2] + ')'
+        return display[:- 3] + ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - AssertionError: ...
========================= 1 failed, 8 passed in 0.15s ==========================

71 : Job ID 87e33d0ad4ac4e18861197a8456ffd75
test outcome: killed
linked_list2.py, start pos: (87, 25), end pos: (87, 26)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -84,5 +84,5 @@
         while curr:
             display += str(curr.data) + ', '
             curr = curr.next
-        return display[:-2] + ')'
+        return display[:- 1] + ')'
ts-3-5/test_3-5_1-0_305.py ........F                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - AssertionError: ...
========================= 1 failed, 8 passed in 0.16s ==========================

72 : Job ID 3b7986df78c843e88835e2b0188a9909
test outcome: killed
linked_list2.py, start pos: (35, 23), end pos: (35, 27)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- alinked_list2.py
+++ blinked_list2.py
@@ -32,7 +32,7 @@
         self._length = 0
         self.head = None
         try:
-            for val in data:
+            for val in []:
                 self.push(val)
         except TypeError:
             if data:
ts-3-5/test_3-5_1-0_305.py ....FF.FF                                     [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_size - assert 0 == 3
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_search_found - AttributeEr...
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_remove - assert 0 == 2
FAILED ts-3-5/test_3-5_1-0_305.py::test_linkedlist_display - AssertionError: ...
========================= 4 failed, 5 passed in 0.15s ==========================
