   - [#  27] EHD linked_list2: 
--------------------------------------------------------------------------------
  34:         try:
  35:             for val in data:
  36:                 self.push(val)
  37:         except TypeError:
- 38:             if data:
- 39:                 self.push(data)
+ 38:             raise
+ 39:     
  40:     
  41:     def push(self, val):
  42:         '''Insert a value at the head of the list.'''
  43:         old_head = self.head
--------------------------------------------------------------------------------
[0.15999 s] survived
