   - [#  11] CDI linked_list2: 
--------------------------------------------------------------------------------
  26:     display() - will return a unicode string representing the list as
  27:     if it were a Python tuple literal: "(12, \'sam\', 37, \'tango\')"
  28:     '''
  29:     
- 30:     def __init__(self, data=None):
- 31:         '''Linked list initialized with head.'''
- 32:         self._length = 0
- 33:         self.head = None
- 34:         try:
- 35:             for val in data:
- 36:                 self.push(val)
- 37:         except TypeError:
- 38:             if data:
- 39:                 self.push(data)
- 40:     
+ 30:     @classmethod
+ 31:     def __init__(self, data=None):
+ 32:         '''Linked list initialized with head.'''
+ 33:         self._length = 0
+ 34:         self.head = None
+ 35:         try:
+ 36:             for val in data:
+ 37:                 self.push(val)
+ 38:         except TypeError:
+ 39:             if data:
+ 40:                 self.push(data)
  41:     def push(self, val):
  42:         '''Insert a value at the head of the list.'''
  43:         old_head = self.head
  44:         self.head = Node(val, old_head)
--------------------------------------------------------------------------------
[0.16156 s] survived
