1 : Job ID e9cfa9c3aad34fb4bf1d973fcf9bad4f
test outcome: killed
longest_common_prefix.py, start pos: (15, 20), end pos: (15, 22)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -12,7 +12,7 @@
     prefix = []
-    while len(head) == 1 and trie.eof not in head:
+    while len(head) != 1 and trie.eof not in head:
         key, value = head.popitem()
         prefix.append(key)
         head = value
ts-3-5/test_3-5_0-2_74.py FFFF....                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_empty_list
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_single_word
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_multiple_words_same_prefix
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_no_common_prefix
========================= 4 failed, 4 passed in 0.09s ==========================

2 : Job ID 96926db4416c45a08bcca64af8e45772
test outcome: killed
longest_common_prefix.py, start pos: (15, 20), end pos: (15, 22)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -12,7 +12,7 @@
     prefix = []
-    while len(head) == 1 and trie.eof not in head:
+    while len(head) < 1 and trie.eof not in head:
         key, value = head.popitem()
         prefix.append(key)
         head = value
ts-3-5/test_3-5_0-2_74.py FFF.....                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_empty_list
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_single_word
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_multiple_words_same_prefix
========================= 3 failed, 5 passed in 0.09s ==========================

3 : Job ID 5779215d14ed4ae78c5dd5973bd75d69
test outcome: killed
longest_common_prefix.py, start pos: (15, 20), end pos: (15, 22)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -12,7 +12,7 @@
     prefix = []
-    while len(head) == 1 and trie.eof not in head:
+    while len(head) <= 1 and trie.eof not in head:
         key, value = head.popitem()
         prefix.append(key)
         head = value
ts-3-5/test_3-5_0-2_74.py F.......                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_empty_list
========================= 1 failed, 7 passed in 0.08s ==========================

4 : Job ID 12bf6b0e19b945e3911ac75a0bdf97ab
test outcome: killed
longest_common_prefix.py, start pos: (15, 20), end pos: (15, 22)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -12,7 +12,7 @@
     prefix = []
-    while len(head) == 1 and trie.eof not in head:
+    while len(head) > 1 and trie.eof not in head:
         key, value = head.popitem()
         prefix.append(key)
         head = value
ts-3-5/test_3-5_0-2_74.py .FFF....                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_single_word
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_multiple_words_same_prefix
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_no_common_prefix
========================= 3 failed, 5 passed in 0.09s ==========================

5 : Job ID f218be5e8eae45499809595a4ead50d7
test outcome: killed
longest_common_prefix.py, start pos: (15, 20), end pos: (15, 22)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -12,7 +12,7 @@
     prefix = []
-    while len(head) == 1 and trie.eof not in head:
+    while len(head) >= 1 and trie.eof not in head:
         key, value = head.popitem()
         prefix.append(key)
         head = value
ts-3-5/test_3-5_0-2_74.py ..FF....                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_multiple_words_same_prefix
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_no_common_prefix
========================= 2 failed, 6 passed in 0.09s ==========================

6 : Job ID c5f0248fac634f05b39c92f46512ba71
test outcome: killed
longest_common_prefix.py, start pos: (33, 21), end pos: (33, 23)
operator: core/ReplaceComparisonOperator_NotEq_Eq, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -30,7 +30,7 @@
     def common_start(w1, w2):
         shorter = w1 if len(w1) < len(w2) else w2
         for i in range(0, len(shorter)):
-            if w1[i] != w2[i]:
+            if w1[i] == w2[i]:
                 return shorter[:i]
         return shorter
ts-3-5/test_3-5_0-2_74.py ......FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_multiple_words_same_prefix
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_no_common_prefix
========================= 2 failed, 6 passed in 0.08s ==========================

7 : Job ID da87759346d64812a23f464d65740d08
SURVIVED
test outcome: survived
longest_common_prefix.py, start pos: (33, 21), end pos: (33, 23)
operator: core/ReplaceComparisonOperator_NotEq_Lt, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -30,7 +30,7 @@
     def common_start(w1, w2):
         shorter = w1 if len(w1) < len(w2) else w2
         for i in range(0, len(shorter)):
-            if w1[i] != w2[i]:
+            if w1[i] < w2[i]:
                 return shorter[:i]
         return shorter
ts-3-5/test_3-5_0-2_74.py ........                                       [100%]
============================== 8 passed in 0.08s ===============================

8 : Job ID f192cc4ee3504e55bd8f9e8fcb0958a5
test outcome: killed
longest_common_prefix.py, start pos: (33, 21), end pos: (33, 23)
operator: core/ReplaceComparisonOperator_NotEq_LtE, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -30,7 +30,7 @@
     def common_start(w1, w2):
         shorter = w1 if len(w1) < len(w2) else w2
         for i in range(0, len(shorter)):
-            if w1[i] != w2[i]:
+            if w1[i] <= w2[i]:
                 return shorter[:i]
         return shorter
ts-3-5/test_3-5_0-2_74.py ......F.                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_multiple_words_same_prefix
========================= 1 failed, 7 passed in 0.08s ==========================

9 : Job ID b9fb1db82c1f42a380e9f638fff53761
test outcome: killed
longest_common_prefix.py, start pos: (33, 21), end pos: (33, 23)
operator: core/ReplaceComparisonOperator_NotEq_Gt, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -30,7 +30,7 @@
     def common_start(w1, w2):
         shorter = w1 if len(w1) < len(w2) else w2
         for i in range(0, len(shorter)):
-            if w1[i] != w2[i]:
+            if w1[i] > w2[i]:
                 return shorter[:i]
         return shorter
ts-3-5/test_3-5_0-2_74.py ......FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_multiple_words_same_prefix
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_no_common_prefix
========================= 2 failed, 6 passed in 0.09s ==========================

10 : Job ID 57a16df860c947e29d9b60bcd46f6b03
test outcome: killed
longest_common_prefix.py, start pos: (33, 21), end pos: (33, 23)
operator: core/ReplaceComparisonOperator_NotEq_GtE, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -30,7 +30,7 @@
     def common_start(w1, w2):
         shorter = w1 if len(w1) < len(w2) else w2
         for i in range(0, len(shorter)):
-            if w1[i] != w2[i]:
+            if w1[i] >= w2[i]:
                 return shorter[:i]
         return shorter
ts-3-5/test_3-5_0-2_74.py ......FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_multiple_words_same_prefix
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_no_common_prefix
========================= 2 failed, 6 passed in 0.09s ==========================

11 : Job ID 5a95e36de988463db31173f41f06d36f
test outcome: killed
longest_common_prefix.py, start pos: (33, 21), end pos: (33, 23)
operator: core/ReplaceComparisonOperator_NotEq_Is, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -30,7 +30,7 @@
     def common_start(w1, w2):
         shorter = w1 if len(w1) < len(w2) else w2
         for i in range(0, len(shorter)):
-            if w1[i] != w2[i]:
+            if w1[i] is w2[i]:
                 return shorter[:i]
         return shorter
ts-3-5/test_3-5_0-2_74.py ......FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_multiple_words_same_prefix
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_no_common_prefix
========================= 2 failed, 6 passed in 0.08s ==========================

12 : Job ID 8fce55a91fa54e74a68435ac47bbd73a
SURVIVED
test outcome: survived
longest_common_prefix.py, start pos: (33, 21), end pos: (33, 23)
operator: core/ReplaceComparisonOperator_NotEq_IsNot, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -30,7 +30,7 @@
     def common_start(w1, w2):
         shorter = w1 if len(w1) < len(w2) else w2
         for i in range(0, len(shorter)):
-            if w1[i] != w2[i]:
+            if w1[i] is not w2[i]:
                 return shorter[:i]
         return shorter
ts-3-5/test_3-5_0-2_74.py ........                                       [100%]
============================== 8 passed in 0.08s ===============================

13 : Job ID f25aa26891214727828fbdcbbac88c85
test outcome: killed
longest_common_prefix.py, start pos: (31, 32), end pos: (31, 33)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -28,7 +28,7 @@
         return ''
     def common_start(w1, w2):
-        shorter = w1 if len(w1) < len(w2) else w2
+        shorter = w1 if len(w1) == len(w2) else w2
         for i in range(0, len(shorter)):
             if w1[i] != w2[i]:
                 return shorter[:i]
ts-3-5/test_3-5_0-2_74.py ......FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_multiple_words_same_prefix
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_no_common_prefix
========================= 2 failed, 6 passed in 0.09s ==========================

14 : Job ID f0b28a0bb75d439c93ce40c0e04e81d1
SURVIVED
test outcome: survived
longest_common_prefix.py, start pos: (31, 32), end pos: (31, 33)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -28,7 +28,7 @@
         return ''
     def common_start(w1, w2):
-        shorter = w1 if len(w1) < len(w2) else w2
+        shorter = w1 if len(w1) != len(w2) else w2
         for i in range(0, len(shorter)):
             if w1[i] != w2[i]:
                 return shorter[:i]
ts-3-5/test_3-5_0-2_74.py ........                                       [100%]
============================== 8 passed in 0.08s ===============================

15 : Job ID 88b48518479c43febecd4a4b1d1ad5e6
SURVIVED
test outcome: survived
longest_common_prefix.py, start pos: (31, 32), end pos: (31, 33)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -28,7 +28,7 @@
         return ''
     def common_start(w1, w2):
-        shorter = w1 if len(w1) < len(w2) else w2
+        shorter = w1 if len(w1) <= len(w2) else w2
         for i in range(0, len(shorter)):
             if w1[i] != w2[i]:
                 return shorter[:i]
ts-3-5/test_3-5_0-2_74.py ........                                       [100%]
============================== 8 passed in 0.08s ===============================

16 : Job ID f6966337b88746dd9bfe4450c70e03fc
test outcome: killed
longest_common_prefix.py, start pos: (31, 32), end pos: (31, 33)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -28,7 +28,7 @@
         return ''
     def common_start(w1, w2):
-        shorter = w1 if len(w1) < len(w2) else w2
+        shorter = w1 if len(w1) > len(w2) else w2
         for i in range(0, len(shorter)):
             if w1[i] != w2[i]:
                 return shorter[:i]
ts-3-5/test_3-5_0-2_74.py ......FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_multiple_words_same_prefix
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_no_common_prefix
========================= 2 failed, 6 passed in 0.09s ==========================

17 : Job ID b82cc2dece184817a3973aa6588bb167
test outcome: killed
longest_common_prefix.py, start pos: (31, 32), end pos: (31, 33)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -28,7 +28,7 @@
         return ''
     def common_start(w1, w2):
-        shorter = w1 if len(w1) < len(w2) else w2
+        shorter = w1 if len(w1) >= len(w2) else w2
         for i in range(0, len(shorter)):
             if w1[i] != w2[i]:
                 return shorter[:i]
ts-3-5/test_3-5_0-2_74.py ......FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_multiple_words_same_prefix
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_no_common_prefix
========================= 2 failed, 6 passed in 0.09s ==========================

18 : Job ID d5aaf44e6ec4407da1d76d88037d4746
test outcome: killed
longest_common_prefix.py, start pos: (31, 32), end pos: (31, 33)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -28,7 +28,7 @@
         return ''
     def common_start(w1, w2):
-        shorter = w1 if len(w1) < len(w2) else w2
+        shorter = w1 if len(w1) is len(w2) else w2
         for i in range(0, len(shorter)):
             if w1[i] != w2[i]:
                 return shorter[:i]
ts-3-5/test_3-5_0-2_74.py ......FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_multiple_words_same_prefix
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_no_common_prefix
========================= 2 failed, 6 passed in 0.08s ==========================

19 : Job ID 2d8f5cac6d40400db87ead015cf09dfa
SURVIVED
test outcome: survived
longest_common_prefix.py, start pos: (31, 32), end pos: (31, 33)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -28,7 +28,7 @@
         return ''
     def common_start(w1, w2):
-        shorter = w1 if len(w1) < len(w2) else w2
+        shorter = w1 if len(w1) is not len(w2) else w2
         for i in range(0, len(shorter)):
             if w1[i] != w2[i]:
                 return shorter[:i]
ts-3-5/test_3-5_0-2_74.py ........                                       [100%]
============================== 8 passed in 0.08s ===============================

20 : Job ID 196fe830d90145a1b8b6ece19720fe18
test outcome: killed
longest_common_prefix.py, start pos: (27, 7), end pos: (27, 10)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -24,7 +24,7 @@
     Find the lcp in a list of words, using 'reduce' functions.
     """
-    if not words:
+    if  words:
         return ''
     def common_start(w1, w2):
ts-3-5/test_3-5_0-2_74.py ....FFF.                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_empty_list
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_single_word
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_multiple_words_same_prefix
========================= 3 failed, 5 passed in 0.09s ==========================

21 : Job ID a65c3c2105024191936018dc741e138c
test outcome: killed
longest_common_prefix.py, start pos: (15, 10), end pos: (15, 49)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -12,7 +12,7 @@
     prefix = []
-    while len(head) == 1 and trie.eof not in head:
+    while not len(head) == 1 and trie.eof not in head:
         key, value = head.popitem()
         prefix.append(key)
         head = value
ts-3-5/test_3-5_0-2_74.py FFFF....                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_empty_list
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_single_word
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_multiple_words_same_prefix
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_no_common_prefix
========================= 4 failed, 4 passed in 0.09s ==========================

22 : Job ID 513add3948d84b8e85cc77082cdc184c
test outcome: killed
longest_common_prefix.py, start pos: (27, 7), end pos: (27, 16)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -24,7 +24,7 @@
     Find the lcp in a list of words, using 'reduce' functions.
     """
-    if not words:
+    if not not words:
         return ''
     def common_start(w1, w2):
ts-3-5/test_3-5_0-2_74.py ....FFF.                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_empty_list
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_single_word
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_multiple_words_same_prefix
========================= 3 failed, 5 passed in 0.09s ==========================

23 : Job ID 4e12c88ecaeb431584affdcbb2e35932
test outcome: killed
longest_common_prefix.py, start pos: (31, 24), end pos: (31, 41)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -28,7 +28,7 @@
         return ''
     def common_start(w1, w2):
-        shorter = w1 if len(w1) < len(w2) else w2
+        shorter = w1 if not len(w1) < len(w2) else w2
         for i in range(0, len(shorter)):
             if w1[i] != w2[i]:
                 return shorter[:i]
ts-3-5/test_3-5_0-2_74.py ......FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_multiple_words_same_prefix
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_no_common_prefix
========================= 2 failed, 6 passed in 0.08s ==========================

24 : Job ID 8b715e9d7cd54159bb4ebcf1128d158d
test outcome: killed
longest_common_prefix.py, start pos: (33, 15), end pos: (33, 29)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -30,7 +30,7 @@
     def common_start(w1, w2):
         shorter = w1 if len(w1) < len(w2) else w2
         for i in range(0, len(shorter)):
-            if w1[i] != w2[i]:
+            if not w1[i] != w2[i]:
                 return shorter[:i]
         return shorter
ts-3-5/test_3-5_0-2_74.py ......FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_multiple_words_same_prefix
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_no_common_prefix
========================= 2 failed, 6 passed in 0.08s ==========================

25 : Job ID 54ac23ae62c943669bde149e0988b85e
test outcome: killed
longest_common_prefix.py, start pos: (15, 25), end pos: (15, 28)
operator: core/ReplaceAndWithOr, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -12,7 +12,7 @@
     prefix = []
-    while len(head) == 1 and trie.eof not in head:
+    while len(head) == 1 or trie.eof not in head:
         key, value = head.popitem()
         prefix.append(key)
         head = value
ts-3-5/test_3-5_0-2_74.py FFFF....                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_empty_list
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_single_word
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_multiple_words_same_prefix
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_no_common_prefix
========================= 4 failed, 4 passed in 0.09s ==========================

26 : Job ID 0e34b4f5343945feba24143fd6b5ebca
test outcome: killed
longest_common_prefix.py, start pos: (15, 23), end pos: (15, 24)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -12,7 +12,7 @@
     prefix = []
-    while len(head) == 1 and trie.eof not in head:
+    while len(head) == 2 and trie.eof not in head:
         key, value = head.popitem()
         prefix.append(key)
         head = value
ts-3-5/test_3-5_0-2_74.py .FF.....                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_single_word
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_multiple_words_same_prefix
========================= 2 failed, 6 passed in 0.09s ==========================

27 : Job ID 11a949ad315543d2a36fd4c8ceab9998
test outcome: killed
longest_common_prefix.py, start pos: (15, 23), end pos: (15, 24)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -12,7 +12,7 @@
     prefix = []
-    while len(head) == 1 and trie.eof not in head:
+    while len(head) == 0 and trie.eof not in head:
         key, value = head.popitem()
         prefix.append(key)
         head = value
ts-3-5/test_3-5_0-2_74.py FFF.....                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_empty_list
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_single_word
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_multiple_words_same_prefix
========================= 3 failed, 5 passed in 0.09s ==========================

28 : Job ID 1d345dcf83734b969b15c122bc028f82
test outcome: killed
longest_common_prefix.py, start pos: (32, 23), end pos: (32, 24)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -29,7 +29,7 @@
     def common_start(w1, w2):
         shorter = w1 if len(w1) < len(w2) else w2
-        for i in range(0, len(shorter)):
+        for i in range( 1, len(shorter)):
             if w1[i] != w2[i]:
                 return shorter[:i]
         return shorter
ts-3-5/test_3-5_0-2_74.py .......F                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_no_common_prefix
========================= 1 failed, 7 passed in 0.08s ==========================

29 : Job ID b6b9aff2662c4390a7813e28b2a9d79a
test outcome: killed
longest_common_prefix.py, start pos: (32, 23), end pos: (32, 24)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -29,7 +29,7 @@
     def common_start(w1, w2):
         shorter = w1 if len(w1) < len(w2) else w2
-        for i in range(0, len(shorter)):
+        for i in range( -1, len(shorter)):
             if w1[i] != w2[i]:
                 return shorter[:i]
         return shorter
ts-3-5/test_3-5_0-2_74.py .......F                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_no_common_prefix
========================= 1 failed, 7 passed in 0.08s ==========================

30 : Job ID 070a9e8159724e76be4a9786ef67ab52
test outcome: killed
longest_common_prefix.py, start pos: (32, 17), end pos: (32, 39)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- alongest_common_prefix.py
+++ blongest_common_prefix.py
@@ -29,7 +29,7 @@
     def common_start(w1, w2):
         shorter = w1 if len(w1) < len(w2) else w2
-        for i in range(0, len(shorter)):
+        for i in []:
             if w1[i] != w2[i]:
                 return shorter[:i]
         return shorter
ts-3-5/test_3-5_0-2_74.py ......FF                                       [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_multiple_words_same_prefix
FAILED ts-3-5/test_3-5_0-2_74.py::test_find_longest_common_prefix_reduce_no_common_prefix
========================= 2 failed, 6 passed in 0.08s ==========================
