   - [#   4] COI longest_common_prefix: 
--------------------------------------------------------------------------------
  23:     """
  24:     Find the lcp in a list of words, using 'reduce' functions.
  25: 
  26:     """
- 27:     if not words:
+ 27:     if not ((not words)):
  28:         return ''
  29:     
  30:     def common_start(w1, w2):
  31:         shorter = w1 if len(w1) < len(w2) else w2
--------------------------------------------------------------------------------
[0.13708 s] killed by ts-3-5/test_3-5_0-1_35.py::test_find_longest_common_prefix_reduce

def test_find_longest_common_prefix_reduce():
        words = ["flower", "flow", "flight"]
>       assert find_longest_common_prefix_reduce(words) == "fl"
E       AssertionError

ts-3-5/test_3-5_0-1_35.py:18: AssertionError

   - [#  21] SDL longest_common_prefix: 
--------------------------------------------------------------------------------
  24:     Find the lcp in a list of words, using 'reduce' functions.
  25: 
  26:     """
  27:     if not words:
- 28:         return ''
+ 28:         pass
  29:     
  30:     def common_start(w1, w2):
  31:         shorter = w1 if len(w1) < len(w2) else w2
  32:         for i in range(0, len(shorter)):
--------------------------------------------------------------------------------
[0.11002 s] survived
