   - [#  24] SDL longest_common_prefix: 
--------------------------------------------------------------------------------
  31:         shorter = w1 if len(w1) < len(w2) else w2
  32:         for i in range(0, len(shorter)):
  33:             if w1[i] != w2[i]:
  34:                 return shorter[:i]
- 35:         return shorter
+ 35:         pass
  36:     
  37:     return reduce(common_start, words)
--------------------------------------------------------------------------------
[0.12938 s] killed by ts-3-5/test_3-5_0-8_266.py::test_find_longest_common_prefix_reduce_no_common_prefix

def test_find_longest_common_prefix_reduce_no_common_prefix():
        words = ['dog', 'cat', 'horse']
>       assert find_longest_common_prefix_reduce(words) == ''
E       AssertionError

ts-3-5/test_3-5_0-8_266.py:41: AssertionError
