   - [#   1] COD longest_common_prefix: 
--------------------------------------------------------------------------------
  11:     head = trie.head
  12:     
  13:     prefix = []
  14:     
- 15:     while (len(head) == 1 and trie.eof not in head):
+ 15:     while (len(head) == 1 and trie.eof in head):
  16:         (key, value) = head.popitem()
  17:         prefix.append(key)
  18:         head = value
  19:     
--------------------------------------------------------------------------------
[0.14390 s] killed by ts-3-5/test_3-5_1-0_318.py::test_find_longest_common_prefix_single_word

def test_find_longest_common_prefix_single_word():
        words = ['apple']
>       assert find_longest_common_prefix(words) == 'apple'
E       AssertionError

ts-3-5/test_3-5_1-0_318.py:17: AssertionError

   - [#   3] COI longest_common_prefix: 
--------------------------------------------------------------------------------
  11:     head = trie.head
  12:     
  13:     prefix = []
  14:     
- 15:     while (len(head) == 1 and trie.eof not in head):
+ 15:     while not ((len(head) == 1 and trie.eof not in head)):
  16:         (key, value) = head.popitem()
  17:         prefix.append(key)
  18:         head = value
  19:     
--------------------------------------------------------------------------------
[0.13075 s] killed by ts-3-5/test_3-5_1-0_318.py::test_find_longest_common_prefix_empty_list

def test_find_longest_common_prefix_empty_list():
        words = []
>       assert find_longest_common_prefix(words) == ''

ts-3-5/test_3-5_1-0_318.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

words = []

>   ???
E   KeyError: 'popitem(): dictionary is empty'

longest_common_prefix:16: KeyError

   - [#   5] COI longest_common_prefix: 
--------------------------------------------------------------------------------
  29:     
  30:     def common_start(w1, w2):
  31:         shorter = w1 if len(w1) < len(w2) else w2
  32:         for i in range(0, len(shorter)):
- 33:             if w1[i] != w2[i]:
+ 33:             if not (w1[i] != w2[i]):
  34:                 return shorter[:i]
  35:         return shorter
  36:     
  37:     return reduce(common_start, words)
--------------------------------------------------------------------------------
[0.13820 s] killed by ts-3-5/test_3-5_1-0_318.py::test_find_longest_common_prefix_reduce_all_same_words

def test_find_longest_common_prefix_reduce_all_same_words():
        words = ['abc', 'abc', 'abc']
>       assert find_longest_common_prefix_reduce(words) == 'abc'
E       AssertionError

ts-3-5/test_3-5_1-0_318.py:37: AssertionError

   - [#   6] LCR longest_common_prefix: 
--------------------------------------------------------------------------------
  11:     head = trie.head
  12:     
  13:     prefix = []
  14:     
- 15:     while (len(head) == 1 and trie.eof not in head):
+ 15:     while (len(head) == 1 or trie.eof not in head):
  16:         (key, value) = head.popitem()
  17:         prefix.append(key)
  18:         head = value
  19:     
--------------------------------------------------------------------------------
[0.13353 s] killed by ts-3-5/test_3-5_1-0_318.py::test_find_longest_common_prefix_empty_list

def test_find_longest_common_prefix_empty_list():
        words = []
>       assert find_longest_common_prefix(words) == ''

ts-3-5/test_3-5_1-0_318.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

words = []

>   ???
E   KeyError: 'popitem(): dictionary is empty'

longest_common_prefix:16: KeyError

   - [#   7] OIL longest_common_prefix: 
--------------------------------------------------------------------------------
  15:     while (len(head) == 1 and trie.eof not in head):
  16:         (key, value) = head.popitem()
  17:         prefix.append(key)
  18:         head = value
- 19:     
+ 19:         break
  20:     return ''.join(prefix)
  21: 
  22: def find_longest_common_prefix_reduce(words: list):
  23:     """
--------------------------------------------------------------------------------
[0.13289 s] killed by ts-3-5/test_3-5_1-0_318.py::test_find_longest_common_prefix_single_word

def test_find_longest_common_prefix_single_word():
        words = ['apple']
>       assert find_longest_common_prefix(words) == 'apple'
E       AssertionError

ts-3-5/test_3-5_1-0_318.py:17: AssertionError

   - [#   8] OIL longest_common_prefix: 
--------------------------------------------------------------------------------
  31:         shorter = w1 if len(w1) < len(w2) else w2
  32:         for i in range(0, len(shorter)):
  33:             if w1[i] != w2[i]:
  34:                 return shorter[:i]
- 35:         return shorter
- 36:     
+ 35:             break
+ 36:         return shorter
  37:     return reduce(common_start, words)
--------------------------------------------------------------------------------
[0.11262 s] survived

   - [#   9] RIL longest_common_prefix: 
--------------------------------------------------------------------------------
  28:         return ''
  29:     
  30:     def common_start(w1, w2):
  31:         shorter = w1 if len(w1) < len(w2) else w2
- 32:         for i in range(0, len(shorter)):
+ 32:         for i in reversed(range(0, len(shorter))):
  33:             if w1[i] != w2[i]:
  34:                 return shorter[:i]
  35:         return shorter
  36:     
--------------------------------------------------------------------------------
[0.11283 s] survived

   - [#  10] ROR longest_common_prefix: 
--------------------------------------------------------------------------------
  11:     head = trie.head
  12:     
  13:     prefix = []
  14:     
- 15:     while (len(head) == 1 and trie.eof not in head):
+ 15:     while (len(head) != 1 and trie.eof not in head):
  16:         (key, value) = head.popitem()
  17:         prefix.append(key)
  18:         head = value
  19:     
--------------------------------------------------------------------------------
[0.13459 s] killed by ts-3-5/test_3-5_1-0_318.py::test_find_longest_common_prefix_empty_list

def test_find_longest_common_prefix_empty_list():
        words = []
>       assert find_longest_common_prefix(words) == ''

ts-3-5/test_3-5_1-0_318.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

words = []

>   ???
E   KeyError: 'popitem(): dictionary is empty'

longest_common_prefix:16: KeyError

   - [#  14] SDL longest_common_prefix: 
--------------------------------------------------------------------------------
   5:     '''
   6:     Find the longest common prefix in a list of words.
   7: 
   8:     '''
-  9:     trie = Trie(words)
+  9:     pass
  10:     
  11:     head = trie.head
  12:     
  13:     prefix = []
--------------------------------------------------------------------------------
[0.13251 s] killed by ts-3-5/test_3-5_1-0_318.py::test_find_longest_common_prefix_empty_list

def test_find_longest_common_prefix_empty_list():
        words = []
>       assert find_longest_common_prefix(words) == ''

ts-3-5/test_3-5_1-0_318.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

words = []

>   ???
E   NameError: name 'trie' is not defined

longest_common_prefix:11: NameError

   - [#  15] SDL longest_common_prefix: 
--------------------------------------------------------------------------------
   7: 
   8:     '''
   9:     trie = Trie(words)
  10:     
- 11:     head = trie.head
+ 11:     pass
  12:     
  13:     prefix = []
  14:     
  15:     while (len(head) == 1 and trie.eof not in head):
--------------------------------------------------------------------------------
[0.13385 s] killed by ts-3-5/test_3-5_1-0_318.py::test_find_longest_common_prefix_empty_list

def test_find_longest_common_prefix_empty_list():
        words = []
>       assert find_longest_common_prefix(words) == ''

ts-3-5/test_3-5_1-0_318.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

words = []

>   ???
E   UnboundLocalError: local variable 'head' referenced before assignment

longest_common_prefix:15: UnboundLocalError

   - [#  16] SDL longest_common_prefix: 
--------------------------------------------------------------------------------
   9:     trie = Trie(words)
  10:     
  11:     head = trie.head
  12:     
- 13:     prefix = []
+ 13:     pass
  14:     
  15:     while (len(head) == 1 and trie.eof not in head):
  16:         (key, value) = head.popitem()
  17:         prefix.append(key)
--------------------------------------------------------------------------------
[0.13605 s] killed by ts-3-5/test_3-5_1-0_318.py::test_find_longest_common_prefix_empty_list

def test_find_longest_common_prefix_empty_list():
        words = []
>       assert find_longest_common_prefix(words) == ''

ts-3-5/test_3-5_1-0_318.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

words = []

>   ???
E   NameError: name 'prefix' is not defined

longest_common_prefix:20: NameError

   - [#  17] SDL longest_common_prefix: 
--------------------------------------------------------------------------------
  12:     
  13:     prefix = []
  14:     
  15:     while (len(head) == 1 and trie.eof not in head):
- 16:         (key, value) = head.popitem()
+ 16:         pass
  17:         prefix.append(key)
  18:         head = value
  19:     
  20:     return ''.join(prefix)
--------------------------------------------------------------------------------
[0.13670 s] killed by ts-3-5/test_3-5_1-0_318.py::test_find_longest_common_prefix_single_word

def test_find_longest_common_prefix_single_word():
        words = ['apple']
>       assert find_longest_common_prefix(words) == 'apple'

ts-3-5/test_3-5_1-0_318.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

words = ['apple']

>   ???
E   NameError: name 'key' is not defined

longest_common_prefix:17: NameError

   - [#  18] SDL longest_common_prefix: 
--------------------------------------------------------------------------------
  13:     prefix = []
  14:     
  15:     while (len(head) == 1 and trie.eof not in head):
  16:         (key, value) = head.popitem()
- 17:         prefix.append(key)
+ 17:         pass
  18:         head = value
  19:     
  20:     return ''.join(prefix)
  21: 
--------------------------------------------------------------------------------
[0.13492 s] killed by ts-3-5/test_3-5_1-0_318.py::test_find_longest_common_prefix_single_word

def test_find_longest_common_prefix_single_word():
        words = ['apple']
>       assert find_longest_common_prefix(words) == 'apple'
E       AssertionError

ts-3-5/test_3-5_1-0_318.py:17: AssertionError

   - [#  19] SDL longest_common_prefix: 
--------------------------------------------------------------------------------
  14:     
  15:     while (len(head) == 1 and trie.eof not in head):
  16:         (key, value) = head.popitem()
  17:         prefix.append(key)
- 18:         head = value
+ 18:         pass
  19:     
  20:     return ''.join(prefix)
  21: 
  22: def find_longest_common_prefix_reduce(words: list):
--------------------------------------------------------------------------------
[0.13826 s] killed by ts-3-5/test_3-5_1-0_318.py::test_find_longest_common_prefix_single_word

def test_find_longest_common_prefix_single_word():
        words = ['apple']
>       assert find_longest_common_prefix(words) == 'apple'
E       AssertionError

ts-3-5/test_3-5_1-0_318.py:17: AssertionError

   - [#  20] SDL longest_common_prefix: 
--------------------------------------------------------------------------------
  16:         (key, value) = head.popitem()
  17:         prefix.append(key)
  18:         head = value
  19:     
- 20:     return ''.join(prefix)
+ 20:     pass
  21: 
  22: def find_longest_common_prefix_reduce(words: list):
  23:     """
  24:     Find the lcp in a list of words, using 'reduce' functions.
--------------------------------------------------------------------------------
[0.13463 s] killed by ts-3-5/test_3-5_1-0_318.py::test_find_longest_common_prefix_empty_list

def test_find_longest_common_prefix_empty_list():
        words = []
>       assert find_longest_common_prefix(words) == ''
E       AssertionError

ts-3-5/test_3-5_1-0_318.py:13: AssertionError

   - [#  22] SDL longest_common_prefix: 
--------------------------------------------------------------------------------
  27:     if not words:
  28:         return ''
  29:     
  30:     def common_start(w1, w2):
- 31:         shorter = w1 if len(w1) < len(w2) else w2
+ 31:         pass
  32:         for i in range(0, len(shorter)):
  33:             if w1[i] != w2[i]:
  34:                 return shorter[:i]
  35:         return shorter
--------------------------------------------------------------------------------
[0.14026 s] killed by ts-3-5/test_3-5_1-0_318.py::test_find_longest_common_prefix_reduce_all_same_words

def test_find_longest_common_prefix_reduce_all_same_words():
        words = ['abc', 'abc', 'abc']
>       assert find_longest_common_prefix_reduce(words) == 'abc'

ts-3-5/test_3-5_1-0_318.py:37: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
longest_common_prefix:37: in find_longest_common_prefix_reduce
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

w1 = 'abc', w2 = 'abc'

>   ???
E   NameError: name 'shorter' is not defined

longest_common_prefix:32: NameError

   - [#  23] SDL longest_common_prefix: 
--------------------------------------------------------------------------------
  30:     def common_start(w1, w2):
  31:         shorter = w1 if len(w1) < len(w2) else w2
  32:         for i in range(0, len(shorter)):
  33:             if w1[i] != w2[i]:
- 34:                 return shorter[:i]
+ 34:                 pass
  35:         return shorter
  36:     
  37:     return reduce(common_start, words)
--------------------------------------------------------------------------------
[0.11494 s] survived

   - [#  25] SDL longest_common_prefix: 
--------------------------------------------------------------------------------
  33:             if w1[i] != w2[i]:
  34:                 return shorter[:i]
  35:         return shorter
  36:     
- 37:     return reduce(common_start, words)
+ 37:     pass
--------------------------------------------------------------------------------
[0.13622 s] killed by ts-3-5/test_3-5_1-0_318.py::test_find_longest_common_prefix_reduce_single_word

def test_find_longest_common_prefix_reduce_single_word():
        words = ['apple']
>       assert find_longest_common_prefix_reduce(words) == 'apple'
E       AssertionError

ts-3-5/test_3-5_1-0_318.py:33: AssertionError

   - [#  26] SIR longest_common_prefix: 
--------------------------------------------------------------------------------
  30:     def common_start(w1, w2):
  31:         shorter = w1 if len(w1) < len(w2) else w2
  32:         for i in range(0, len(shorter)):
  33:             if w1[i] != w2[i]:
- 34:                 return shorter[:i]
+ 34:                 return shorter[:]
  35:         return shorter
  36:     
  37:     return reduce(common_start, words)
--------------------------------------------------------------------------------
[0.11269 s] survived

   - [#  27] ZIL longest_common_prefix: 
--------------------------------------------------------------------------------
  12:     
  13:     prefix = []
  14:     
  15:     while (len(head) == 1 and trie.eof not in head):
- 16:         (key, value) = head.popitem()
- 17:         prefix.append(key)
- 18:         head = value
+ 16:         break
+ 17:     
+ 18:     
  19:     
  20:     return ''.join(prefix)
  21: 
  22: def find_longest_common_prefix_reduce(words: list):
--------------------------------------------------------------------------------
[0.13539 s] killed by ts-3-5/test_3-5_1-0_318.py::test_find_longest_common_prefix_single_word

def test_find_longest_common_prefix_single_word():
        words = ['apple']
>       assert find_longest_common_prefix(words) == 'apple'
E       AssertionError

ts-3-5/test_3-5_1-0_318.py:17: AssertionError

   - [#  28] ZIL longest_common_prefix: 
--------------------------------------------------------------------------------
  29:     
  30:     def common_start(w1, w2):
  31:         shorter = w1 if len(w1) < len(w2) else w2
  32:         for i in range(0, len(shorter)):
- 33:             if w1[i] != w2[i]:
- 34:                 return shorter[:i]
+ 33:             break
+ 34:         
  35:         return shorter
  36:     
  37:     return reduce(common_start, words)
--------------------------------------------------------------------------------
[0.11317 s] survived
