1 : Job ID e185d67d04144dc2bd2c66cfa163c88d
SURVIVED
test outcome: survived
lru_cache.py, start pos: (61, 20), end pos: (61, 22)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 0
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -58,7 +58,7 @@
         :param capacity: the maximum number of elements that can be stored in the cache,
             must be greater than 0
         """
-        if capacity <= 1:
+        if capacity == 1:
             raise ValueError("Capacity must be >= 1")
         # init the head and tail nodes
ts-3-5/test_3-5_0-5_163.py ........                                      [100%]
============================== 8 passed in 0.12s ===============================

2 : Job ID d34d19b24819425b9c5de04f0cff9e8f
test outcome: killed
lru_cache.py, start pos: (61, 20), end pos: (61, 22)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 0
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -58,7 +58,7 @@
         :param capacity: the maximum number of elements that can be stored in the cache,
             must be greater than 0
         """
-        if capacity <= 1:
+        if capacity != 1:
             raise ValueError("Capacity must be >= 1")
         # init the head and tail nodes
ts-3-5/test_3-5_0-5_163.py .FEEEEEE                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_init - ValueError: Capacity...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put - ValueError: Capacity m...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put_capacity_reached - Value...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get - ValueError: Capacity m...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get_nonexistent_key - ValueE...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache__add - ValueError: Capacity ...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache__remove - ValueError: Capaci...
==================== 1 failed, 1 passed, 6 errors in 0.13s =====================

3 : Job ID 6e552e9959514e44b9fe2058180705e9
SURVIVED
test outcome: survived
lru_cache.py, start pos: (61, 20), end pos: (61, 22)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 0
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -58,7 +58,7 @@
         :param capacity: the maximum number of elements that can be stored in the cache,
             must be greater than 0
         """
-        if capacity <= 1:
+        if capacity < 1:
             raise ValueError("Capacity must be >= 1")
         # init the head and tail nodes
ts-3-5/test_3-5_0-5_163.py ........                                      [100%]
============================== 8 passed in 0.12s ===============================

4 : Job ID a454437226ff4f4ba21f4d47b7672132
test outcome: killed
lru_cache.py, start pos: (61, 20), end pos: (61, 22)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 0
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -58,7 +58,7 @@
         :param capacity: the maximum number of elements that can be stored in the cache,
             must be greater than 0
         """
-        if capacity <= 1:
+        if capacity > 1:
             raise ValueError("Capacity must be >= 1")
         # init the head and tail nodes
ts-3-5/test_3-5_0-5_163.py .FEEEEEE                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_init - ValueError: Capacity...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put - ValueError: Capacity m...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put_capacity_reached - Value...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get - ValueError: Capacity m...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get_nonexistent_key - ValueE...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache__add - ValueError: Capacity ...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache__remove - ValueError: Capaci...
==================== 1 failed, 1 passed, 6 errors in 0.13s =====================

5 : Job ID d79cb72dfe9544aca938c7afc85eb293
test outcome: killed
lru_cache.py, start pos: (61, 20), end pos: (61, 22)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 0
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -58,7 +58,7 @@
         :param capacity: the maximum number of elements that can be stored in the cache,
             must be greater than 0
         """
-        if capacity <= 1:
+        if capacity >= 1:
             raise ValueError("Capacity must be >= 1")
         # init the head and tail nodes
ts-3-5/test_3-5_0-5_163.py .FEEEEEE                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_init - ValueError: Capacity...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put - ValueError: Capacity m...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put_capacity_reached - Value...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get - ValueError: Capacity m...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get_nonexistent_key - ValueE...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache__add - ValueError: Capacity ...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache__remove - ValueError: Capaci...
==================== 1 failed, 1 passed, 6 errors in 0.13s =====================

6 : Job ID 53239ef71b4d499aa99b4919d723a93c
test outcome: killed
lru_cache.py, start pos: (105, 32), end pos: (105, 33)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 0
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -102,7 +102,7 @@
         self.lookup_map[key] = node
         # check the capacity
-        if len(self.lookup_map) > self.capacity:
+        if len(self.lookup_map) == self.capacity:
             # remove the last node
             least_recently_used_node = self.head.next
ts-3-5/test_3-5_0-5_163.py ...FF...                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put_capacity_reached - asse...
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get - AssertionError: asser...
========================= 2 failed, 6 passed in 0.12s ==========================

7 : Job ID 70c915babdbb4e4d92e1a3f5fc02b0c9
test outcome: killed
lru_cache.py, start pos: (105, 32), end pos: (105, 33)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 0
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -102,7 +102,7 @@
         self.lookup_map[key] = node
         # check the capacity
-        if len(self.lookup_map) > self.capacity:
+        if len(self.lookup_map) != self.capacity:
             # remove the last node
             least_recently_used_node = self.head.next
ts-3-5/test_3-5_0-5_163.py ..FFF...                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put - KeyError: 1
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put_capacity_reached - asse...
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get - AssertionError: asser...
========================= 3 failed, 5 passed in 0.12s ==========================

8 : Job ID 1f05c257d0104efb89177b2366a8a1b5
test outcome: killed
lru_cache.py, start pos: (105, 32), end pos: (105, 33)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 0
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -102,7 +102,7 @@
         self.lookup_map[key] = node
         # check the capacity
-        if len(self.lookup_map) > self.capacity:
+        if len(self.lookup_map) < self.capacity:
             # remove the last node
             least_recently_used_node = self.head.next
ts-3-5/test_3-5_0-5_163.py ..FFF...                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put - KeyError: 1
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put_capacity_reached - asse...
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get - AssertionError: asser...
========================= 3 failed, 5 passed in 0.12s ==========================

9 : Job ID 5c3e943517e24f25b49136a5aa6efb9b
test outcome: killed
lru_cache.py, start pos: (105, 32), end pos: (105, 33)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 0
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -102,7 +102,7 @@
         self.lookup_map[key] = node
         # check the capacity
-        if len(self.lookup_map) > self.capacity:
+        if len(self.lookup_map) <= self.capacity:
             # remove the last node
             least_recently_used_node = self.head.next
ts-3-5/test_3-5_0-5_163.py ..FFF...                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put - KeyError: 1
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put_capacity_reached - asse...
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get - AssertionError: asser...
========================= 3 failed, 5 passed in 0.12s ==========================

10 : Job ID c23e7f95b40d45fba7f0047ff85a5371
test outcome: killed
lru_cache.py, start pos: (105, 32), end pos: (105, 33)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 0
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -102,7 +102,7 @@
         self.lookup_map[key] = node
         # check the capacity
-        if len(self.lookup_map) > self.capacity:
+        if len(self.lookup_map) >= self.capacity:
             # remove the last node
             least_recently_used_node = self.head.next
ts-3-5/test_3-5_0-5_163.py ...FF...                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put_capacity_reached - asse...
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get - AssertionError: asser...
========================= 2 failed, 6 passed in 0.12s ==========================

11 : Job ID 6dfcbc4406d4433a820e48020873c625
test outcome: killed
lru_cache.py, start pos: (105, 32), end pos: (105, 33)
operator: core/ReplaceComparisonOperator_Gt_Is, occurrence: 0
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -102,7 +102,7 @@
         self.lookup_map[key] = node
         # check the capacity
-        if len(self.lookup_map) > self.capacity:
+        if len(self.lookup_map) is self.capacity:
             # remove the last node
             least_recently_used_node = self.head.next
ts-3-5/test_3-5_0-5_163.py ...FF...                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put_capacity_reached - asse...
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get - AssertionError: asser...
========================= 2 failed, 6 passed in 0.12s ==========================

12 : Job ID 2feee9c70d6c40a58d40ba97eae00174
test outcome: killed
lru_cache.py, start pos: (105, 32), end pos: (105, 33)
operator: core/ReplaceComparisonOperator_Gt_IsNot, occurrence: 0
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -102,7 +102,7 @@
         self.lookup_map[key] = node
         # check the capacity
-        if len(self.lookup_map) > self.capacity:
+        if len(self.lookup_map) is not self.capacity:
             # remove the last node
             least_recently_used_node = self.head.next
ts-3-5/test_3-5_0-5_163.py ..FFF...                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put - KeyError: 1
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put_capacity_reached - asse...
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get - AssertionError: asser...
========================= 3 failed, 5 passed in 0.12s ==========================

13 : Job ID 7357f237871f42379ebb5d9d24c27d19
test outcome: killed
lru_cache.py, start pos: (137, 19), end pos: (137, 20)
operator: core/ReplaceUnaryOperator_USub_UAdd, occurrence: 0
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -134,7 +134,7 @@
             return node.val
         else:
-            return -1
+            return +1
     def _add(self, node):
         """
ts-3-5/test_3-5_0-5_163.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get_nonexistent_key - asser...
========================= 1 failed, 7 passed in 0.12s ==========================

14 : Job ID 9c07af7c996c4824aaa2773f30e97ad0
test outcome: killed
lru_cache.py, start pos: (137, 19), end pos: (137, 20)
operator: core/ReplaceUnaryOperator_USub_Invert, occurrence: 0
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -134,7 +134,7 @@
             return node.val
         else:
-            return -1
+            return ~1
     def _add(self, node):
         """
ts-3-5/test_3-5_0-5_163.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get_nonexistent_key - asser...
========================= 1 failed, 7 passed in 0.12s ==========================

15 : Job ID 6b69943643ee4dfebd9a4e7ee7b2bd02
test outcome: killed
lru_cache.py, start pos: (137, 19), end pos: (137, 20)
operator: core/ReplaceUnaryOperator_USub_Not, occurrence: 0
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -134,7 +134,7 @@
             return node.val
         else:
-            return -1
+            return not 1
     def _add(self, node):
         """
ts-3-5/test_3-5_0-5_163.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get_nonexistent_key - asser...
========================= 1 failed, 7 passed in 0.12s ==========================

16 : Job ID a6a78fdf7cfc4a90841c6babff80efdd
test outcome: killed
lru_cache.py, start pos: (137, 19), end pos: (137, 20)
operator: core/ReplaceUnaryOperator_Delete_USub, occurrence: 0
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -134,7 +134,7 @@
             return node.val
         else:
-            return -1
+            return 1
     def _add(self, node):
         """
ts-3-5/test_3-5_0-5_163.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get_nonexistent_key - asser...
========================= 1 failed, 7 passed in 0.12s ==========================

17 : Job ID cbc79e0ab89d487fa6507db7396ef712
test outcome: killed
lru_cache.py, start pos: (61, 11), end pos: (61, 24)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -58,7 +58,7 @@
         :param capacity: the maximum number of elements that can be stored in the cache,
             must be greater than 0
         """
-        if capacity <= 1:
+        if not capacity <= 1:
             raise ValueError("Capacity must be >= 1")
         # init the head and tail nodes
ts-3-5/test_3-5_0-5_163.py .FEEEEEE                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_init - ValueError: Capacity...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put - ValueError: Capacity m...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put_capacity_reached - Value...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get - ValueError: Capacity m...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get_nonexistent_key - ValueE...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache__add - ValueError: Capacity ...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache__remove - ValueError: Capaci...
==================== 1 failed, 1 passed, 6 errors in 0.13s =====================

18 : Job ID ca484e157f65432faaff8c9e1934b17e
test outcome: killed
lru_cache.py, start pos: (90, 11), end pos: (90, 33)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -87,7 +87,7 @@
         :return: None
         """
         # check if the key is in the lookup map
-        if key in self.lookup_map:
+        if not key in self.lookup_map:
             # remove the node from map and the list
             node = self.lookup_map.pop(key)
             self._remove(node)
ts-3-5/test_3-5_0-5_163.py ..FFF...                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put - KeyError: 1
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put_capacity_reached - KeyE...
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get - KeyError: 1
========================= 3 failed, 5 passed in 0.12s ==========================

19 : Job ID 1000264591a348d6acda86c7023d54a1
test outcome: killed
lru_cache.py, start pos: (105, 11), end pos: (105, 47)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -102,7 +102,7 @@
         self.lookup_map[key] = node
         # check the capacity
-        if len(self.lookup_map) > self.capacity:
+        if not len(self.lookup_map) > self.capacity:
             # remove the last node
             least_recently_used_node = self.head.next
ts-3-5/test_3-5_0-5_163.py ..FFF...                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put - KeyError: 1
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put_capacity_reached - asse...
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get - AssertionError: asser...
========================= 3 failed, 5 passed in 0.12s ==========================

20 : Job ID ae7597dc3dfe43c28080a5700717e53c
test outcome: killed
lru_cache.py, start pos: (125, 11), end pos: (125, 33)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -122,7 +122,7 @@
         :return: the value of the key or -1 if the key is not found
         """
         # check if the key is in the lookup
-        if key in self.lookup_map:
+        if not key in self.lookup_map:
             # get the node
             node = self.lookup_map[key]
ts-3-5/test_3-5_0-5_163.py ....FF..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get - AssertionError: asser...
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get_nonexistent_key - KeyEr...
========================= 2 failed, 6 passed in 0.12s ==========================

21 : Job ID fb54bfb5cc0d495488aa7f0d200f65db
SURVIVED
test outcome: survived
lru_cache.py, start pos: (49, 21), end pos: (49, 22)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -46,7 +46,7 @@
     """
-    terminal_value = 0
+    terminal_value = 1
     """
     Constant value used by the head and tail as terminating values.
     """
ts-3-5/test_3-5_0-5_163.py ........                                      [100%]
============================== 8 passed in 0.12s ===============================

22 : Job ID 5a0f67cd1b8c4853852c796fe2633795
SURVIVED
test outcome: survived
lru_cache.py, start pos: (49, 21), end pos: (49, 22)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -46,7 +46,7 @@
     """
-    terminal_value = 0
+    terminal_value = -1
     """
     Constant value used by the head and tail as terminating values.
     """
ts-3-5/test_3-5_0-5_163.py ........                                      [100%]
============================== 8 passed in 0.12s ===============================

23 : Job ID 3b54bc0514b44a8c98cd2563e273bf66
test outcome: killed
lru_cache.py, start pos: (61, 23), end pos: (61, 24)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -58,7 +58,7 @@
         :param capacity: the maximum number of elements that can be stored in the cache,
             must be greater than 0
         """
-        if capacity <= 1:
+        if capacity <= 2:
             raise ValueError("Capacity must be >= 1")
         # init the head and tail nodes
ts-3-5/test_3-5_0-5_163.py ..EEEEEE                                      [100%]
=========================== short test summary info ============================
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put - ValueError: Capacity m...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache_put_capacity_reached - Value...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get - ValueError: Capacity m...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get_nonexistent_key - ValueE...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache__add - ValueError: Capacity ...
ERROR ts-3-5/test_3-5_0-5_163.py::test_lru_cache__remove - ValueError: Capaci...
========================= 2 passed, 6 errors in 0.13s ==========================

24 : Job ID ddbbe4b4da974d5cb023322464feac02
SURVIVED
test outcome: survived
lru_cache.py, start pos: (61, 23), end pos: (61, 24)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -58,7 +58,7 @@
         :param capacity: the maximum number of elements that can be stored in the cache,
             must be greater than 0
         """
-        if capacity <= 1:
+        if capacity <= 0:
             raise ValueError("Capacity must be >= 1")
         # init the head and tail nodes
ts-3-5/test_3-5_0-5_163.py ........                                      [100%]
============================== 8 passed in 0.12s ===============================

25 : Job ID b41f8523e7f14315a165485195101333
test outcome: killed
lru_cache.py, start pos: (137, 20), end pos: (137, 21)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -134,7 +134,7 @@
             return node.val
         else:
-            return -1
+            return - 2
     def _add(self, node):
         """
ts-3-5/test_3-5_0-5_163.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get_nonexistent_key - asser...
========================= 1 failed, 7 passed in 0.12s ==========================

26 : Job ID bdf0ac6639124882ac077a45f36e11e5
test outcome: killed
lru_cache.py, start pos: (137, 20), end pos: (137, 21)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- alru_cache.py
+++ blru_cache.py
@@ -134,7 +134,7 @@
             return node.val
         else:
-            return -1
+            return - 0
     def _add(self, node):
         """
ts-3-5/test_3-5_0-5_163.py .....F..                                      [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-5_163.py::test_lru_cache_get_nonexistent_key - asser...
========================= 1 failed, 7 passed in 0.12s ==========================
