   - [#   3] CDI lru_cache: 
--------------------------------------------------------------------------------
    9: 
   10: 
   11:     '''
   12:     
-  13:     def __init__(self, key, val):
-  14:         '''
-  15:         Create a node.
-  16: 
-  17:         Node will have a key and value, and blank
-  18:         previous and next values.
-  19: 
-  20:         :param key: the lookup key value
-  21:         :param val: the value corresponding to the key
-  22:         '''
-  23:         self.key = key
-  24:         self.val = val
-  25:         self.next = None
-  26:         self.prev = None
-  27: 
+  13:     @classmethod
+  14:     def __init__(self, key, val):
+  15:         '''
+  16:         Create a node.
+  17: 
+  18:         Node will have a key and value, and blank
+  19:         previous and next values.
+  20: 
+  21:         :param key: the lookup key value
+  22:         :param val: the value corresponding to the key
+  23:         '''
+  24:         self.key = key
+  25:         self.val = val
+  26:         self.next = None
+  27:         self.prev = None
   28: 
   29: class LruCache:
   30:     
   31:     '''
--------------------------------------------------------------------------------
[0.17292 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df21829de0>

   - [#   4] CDI lru_cache: 
--------------------------------------------------------------------------------
   50:     '''
   51:     Constant value used by the head and tail as terminating values.
   52:     '''
   53:     
-  54:     def __init__(self, capacity):
-  55:         '''
-  56:         Create an LRU Cache.
-  57: 
-  58:         :param capacity: the maximum number of elements that can be stored in the cache,
-  59:             must be greater than 0
-  60:         '''
-  61:         if capacity <= 1:
-  62:             raise ValueError('Capacity must be >= 1')
-  63:         
+  54:     @classmethod
+  55:     def __init__(self, capacity):
+  56:         '''
+  57:         Create an LRU Cache.
+  58: 
+  59:         :param capacity: the maximum number of elements that can be stored in the cache,
+  60:             must be greater than 0
+  61:         '''
+  62:         if capacity <= 1:
+  63:             raise ValueError('Capacity must be >= 1')
   64:         
-  65:         self.head = ListNode(self.terminal_value, self.terminal_value)
-  66:         self.tail = ListNode(self.terminal_value, self.terminal_value)
-  67:         
+  65:         
+  66:         self.head = ListNode(self.terminal_value, self.terminal_value)
+  67:         self.tail = ListNode(self.terminal_value, self.terminal_value)
   68:         
-  69:         self.head.next = self.tail
-  70:         self.tail.prev = self.head
-  71:         
+  69:         
+  70:         self.head.next = self.tail
+  71:         self.tail.prev = self.head
   72:         
-  73:         self.lookup_map = {}
-  74:         
+  73:         
+  74:         self.lookup_map = {}

   - [#   5] CDI lru_cache: 
--------------------------------------------------------------------------------
   74:         
   75:         
   76:         self.capacity = capacity
   77:     
-  78:     def put(self, key, value):
-  79:         '''
-  80:         Add a value to the cache.
-  81: 
-  82:         If adding the value will cause the cache to go above capacity, then
-  83:         the least recently item will be dropped.
-  84: 
-  85:         :param key: the lookup key of the item
-  86:         :param value: the value stored on key
-  87:         :return: None
-  88:         '''
-  89:         
-  90:         if key in self.lookup_map:
-  91:             
-  92:             node = self.lookup_map.pop(key)
-  93:             self._remove(node)
-  94:         
+  78:     @classmethod
+  79:     def put(self, key, value):
+  80:         '''
+  81:         Add a value to the cache.
+  82: 
+  83:         If adding the value will cause the cache to go above capacity, then
+  84:         the least recently item will be dropped.
+  85: 
+  86:         :param key: the lookup key of the item
+  87:         :param value: the value stored on key
+  88:         :return: None
+  89:         '''
+  90:         
+  91:         if key in self.lookup_map:
+  92:             
+  93:             node = self.lookup_map.pop(key)
+  94:             self._remove(node)
   95:         
-  96:         node = ListNode(key, value)
-  97:         
+  96:         
+  97:         node = ListNode(key, value)

   - [#   6] CDI lru_cache: 
--------------------------------------------------------------------------------
  111:             
  112:             
  113:             del self.lookup_map[least_recently_used_node.key]
  114:     
- 115:     def get(self, key):
- 116:         '''
- 117:         Get a value from the cache.
- 118: 
- 119:         This will reset the key in the drop order.
- 120: 
- 121:         :param key: the key to lookup
- 122:         :return: the value of the key or -1 if the key is not found
- 123:         '''
- 124:         
- 125:         if key in self.lookup_map:
- 126:             
- 127:             node = self.lookup_map[key]
- 128:             
+ 115:     @classmethod
+ 116:     def get(self, key):
+ 117:         '''
+ 118:         Get a value from the cache.
+ 119: 
+ 120:         This will reset the key in the drop order.
+ 121: 
+ 122:         :param key: the key to lookup
+ 123:         :return: the value of the key or -1 if the key is not found
+ 124:         '''
+ 125:         
+ 126:         if key in self.lookup_map:
+ 127:             
+ 128:             node = self.lookup_map[key]
  129:             
- 130:             self._remove(node)
- 131:             
+ 130:             
+ 131:             self._remove(node)
  132:             
- 133:             self._add(node)
- 134:             
- 135:             return node.val
- 136:         else:
- 137:             return -1

   - [#   7] CDI lru_cache: 
--------------------------------------------------------------------------------
  135:             return node.val
  136:         else:
  137:             return -1
  138:     
- 139:     def _add(self, node):
- 140:         '''
- 141:         Internal function.  Add a node to the end of the LRU list.
- 142: 
- 143:         This function will add a node immediately in front of the tail
- 144:         node.  Sets the node previous to the tail to the previous of
- 145:         the new node, and the next of the new node to the tail.
- 146: 
- 147:         :param node:m the node to add to the list
- 148:         :return: None
- 149:         '''
- 150:         old_last_node = self.tail.prev
- 151:         
+ 139:     @classmethod
+ 140:     def _add(self, node):
+ 141:         '''
+ 142:         Internal function.  Add a node to the end of the LRU list.
+ 143: 
+ 144:         This function will add a node immediately in front of the tail
+ 145:         node.  Sets the node previous to the tail to the previous of
+ 146:         the new node, and the next of the new node to the tail.
+ 147: 
+ 148:         :param node:m the node to add to the list
+ 149:         :return: None
+ 150:         '''
+ 151:         old_last_node = self.tail.prev
  152:         
- 153:         node.prev = old_last_node
- 154:         
+ 153:         
+ 154:         node.prev = old_last_node
  155:         
- 156:         node.next = self.tail
- 157:         
+ 156:         
+ 157:         node.next = self.tail
  158:         
- 159:         old_last_node.next = node
- 160:

   - [#   8] CDI lru_cache: 
--------------------------------------------------------------------------------
  160:         
  161:         
  162:         self.tail.prev = node
  163:     
- 164:     def _remove(self, node):
- 165:         '''
- 166:         Internal function.  Remove a node from the list.
- 167: 
- 168:         This function will remove a node by getting its prev and next
- 169:         and linking them together, thus removing the node and allowing
- 170:         it to be garbage collected.
- 171: 
- 172:         :param node: the node to remove from the list
- 173:         :return: None
- 174:         '''
- 175:         
+ 164:     @classmethod
+ 165:     def _remove(self, node):
+ 166:         '''
+ 167:         Internal function.  Remove a node from the list.
+ 168: 
+ 169:         This function will remove a node by getting its prev and next
+ 170:         and linking them together, thus removing the node and allowing
+ 171:         it to be garbage collected.
+ 172: 
+ 173:         :param node: the node to remove from the list
+ 174:         :return: None
+ 175:         '''
  176:         
- 177:         previous_node = node.prev
- 178:         next_node = node.next
- 179:         
+ 177:         
+ 178:         previous_node = node.prev
+ 179:         next_node = node.next
  180:         
- 181:         previous_node.next = next_node
- 182:         
+ 181:         
+ 182:         previous_node.next = next_node
  183:         
- 184:         next_node.prev = previous_node
+ 184:

   - [#   9] COI lru_cache: 
--------------------------------------------------------------------------------
   57: 
   58:         :param capacity: the maximum number of elements that can be stored in the cache,
   59:             must be greater than 0
   60:         '''
-  61:         if capacity <= 1:
+  61:         if not (capacity <= 1):
   62:             raise ValueError('Capacity must be >= 1')
   63:         
   64:         
   65:         self.head = ListNode(self.terminal_value, self.terminal_value)
--------------------------------------------------------------------------------
[0.15789 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_cache_initialization

self = <test_3-5_0-7_216.TestLruCache object at 0x76df21896260>

    def test_cache_initialization(self):
>       cache = LruCache(3)

ts-3-5/test_3-5_0-7_216.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df21750fd0>, capacity = 3

>   ???
E   ValueError: Capacity must be >= 1

lru_cache:62: ValueError

   - [#  10] COI lru_cache: 
--------------------------------------------------------------------------------
   86:         :param value: the value stored on key
   87:         :return: None
   88:         '''
   89:         
-  90:         if key in self.lookup_map:
+  90:         if not (key in self.lookup_map):
   91:             
   92:             node = self.lookup_map.pop(key)
   93:             self._remove(node)
   94:         
--------------------------------------------------------------------------------
[0.15978 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df218d9180>

    def test_put_get_operations(self):
        cache = LruCache(2)
>       cache.put(1, 'a')

ts-3-5/test_3-5_0-7_216.py:41: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df218dbc70>, key = 1, value = 'a'

>   ???
E   KeyError: 1

lru_cache:92: KeyError

   - [#  11] COI lru_cache: 
--------------------------------------------------------------------------------
   86:         :param value: the value stored on key
   87:         :return: None
   88:         '''
   89:         
-  90:         if key in self.lookup_map:
+  90:         if key not in self.lookup_map:
   91:             
   92:             node = self.lookup_map.pop(key)
   93:             self._remove(node)
   94:         
--------------------------------------------------------------------------------
[0.15936 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df216ced40>

    def test_put_get_operations(self):
        cache = LruCache(2)
>       cache.put(1, 'a')

ts-3-5/test_3-5_0-7_216.py:41: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df216cece0>, key = 1, value = 'a'

>   ???
E   KeyError: 1

lru_cache:92: KeyError

   - [#  12] COI lru_cache: 
--------------------------------------------------------------------------------
  101:         
  102:         self.lookup_map[key] = node
  103:         
  104:         
- 105:         if len(self.lookup_map) > self.capacity:
+ 105:         if not (len(self.lookup_map) > self.capacity):
  106:             
  107:             least_recently_used_node = self.head.next
  108:             
  109:             
--------------------------------------------------------------------------------
[0.16292 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df216cfdf0>

    def test_put_get_operations(self):
        cache = LruCache(2)
        cache.put(1, 'a')
        cache.put(2, 'b')
    
>       assert cache.get(1) == 'a'
E       AssertionError

ts-3-5/test_3-5_0-7_216.py:44: AssertionError

   - [#  15] ROR lru_cache: 
--------------------------------------------------------------------------------
   57: 
   58:         :param capacity: the maximum number of elements that can be stored in the cache,
   59:             must be greater than 0
   60:         '''
-  61:         if capacity <= 1:
+  61:         if capacity >= 1:
   62:             raise ValueError('Capacity must be >= 1')
   63:         
   64:         
   65:         self.head = ListNode(self.terminal_value, self.terminal_value)
--------------------------------------------------------------------------------
[0.17214 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_cache_initialization

self = <test_3-5_0-7_216.TestLruCache object at 0x76df218282e0>

    def test_cache_initialization(self):
>       cache = LruCache(3)

ts-3-5/test_3-5_0-7_216.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df218287c0>, capacity = 3

>   ???
E   ValueError: Capacity must be >= 1

lru_cache:62: ValueError

   - [#  16] ROR lru_cache: 
--------------------------------------------------------------------------------
   57: 
   58:         :param capacity: the maximum number of elements that can be stored in the cache,
   59:             must be greater than 0
   60:         '''
-  61:         if capacity <= 1:
+  61:         if capacity < 1:
   62:             raise ValueError('Capacity must be >= 1')
   63:         
   64:         
   65:         self.head = ListNode(self.terminal_value, self.terminal_value)
--------------------------------------------------------------------------------
[0.13929 s] survived

   - [#  17] ROR lru_cache: 
--------------------------------------------------------------------------------
  101:         
  102:         self.lookup_map[key] = node
  103:         
  104:         
- 105:         if len(self.lookup_map) > self.capacity:
+ 105:         if len(self.lookup_map) < self.capacity:
  106:             
  107:             least_recently_used_node = self.head.next
  108:             
  109:             
--------------------------------------------------------------------------------
[0.15896 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df219d2890>

    def test_put_get_operations(self):
        cache = LruCache(2)
        cache.put(1, 'a')
        cache.put(2, 'b')
    
>       assert cache.get(1) == 'a'
E       AssertionError

ts-3-5/test_3-5_0-7_216.py:44: AssertionError

   - [#  18] ROR lru_cache: 
--------------------------------------------------------------------------------
  101:         
  102:         self.lookup_map[key] = node
  103:         
  104:         
- 105:         if len(self.lookup_map) > self.capacity:
+ 105:         if len(self.lookup_map) >= self.capacity:
  106:             
  107:             least_recently_used_node = self.head.next
  108:             
  109:             
--------------------------------------------------------------------------------
[0.15765 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df21849930>

    def test_put_get_operations(self):
        cache = LruCache(2)
        cache.put(1, 'a')
        cache.put(2, 'b')
    
>       assert cache.get(1) == 'a'
E       AssertionError

ts-3-5/test_3-5_0-7_216.py:44: AssertionError

   - [#  25] SDL lru_cache: 
--------------------------------------------------------------------------------
   19: 
   20:         :param key: the lookup key value
   21:         :param val: the value corresponding to the key
   22:         '''
-  23:         self.key = key
+  23:         pass
   24:         self.val = val
   25:         self.next = None
   26:         self.prev = None
   27: 
--------------------------------------------------------------------------------
[0.15734 s] killed by ts-3-5/test_3-5_0-7_216.py::TestListNode::test_list_node_initialization

self = <test_3-5_0-7_216.TestListNode object at 0x76df217350c0>

    def test_list_node_initialization(self):
        node = ListNode(1, 'a')
>       assert node.key == 1
E       AttributeError: 'ListNode' object has no attribute 'key'

ts-3-5/test_3-5_0-7_216.py:15: AttributeError

   - [#  26] SDL lru_cache: 
--------------------------------------------------------------------------------
   20:         :param key: the lookup key value
   21:         :param val: the value corresponding to the key
   22:         '''
   23:         self.key = key
-  24:         self.val = val
+  24:         pass
   25:         self.next = None
   26:         self.prev = None
   27: 
   28: 
--------------------------------------------------------------------------------
[0.15787 s] killed by ts-3-5/test_3-5_0-7_216.py::TestListNode::test_list_node_initialization

self = <test_3-5_0-7_216.TestListNode object at 0x76df21980b20>

    def test_list_node_initialization(self):
        node = ListNode(1, 'a')
        assert node.key == 1
>       assert node.val == 'a'
E       AttributeError: 'ListNode' object has no attribute 'val'

ts-3-5/test_3-5_0-7_216.py:16: AttributeError

   - [#  27] SDL lru_cache: 
--------------------------------------------------------------------------------
   21:         :param val: the value corresponding to the key
   22:         '''
   23:         self.key = key
   24:         self.val = val
-  25:         self.next = None
+  25:         pass
   26:         self.prev = None
   27: 
   28: 
   29: class LruCache:
--------------------------------------------------------------------------------
[0.15779 s] killed by ts-3-5/test_3-5_0-7_216.py::TestListNode::test_list_node_initialization

self = <test_3-5_0-7_216.TestListNode object at 0x76df217357b0>

    def test_list_node_initialization(self):
        node = ListNode(1, 'a')
        assert node.key == 1
        assert node.val == 'a'
>       assert node.next is None
E       AttributeError: 'ListNode' object has no attribute 'next'

ts-3-5/test_3-5_0-7_216.py:17: AttributeError

   - [#  29] SDL lru_cache: 
--------------------------------------------------------------------------------
   45:         get: O(1), amortized worst case: O(N)
   46: 
   47:     '''
   48:     
-  49:     terminal_value = 0
+  49:     pass
   50:     '''
   51:     Constant value used by the head and tail as terminating values.
   52:     '''
   53:     
--------------------------------------------------------------------------------
[0.19154 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_cache_initialization

self = <test_3-5_0-7_216.TestLruCache object at 0x76df218db8e0>

    def test_cache_initialization(self):
>       cache = LruCache(3)

ts-3-5/test_3-5_0-7_216.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df218f5840>, capacity = 3

>   ???
E   AttributeError: 'LruCache' object has no attribute 'terminal_value'

lru_cache:65: AttributeError

   - [#  30] SDL lru_cache: 
--------------------------------------------------------------------------------
   46: 
   47:     '''
   48:     
   49:     terminal_value = 0
-  50:     '''
-  51:     Constant value used by the head and tail as terminating values.
-  52:     '''
+  50:     pass
+  51:     
+  52:     
   53:     
   54:     def __init__(self, capacity):
   55:         '''
   56:         Create an LRU Cache.
--------------------------------------------------------------------------------
[0.14879 s] survived

   - [#  31] SDL lru_cache: 
--------------------------------------------------------------------------------
   61:         if capacity <= 1:
   62:             raise ValueError('Capacity must be >= 1')
   63:         
   64:         
-  65:         self.head = ListNode(self.terminal_value, self.terminal_value)
+  65:         pass
   66:         self.tail = ListNode(self.terminal_value, self.terminal_value)
   67:         
   68:         
   69:         self.head.next = self.tail
--------------------------------------------------------------------------------
[0.17047 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_cache_initialization

self = <test_3-5_0-7_216.TestLruCache object at 0x76df218db220>

    def test_cache_initialization(self):
>       cache = LruCache(3)

ts-3-5/test_3-5_0-7_216.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df218dbb80>, capacity = 3

>   ???
E   AttributeError: 'LruCache' object has no attribute 'head'

lru_cache:69: AttributeError

   - [#  32] SDL lru_cache: 
--------------------------------------------------------------------------------
   62:             raise ValueError('Capacity must be >= 1')
   63:         
   64:         
   65:         self.head = ListNode(self.terminal_value, self.terminal_value)
-  66:         self.tail = ListNode(self.terminal_value, self.terminal_value)
+  66:         pass
   67:         
   68:         
   69:         self.head.next = self.tail
   70:         self.tail.prev = self.head
--------------------------------------------------------------------------------
[0.17253 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_cache_initialization

self = <test_3-5_0-7_216.TestLruCache object at 0x76df21b71000>

    def test_cache_initialization(self):
>       cache = LruCache(3)

ts-3-5/test_3-5_0-7_216.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df21b71a50>, capacity = 3

>   ???
E   AttributeError: 'LruCache' object has no attribute 'tail'

lru_cache:69: AttributeError

   - [#  33] SDL lru_cache: 
--------------------------------------------------------------------------------
   65:         self.head = ListNode(self.terminal_value, self.terminal_value)
   66:         self.tail = ListNode(self.terminal_value, self.terminal_value)
   67:         
   68:         
-  69:         self.head.next = self.tail
+  69:         pass
   70:         self.tail.prev = self.head
   71:         
   72:         
   73:         self.lookup_map = {}
--------------------------------------------------------------------------------
[0.17334 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_cache_initialization

self = <test_3-5_0-7_216.TestLruCache object at 0x76df218db340>

    def test_cache_initialization(self):
        cache = LruCache(3)
        assert cache.capacity == 3
        assert cache.lookup_map == {}
        assert cache.head.key == cache.tail.key == LruCache.terminal_value
>       assert cache.head.next == cache.tail
E       AssertionError

ts-3-5/test_3-5_0-7_216.py:36: AssertionError

   - [#  34] SDL lru_cache: 
--------------------------------------------------------------------------------
   66:         self.tail = ListNode(self.terminal_value, self.terminal_value)
   67:         
   68:         
   69:         self.head.next = self.tail
-  70:         self.tail.prev = self.head
+  70:         pass
   71:         
   72:         
   73:         self.lookup_map = {}
   74:         
--------------------------------------------------------------------------------
[0.17689 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_cache_initialization

self = <test_3-5_0-7_216.TestLruCache object at 0x76df217a9840>

    def test_cache_initialization(self):
        cache = LruCache(3)
        assert cache.capacity == 3
        assert cache.lookup_map == {}
        assert cache.head.key == cache.tail.key == LruCache.terminal_value
        assert cache.head.next == cache.tail
>       assert cache.tail.prev == cache.head
E       AssertionError

ts-3-5/test_3-5_0-7_216.py:37: AssertionError

   - [#  35] SDL lru_cache: 
--------------------------------------------------------------------------------
   69:         self.head.next = self.tail
   70:         self.tail.prev = self.head
   71:         
   72:         
-  73:         self.lookup_map = {}
+  73:         pass
   74:         
   75:         
   76:         self.capacity = capacity
   77:     
--------------------------------------------------------------------------------
[0.16365 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_cache_initialization

self = <test_3-5_0-7_216.TestLruCache object at 0x76df21959c00>

    def test_cache_initialization(self):
        cache = LruCache(3)
        assert cache.capacity == 3
>       assert cache.lookup_map == {}
E       AttributeError: 'LruCache' object has no attribute 'lookup_map'

ts-3-5/test_3-5_0-7_216.py:34: AttributeError

   - [#  36] SDL lru_cache: 
--------------------------------------------------------------------------------
   72:         
   73:         self.lookup_map = {}
   74:         
   75:         
-  76:         self.capacity = capacity
+  76:         pass
   77:     
   78:     def put(self, key, value):
   79:         '''
   80:         Add a value to the cache.
--------------------------------------------------------------------------------
[0.16590 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_cache_initialization

self = <test_3-5_0-7_216.TestLruCache object at 0x76df215dbac0>

    def test_cache_initialization(self):
        cache = LruCache(3)
>       assert cache.capacity == 3
E       AttributeError: 'LruCache' object has no attribute 'capacity'

ts-3-5/test_3-5_0-7_216.py:33: AttributeError

   - [#  37] SDL lru_cache: 
--------------------------------------------------------------------------------
   88:         '''
   89:         
   90:         if key in self.lookup_map:
   91:             
-  92:             node = self.lookup_map.pop(key)
+  92:             pass
   93:             self._remove(node)
   94:         
   95:         
   96:         node = ListNode(key, value)
--------------------------------------------------------------------------------
[0.14324 s] survived

   - [#  38] SDL lru_cache: 
--------------------------------------------------------------------------------
   89:         
   90:         if key in self.lookup_map:
   91:             
   92:             node = self.lookup_map.pop(key)
-  93:             self._remove(node)
+  93:             pass
   94:         
   95:         
   96:         node = ListNode(key, value)
   97:         
--------------------------------------------------------------------------------
[0.14498 s] survived

   - [#  39] SDL lru_cache: 
--------------------------------------------------------------------------------
   92:             node = self.lookup_map.pop(key)
   93:             self._remove(node)
   94:         
   95:         
-  96:         node = ListNode(key, value)
+  96:         pass
   97:         
   98:         
   99:         self._add(node)
  100:         
--------------------------------------------------------------------------------
[0.16923 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df21853700>

    def test_put_get_operations(self):
        cache = LruCache(2)
>       cache.put(1, 'a')

ts-3-5/test_3-5_0-7_216.py:41: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df218523b0>, key = 1, value = 'a'

>   ???
E   UnboundLocalError: local variable 'node' referenced before assignment

lru_cache:99: UnboundLocalError

   - [#  40] SDL lru_cache: 
--------------------------------------------------------------------------------
   95:         
   96:         node = ListNode(key, value)
   97:         
   98:         
-  99:         self._add(node)
+  99:         pass
  100:         
  101:         
  102:         self.lookup_map[key] = node
  103:         
--------------------------------------------------------------------------------
[0.17230 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df217a9d50>

    def test_put_get_operations(self):
        cache = LruCache(2)
        cache.put(1, 'a')
        cache.put(2, 'b')
    
>       assert cache.get(1) == 'a'

ts-3-5/test_3-5_0-7_216.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
lru_cache:130: in get
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df21853f70>
node = <lru_cache.ListNode object at 0x76df218533d0>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

lru_cache:181: AttributeError
