   - [#  41] SDL lru_cache: 
--------------------------------------------------------------------------------
   98:         
   99:         self._add(node)
  100:         
  101:         
- 102:         self.lookup_map[key] = node
+ 102:         pass
  103:         
  104:         
  105:         if len(self.lookup_map) > self.capacity:
  106:             
--------------------------------------------------------------------------------
[0.17036 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df218a0820>

    def test_put_get_operations(self):
        cache = LruCache(2)
        cache.put(1, 'a')
        cache.put(2, 'b')
    
>       assert cache.get(1) == 'a'
E       AssertionError

ts-3-5/test_3-5_0-7_216.py:44: AssertionError

   - [#  42] SDL lru_cache: 
--------------------------------------------------------------------------------
  103:         
  104:         
  105:         if len(self.lookup_map) > self.capacity:
  106:             
- 107:             least_recently_used_node = self.head.next
+ 107:             pass
  108:             
  109:             
  110:             self._remove(least_recently_used_node)
  111:             
--------------------------------------------------------------------------------
[0.17382 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_eviction

self = <test_3-5_0-7_216.TestLruCache object at 0x76df219d23e0>

    def test_put_eviction(self):
        cache = LruCache(2)
        cache.put(1, 'a')
        cache.put(2, 'b')
>       cache.put(3, 'c')  # Forces eviction of key 1

ts-3-5/test_3-5_0-7_216.py:51: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df219d1180>, key = 3, value = 'c'

>   ???
E   NameError: name 'least_recently_used_node' is not defined

lru_cache:110: NameError

   - [#  43] SDL lru_cache: 
--------------------------------------------------------------------------------
  106:             
  107:             least_recently_used_node = self.head.next
  108:             
  109:             
- 110:             self._remove(least_recently_used_node)
+ 110:             pass
  111:             
  112:             
  113:             del self.lookup_map[least_recently_used_node.key]
  114:     
--------------------------------------------------------------------------------
[0.14714 s] survived

   - [#  44] SDL lru_cache: 
--------------------------------------------------------------------------------
  123:         '''
  124:         
  125:         if key in self.lookup_map:
  126:             
- 127:             node = self.lookup_map[key]
+ 127:             pass
  128:             
  129:             
  130:             self._remove(node)
  131:             
--------------------------------------------------------------------------------
[0.17699 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df218dbaf0>

    def test_put_get_operations(self):
        cache = LruCache(2)
        cache.put(1, 'a')
        cache.put(2, 'b')
    
>       assert cache.get(1) == 'a'

ts-3-5/test_3-5_0-7_216.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df218d91e0>, key = 1

>   ???
E   NameError: name 'node' is not defined

lru_cache:130: NameError

   - [#  45] SDL lru_cache: 
--------------------------------------------------------------------------------
  126:             
  127:             node = self.lookup_map[key]
  128:             
  129:             
- 130:             self._remove(node)
+ 130:             pass
  131:             
  132:             
  133:             self._add(node)
  134:             
--------------------------------------------------------------------------------
[0.17139 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_cache_ordering

self = <test_3-5_0-7_216.TestLruCache object at 0x76df21980af0>

    def test_cache_ordering(self):
        cache = LruCache(3)
        cache.put(1, 'a')
        cache.put(2, 'b')
        cache.put(3, 'c')
    
        assert cache.head.next.key == 1
        assert cache.head.next.val == 'a'
    
        assert cache.get(1) == 'a'  # Move key 1 to the end
>       assert cache.head.next.key == 2
E       AssertionError

ts-3-5/test_3-5_0-7_216.py:74: AssertionError

   - [#  47] SDL lru_cache: 
--------------------------------------------------------------------------------
  131:             
  132:             
  133:             self._add(node)
  134:             
- 135:             return node.val
+ 135:             pass
  136:         else:
  137:             return -1
  138:     
  139:     def _add(self, node):
--------------------------------------------------------------------------------
[0.17154 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df217a80a0>

    def test_put_get_operations(self):
        cache = LruCache(2)
        cache.put(1, 'a')
        cache.put(2, 'b')
    
>       assert cache.get(1) == 'a'
E       AssertionError

ts-3-5/test_3-5_0-7_216.py:44: AssertionError

   - [#  48] SDL lru_cache: 
--------------------------------------------------------------------------------
  133:             self._add(node)
  134:             
  135:             return node.val
  136:         else:
- 137:             return -1
+ 137:             pass
  138:     
  139:     def _add(self, node):
  140:         '''
  141:         Internal function.  Add a node to the end of the LRU list.
--------------------------------------------------------------------------------
[0.17240 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_eviction

self = <test_3-5_0-7_216.TestLruCache object at 0x76df218461a0>

    def test_put_eviction(self):
        cache = LruCache(2)
        cache.put(1, 'a')
        cache.put(2, 'b')
        cache.put(3, 'c')  # Forces eviction of key 1
    
>       assert cache.get(1) == -1
E       AssertionError

ts-3-5/test_3-5_0-7_216.py:53: AssertionError

   - [#  49] SDL lru_cache: 
--------------------------------------------------------------------------------
  146: 
  147:         :param node:m the node to add to the list
  148:         :return: None
  149:         '''
- 150:         old_last_node = self.tail.prev
+ 150:         pass
  151:         
  152:         
  153:         node.prev = old_last_node
  154:         
--------------------------------------------------------------------------------
[0.18815 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df2178ce80>

    def test_put_get_operations(self):
        cache = LruCache(2)
>       cache.put(1, 'a')

ts-3-5/test_3-5_0-7_216.py:41: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
lru_cache:99: in put
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df2178f520>
node = <lru_cache.ListNode object at 0x76df2178ff10>

>   ???
E   NameError: name 'old_last_node' is not defined

lru_cache:153: NameError

   - [#  50] SDL lru_cache: 
--------------------------------------------------------------------------------
  149:         '''
  150:         old_last_node = self.tail.prev
  151:         
  152:         
- 153:         node.prev = old_last_node
+ 153:         pass
  154:         
  155:         
  156:         node.next = self.tail
  157:         
--------------------------------------------------------------------------------
[0.16271 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df21848880>

    def test_put_get_operations(self):
        cache = LruCache(2)
        cache.put(1, 'a')
        cache.put(2, 'b')
    
>       assert cache.get(1) == 'a'

ts-3-5/test_3-5_0-7_216.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
lru_cache:130: in get
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df21848970>
node = <lru_cache.ListNode object at 0x76df21848220>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'next'

lru_cache:181: AttributeError

   - [#  51] SDL lru_cache: 
--------------------------------------------------------------------------------
  152:         
  153:         node.prev = old_last_node
  154:         
  155:         
- 156:         node.next = self.tail
+ 156:         pass
  157:         
  158:         
  159:         old_last_node.next = node
  160:         
--------------------------------------------------------------------------------
[0.14747 s] survived

   - [#  52] SDL lru_cache: 
--------------------------------------------------------------------------------
  155:         
  156:         node.next = self.tail
  157:         
  158:         
- 159:         old_last_node.next = node
+ 159:         pass
  160:         
  161:         
  162:         self.tail.prev = node
  163:     
--------------------------------------------------------------------------------
[0.17467 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_eviction

self = <test_3-5_0-7_216.TestLruCache object at 0x76df217a8a90>

    def test_put_eviction(self):
        cache = LruCache(2)
        cache.put(1, 'a')
        cache.put(2, 'b')
>       cache.put(3, 'c')  # Forces eviction of key 1

ts-3-5/test_3-5_0-7_216.py:51: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
lru_cache:110: in put
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df217aa7a0>
node = <lru_cache.ListNode object at 0x76df217a9060>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'prev'

lru_cache:184: AttributeError

   - [#  53] SDL lru_cache: 
--------------------------------------------------------------------------------
  158:         
  159:         old_last_node.next = node
  160:         
  161:         
- 162:         self.tail.prev = node
+ 162:         pass
  163:     
  164:     def _remove(self, node):
  165:         '''
  166:         Internal function.  Remove a node from the list.
--------------------------------------------------------------------------------
[0.17064 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_eviction

self = <test_3-5_0-7_216.TestLruCache object at 0x76df219d3580>

    def test_put_eviction(self):
        cache = LruCache(2)
        cache.put(1, 'a')
        cache.put(2, 'b')
        cache.put(3, 'c')  # Forces eviction of key 1
    
>       assert cache.get(1) == -1
E       AssertionError

ts-3-5/test_3-5_0-7_216.py:53: AssertionError

   - [#  54] SDL lru_cache: 
--------------------------------------------------------------------------------
  173:         :return: None
  174:         '''
  175:         
  176:         
- 177:         previous_node = node.prev
+ 177:         pass
  178:         next_node = node.next
  179:         
  180:         
  181:         previous_node.next = next_node
--------------------------------------------------------------------------------
[0.17131 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df21700cd0>

    def test_put_get_operations(self):
        cache = LruCache(2)
        cache.put(1, 'a')
        cache.put(2, 'b')
    
>       assert cache.get(1) == 'a'

ts-3-5/test_3-5_0-7_216.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
lru_cache:130: in get
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df21701180>
node = <lru_cache.ListNode object at 0x76df217013f0>

>   ???
E   NameError: name 'previous_node' is not defined

lru_cache:181: NameError

   - [#  55] SDL lru_cache: 
--------------------------------------------------------------------------------
  174:         '''
  175:         
  176:         
  177:         previous_node = node.prev
- 178:         next_node = node.next
+ 178:         pass
  179:         
  180:         
  181:         previous_node.next = next_node
  182:         
--------------------------------------------------------------------------------
[0.17172 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df21a495d0>

    def test_put_get_operations(self):
        cache = LruCache(2)
        cache.put(1, 'a')
        cache.put(2, 'b')
    
>       assert cache.get(1) == 'a'

ts-3-5/test_3-5_0-7_216.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
lru_cache:130: in get
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df219368f0>
node = <lru_cache.ListNode object at 0x76df219344f0>

>   ???
E   NameError: name 'next_node' is not defined

lru_cache:181: NameError

   - [#  56] SDL lru_cache: 
--------------------------------------------------------------------------------
  177:         previous_node = node.prev
  178:         next_node = node.next
  179:         
  180:         
- 181:         previous_node.next = next_node
+ 181:         pass
  182:         
  183:         
  184:         next_node.prev = previous_node
--------------------------------------------------------------------------------
[0.17639 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_cache_ordering

self = <test_3-5_0-7_216.TestLruCache object at 0x76df21849de0>

    def test_cache_ordering(self):
        cache = LruCache(3)
        cache.put(1, 'a')
        cache.put(2, 'b')
        cache.put(3, 'c')
    
        assert cache.head.next.key == 1
        assert cache.head.next.val == 'a'
    
        assert cache.get(1) == 'a'  # Move key 1 to the end
>       assert cache.head.next.key == 2
E       AssertionError

ts-3-5/test_3-5_0-7_216.py:74: AssertionError

   - [#  57] SDL lru_cache: 
--------------------------------------------------------------------------------
  180:         
  181:         previous_node.next = next_node
  182:         
  183:         
- 184:         next_node.prev = previous_node
+ 184:         pass
--------------------------------------------------------------------------------
[0.15037 s] survived

   - [#  63] SVD lru_cache: 
--------------------------------------------------------------------------------
   61:         if capacity <= 1:
   62:             raise ValueError('Capacity must be >= 1')
   63:         
   64:         
-  65:         self.head = ListNode(self.terminal_value, self.terminal_value)
+  65:         self.head = ListNode(terminal_value, self.terminal_value)
   66:         self.tail = ListNode(self.terminal_value, self.terminal_value)
   67:         
   68:         
   69:         self.head.next = self.tail
--------------------------------------------------------------------------------
[0.17049 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_cache_initialization

self = <test_3-5_0-7_216.TestLruCache object at 0x76df21a0e110>

    def test_cache_initialization(self):
>       cache = LruCache(3)

ts-3-5/test_3-5_0-7_216.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df21a0c670>, capacity = 3

>   ???
E   NameError: name 'terminal_value' is not defined

lru_cache:65: NameError

   - [#  64] SVD lru_cache: 
--------------------------------------------------------------------------------
   61:         if capacity <= 1:
   62:             raise ValueError('Capacity must be >= 1')
   63:         
   64:         
-  65:         self.head = ListNode(self.terminal_value, self.terminal_value)
+  65:         self.head = ListNode(self.terminal_value, terminal_value)
   66:         self.tail = ListNode(self.terminal_value, self.terminal_value)
   67:         
   68:         
   69:         self.head.next = self.tail
--------------------------------------------------------------------------------
[0.17062 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_cache_initialization

self = <test_3-5_0-7_216.TestLruCache object at 0x76df215d99f0>

    def test_cache_initialization(self):
>       cache = LruCache(3)

ts-3-5/test_3-5_0-7_216.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df215d91e0>, capacity = 3

>   ???
E   NameError: name 'terminal_value' is not defined

lru_cache:65: NameError

   - [#  66] SVD lru_cache: 
--------------------------------------------------------------------------------
   62:             raise ValueError('Capacity must be >= 1')
   63:         
   64:         
   65:         self.head = ListNode(self.terminal_value, self.terminal_value)
-  66:         self.tail = ListNode(self.terminal_value, self.terminal_value)
+  66:         self.tail = ListNode(terminal_value, self.terminal_value)
   67:         
   68:         
   69:         self.head.next = self.tail
   70:         self.tail.prev = self.head
--------------------------------------------------------------------------------
[0.16938 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_cache_initialization

self = <test_3-5_0-7_216.TestLruCache object at 0x76df21b71e40>

    def test_cache_initialization(self):
>       cache = LruCache(3)

ts-3-5/test_3-5_0-7_216.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df21b71ae0>, capacity = 3

>   ???
E   NameError: name 'terminal_value' is not defined

lru_cache:66: NameError

   - [#  67] SVD lru_cache: 
--------------------------------------------------------------------------------
   62:             raise ValueError('Capacity must be >= 1')
   63:         
   64:         
   65:         self.head = ListNode(self.terminal_value, self.terminal_value)
-  66:         self.tail = ListNode(self.terminal_value, self.terminal_value)
+  66:         self.tail = ListNode(self.terminal_value, terminal_value)
   67:         
   68:         
   69:         self.head.next = self.tail
   70:         self.tail.prev = self.head
--------------------------------------------------------------------------------
[0.16947 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_cache_initialization

self = <test_3-5_0-7_216.TestLruCache object at 0x76df217f64a0>

    def test_cache_initialization(self):
>       cache = LruCache(3)

ts-3-5/test_3-5_0-7_216.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df217f6d40>, capacity = 3

>   ???
E   NameError: name 'terminal_value' is not defined

lru_cache:66: NameError

   - [#  68] SVD lru_cache: 
--------------------------------------------------------------------------------
   65:         self.head = ListNode(self.terminal_value, self.terminal_value)
   66:         self.tail = ListNode(self.terminal_value, self.terminal_value)
   67:         
   68:         
-  69:         self.head.next = self.tail
+  69:         head.next = self.tail
   70:         self.tail.prev = self.head
   71:         
   72:         
   73:         self.lookup_map = {}
--------------------------------------------------------------------------------
[0.17078 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_cache_initialization

self = <test_3-5_0-7_216.TestLruCache object at 0x76df218d83a0>

    def test_cache_initialization(self):
>       cache = LruCache(3)

ts-3-5/test_3-5_0-7_216.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df218d9810>, capacity = 3

>   ???
E   NameError: name 'head' is not defined

lru_cache:69: NameError

   - [#  69] SVD lru_cache: 
--------------------------------------------------------------------------------
   65:         self.head = ListNode(self.terminal_value, self.terminal_value)
   66:         self.tail = ListNode(self.terminal_value, self.terminal_value)
   67:         
   68:         
-  69:         self.head.next = self.tail
+  69:         self.head.next = tail
   70:         self.tail.prev = self.head
   71:         
   72:         
   73:         self.lookup_map = {}
--------------------------------------------------------------------------------
[0.16078 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_cache_initialization

self = <test_3-5_0-7_216.TestLruCache object at 0x76df217be3e0>

    def test_cache_initialization(self):
>       cache = LruCache(3)

ts-3-5/test_3-5_0-7_216.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df217bde10>, capacity = 3

>   ???
E   NameError: name 'tail' is not defined

lru_cache:69: NameError

   - [#  70] SVD lru_cache: 
--------------------------------------------------------------------------------
   66:         self.tail = ListNode(self.terminal_value, self.terminal_value)
   67:         
   68:         
   69:         self.head.next = self.tail
-  70:         self.tail.prev = self.head
+  70:         tail.prev = self.head
   71:         
   72:         
   73:         self.lookup_map = {}
   74:         
--------------------------------------------------------------------------------
[0.16886 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_cache_initialization

self = <test_3-5_0-7_216.TestLruCache object at 0x76df21753700>

    def test_cache_initialization(self):
>       cache = LruCache(3)

ts-3-5/test_3-5_0-7_216.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df21753d30>, capacity = 3

>   ???
E   NameError: name 'tail' is not defined

lru_cache:70: NameError

   - [#  71] SVD lru_cache: 
--------------------------------------------------------------------------------
   66:         self.tail = ListNode(self.terminal_value, self.terminal_value)
   67:         
   68:         
   69:         self.head.next = self.tail
-  70:         self.tail.prev = self.head
+  70:         self.tail.prev = head
   71:         
   72:         
   73:         self.lookup_map = {}
   74:         
--------------------------------------------------------------------------------
[0.17189 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_cache_initialization

self = <test_3-5_0-7_216.TestLruCache object at 0x76df21896680>

    def test_cache_initialization(self):
>       cache = LruCache(3)

ts-3-5/test_3-5_0-7_216.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df21896f80>, capacity = 3

>   ???
E   NameError: name 'head' is not defined

lru_cache:70: NameError

   - [#  74] SVD lru_cache: 
--------------------------------------------------------------------------------
   86:         :param value: the value stored on key
   87:         :return: None
   88:         '''
   89:         
-  90:         if key in self.lookup_map:
+  90:         if key in lookup_map:
   91:             
   92:             node = self.lookup_map.pop(key)
   93:             self._remove(node)
   94:         
--------------------------------------------------------------------------------
[0.18422 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df215dbe80>

    def test_put_get_operations(self):
        cache = LruCache(2)
>       cache.put(1, 'a')

ts-3-5/test_3-5_0-7_216.py:41: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df21958790>, key = 1, value = 'a'

>   ???
E   NameError: name 'lookup_map' is not defined

lru_cache:90: NameError

   - [#  75] SVD lru_cache: 
--------------------------------------------------------------------------------
   88:         '''
   89:         
   90:         if key in self.lookup_map:
   91:             
-  92:             node = self.lookup_map.pop(key)
+  92:             node = lookup_map.pop(key)
   93:             self._remove(node)
   94:         
   95:         
   96:         node = ListNode(key, value)
--------------------------------------------------------------------------------
[0.15015 s] survived

   - [#  76] SVD lru_cache: 
--------------------------------------------------------------------------------
   89:         
   90:         if key in self.lookup_map:
   91:             
   92:             node = self.lookup_map.pop(key)
-  93:             self._remove(node)
+  93:             _remove(node)
   94:         
   95:         
   96:         node = ListNode(key, value)
   97:         
--------------------------------------------------------------------------------
[0.14764 s] survived

   - [#  77] SVD lru_cache: 
--------------------------------------------------------------------------------
   95:         
   96:         node = ListNode(key, value)
   97:         
   98:         
-  99:         self._add(node)
+  99:         _add(node)
  100:         
  101:         
  102:         self.lookup_map[key] = node
  103:         
--------------------------------------------------------------------------------
[0.17280 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df218d9f30>

    def test_put_get_operations(self):
        cache = LruCache(2)
>       cache.put(1, 'a')

ts-3-5/test_3-5_0-7_216.py:41: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df218db340>, key = 1, value = 'a'

>   ???
E   NameError: name '_add' is not defined

lru_cache:99: NameError

   - [#  78] SVD lru_cache: 
--------------------------------------------------------------------------------
   98:         
   99:         self._add(node)
  100:         
  101:         
- 102:         self.lookup_map[key] = node
+ 102:         lookup_map[key] = node
  103:         
  104:         
  105:         if len(self.lookup_map) > self.capacity:
  106:             
--------------------------------------------------------------------------------
[0.17148 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df215da320>

    def test_put_get_operations(self):
        cache = LruCache(2)
>       cache.put(1, 'a')

ts-3-5/test_3-5_0-7_216.py:41: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df218289d0>, key = 1, value = 'a'

>   ???
E   NameError: name 'lookup_map' is not defined

lru_cache:102: NameError

   - [#  79] SVD lru_cache: 
--------------------------------------------------------------------------------
  101:         
  102:         self.lookup_map[key] = node
  103:         
  104:         
- 105:         if len(self.lookup_map) > self.capacity:
+ 105:         if len(lookup_map) > self.capacity:
  106:             
  107:             least_recently_used_node = self.head.next
  108:             
  109:             
--------------------------------------------------------------------------------
[0.17175 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df21822e90>

    def test_put_get_operations(self):
        cache = LruCache(2)
>       cache.put(1, 'a')

ts-3-5/test_3-5_0-7_216.py:41: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df21820af0>, key = 1, value = 'a'

>   ???
E   NameError: name 'lookup_map' is not defined

lru_cache:105: NameError

   - [#  80] SVD lru_cache: 
--------------------------------------------------------------------------------
  101:         
  102:         self.lookup_map[key] = node
  103:         
  104:         
- 105:         if len(self.lookup_map) > self.capacity:
+ 105:         if len(self.lookup_map) > capacity:
  106:             
  107:             least_recently_used_node = self.head.next
  108:             
  109:             
--------------------------------------------------------------------------------
[0.18640 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df21935a80>

    def test_put_get_operations(self):
        cache = LruCache(2)
>       cache.put(1, 'a')

ts-3-5/test_3-5_0-7_216.py:41: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df21937d60>, key = 1, value = 'a'

>   ???
E   NameError: name 'capacity' is not defined

lru_cache:105: NameError
