   - [#  81] SVD lru_cache: 
--------------------------------------------------------------------------------
  103:         
  104:         
  105:         if len(self.lookup_map) > self.capacity:
  106:             
- 107:             least_recently_used_node = self.head.next
+ 107:             least_recently_used_node = head.next
  108:             
  109:             
  110:             self._remove(least_recently_used_node)
  111:             
--------------------------------------------------------------------------------
[0.17683 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_eviction

self = <test_3-5_0-7_216.TestLruCache object at 0x76df21a49600>

    def test_put_eviction(self):
        cache = LruCache(2)
        cache.put(1, 'a')
        cache.put(2, 'b')
>       cache.put(3, 'c')  # Forces eviction of key 1

ts-3-5/test_3-5_0-7_216.py:51: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df21a49ea0>, key = 3, value = 'c'

>   ???
E   NameError: name 'head' is not defined

lru_cache:107: NameError

   - [#  82] SVD lru_cache: 
--------------------------------------------------------------------------------
  106:             
  107:             least_recently_used_node = self.head.next
  108:             
  109:             
- 110:             self._remove(least_recently_used_node)
+ 110:             _remove(least_recently_used_node)
  111:             
  112:             
  113:             del self.lookup_map[least_recently_used_node.key]
  114:     
--------------------------------------------------------------------------------
[0.17714 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_eviction

self = <test_3-5_0-7_216.TestLruCache object at 0x76df218d92d0>

    def test_put_eviction(self):
        cache = LruCache(2)
        cache.put(1, 'a')
        cache.put(2, 'b')
>       cache.put(3, 'c')  # Forces eviction of key 1

ts-3-5/test_3-5_0-7_216.py:51: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df21849450>, key = 3, value = 'c'

>   ???
E   NameError: name '_remove' is not defined

lru_cache:110: NameError

   - [#  83] SVD lru_cache: 
--------------------------------------------------------------------------------
  109:             
  110:             self._remove(least_recently_used_node)
  111:             
  112:             
- 113:             del self.lookup_map[least_recently_used_node.key]
+ 113:             del lookup_map[least_recently_used_node.key]
  114:     
  115:     def get(self, key):
  116:         '''
  117:         Get a value from the cache.
--------------------------------------------------------------------------------
[0.16997 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_eviction

self = <test_3-5_0-7_216.TestLruCache object at 0x76df218d8e50>

    def test_put_eviction(self):
        cache = LruCache(2)
        cache.put(1, 'a')
        cache.put(2, 'b')
>       cache.put(3, 'c')  # Forces eviction of key 1

ts-3-5/test_3-5_0-7_216.py:51: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df218daaa0>, key = 3, value = 'c'

>   ???
E   NameError: name 'lookup_map' is not defined

lru_cache:113: NameError

   - [#  85] SVD lru_cache: 
--------------------------------------------------------------------------------
  123:         '''
  124:         
  125:         if key in self.lookup_map:
  126:             
- 127:             node = self.lookup_map[key]
+ 127:             node = lookup_map[key]
  128:             
  129:             
  130:             self._remove(node)
  131:             
--------------------------------------------------------------------------------
[0.16798 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df21832410>

    def test_put_get_operations(self):
        cache = LruCache(2)
        cache.put(1, 'a')
        cache.put(2, 'b')
    
>       assert cache.get(1) == 'a'

ts-3-5/test_3-5_0-7_216.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df21833340>, key = 1

>   ???
E   NameError: name 'lookup_map' is not defined

lru_cache:127: NameError

   - [#  86] SVD lru_cache: 
--------------------------------------------------------------------------------
  126:             
  127:             node = self.lookup_map[key]
  128:             
  129:             
- 130:             self._remove(node)
+ 130:             _remove(node)
  131:             
  132:             
  133:             self._add(node)
  134:             
--------------------------------------------------------------------------------
[0.17154 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df217f6050>

    def test_put_get_operations(self):
        cache = LruCache(2)
        cache.put(1, 'a')
        cache.put(2, 'b')
    
>       assert cache.get(1) == 'a'

ts-3-5/test_3-5_0-7_216.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df217f4e50>, key = 1

>   ???
E   NameError: name '_remove' is not defined

lru_cache:130: NameError

   - [#  88] SVD lru_cache: 
--------------------------------------------------------------------------------
  146: 
  147:         :param node:m the node to add to the list
  148:         :return: None
  149:         '''
- 150:         old_last_node = self.tail.prev
+ 150:         old_last_node = tail.prev
  151:         
  152:         
  153:         node.prev = old_last_node
  154:         
--------------------------------------------------------------------------------
[0.16082 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df21792440>

    def test_put_get_operations(self):
        cache = LruCache(2)
>       cache.put(1, 'a')

ts-3-5/test_3-5_0-7_216.py:41: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
lru_cache:99: in put
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df217928f0>
node = <lru_cache.ListNode object at 0x76df21792b60>

>   ???
E   NameError: name 'tail' is not defined

lru_cache:150: NameError

   - [#  89] SVD lru_cache: 
--------------------------------------------------------------------------------
  152:         
  153:         node.prev = old_last_node
  154:         
  155:         
- 156:         node.next = self.tail
+ 156:         node.next = tail
  157:         
  158:         
  159:         old_last_node.next = node
  160:         
--------------------------------------------------------------------------------
[0.18274 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df21849bd0>

    def test_put_get_operations(self):
        cache = LruCache(2)
>       cache.put(1, 'a')

ts-3-5/test_3-5_0-7_216.py:41: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
lru_cache:99: in put
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df2184ae30>
node = <lru_cache.ListNode object at 0x76df2184afb0>

>   ???
E   NameError: name 'tail' is not defined

lru_cache:156: NameError

   - [#  90] SVD lru_cache: 
--------------------------------------------------------------------------------
  158:         
  159:         old_last_node.next = node
  160:         
  161:         
- 162:         self.tail.prev = node
+ 162:         tail.prev = node
  163:     
  164:     def _remove(self, node):
  165:         '''
  166:         Internal function.  Remove a node from the list.
--------------------------------------------------------------------------------
[0.17065 s] killed by ts-3-5/test_3-5_0-7_216.py::TestLruCache::test_put_get_operations

self = <test_3-5_0-7_216.TestLruCache object at 0x76df2180c460>

    def test_put_get_operations(self):
        cache = LruCache(2)
>       cache.put(1, 'a')

ts-3-5/test_3-5_0-7_216.py:41: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
lru_cache:99: in put
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <lru_cache.LruCache object at 0x76df2180ce20>
node = <lru_cache.ListNode object at 0x76df2180c7f0>

>   ???
E   NameError: name 'tail' is not defined

lru_cache:162: NameError
