1 : Job ID 819e400dace5412c827955e4d486c89b
test outcome: killed
mergesort.py, start pos: (10, 29), end pos: (10, 31)
operator: core/ReplaceBinaryOperator_FloorDiv_Add, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -7,7 +7,7 @@
         if len(l) <= 1:
             return l
-        left = sort(l[:len(l)//2])
+        left = sort(l[:len(l)+2])
         right = sort(l[len(l)//2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - RecursionError: maximum...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - RecursionError: maxim...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - RecursionError: m...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - RecursionError: maxi...
========================= 5 failed, 1 passed in 0.14s ==========================

2 : Job ID 9d58201ed5e34e29b67571f46364a930
test outcome: killed
mergesort.py, start pos: (11, 29), end pos: (11, 31)
operator: core/ReplaceBinaryOperator_FloorDiv_Add, occurrence: 1
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -8,7 +8,7 @@
             return l
         left = sort(l[:len(l)//2])
-        right = sort(l[len(l)//2:])
+        right = sort(l[len(l)+2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - assert [1] == [1, 2, 3,...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - assert [5] == [...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - assert [2] == [2, 2, ...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-3] == [-...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [3] == [-3, -...
========================= 5 failed, 1 passed in 0.13s ==========================

3 : Job ID 6e83f53c83a543be9351901de9811d7d
test outcome: killed
mergesort.py, start pos: (10, 29), end pos: (10, 31)
operator: core/ReplaceBinaryOperator_FloorDiv_Sub, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -7,7 +7,7 @@
         if len(l) <= 1:
             return l
-        left = sort(l[:len(l)//2])
+        left = sort(l[:len(l)-2])
         right = sort(l[len(l)//2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - assert [1, 3, 3, 5] == ...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - assert [1, 3, 3...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - assert [2, 2, 2, 2] =...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-5, -5, -...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [-3, -1, 4, 4...
========================= 5 failed, 1 passed in 0.12s ==========================

4 : Job ID 169c636ab87844249953fdb9cbde3518
test outcome: killed
mergesort.py, start pos: (11, 29), end pos: (11, 31)
operator: core/ReplaceBinaryOperator_FloorDiv_Sub, occurrence: 1
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -8,7 +8,7 @@
             return l
         left = sort(l[:len(l)//2])
-        right = sort(l[len(l)//2:])
+        right = sort(l[len(l)-2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - RecursionError: maximum...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - RecursionError: maxim...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - RecursionError: m...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - RecursionError: maxi...
========================= 5 failed, 1 passed in 0.14s ==========================

5 : Job ID ca1b61cfc8334e81ad884225e70a37ee
test outcome: killed
mergesort.py, start pos: (10, 29), end pos: (10, 31)
operator: core/ReplaceBinaryOperator_FloorDiv_Mul, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -7,7 +7,7 @@
         if len(l) <= 1:
             return l
-        left = sort(l[:len(l)//2])
+        left = sort(l[:len(l)*2])
         right = sort(l[len(l)//2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - RecursionError: maximum...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - RecursionError: maxim...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - RecursionError: m...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - RecursionError: maxi...
========================= 5 failed, 1 passed in 0.14s ==========================

6 : Job ID 961093eb8b59460ca85e760163e5eff2
test outcome: killed
mergesort.py, start pos: (11, 29), end pos: (11, 31)
operator: core/ReplaceBinaryOperator_FloorDiv_Mul, occurrence: 1
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -8,7 +8,7 @@
             return l
         left = sort(l[:len(l)//2])
-        right = sort(l[len(l)//2:])
+        right = sort(l[len(l)*2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - assert [1] == [1, 2, 3,...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - assert [5] == [...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - assert [2] == [2, 2, ...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-3] == [-...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [3] == [-3, -...
========================= 5 failed, 1 passed in 0.12s ==========================

7 : Job ID 99f024a82ce9411fb697c7646d02d47d
test outcome: killed
mergesort.py, start pos: (10, 29), end pos: (10, 31)
operator: core/ReplaceBinaryOperator_FloorDiv_Div, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -7,7 +7,7 @@
         if len(l) <= 1:
             return l
-        left = sort(l[:len(l)//2])
+        left = sort(l[:len(l)/2])
         right = sort(l[len(l)//2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - TypeError: slice indice...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - TypeError: slic...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - TypeError: slice indi...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - TypeError: slice ...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - TypeError: slice ind...
========================= 5 failed, 1 passed in 0.12s ==========================

8 : Job ID 8b34a762dd8843079dbd6567e7f0b302
test outcome: killed
mergesort.py, start pos: (11, 29), end pos: (11, 31)
operator: core/ReplaceBinaryOperator_FloorDiv_Div, occurrence: 1
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -8,7 +8,7 @@
             return l
         left = sort(l[:len(l)//2])
-        right = sort(l[len(l)//2:])
+        right = sort(l[len(l)/2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - TypeError: slice indice...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - TypeError: slic...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - TypeError: slice indi...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - TypeError: slice ...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - TypeError: slice ind...
========================= 5 failed, 1 passed in 0.13s ==========================

9 : Job ID edbc2e56be0c4e0e95cab7c34686043c
test outcome: killed
mergesort.py, start pos: (10, 29), end pos: (10, 31)
operator: core/ReplaceBinaryOperator_FloorDiv_Mod, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -7,7 +7,7 @@
         if len(l) <= 1:
             return l
-        left = sort(l[:len(l)//2])
+        left = sort(l[:len(l)%2])
         right = sort(l[len(l)//2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - assert [1, 3, 5] == [1,...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - assert [1, 3, 5...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - assert [2, 2, 2] == [...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-5, -4, -...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [-3] == [-3, ...
========================= 5 failed, 1 passed in 0.12s ==========================

10 : Job ID d56d9e4f11f941d9ab32dbfeb1d4536f
test outcome: killed
mergesort.py, start pos: (11, 29), end pos: (11, 31)
operator: core/ReplaceBinaryOperator_FloorDiv_Mod, occurrence: 1
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -8,7 +8,7 @@
             return l
         left = sort(l[:len(l)//2])
-        right = sort(l[len(l)//2:])
+        right = sort(l[len(l)%2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - RecursionError: maximum...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - RecursionError: maxim...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - RecursionError: m...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - RecursionError: maxi...
========================= 5 failed, 1 passed in 0.14s ==========================

11 : Job ID a862bed1e370403f8aad7fe95bccc2ef
test outcome: killed
mergesort.py, start pos: (10, 29), end pos: (10, 31)
operator: core/ReplaceBinaryOperator_FloorDiv_Pow, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -7,7 +7,7 @@
         if len(l) <= 1:
             return l
-        left = sort(l[:len(l)//2])
+        left = sort(l[:len(l)**2])
         right = sort(l[len(l)//2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - RecursionError: maximum...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - RecursionError: maxim...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - RecursionError: m...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - RecursionError: maxi...
========================= 5 failed, 1 passed in 0.14s ==========================

12 : Job ID 5d8d502889104d38b4c296182974b6c6
test outcome: killed
mergesort.py, start pos: (11, 29), end pos: (11, 31)
operator: core/ReplaceBinaryOperator_FloorDiv_Pow, occurrence: 1
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -8,7 +8,7 @@
             return l
         left = sort(l[:len(l)//2])
-        right = sort(l[len(l)//2:])
+        right = sort(l[len(l)**2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - assert [1] == [1, 2, 3,...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - assert [5] == [...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - assert [2] == [2, 2, ...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-3] == [-...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [3] == [-3, -...
========================= 5 failed, 1 passed in 0.12s ==========================

13 : Job ID 304e563c6894476e85873ee9d6e51f73
test outcome: killed
mergesort.py, start pos: (10, 29), end pos: (10, 31)
operator: core/ReplaceBinaryOperator_FloorDiv_RShift, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -7,7 +7,7 @@
         if len(l) <= 1:
             return l
-        left = sort(l[:len(l)//2])
+        left = sort(l[:len(l)>>2])
         right = sort(l[len(l)//2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - assert [1, 5] == [1, 2,...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - assert [1, 5] =...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - assert [2, 2] == [2, ...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-4, -3] =...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [-3, -2, -1] ...
========================= 5 failed, 1 passed in 0.12s ==========================

14 : Job ID d82b9d3d32cc4f63b3c4dd41189011d6
test outcome: killed
mergesort.py, start pos: (11, 29), end pos: (11, 31)
operator: core/ReplaceBinaryOperator_FloorDiv_RShift, occurrence: 1
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -8,7 +8,7 @@
             return l
         left = sort(l[:len(l)//2])
-        right = sort(l[len(l)//2:])
+        right = sort(l[len(l)>>2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - RecursionError: maximum...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - RecursionError: maxim...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - RecursionError: m...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - RecursionError: maxi...
========================= 5 failed, 1 passed in 0.14s ==========================

15 : Job ID 3b83fcc10a7b4fe2955957a124b0620d
test outcome: killed
mergesort.py, start pos: (10, 29), end pos: (10, 31)
operator: core/ReplaceBinaryOperator_FloorDiv_LShift, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -7,7 +7,7 @@
         if len(l) <= 1:
             return l
-        left = sort(l[:len(l)//2])
+        left = sort(l[:len(l)<<2])
         right = sort(l[len(l)//2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - RecursionError: maximum...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - RecursionError: maxim...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - RecursionError: m...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - RecursionError: maxi...
========================= 5 failed, 1 passed in 0.14s ==========================

16 : Job ID ffae5a6fe8de48faaf10fdd2e5b37a0f
test outcome: killed
mergesort.py, start pos: (11, 29), end pos: (11, 31)
operator: core/ReplaceBinaryOperator_FloorDiv_LShift, occurrence: 1
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -8,7 +8,7 @@
             return l
         left = sort(l[:len(l)//2])
-        right = sort(l[len(l)//2:])
+        right = sort(l[len(l)<<2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - assert [1] == [1, 2, 3,...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - assert [5] == [...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - assert [2] == [2, 2, ...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-3] == [-...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [3] == [-3, -...
========================= 5 failed, 1 passed in 0.12s ==========================

17 : Job ID 9b1ad9fc74da42aa87af96ebfb29a81c
test outcome: killed
mergesort.py, start pos: (10, 29), end pos: (10, 31)
operator: core/ReplaceBinaryOperator_FloorDiv_BitOr, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -7,7 +7,7 @@
         if len(l) <= 1:
             return l
-        left = sort(l[:len(l)//2])
+        left = sort(l[:len(l)|2])
         right = sort(l[len(l)//2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - RecursionError: maximum...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - RecursionError: maxim...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - RecursionError: m...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - RecursionError: maxi...
========================= 5 failed, 1 passed in 0.15s ==========================

18 : Job ID 694ad266dfd94ab883d341f8f40de1a8
test outcome: killed
mergesort.py, start pos: (11, 29), end pos: (11, 31)
operator: core/ReplaceBinaryOperator_FloorDiv_BitOr, occurrence: 1
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -8,7 +8,7 @@
             return l
         left = sort(l[:len(l)//2])
-        right = sort(l[len(l)//2:])
+        right = sort(l[len(l)|2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - assert [1] == [1, 2, 3,...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - assert [5] == [...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - assert [2] == [2, 2, ...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-3] == [-...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [3] == [-3, -...
========================= 5 failed, 1 passed in 0.13s ==========================

19 : Job ID 5024ac26ad724934988522b71b3fcf2b
test outcome: killed
mergesort.py, start pos: (10, 29), end pos: (10, 31)
operator: core/ReplaceBinaryOperator_FloorDiv_BitAnd, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -7,7 +7,7 @@
         if len(l) <= 1:
             return l
-        left = sort(l[:len(l)//2])
+        left = sort(l[:len(l)&2])
         right = sort(l[len(l)//2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - RecursionError: maximum...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - RecursionError: maxim...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - RecursionError: m...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - RecursionError: maxi...
========================= 5 failed, 1 passed in 0.14s ==========================

20 : Job ID f80e7a75d08d462594bb95915927109d
test outcome: killed
mergesort.py, start pos: (11, 29), end pos: (11, 31)
operator: core/ReplaceBinaryOperator_FloorDiv_BitAnd, occurrence: 1
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -8,7 +8,7 @@
             return l
         left = sort(l[:len(l)//2])
-        right = sort(l[len(l)//2:])
+        right = sort(l[len(l)&2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - RecursionError: maximum...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - RecursionError: maxim...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - RecursionError: m...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - RecursionError: maxi...
========================= 5 failed, 1 passed in 0.15s ==========================

21 : Job ID bc726b81b032408486f42fd266a4437e
test outcome: killed
mergesort.py, start pos: (10, 29), end pos: (10, 31)
operator: core/ReplaceBinaryOperator_FloorDiv_BitXor, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -7,7 +7,7 @@
         if len(l) <= 1:
             return l
-        left = sort(l[:len(l)//2])
+        left = sort(l[:len(l)^2])
         right = sort(l[len(l)//2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - RecursionError: maximum...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - RecursionError: maxim...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - RecursionError: m...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - RecursionError: maxi...
========================= 5 failed, 1 passed in 0.14s ==========================

22 : Job ID eb1cffc0174d46729c59ba1047d64720
test outcome: killed
mergesort.py, start pos: (11, 29), end pos: (11, 31)
operator: core/ReplaceBinaryOperator_FloorDiv_BitXor, occurrence: 1
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -8,7 +8,7 @@
             return l
         left = sort(l[:len(l)//2])
-        right = sort(l[len(l)//2:])
+        right = sort(l[len(l)^2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - RecursionError: maximum...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - RecursionError: maxim...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - RecursionError: m...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - RecursionError: maxi...
========================= 5 failed, 1 passed in 0.14s ==========================

23 : Job ID c3091381f2a94c579a72d739324c6358
test outcome: killed
mergesort.py, start pos: (24, 21), end pos: (24, 22)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -21,7 +21,7 @@
         l2 = deque(l2)
         while l1 and l2:
-            if l1[0] < l2[0]:
+            if l1[0] == l2[0]:
                 res.append(l1.popleft())
             else:
                 res.append(l2.popleft())
ts-3-5/test_3-5_0-9_272.py .F..FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - assert [5, 4, 3, 2, 1] ...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-4, -2, -...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [-3, 2, 4, -2...
========================= 3 failed, 3 passed in 0.14s ==========================

24 : Job ID c1af65532f724836af6eb0223b7a97e9
test outcome: killed
mergesort.py, start pos: (24, 21), end pos: (24, 22)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -21,7 +21,7 @@
         l2 = deque(l2)
         while l1 and l2:
-            if l1[0] < l2[0]:
+            if l1[0] != l2[0]:
                 res.append(l1.popleft())
             else:
                 res.append(l2.popleft())
ts-3-5/test_3-5_0-9_272.py ..F.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - assert [5, 4, 3...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-3, -1, -...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [3, -1, 0, 5,...
========================= 3 failed, 3 passed in 0.13s ==========================

25 : Job ID bc9cfcdd6bc44540bf96c97f959e9ca9
SURVIVED
test outcome: survived
mergesort.py, start pos: (24, 21), end pos: (24, 22)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -21,7 +21,7 @@
         l2 = deque(l2)
         while l1 and l2:
-            if l1[0] < l2[0]:
+            if l1[0] <= l2[0]:
                 res.append(l1.popleft())
             else:
                 res.append(l2.popleft())
ts-3-5/test_3-5_0-9_272.py ......                                        [100%]
============================== 6 passed in 0.12s ===============================

26 : Job ID aec2eedb8a08473892f55e3f981f5838
test outcome: killed
mergesort.py, start pos: (24, 21), end pos: (24, 22)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -21,7 +21,7 @@
         l2 = deque(l2)
         while l1 and l2:
-            if l1[0] < l2[0]:
+            if l1[0] > l2[0]:
                 res.append(l1.popleft())
             else:
                 res.append(l2.popleft())
ts-3-5/test_3-5_0-9_272.py .FF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - assert [5, 4, 3, 2, 1] ...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - assert [5, 4, 3...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-1, -2, -...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [5, 4, 3, 2, ...
========================= 4 failed, 2 passed in 0.12s ==========================

27 : Job ID 2f92d440d99e499cabcb811120c2efeb
test outcome: killed
mergesort.py, start pos: (24, 21), end pos: (24, 22)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -21,7 +21,7 @@
         l2 = deque(l2)
         while l1 and l2:
-            if l1[0] < l2[0]:
+            if l1[0] >= l2[0]:
                 res.append(l1.popleft())
             else:
                 res.append(l2.popleft())
ts-3-5/test_3-5_0-9_272.py .FF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - assert [5, 4, 3, 2, 1] ...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - assert [5, 4, 3...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-1, -2, -...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [5, 4, 3, 2, ...
========================= 4 failed, 2 passed in 0.12s ==========================

28 : Job ID 4869aa4aa3a34b67b5201b2a3ba6492a
test outcome: killed
mergesort.py, start pos: (24, 21), end pos: (24, 22)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -21,7 +21,7 @@
         l2 = deque(l2)
         while l1 and l2:
-            if l1[0] < l2[0]:
+            if l1[0] is l2[0]:
                 res.append(l1.popleft())
             else:
                 res.append(l2.popleft())
ts-3-5/test_3-5_0-9_272.py .F..FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - assert [5, 4, 3, 2, 1] ...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-4, -2, -...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [-3, 2, 4, -2...
========================= 3 failed, 3 passed in 0.13s ==========================
