29 : Job ID 48cdcdccb9c7422d844afb69ccb5efd3
test outcome: killed
mergesort.py, start pos: (24, 21), end pos: (24, 22)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -21,7 +21,7 @@
         l2 = deque(l2)
         while l1 and l2:
-            if l1[0] < l2[0]:
+            if l1[0] is not l2[0]:
                 res.append(l1.popleft())
             else:
                 res.append(l2.popleft())
ts-3-5/test_3-5_0-9_272.py ..F.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - assert [5, 4, 3...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-3, -1, -...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [3, -1, 0, 5,...
========================= 3 failed, 3 passed in 0.13s ==========================

30 : Job ID bfc3295ee8ce4e36a446f28f61ff09cb
test outcome: killed
mergesort.py, start pos: (7, 18), end pos: (7, 20)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -4,7 +4,7 @@
     def sort(l):
-        if len(l) <= 1:
+        if len(l) == 1:
             return l
         left = sort(l[:len(l)//2])
ts-3-5/test_3-5_0-9_272.py F.....                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_empty_list - RecursionError: maximum ...
========================= 1 failed, 5 passed in 0.12s ==========================

31 : Job ID 5c63e8a5a87b4caa9cffd1085dc623d7
test outcome: killed
mergesort.py, start pos: (7, 18), end pos: (7, 20)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -4,7 +4,7 @@
     def sort(l):
-        if len(l) <= 1:
+        if len(l) != 1:
             return l
         left = sort(l[:len(l)//2])
ts-3-5/test_3-5_0-9_272.py ..F.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - assert [5, 4, 3...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-3, -1, -...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [3, -1, 0, 5,...
========================= 3 failed, 3 passed in 0.13s ==========================

32 : Job ID 950e5608c06540e9a703730d304eb62d
test outcome: killed
mergesort.py, start pos: (7, 18), end pos: (7, 20)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -4,7 +4,7 @@
     def sort(l):
-        if len(l) <= 1:
+        if len(l) < 1:
             return l
         left = sort(l[:len(l)//2])
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - RecursionError: maximum...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - RecursionError: maxim...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - RecursionError: m...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - RecursionError: maxi...
========================= 5 failed, 1 passed in 0.14s ==========================

33 : Job ID 28a0f4c36f50453abc0b360a2486488a
test outcome: killed
mergesort.py, start pos: (7, 18), end pos: (7, 20)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -4,7 +4,7 @@
     def sort(l):
-        if len(l) <= 1:
+        if len(l) > 1:
             return l
         left = sort(l[:len(l)//2])
ts-3-5/test_3-5_0-9_272.py F.F.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_empty_list - RecursionError: maximum ...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - assert [5, 4, 3...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-3, -1, -...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [3, -1, 0, 5,...
========================= 4 failed, 2 passed in 0.13s ==========================

34 : Job ID a5b100b5fd8e4999bfc035dd57162e16
test outcome: killed
mergesort.py, start pos: (7, 18), end pos: (7, 20)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -4,7 +4,7 @@
     def sort(l):
-        if len(l) <= 1:
+        if len(l) >= 1:
             return l
         left = sort(l[:len(l)//2])
ts-3-5/test_3-5_0-9_272.py F.F.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_empty_list - RecursionError: maximum ...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - assert [5, 4, 3...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-3, -1, -...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [3, -1, 0, 5,...
========================= 4 failed, 2 passed in 0.13s ==========================

35 : Job ID 8e27e8fa6e4a4c52a05126dc8ac4ad2d
test outcome: killed
mergesort.py, start pos: (7, 11), end pos: (7, 22)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -4,7 +4,7 @@
     def sort(l):
-        if len(l) <= 1:
+        if not len(l) <= 1:
             return l
         left = sort(l[:len(l)//2])
ts-3-5/test_3-5_0-9_272.py F.F.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_empty_list - RecursionError: maximum ...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - assert [5, 4, 3...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-3, -1, -...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [3, -1, 0, 5,...
========================= 4 failed, 2 passed in 0.13s ==========================

36 : Job ID 0848b9d9f2a947f6aeee613461c8060f
test outcome: killed
mergesort.py, start pos: (23, 14), end pos: (23, 23)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -20,7 +20,7 @@
         l1 = deque(l1)
         l2 = deque(l2)
-        while l1 and l2:
+        while not l1 and l2:
             if l1[0] < l2[0]:
                 res.append(l1.popleft())
             else:
ts-3-5/test_3-5_0-9_272.py ..F.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - assert [5, 4, 3...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-3, -1, -...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [3, -1, 0, 5,...
========================= 3 failed, 3 passed in 0.12s ==========================

37 : Job ID 5d1935192cfd40ccbc3e7cbc39647832
test outcome: killed
mergesort.py, start pos: (24, 15), end pos: (24, 28)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -21,7 +21,7 @@
         l2 = deque(l2)
         while l1 and l2:
-            if l1[0] < l2[0]:
+            if not l1[0] < l2[0]:
                 res.append(l1.popleft())
             else:
                 res.append(l2.popleft())
ts-3-5/test_3-5_0-9_272.py .FF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - assert [5, 4, 3, 2, 1] ...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - assert [5, 4, 3...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-1, -2, -...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [5, 4, 3, 2, ...
========================= 4 failed, 2 passed in 0.12s ==========================

38 : Job ID 2bd7ec834dd54a8aad328b0fc1e5bb51
test outcome: killed
mergesort.py, start pos: (28, 14), end pos: (28, 16)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -25,7 +25,7 @@
                 res.append(l1.popleft())
             else:
                 res.append(l2.popleft())
-        while l1:
+        while not l1:
             res.append(l1.popleft())
         while l2:
             res.append(l2.popleft())
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - IndexError: pop from an...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - assert [1] == [...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - assert [2] == [2, 2, ...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - IndexError: pop f...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - IndexError: pop from...
========================= 5 failed, 1 passed in 0.12s ==========================

39 : Job ID 9a2e92b33a6543639fef8285fa00b29c
test outcome: killed
mergesort.py, start pos: (30, 14), end pos: (30, 16)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -27,7 +27,7 @@
                 res.append(l2.popleft())
         while l1:
             res.append(l1.popleft())
-        while l2:
+        while not l2:
             res.append(l2.popleft())
         return res
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - assert [1] == [1, 2, 3,...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - IndexError: pop...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - IndexError: pop from ...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - IndexError: pop f...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - IndexError: pop from...
========================= 5 failed, 1 passed in 0.12s ==========================

40 : Job ID a7c148cd55284ff08e006cae66ee2df7
test outcome: killed
mergesort.py, start pos: (23, 17), end pos: (23, 20)
operator: core/ReplaceAndWithOr, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -20,7 +20,7 @@
         l1 = deque(l1)
         l2 = deque(l2)
-        while l1 and l2:
+        while l1 or l2:
             if l1[0] < l2[0]:
                 res.append(l1.popleft())
             else:
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - IndexError: deque index...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - IndexError: deq...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - IndexError: deque ind...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - IndexError: deque...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - IndexError: deque in...
========================= 5 failed, 1 passed in 0.12s ==========================

41 : Job ID 03c2d6715ca0452492119ea7a1cb0b9c
test outcome: killed
mergesort.py, start pos: (7, 21), end pos: (7, 22)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -4,7 +4,7 @@
     def sort(l):
-        if len(l) <= 1:
+        if len(l) <= 2:
             return l
         left = sort(l[:len(l)//2])
ts-3-5/test_3-5_0-9_272.py ..F.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - assert [2, 1, 3...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-5, -3, -...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [-2, 0, 2, -3...
========================= 3 failed, 3 passed in 0.12s ==========================

42 : Job ID 65be6e31721c4bed9b8e51d348d0b8e6
test outcome: killed
mergesort.py, start pos: (7, 21), end pos: (7, 22)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -4,7 +4,7 @@
     def sort(l):
-        if len(l) <= 1:
+        if len(l) <= 0:
             return l
         left = sort(l[:len(l)//2])
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - RecursionError: maximum...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - RecursionError: maxim...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - RecursionError: m...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - RecursionError: maxi...
========================= 5 failed, 1 passed in 0.14s ==========================

43 : Job ID 4957c507090d4fadb454fe8150696966
test outcome: killed
mergesort.py, start pos: (10, 31), end pos: (10, 32)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -7,7 +7,7 @@
         if len(l) <= 1:
             return l
-        left = sort(l[:len(l)//2])
+        left = sort(l[:len(l)// 3])
         right = sort(l[len(l)//2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - assert [1, 3, 5] == [1,...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - assert [1, 3, 5...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - assert [2, 2, 2] == [...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-5, -4, -...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [-3, -2, -1] ...
========================= 5 failed, 1 passed in 0.12s ==========================

44 : Job ID cdbb86c51f84418795ffea50814d0ffc
test outcome: killed
mergesort.py, start pos: (10, 31), end pos: (10, 32)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -7,7 +7,7 @@
         if len(l) <= 1:
             return l
-        left = sort(l[:len(l)//2])
+        left = sort(l[:len(l)// 1])
         right = sort(l[len(l)//2:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - RecursionError: maximum...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - RecursionError: maxim...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - RecursionError: m...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - RecursionError: maxi...
========================= 5 failed, 1 passed in 0.14s ==========================

45 : Job ID 1b23e08f72db478a99d5219bec805e07
test outcome: killed
mergesort.py, start pos: (11, 31), end pos: (11, 32)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -8,7 +8,7 @@
             return l
         left = sort(l[:len(l)//2])
-        right = sort(l[len(l)//2:])
+        right = sort(l[len(l)// 3:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - RecursionError: maximum...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - RecursionError: maxim...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - RecursionError: m...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - RecursionError: maxi...
========================= 5 failed, 1 passed in 0.14s ==========================

46 : Job ID ace20ac4e7b34cbc8eeb49c6dff361a6
test outcome: killed
mergesort.py, start pos: (11, 31), end pos: (11, 32)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -8,7 +8,7 @@
             return l
         left = sort(l[:len(l)//2])
-        right = sort(l[len(l)//2:])
+        right = sort(l[len(l)// 1:])
         output = merge(left, right)
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - assert [1] == [1, 2, 3,...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - assert [5] == [...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - assert [2] == [2, 2, ...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-3] == [-...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [3] == [-3, -...
========================= 5 failed, 1 passed in 0.12s ==========================

47 : Job ID c9434d0f97c24b9fa87568183e604a13
test outcome: killed
mergesort.py, start pos: (24, 18), end pos: (24, 19)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -21,7 +21,7 @@
         l2 = deque(l2)
         while l1 and l2:
-            if l1[0] < l2[0]:
+            if l1[ 1] < l2[0]:
                 res.append(l1.popleft())
             else:
                 res.append(l2.popleft())
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - IndexError: deque index...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - IndexError: deq...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - IndexError: deque ind...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - IndexError: deque...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - IndexError: deque in...
========================= 5 failed, 1 passed in 0.12s ==========================

48 : Job ID cc889bacac0f48a196820143987482ea
test outcome: killed
mergesort.py, start pos: (24, 18), end pos: (24, 19)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -21,7 +21,7 @@
         l2 = deque(l2)
         while l1 and l2:
-            if l1[0] < l2[0]:
+            if l1[ -1] < l2[0]:
                 res.append(l1.popleft())
             else:
                 res.append(l2.popleft())
ts-3-5/test_3-5_0-9_272.py ....FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-5, -4, -...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [-3, 2, -2, 4...
========================= 2 failed, 4 passed in 0.12s ==========================

49 : Job ID 81ca011f4df949eabbfec1282b03859d
test outcome: killed
mergesort.py, start pos: (24, 26), end pos: (24, 27)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -21,7 +21,7 @@
         l2 = deque(l2)
         while l1 and l2:
-            if l1[0] < l2[0]:
+            if l1[0] < l2[ 1]:
                 res.append(l1.popleft())
             else:
                 res.append(l2.popleft())
ts-3-5/test_3-5_0-9_272.py .FFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_sorted_list - IndexError: deque index...
FAILED ts-3-5/test_3-5_0-9_272.py::test_reverse_sorted_list - IndexError: deq...
FAILED ts-3-5/test_3-5_0-9_272.py::test_same_elements - IndexError: deque ind...
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - IndexError: deque...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - IndexError: deque in...
========================= 5 failed, 1 passed in 0.12s ==========================

50 : Job ID 3407f2c36ff34a0a907180a4d8a3444a
test outcome: killed
mergesort.py, start pos: (24, 26), end pos: (24, 27)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- amergesort.py
+++ bmergesort.py
@@ -21,7 +21,7 @@
         l2 = deque(l2)
         while l1 and l2:
-            if l1[0] < l2[0]:
+            if l1[0] < l2[ -1]:
                 res.append(l1.popleft())
             else:
                 res.append(l2.popleft())
ts-3-5/test_3-5_0-9_272.py ....FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_272.py::test_negative_elements - assert [-3, -5, -...
FAILED ts-3-5/test_3-5_0-9_272.py::test_mixed_elements - assert [-1, 3, 0, -2...
========================= 2 failed, 4 passed in 0.12s ==========================
