1 : Job ID 7f0bbbc4f5c84ffd88a025ad817b1ffd
SURVIVED
test outcome: survived
naive_tree.py, start pos: (13, 26), end pos: (13, 27)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -10,7 +10,7 @@
         Print a pre order traversal.
         """
         output = self.pre_order_traversal()
-        str_output =  '[' + ", ".join(map(str, output)) + ']'
+        str_output =  '[' - ", ".join(map(str, output)) + ']'
         return str_output
     def pre_order_traversal(self):
ts-3-5/test_3-5_0-6_200.py .                                             [100%]
============================== 1 passed in 0.15s ===============================

2 : Job ID cfa3322e5b4d49c1a6880b62ecb0f419
SURVIVED
test outcome: survived
naive_tree.py, start pos: (13, 56), end pos: (13, 57)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 1
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -10,7 +10,7 @@
         Print a pre order traversal.
         """
         output = self.pre_order_traversal()
-        str_output =  '[' + ", ".join(map(str, output)) + ']'
+        str_output =  '[' + ", ".join(map(str, output)) - ']'
         return str_output
     def pre_order_traversal(self):
ts-3-5/test_3-5_0-6_200.py .                                             [100%]
============================== 1 passed in 0.14s ===============================

3 : Job ID 46dc612e36034f739d38eee30f5e7334
SURVIVED
test outcome: survived
naive_tree.py, start pos: (13, 26), end pos: (13, 27)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -10,7 +10,7 @@
         Print a pre order traversal.
         """
         output = self.pre_order_traversal()
-        str_output =  '[' + ", ".join(map(str, output)) + ']'
+        str_output =  '[' * ", ".join(map(str, output)) + ']'
         return str_output
     def pre_order_traversal(self):
ts-3-5/test_3-5_0-6_200.py .                                             [100%]
============================== 1 passed in 0.15s ===============================

4 : Job ID ca98aa8794684c78a2542c695336f890
SURVIVED
test outcome: survived
naive_tree.py, start pos: (13, 56), end pos: (13, 57)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 1
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -10,7 +10,7 @@
         Print a pre order traversal.
         """
         output = self.pre_order_traversal()
-        str_output =  '[' + ", ".join(map(str, output)) + ']'
+        str_output =  '[' + ", ".join(map(str, output)) * ']'
         return str_output
     def pre_order_traversal(self):
ts-3-5/test_3-5_0-6_200.py .                                             [100%]
============================== 1 passed in 0.14s ===============================

5 : Job ID 5213c5c4cede4eceaa64bea76858e0c5
SURVIVED
test outcome: survived
naive_tree.py, start pos: (13, 26), end pos: (13, 27)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -10,7 +10,7 @@
         Print a pre order traversal.
         """
         output = self.pre_order_traversal()
-        str_output =  '[' + ", ".join(map(str, output)) + ']'
+        str_output =  '[' / ", ".join(map(str, output)) + ']'
         return str_output
     def pre_order_traversal(self):
ts-3-5/test_3-5_0-6_200.py .                                             [100%]
============================== 1 passed in 0.15s ===============================

6 : Job ID add6df608db7481e932837fbbd9e4103
SURVIVED
test outcome: survived
naive_tree.py, start pos: (13, 56), end pos: (13, 57)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 1
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -10,7 +10,7 @@
         Print a pre order traversal.
         """
         output = self.pre_order_traversal()
-        str_output =  '[' + ", ".join(map(str, output)) + ']'
+        str_output =  '[' + ", ".join(map(str, output)) / ']'
         return str_output
     def pre_order_traversal(self):
ts-3-5/test_3-5_0-6_200.py .                                             [100%]
============================== 1 passed in 0.14s ===============================

7 : Job ID 924e59abca2546dd919e2c6883b58553
SURVIVED
test outcome: survived
naive_tree.py, start pos: (13, 26), end pos: (13, 27)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -10,7 +10,7 @@
         Print a pre order traversal.
         """
         output = self.pre_order_traversal()
-        str_output =  '[' + ", ".join(map(str, output)) + ']'
+        str_output =  '[' // ", ".join(map(str, output)) + ']'
         return str_output
     def pre_order_traversal(self):
ts-3-5/test_3-5_0-6_200.py .                                             [100%]
============================== 1 passed in 0.14s ===============================

8 : Job ID c4b1abc278d84e74b1c9e2d2d3ddf94f
SURVIVED
test outcome: survived
naive_tree.py, start pos: (13, 56), end pos: (13, 57)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 1
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -10,7 +10,7 @@
         Print a pre order traversal.
         """
         output = self.pre_order_traversal()
-        str_output =  '[' + ", ".join(map(str, output)) + ']'
+        str_output =  '[' + ", ".join(map(str, output)) // ']'
         return str_output
     def pre_order_traversal(self):
ts-3-5/test_3-5_0-6_200.py .                                             [100%]
============================== 1 passed in 0.14s ===============================

9 : Job ID d5fae5177d8e470fa26d25e83b894cea
SURVIVED
test outcome: survived
naive_tree.py, start pos: (13, 26), end pos: (13, 27)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -10,7 +10,7 @@
         Print a pre order traversal.
         """
         output = self.pre_order_traversal()
-        str_output =  '[' + ", ".join(map(str, output)) + ']'
+        str_output =  '[' % ", ".join(map(str, output)) + ']'
         return str_output
     def pre_order_traversal(self):
ts-3-5/test_3-5_0-6_200.py .                                             [100%]
============================== 1 passed in 0.14s ===============================

10 : Job ID 9e3470b8043443e69b7d9de1d7211842
SURVIVED
test outcome: survived
naive_tree.py, start pos: (13, 56), end pos: (13, 57)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 1
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -10,7 +10,7 @@
         Print a pre order traversal.
         """
         output = self.pre_order_traversal()
-        str_output =  '[' + ", ".join(map(str, output)) + ']'
+        str_output =  '[' + ", ".join(map(str, output)) % ']'
         return str_output
     def pre_order_traversal(self):
ts-3-5/test_3-5_0-6_200.py .                                             [100%]
============================== 1 passed in 0.15s ===============================

11 : Job ID 0a6b0ced7419429fbb4808e395b36aca
SURVIVED
test outcome: survived
naive_tree.py, start pos: (13, 26), end pos: (13, 27)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -10,7 +10,7 @@
         Print a pre order traversal.
         """
         output = self.pre_order_traversal()
-        str_output =  '[' + ", ".join(map(str, output)) + ']'
+        str_output =  '[' ** ", ".join(map(str, output)) + ']'
         return str_output
     def pre_order_traversal(self):
ts-3-5/test_3-5_0-6_200.py .                                             [100%]
============================== 1 passed in 0.15s ===============================

12 : Job ID 771b74d0ba174f7d8af17d7021195b05
SURVIVED
test outcome: survived
naive_tree.py, start pos: (13, 56), end pos: (13, 57)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 1
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -10,7 +10,7 @@
         Print a pre order traversal.
         """
         output = self.pre_order_traversal()
-        str_output =  '[' + ", ".join(map(str, output)) + ']'
+        str_output =  '[' + ", ".join(map(str, output)) ** ']'
         return str_output
     def pre_order_traversal(self):
ts-3-5/test_3-5_0-6_200.py .                                             [100%]
============================== 1 passed in 0.14s ===============================

13 : Job ID e0aa6481c1a347ae83f5ea0d2f6e2f4d
SURVIVED
test outcome: survived
naive_tree.py, start pos: (13, 26), end pos: (13, 27)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -10,7 +10,7 @@
         Print a pre order traversal.
         """
         output = self.pre_order_traversal()
-        str_output =  '[' + ", ".join(map(str, output)) + ']'
+        str_output =  '[' >> ", ".join(map(str, output)) + ']'
         return str_output
     def pre_order_traversal(self):
ts-3-5/test_3-5_0-6_200.py .                                             [100%]
============================== 1 passed in 0.15s ===============================

14 : Job ID d750aec739784e6e86e9fb6cfbada1fd
SURVIVED
test outcome: survived
naive_tree.py, start pos: (13, 56), end pos: (13, 57)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 1
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -10,7 +10,7 @@
         Print a pre order traversal.
         """
         output = self.pre_order_traversal()
-        str_output =  '[' + ", ".join(map(str, output)) + ']'
+        str_output =  '[' + ", ".join(map(str, output)) >> ']'
         return str_output
     def pre_order_traversal(self):
ts-3-5/test_3-5_0-6_200.py .                                             [100%]
============================== 1 passed in 0.15s ===============================

15 : Job ID 830f683c91ec4ba39b904e0069495ac9
SURVIVED
test outcome: survived
naive_tree.py, start pos: (13, 26), end pos: (13, 27)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -10,7 +10,7 @@
         Print a pre order traversal.
         """
         output = self.pre_order_traversal()
-        str_output =  '[' + ", ".join(map(str, output)) + ']'
+        str_output =  '[' << ", ".join(map(str, output)) + ']'
         return str_output
     def pre_order_traversal(self):
ts-3-5/test_3-5_0-6_200.py .                                             [100%]
============================== 1 passed in 0.14s ===============================

16 : Job ID d93d262938474bad97a11b9075ecf27c
SURVIVED
test outcome: survived
naive_tree.py, start pos: (13, 56), end pos: (13, 57)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 1
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -10,7 +10,7 @@
         Print a pre order traversal.
         """
         output = self.pre_order_traversal()
-        str_output =  '[' + ", ".join(map(str, output)) + ']'
+        str_output =  '[' + ", ".join(map(str, output)) << ']'
         return str_output
     def pre_order_traversal(self):
ts-3-5/test_3-5_0-6_200.py .                                             [100%]
============================== 1 passed in 0.15s ===============================

17 : Job ID 06104675c7c34587a4ebbb3e3f132c94
SURVIVED
test outcome: survived
naive_tree.py, start pos: (13, 26), end pos: (13, 27)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -10,7 +10,7 @@
         Print a pre order traversal.
         """
         output = self.pre_order_traversal()
-        str_output =  '[' + ", ".join(map(str, output)) + ']'
+        str_output =  '[' | ", ".join(map(str, output)) + ']'
         return str_output
     def pre_order_traversal(self):
ts-3-5/test_3-5_0-6_200.py .                                             [100%]
============================== 1 passed in 0.14s ===============================

18 : Job ID 50013f4b738b4771acc94275628d7f4a
SURVIVED
test outcome: survived
naive_tree.py, start pos: (13, 56), end pos: (13, 57)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 1
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -10,7 +10,7 @@
         Print a pre order traversal.
         """
         output = self.pre_order_traversal()
-        str_output =  '[' + ", ".join(map(str, output)) + ']'
+        str_output =  '[' + ", ".join(map(str, output)) | ']'
         return str_output
     def pre_order_traversal(self):
ts-3-5/test_3-5_0-6_200.py .                                             [100%]
============================== 1 passed in 0.14s ===============================

19 : Job ID 9da61e81658f4a979ed52444f7f850a5
SURVIVED
test outcome: survived
naive_tree.py, start pos: (13, 26), end pos: (13, 27)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -10,7 +10,7 @@
         Print a pre order traversal.
         """
         output = self.pre_order_traversal()
-        str_output =  '[' + ", ".join(map(str, output)) + ']'
+        str_output =  '[' & ", ".join(map(str, output)) + ']'
         return str_output
     def pre_order_traversal(self):
ts-3-5/test_3-5_0-6_200.py .                                             [100%]
============================== 1 passed in 0.15s ===============================

20 : Job ID 7ee5411a2aa84497b201afd9a9431e93
SURVIVED
test outcome: survived
naive_tree.py, start pos: (13, 56), end pos: (13, 57)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 1
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -10,7 +10,7 @@
         Print a pre order traversal.
         """
         output = self.pre_order_traversal()
-        str_output =  '[' + ", ".join(map(str, output)) + ']'
+        str_output =  '[' + ", ".join(map(str, output)) & ']'
         return str_output
     def pre_order_traversal(self):
ts-3-5/test_3-5_0-6_200.py .                                             [100%]
============================== 1 passed in 0.15s ===============================

21 : Job ID cdd2cefa2d004b0586bfa4a2c129f186
SURVIVED
test outcome: survived
naive_tree.py, start pos: (13, 26), end pos: (13, 27)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -10,7 +10,7 @@
         Print a pre order traversal.
         """
         output = self.pre_order_traversal()
-        str_output =  '[' + ", ".join(map(str, output)) + ']'
+        str_output =  '[' ^ ", ".join(map(str, output)) + ']'
         return str_output
     def pre_order_traversal(self):
ts-3-5/test_3-5_0-6_200.py .                                             [100%]
============================== 1 passed in 0.14s ===============================

22 : Job ID 79d6d3de3472418f948a997cf120b39d
SURVIVED
test outcome: survived
naive_tree.py, start pos: (13, 56), end pos: (13, 57)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 1
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -10,7 +10,7 @@
         Print a pre order traversal.
         """
         output = self.pre_order_traversal()
-        str_output =  '[' + ", ".join(map(str, output)) + ']'
+        str_output =  '[' + ", ".join(map(str, output)) ^ ']'
         return str_output
     def pre_order_traversal(self):
ts-3-5/test_3-5_0-6_200.py .                                             [100%]
============================== 1 passed in 0.14s ===============================

26 : Job ID 78a266d22a494ca387e5253dc6cbbe1b
test outcome: killed
naive_tree.py, start pos: (50, 14), end pos: (50, 19)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -47,7 +47,7 @@
         output = []
         queue = deque([self.head])
-        while queue:
+        while not queue:
             output.extend(list(map(lambda n: n.value, list(queue))))
             next_level = deque()
             while queue:
ts-3-5/test_3-5_0-6_200.py F                                             [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_200.py::test_naive_binary_tree - assert [] == [1, ...
============================== 1 failed in 0.14s ===============================

27 : Job ID 103bba2f795a4208a4aa7bbf691f49d5
test outcome: killed
naive_tree.py, start pos: (53, 18), end pos: (53, 23)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -50,7 +50,7 @@
         while queue:
             output.extend(list(map(lambda n: n.value, list(queue))))
             next_level = deque()
-            while queue:
+            while not queue:
                 current = queue.popleft()
                 if current.left:
                     next_level.append(current.left)
ts-3-5/test_3-5_0-6_200.py F                                             [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_200.py::test_naive_binary_tree - assert [1] == [1,...
============================== 1 failed in 0.15s ===============================

28 : Job ID 2f0c669a7af44cc5b69480a165411aa8
test outcome: killed
naive_tree.py, start pos: (55, 19), end pos: (55, 31)
operator: core/AddNot, occurrence: 5
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -52,7 +52,7 @@
             next_level = deque()
             while queue:
                 current = queue.popleft()
-                if current.left:
+                if not current.left:
                     next_level.append(current.left)
                 if current.right:
                     next_level.append(current.right)
ts-3-5/test_3-5_0-6_200.py F                                             [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_200.py::test_naive_binary_tree - AttributeError: '...
============================== 1 failed in 0.14s ===============================

29 : Job ID a107ae02b8e244579f70392c6b43c61c
test outcome: killed
naive_tree.py, start pos: (57, 19), end pos: (57, 32)
operator: core/AddNot, occurrence: 6
--- mutation diff ---
--- anaive_tree.py
+++ bnaive_tree.py
@@ -54,7 +54,7 @@
                 current = queue.popleft()
                 if current.left:
                     next_level.append(current.left)
-                if current.right:
+                if not current.right:
                     next_level.append(current.right)
             queue = next_level
         return output
ts-3-5/test_3-5_0-6_200.py F                                             [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-6_200.py::test_naive_binary_tree - AttributeError: '...
============================== 1 failed in 0.15s ===============================
