   - [#   1] AOR naive_tree: 
--------------------------------------------------------------------------------
   9:         '''
  10:         Print a pre order traversal.
  11:         '''
  12:         output = self.pre_order_traversal()
- 13:         str_output = ('[' + ', '.join(map(str, output))) + ']'
+ 13:         str_output = ('[' - ', '.join(map(str, output))) + ']'
  14:         return str_output
  15:     
  16:     def pre_order_traversal(self):
  17:         output = []
--------------------------------------------------------------------------------
[0.17825 s] survived

   - [#   2] AOR naive_tree: 
--------------------------------------------------------------------------------
   9:         '''
  10:         Print a pre order traversal.
  11:         '''
  12:         output = self.pre_order_traversal()
- 13:         str_output = ('[' + ', '.join(map(str, output))) + ']'
+ 13:         str_output = ('[' + ', '.join(map(str, output))) - ']'
  14:         return str_output
  15:     
  16:     def pre_order_traversal(self):
  17:         output = []
--------------------------------------------------------------------------------
[0.19144 s] survived

   - [#   3] CDI naive_tree: 
--------------------------------------------------------------------------------
   1: from collections import deque
   2: 
   3: class NaiveBinaryTree:
   4:     
-  5:     def __init__(self):
-  6:         self.head = None
-  7:     
+  5:     @classmethod
+  6:     def __init__(self):
+  7:         self.head = None
   8:     def __str__(self):
   9:         '''
  10:         Print a pre order traversal.
  11:         '''
--------------------------------------------------------------------------------
[0.17908 s] survived

   - [#   4] CDI naive_tree: 
--------------------------------------------------------------------------------
   4:     
   5:     def __init__(self):
   6:         self.head = None
   7:     
-  8:     def __str__(self):
-  9:         '''
- 10:         Print a pre order traversal.
- 11:         '''
- 12:         output = self.pre_order_traversal()
- 13:         str_output = ('[' + ', '.join(map(str, output))) + ']'
- 14:         return str_output
- 15:     
+  8:     @classmethod
+  9:     def __str__(self):
+ 10:         '''
+ 11:         Print a pre order traversal.
+ 12:         '''
+ 13:         output = self.pre_order_traversal()
+ 14:         str_output = ('[' + ', '.join(map(str, output))) + ']'
+ 15:         return str_output
  16:     def pre_order_traversal(self):
  17:         output = []
  18:         def recur(node):
  19:             if node:
--------------------------------------------------------------------------------
[0.18429 s] survived

   - [#   5] CDI naive_tree: 
--------------------------------------------------------------------------------
  12:         output = self.pre_order_traversal()
  13:         str_output = ('[' + ', '.join(map(str, output))) + ']'
  14:         return str_output
  15:     
- 16:     def pre_order_traversal(self):
- 17:         output = []
- 18:         def recur(node):
- 19:             if node:
- 20:                 output.append(node.value)
- 21:                 recur(node.left)
- 22:                 recur(node.right)
- 23:         recur(self.head)
- 24:         return output
- 25:     
+ 16:     @classmethod
+ 17:     def pre_order_traversal(self):
+ 18:         output = []
+ 19:         def recur(node):
+ 20:             if node:
+ 21:                 output.append(node.value)
+ 22:                 recur(node.left)
+ 23:                 recur(node.right)
+ 24:         recur(self.head)
+ 25:         return output
  26:     def in_order_traversal(self):
  27:         output = []
  28:         def recur(node):
  29:             if node:
--------------------------------------------------------------------------------
[0.19879 s] killed by ts-3-5/test_3-5_0-9_293.py::test_pre_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b611636edd0>

    def test_pre_order_traversal(sample_tree):
        expected_output = [1, 2, 4, 5, 3, 6, 7]
>       assert sample_tree.pre_order_traversal() == expected_output

ts-3-5/test_3-5_0-9_293.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'naive_tree.NaiveBinaryTree'>

>   ???

   - [#   6] CDI naive_tree: 
--------------------------------------------------------------------------------
  22:                 recur(node.right)
  23:         recur(self.head)
  24:         return output
  25:     
- 26:     def in_order_traversal(self):
- 27:         output = []
- 28:         def recur(node):
- 29:             if node:
- 30:                 recur(node.left)
- 31:                 output.append(node.value)
- 32:                 recur(node.right)
- 33:         recur(self.head)
- 34:         return output
- 35:     
+ 26:     @classmethod
+ 27:     def in_order_traversal(self):
+ 28:         output = []
+ 29:         def recur(node):
+ 30:             if node:
+ 31:                 recur(node.left)
+ 32:                 output.append(node.value)
+ 33:                 recur(node.right)
+ 34:         recur(self.head)
+ 35:         return output
  36:     def post_order_traversal(self):
  37:         output = []
  38:         def recur(node):
  39:             if node:
--------------------------------------------------------------------------------
[0.20431 s] killed by ts-3-5/test_3-5_0-9_293.py::test_in_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b6116340370>

    def test_in_order_traversal(sample_tree):
        expected_output = [4, 2, 5, 1, 6, 3, 7]
>       assert sample_tree.in_order_traversal() == expected_output

ts-3-5/test_3-5_0-9_293.py:36: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'naive_tree.NaiveBinaryTree'>

>   ???

   - [#   7] CDI naive_tree: 
--------------------------------------------------------------------------------
  32:                 recur(node.right)
  33:         recur(self.head)
  34:         return output
  35:     
- 36:     def post_order_traversal(self):
- 37:         output = []
- 38:         def recur(node):
- 39:             if node:
- 40:                 recur(node.left)
- 41:                 recur(node.right)
- 42:                 output.append(node.value)
- 43:         recur(self.head)
- 44:         return output
- 45:     
+ 36:     @classmethod
+ 37:     def post_order_traversal(self):
+ 38:         output = []
+ 39:         def recur(node):
+ 40:             if node:
+ 41:                 recur(node.left)
+ 42:                 recur(node.right)
+ 43:                 output.append(node.value)
+ 44:         recur(self.head)
+ 45:         return output
  46:     def level_order_traversal(self):
  47:         output = []
  48:         queue = deque([self.head])
  49:         
--------------------------------------------------------------------------------
[0.20610 s] killed by ts-3-5/test_3-5_0-9_293.py::test_post_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b61163f5c00>

    def test_post_order_traversal(sample_tree):
        expected_output = [4, 5, 2, 6, 7, 3, 1]
>       assert sample_tree.post_order_traversal() == expected_output

ts-3-5/test_3-5_0-9_293.py:40: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'naive_tree.NaiveBinaryTree'>

>   ???

   - [#   8] CDI naive_tree: 
--------------------------------------------------------------------------------
  42:                 output.append(node.value)
  43:         recur(self.head)
  44:         return output
  45:     
- 46:     def level_order_traversal(self):
- 47:         output = []
- 48:         queue = deque([self.head])
- 49:         
- 50:         while queue:
- 51:             output.extend(list(map((lambda n: (n.value)), list(queue))))
- 52:             next_level = deque()
- 53:             while queue:
- 54:                 current = queue.popleft()
- 55:                 if current.left:
- 56:                     next_level.append(current.left)
- 57:                 if current.right:
- 58:                     next_level.append(current.right)
- 59:             queue = next_level
- 60:         return output
+ 46:     @classmethod
+ 47:     def level_order_traversal(self):
+ 48:         output = []
+ 49:         queue = deque([self.head])
+ 50:         
+ 51:         while queue:
+ 52:             output.extend(list(map((lambda n: (n.value)), list(queue))))
+ 53:             next_level = deque()
+ 54:             while queue:
+ 55:                 current = queue.popleft()
+ 56:                 if current.left:
+ 57:                     next_level.append(current.left)
+ 58:                 if current.right:
+ 59:                     next_level.append(current.right)
+ 60:             queue = next_level
+ 61:         return output
--------------------------------------------------------------------------------
[0.20764 s] killed by ts-3-5/test_3-5_0-9_293.py::test_level_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b6116341390>

    def test_level_order_traversal(sample_tree):
        expected_output = [1, 2, 3, 4, 5, 6, 7]
>

   - [#  14] COI naive_tree: 
--------------------------------------------------------------------------------
  51:             output.extend(list(map((lambda n: (n.value)), list(queue))))
  52:             next_level = deque()
  53:             while queue:
  54:                 current = queue.popleft()
- 55:                 if current.left:
+ 55:                 if not (current.left):
  56:                     next_level.append(current.left)
  57:                 if current.right:
  58:                     next_level.append(current.right)
  59:             queue = next_level
--------------------------------------------------------------------------------
[0.20564 s] killed by ts-3-5/test_3-5_0-9_293.py::test_level_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b61165241f0>

    def test_level_order_traversal(sample_tree):
        expected_output = [1, 2, 3, 4, 5, 6, 7]
>       assert sample_tree.level_order_traversal() == expected_output

ts-3-5/test_3-5_0-9_293.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
naive_tree:51: in level_order_traversal
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

n = None

>   ???
E   AttributeError: 'NoneType' object has no attribute 'value'

naive_tree:51: AttributeError

   - [#  15] COI naive_tree: 
--------------------------------------------------------------------------------
  53:             while queue:
  54:                 current = queue.popleft()
  55:                 if current.left:
  56:                     next_level.append(current.left)
- 57:                 if current.right:
+ 57:                 if not (current.right):
  58:                     next_level.append(current.right)
  59:             queue = next_level
  60:         return output
--------------------------------------------------------------------------------
[0.20726 s] killed by ts-3-5/test_3-5_0-9_293.py::test_level_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b6115f40fd0>

    def test_level_order_traversal(sample_tree):
        expected_output = [1, 2, 3, 4, 5, 6, 7]
>       assert sample_tree.level_order_traversal() == expected_output

ts-3-5/test_3-5_0-9_293.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
naive_tree:51: in level_order_traversal
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

n = None

>   ???
E   AttributeError: 'NoneType' object has no attribute 'value'

naive_tree:51: AttributeError

   - [#  16] OIL naive_tree: 
--------------------------------------------------------------------------------
  56:                     next_level.append(current.left)
  57:                 if current.right:
  58:                     next_level.append(current.right)
  59:             queue = next_level
- 60:         return output
+ 60:             break
+ 61:         return output
--------------------------------------------------------------------------------
[0.20582 s] killed by ts-3-5/test_3-5_0-9_293.py::test_level_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b61162a1000>

    def test_level_order_traversal(sample_tree):
        expected_output = [1, 2, 3, 4, 5, 6, 7]
>       assert sample_tree.level_order_traversal() == expected_output
E       AssertionError

ts-3-5/test_3-5_0-9_293.py:44: AssertionError

   - [#  17] OIL naive_tree: 
--------------------------------------------------------------------------------
  55:                 if current.left:
  56:                     next_level.append(current.left)
  57:                 if current.right:
  58:                     next_level.append(current.right)
- 59:             queue = next_level
- 60:         return output
+ 59:                 break
+ 60:             queue = next_level
+ 61:         return output
--------------------------------------------------------------------------------
[0.18912 s] killed by ts-3-5/test_3-5_0-9_293.py::test_level_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b6115fc5030>

    def test_level_order_traversal(sample_tree):
        expected_output = [1, 2, 3, 4, 5, 6, 7]
>       assert sample_tree.level_order_traversal() == expected_output
E       AssertionError

ts-3-5/test_3-5_0-9_293.py:44: AssertionError

   - [#  19] SDI naive_tree: 
--------------------------------------------------------------------------------
   4:     
   5:     def __init__(self):
   6:         self.head = None
   7:     
-  8:     def __str__(self):
-  9:         '''
- 10:         Print a pre order traversal.
- 11:         '''
- 12:         output = self.pre_order_traversal()
- 13:         str_output = ('[' + ', '.join(map(str, output))) + ']'
- 14:         return str_output
- 15:     
+  8:     @staticmethod
+  9:     def __str__(self):
+ 10:         '''
+ 11:         Print a pre order traversal.
+ 12:         '''
+ 13:         output = self.pre_order_traversal()
+ 14:         str_output = ('[' + ', '.join(map(str, output))) + ']'
+ 15:         return str_output
  16:     def pre_order_traversal(self):
  17:         output = []
  18:         def recur(node):
  19:             if node:
--------------------------------------------------------------------------------
[0.18066 s] survived

   - [#  25] SDL naive_tree: 
--------------------------------------------------------------------------------
   8:     def __str__(self):
   9:         '''
  10:         Print a pre order traversal.
  11:         '''
- 12:         output = self.pre_order_traversal()
+ 12:         pass
  13:         str_output = ('[' + ', '.join(map(str, output))) + ']'
  14:         return str_output
  15:     
  16:     def pre_order_traversal(self):
--------------------------------------------------------------------------------
[0.17916 s] survived

   - [#  26] SDL naive_tree: 
--------------------------------------------------------------------------------
   9:         '''
  10:         Print a pre order traversal.
  11:         '''
  12:         output = self.pre_order_traversal()
- 13:         str_output = ('[' + ', '.join(map(str, output))) + ']'
+ 13:         pass
  14:         return str_output
  15:     
  16:     def pre_order_traversal(self):
  17:         output = []
--------------------------------------------------------------------------------
[0.17811 s] survived

   - [#  27] SDL naive_tree: 
--------------------------------------------------------------------------------
  10:         Print a pre order traversal.
  11:         '''
  12:         output = self.pre_order_traversal()
  13:         str_output = ('[' + ', '.join(map(str, output))) + ']'
- 14:         return str_output
+ 14:         pass
  15:     
  16:     def pre_order_traversal(self):
  17:         output = []
  18:         def recur(node):
--------------------------------------------------------------------------------
[0.17942 s] survived

   - [#  28] SDL naive_tree: 
--------------------------------------------------------------------------------
  13:         str_output = ('[' + ', '.join(map(str, output))) + ']'
  14:         return str_output
  15:     
  16:     def pre_order_traversal(self):
- 17:         output = []
+ 17:         pass
  18:         def recur(node):
  19:             if node:
  20:                 output.append(node.value)
  21:                 recur(node.left)
--------------------------------------------------------------------------------
[0.20261 s] killed by ts-3-5/test_3-5_0-9_293.py::test_pre_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b6116081030>

    def test_pre_order_traversal(sample_tree):
        expected_output = [1, 2, 4, 5, 3, 6, 7]
>       assert sample_tree.pre_order_traversal() == expected_output

ts-3-5/test_3-5_0-9_293.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
naive_tree:23: in pre_order_traversal
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

node = <test_3-5_0-9_293.sample_tree.<locals>.Node object at 0x7b6116080160>

>   ???
E   NameError: name 'output' is not defined

naive_tree:20: NameError

   - [#  29] SDL naive_tree: 
--------------------------------------------------------------------------------
  16:     def pre_order_traversal(self):
  17:         output = []
  18:         def recur(node):
  19:             if node:
- 20:                 output.append(node.value)
+ 20:                 pass
  21:                 recur(node.left)
  22:                 recur(node.right)
  23:         recur(self.head)
  24:         return output
--------------------------------------------------------------------------------
[0.20470 s] killed by ts-3-5/test_3-5_0-9_293.py::test_pre_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b61160afb20>

    def test_pre_order_traversal(sample_tree):
        expected_output = [1, 2, 4, 5, 3, 6, 7]
>       assert sample_tree.pre_order_traversal() == expected_output
E       AssertionError

ts-3-5/test_3-5_0-9_293.py:32: AssertionError

   - [#  30] SDL naive_tree: 
--------------------------------------------------------------------------------
  17:         output = []
  18:         def recur(node):
  19:             if node:
  20:                 output.append(node.value)
- 21:                 recur(node.left)
+ 21:                 pass
  22:                 recur(node.right)
  23:         recur(self.head)
  24:         return output
  25:     
--------------------------------------------------------------------------------
[0.20424 s] killed by ts-3-5/test_3-5_0-9_293.py::test_pre_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b61160bd5d0>

    def test_pre_order_traversal(sample_tree):
        expected_output = [1, 2, 4, 5, 3, 6, 7]
>       assert sample_tree.pre_order_traversal() == expected_output
E       AssertionError

ts-3-5/test_3-5_0-9_293.py:32: AssertionError

   - [#  31] SDL naive_tree: 
--------------------------------------------------------------------------------
  18:         def recur(node):
  19:             if node:
  20:                 output.append(node.value)
  21:                 recur(node.left)
- 22:                 recur(node.right)
+ 22:                 pass
  23:         recur(self.head)
  24:         return output
  25:     
  26:     def in_order_traversal(self):
--------------------------------------------------------------------------------
[0.20090 s] killed by ts-3-5/test_3-5_0-9_293.py::test_pre_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b6116069150>

    def test_pre_order_traversal(sample_tree):
        expected_output = [1, 2, 4, 5, 3, 6, 7]
>       assert sample_tree.pre_order_traversal() == expected_output
E       AssertionError

ts-3-5/test_3-5_0-9_293.py:32: AssertionError

   - [#  32] SDL naive_tree: 
--------------------------------------------------------------------------------
  19:             if node:
  20:                 output.append(node.value)
  21:                 recur(node.left)
  22:                 recur(node.right)
- 23:         recur(self.head)
+ 23:         pass
  24:         return output
  25:     
  26:     def in_order_traversal(self):
  27:         output = []
--------------------------------------------------------------------------------
[0.20848 s] killed by ts-3-5/test_3-5_0-9_293.py::test_pre_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b61162a3fd0>

    def test_pre_order_traversal(sample_tree):
        expected_output = [1, 2, 4, 5, 3, 6, 7]
>       assert sample_tree.pre_order_traversal() == expected_output
E       AssertionError

ts-3-5/test_3-5_0-9_293.py:32: AssertionError

   - [#  33] SDL naive_tree: 
--------------------------------------------------------------------------------
  20:                 output.append(node.value)
  21:                 recur(node.left)
  22:                 recur(node.right)
  23:         recur(self.head)
- 24:         return output
+ 24:         pass
  25:     
  26:     def in_order_traversal(self):
  27:         output = []
  28:         def recur(node):
--------------------------------------------------------------------------------
[0.19633 s] killed by ts-3-5/test_3-5_0-9_293.py::test_pre_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b61162a0c40>

    def test_pre_order_traversal(sample_tree):
        expected_output = [1, 2, 4, 5, 3, 6, 7]
>       assert sample_tree.pre_order_traversal() == expected_output
E       AssertionError

ts-3-5/test_3-5_0-9_293.py:32: AssertionError

   - [#  34] SDL naive_tree: 
--------------------------------------------------------------------------------
  23:         recur(self.head)
  24:         return output
  25:     
  26:     def in_order_traversal(self):
- 27:         output = []
+ 27:         pass
  28:         def recur(node):
  29:             if node:
  30:                 recur(node.left)
  31:                 output.append(node.value)
--------------------------------------------------------------------------------
[0.20352 s] killed by ts-3-5/test_3-5_0-9_293.py::test_in_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b61160bf7c0>

    def test_in_order_traversal(sample_tree):
        expected_output = [4, 2, 5, 1, 6, 3, 7]
>       assert sample_tree.in_order_traversal() == expected_output

ts-3-5/test_3-5_0-9_293.py:36: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
naive_tree:33: in in_order_traversal
    ???
naive_tree:30: in recur
    ???
naive_tree:30: in recur
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

node = <test_3-5_0-9_293.sample_tree.<locals>.Node object at 0x7b61160bfbe0>

>   ???
E   NameError: name 'output' is not defined

naive_tree:31: NameError

   - [#  35] SDL naive_tree: 
--------------------------------------------------------------------------------
  26:     def in_order_traversal(self):
  27:         output = []
  28:         def recur(node):
  29:             if node:
- 30:                 recur(node.left)
+ 30:                 pass
  31:                 output.append(node.value)
  32:                 recur(node.right)
  33:         recur(self.head)
  34:         return output
--------------------------------------------------------------------------------
[0.22409 s] killed by ts-3-5/test_3-5_0-9_293.py::test_in_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b61162f9510>

    def test_in_order_traversal(sample_tree):
        expected_output = [4, 2, 5, 1, 6, 3, 7]
>       assert sample_tree.in_order_traversal() == expected_output
E       AssertionError

ts-3-5/test_3-5_0-9_293.py:36: AssertionError

   - [#  36] SDL naive_tree: 
--------------------------------------------------------------------------------
  27:         output = []
  28:         def recur(node):
  29:             if node:
  30:                 recur(node.left)
- 31:                 output.append(node.value)
+ 31:                 pass
  32:                 recur(node.right)
  33:         recur(self.head)
  34:         return output
  35:     
--------------------------------------------------------------------------------
[0.20663 s] killed by ts-3-5/test_3-5_0-9_293.py::test_in_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b6115f57310>

    def test_in_order_traversal(sample_tree):
        expected_output = [4, 2, 5, 1, 6, 3, 7]
>       assert sample_tree.in_order_traversal() == expected_output
E       AssertionError

ts-3-5/test_3-5_0-9_293.py:36: AssertionError

   - [#  37] SDL naive_tree: 
--------------------------------------------------------------------------------
  28:         def recur(node):
  29:             if node:
  30:                 recur(node.left)
  31:                 output.append(node.value)
- 32:                 recur(node.right)
+ 32:                 pass
  33:         recur(self.head)
  34:         return output
  35:     
  36:     def post_order_traversal(self):
--------------------------------------------------------------------------------
[0.20543 s] killed by ts-3-5/test_3-5_0-9_293.py::test_in_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b61162f5870>

    def test_in_order_traversal(sample_tree):
        expected_output = [4, 2, 5, 1, 6, 3, 7]
>       assert sample_tree.in_order_traversal() == expected_output
E       AssertionError

ts-3-5/test_3-5_0-9_293.py:36: AssertionError

   - [#  40] SDL naive_tree: 
--------------------------------------------------------------------------------
  33:         recur(self.head)
  34:         return output
  35:     
  36:     def post_order_traversal(self):
- 37:         output = []
+ 37:         pass
  38:         def recur(node):
  39:             if node:
  40:                 recur(node.left)
  41:                 recur(node.right)
--------------------------------------------------------------------------------
[0.20639 s] killed by ts-3-5/test_3-5_0-9_293.py::test_post_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b61160a4430>

    def test_post_order_traversal(sample_tree):
        expected_output = [4, 5, 2, 6, 7, 3, 1]
>       assert sample_tree.post_order_traversal() == expected_output

ts-3-5/test_3-5_0-9_293.py:40: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
naive_tree:43: in post_order_traversal
    ???
naive_tree:40: in recur
    ???
naive_tree:40: in recur
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

node = <test_3-5_0-9_293.sample_tree.<locals>.Node object at 0x7b61160a7c10>

>   ???
E   NameError: name 'output' is not defined

naive_tree:42: NameError

   - [#  43] SDL naive_tree: 
--------------------------------------------------------------------------------
  38:         def recur(node):
  39:             if node:
  40:                 recur(node.left)
  41:                 recur(node.right)
- 42:                 output.append(node.value)
+ 42:                 pass
  43:         recur(self.head)
  44:         return output
  45:     
  46:     def level_order_traversal(self):
--------------------------------------------------------------------------------
[0.20812 s] killed by ts-3-5/test_3-5_0-9_293.py::test_post_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b61163b0730>

    def test_post_order_traversal(sample_tree):
        expected_output = [4, 5, 2, 6, 7, 3, 1]
>       assert sample_tree.post_order_traversal() == expected_output
E       AssertionError

ts-3-5/test_3-5_0-9_293.py:40: AssertionError

   - [#  44] SDL naive_tree: 
--------------------------------------------------------------------------------
  39:             if node:
  40:                 recur(node.left)
  41:                 recur(node.right)
  42:                 output.append(node.value)
- 43:         recur(self.head)
+ 43:         pass
  44:         return output
  45:     
  46:     def level_order_traversal(self):
  47:         output = []
--------------------------------------------------------------------------------
[0.20590 s] killed by ts-3-5/test_3-5_0-9_293.py::test_post_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b61163f4a30>

    def test_post_order_traversal(sample_tree):
        expected_output = [4, 5, 2, 6, 7, 3, 1]
>       assert sample_tree.post_order_traversal() == expected_output
E       AssertionError

ts-3-5/test_3-5_0-9_293.py:40: AssertionError

   - [#  46] SDL naive_tree: 
--------------------------------------------------------------------------------
  43:         recur(self.head)
  44:         return output
  45:     
  46:     def level_order_traversal(self):
- 47:         output = []
+ 47:         pass
  48:         queue = deque([self.head])
  49:         
  50:         while queue:
  51:             output.extend(list(map((lambda n: (n.value)), list(queue))))
--------------------------------------------------------------------------------
[0.20484 s] killed by ts-3-5/test_3-5_0-9_293.py::test_level_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b6115fe7eb0>

    def test_level_order_traversal(sample_tree):
        expected_output = [1, 2, 3, 4, 5, 6, 7]
>       assert sample_tree.level_order_traversal() == expected_output

ts-3-5/test_3-5_0-9_293.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <naive_tree.NaiveBinaryTree object at 0x7b6115fe7eb0>

>   ???
E   NameError: name 'output' is not defined

naive_tree:51: NameError
