   - [#  47] SDL naive_tree: 
--------------------------------------------------------------------------------
  44:         return output
  45:     
  46:     def level_order_traversal(self):
  47:         output = []
- 48:         queue = deque([self.head])
+ 48:         pass
  49:         
  50:         while queue:
  51:             output.extend(list(map((lambda n: (n.value)), list(queue))))
  52:             next_level = deque()
--------------------------------------------------------------------------------
[0.21176 s] killed by ts-3-5/test_3-5_0-9_293.py::test_level_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b611636ea10>

    def test_level_order_traversal(sample_tree):
        expected_output = [1, 2, 3, 4, 5, 6, 7]
>       assert sample_tree.level_order_traversal() == expected_output

ts-3-5/test_3-5_0-9_293.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <naive_tree.NaiveBinaryTree object at 0x7b611636ea10>

>   ???
E   UnboundLocalError: local variable 'queue' referenced before assignment

naive_tree:50: UnboundLocalError

   - [#  48] SDL naive_tree: 
--------------------------------------------------------------------------------
  47:         output = []
  48:         queue = deque([self.head])
  49:         
  50:         while queue:
- 51:             output.extend(list(map((lambda n: (n.value)), list(queue))))
+ 51:             pass
  52:             next_level = deque()
  53:             while queue:
  54:                 current = queue.popleft()
  55:                 if current.left:
--------------------------------------------------------------------------------
[0.19909 s] killed by ts-3-5/test_3-5_0-9_293.py::test_level_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b61161149a0>

    def test_level_order_traversal(sample_tree):
        expected_output = [1, 2, 3, 4, 5, 6, 7]
>       assert sample_tree.level_order_traversal() == expected_output
E       AssertionError

ts-3-5/test_3-5_0-9_293.py:44: AssertionError

   - [#  49] SDL naive_tree: 
--------------------------------------------------------------------------------
  48:         queue = deque([self.head])
  49:         
  50:         while queue:
  51:             output.extend(list(map((lambda n: (n.value)), list(queue))))
- 52:             next_level = deque()
+ 52:             pass
  53:             while queue:
  54:                 current = queue.popleft()
  55:                 if current.left:
  56:                     next_level.append(current.left)
--------------------------------------------------------------------------------
[0.22196 s] killed by ts-3-5/test_3-5_0-9_293.py::test_level_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b611636f400>

    def test_level_order_traversal(sample_tree):
        expected_output = [1, 2, 3, 4, 5, 6, 7]
>       assert sample_tree.level_order_traversal() == expected_output

ts-3-5/test_3-5_0-9_293.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <naive_tree.NaiveBinaryTree object at 0x7b611636f400>

>   ???
E   NameError: name 'next_level' is not defined

naive_tree:56: NameError

   - [#  50] SDL naive_tree: 
--------------------------------------------------------------------------------
  50:         while queue:
  51:             output.extend(list(map((lambda n: (n.value)), list(queue))))
  52:             next_level = deque()
  53:             while queue:
- 54:                 current = queue.popleft()
+ 54:                 pass
  55:                 if current.left:
  56:                     next_level.append(current.left)
  57:                 if current.right:
  58:                     next_level.append(current.right)
--------------------------------------------------------------------------------
[0.20324 s] killed by ts-3-5/test_3-5_0-9_293.py::test_level_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b61160bd120>

    def test_level_order_traversal(sample_tree):
        expected_output = [1, 2, 3, 4, 5, 6, 7]
>       assert sample_tree.level_order_traversal() == expected_output

ts-3-5/test_3-5_0-9_293.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <naive_tree.NaiveBinaryTree object at 0x7b61160bd120>

>   ???
E   NameError: name 'current' is not defined

naive_tree:55: NameError

   - [#  51] SDL naive_tree: 
--------------------------------------------------------------------------------
  52:             next_level = deque()
  53:             while queue:
  54:                 current = queue.popleft()
  55:                 if current.left:
- 56:                     next_level.append(current.left)
+ 56:                     pass
  57:                 if current.right:
  58:                     next_level.append(current.right)
  59:             queue = next_level
  60:         return output
--------------------------------------------------------------------------------
[0.20466 s] killed by ts-3-5/test_3-5_0-9_293.py::test_level_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b6115fe4bb0>

    def test_level_order_traversal(sample_tree):
        expected_output = [1, 2, 3, 4, 5, 6, 7]
>       assert sample_tree.level_order_traversal() == expected_output
E       AssertionError

ts-3-5/test_3-5_0-9_293.py:44: AssertionError

   - [#  52] SDL naive_tree: 
--------------------------------------------------------------------------------
  54:                 current = queue.popleft()
  55:                 if current.left:
  56:                     next_level.append(current.left)
  57:                 if current.right:
- 58:                     next_level.append(current.right)
+ 58:                     pass
  59:             queue = next_level
  60:         return output
--------------------------------------------------------------------------------
[0.20884 s] killed by ts-3-5/test_3-5_0-9_293.py::test_level_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b61162a0310>

    def test_level_order_traversal(sample_tree):
        expected_output = [1, 2, 3, 4, 5, 6, 7]
>       assert sample_tree.level_order_traversal() == expected_output
E       AssertionError

ts-3-5/test_3-5_0-9_293.py:44: AssertionError

   - [#  53] SDL naive_tree: 
--------------------------------------------------------------------------------
  55:                 if current.left:
  56:                     next_level.append(current.left)
  57:                 if current.right:
  58:                     next_level.append(current.right)
- 59:             queue = next_level
+ 59:             pass
  60:         return output
--------------------------------------------------------------------------------
[0.20363 s] killed by ts-3-5/test_3-5_0-9_293.py::test_level_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b6115fe4bb0>

    def test_level_order_traversal(sample_tree):
        expected_output = [1, 2, 3, 4, 5, 6, 7]
>       assert sample_tree.level_order_traversal() == expected_output
E       AssertionError

ts-3-5/test_3-5_0-9_293.py:44: AssertionError

   - [#  54] SDL naive_tree: 
--------------------------------------------------------------------------------
  56:                     next_level.append(current.left)
  57:                 if current.right:
  58:                     next_level.append(current.right)
  59:             queue = next_level
- 60:         return output
+ 60:         pass
--------------------------------------------------------------------------------
[0.22242 s] killed by ts-3-5/test_3-5_0-9_293.py::test_level_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b61165255a0>

    def test_level_order_traversal(sample_tree):
        expected_output = [1, 2, 3, 4, 5, 6, 7]
>       assert sample_tree.level_order_traversal() == expected_output
E       AssertionError

ts-3-5/test_3-5_0-9_293.py:44: AssertionError

   - [#  56] SVD naive_tree: 
--------------------------------------------------------------------------------
   8:     def __str__(self):
   9:         '''
  10:         Print a pre order traversal.
  11:         '''
- 12:         output = self.pre_order_traversal()
+ 12:         output = pre_order_traversal()
  13:         str_output = ('[' + ', '.join(map(str, output))) + ']'
  14:         return str_output
  15:     
  16:     def pre_order_traversal(self):
--------------------------------------------------------------------------------
[0.18082 s] survived

   - [#  57] SVD naive_tree: 
--------------------------------------------------------------------------------
  19:             if node:
  20:                 output.append(node.value)
  21:                 recur(node.left)
  22:                 recur(node.right)
- 23:         recur(self.head)
+ 23:         recur(head)
  24:         return output
  25:     
  26:     def in_order_traversal(self):
  27:         output = []
--------------------------------------------------------------------------------
[0.20843 s] killed by ts-3-5/test_3-5_0-9_293.py::test_pre_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b6116281930>

    def test_pre_order_traversal(sample_tree):
        expected_output = [1, 2, 4, 5, 3, 6, 7]
>       assert sample_tree.pre_order_traversal() == expected_output

ts-3-5/test_3-5_0-9_293.py:32: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <naive_tree.NaiveBinaryTree object at 0x7b6116281930>

>   ???
E   NameError: name 'head' is not defined

naive_tree:23: NameError

   - [#  59] SVD naive_tree: 
--------------------------------------------------------------------------------
  39:             if node:
  40:                 recur(node.left)
  41:                 recur(node.right)
  42:                 output.append(node.value)
- 43:         recur(self.head)
+ 43:         recur(head)
  44:         return output
  45:     
  46:     def level_order_traversal(self):
  47:         output = []
--------------------------------------------------------------------------------
[0.20588 s] killed by ts-3-5/test_3-5_0-9_293.py::test_post_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b6115fe7e20>

    def test_post_order_traversal(sample_tree):
        expected_output = [4, 5, 2, 6, 7, 3, 1]
>       assert sample_tree.post_order_traversal() == expected_output

ts-3-5/test_3-5_0-9_293.py:40: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <naive_tree.NaiveBinaryTree object at 0x7b6115fe7e20>

>   ???
E   NameError: name 'head' is not defined

naive_tree:43: NameError

   - [#  60] SVD naive_tree: 
--------------------------------------------------------------------------------
  44:         return output
  45:     
  46:     def level_order_traversal(self):
  47:         output = []
- 48:         queue = deque([self.head])
+ 48:         queue = deque([head])
  49:         
  50:         while queue:
  51:             output.extend(list(map((lambda n: (n.value)), list(queue))))
  52:             next_level = deque()
--------------------------------------------------------------------------------
[0.20493 s] killed by ts-3-5/test_3-5_0-9_293.py::test_level_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b61160bd870>

    def test_level_order_traversal(sample_tree):
        expected_output = [1, 2, 3, 4, 5, 6, 7]
>       assert sample_tree.level_order_traversal() == expected_output

ts-3-5/test_3-5_0-9_293.py:44: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <naive_tree.NaiveBinaryTree object at 0x7b61160bd870>

>   ???
E   NameError: name 'head' is not defined

naive_tree:48: NameError

   - [#  61] ZIL naive_tree: 
--------------------------------------------------------------------------------
  47:         output = []
  48:         queue = deque([self.head])
  49:         
  50:         while queue:
- 51:             output.extend(list(map((lambda n: (n.value)), list(queue))))
- 52:             next_level = deque()
- 53:             while queue:
- 54:                 current = queue.popleft()
- 55:                 if current.left:
- 56:                     next_level.append(current.left)
- 57:                 if current.right:
- 58:                     next_level.append(current.right)
- 59:             queue = next_level
+ 51:             break
+ 52:         
+ 53:         
+ 54:         
+ 55:         
+ 56:         
+ 57:         
+ 58:         
+ 59:         
  60:         return output
--------------------------------------------------------------------------------
[0.20045 s] killed by ts-3-5/test_3-5_0-9_293.py::test_level_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b61162f70d0>

    def test_level_order_traversal(sample_tree):
        expected_output = [1, 2, 3, 4, 5, 6, 7]
>       assert sample_tree.level_order_traversal() == expected_output
E       AssertionError

ts-3-5/test_3-5_0-9_293.py:44: AssertionError

   - [#  62] ZIL naive_tree: 
--------------------------------------------------------------------------------
  50:         while queue:
  51:             output.extend(list(map((lambda n: (n.value)), list(queue))))
  52:             next_level = deque()
  53:             while queue:
- 54:                 current = queue.popleft()
- 55:                 if current.left:
- 56:                     next_level.append(current.left)
- 57:                 if current.right:
- 58:                     next_level.append(current.right)
+ 54:                 break
+ 55:             
+ 56:             
+ 57:             
+ 58:             
  59:             queue = next_level
  60:         return output
--------------------------------------------------------------------------------
[0.19942 s] killed by ts-3-5/test_3-5_0-9_293.py::test_level_order_traversal

sample_tree = <naive_tree.NaiveBinaryTree object at 0x7b61160830d0>

    def test_level_order_traversal(sample_tree):
        expected_output = [1, 2, 3, 4, 5, 6, 7]
>       assert sample_tree.level_order_traversal() == expected_output
E       AssertionError

ts-3-5/test_3-5_0-9_293.py:44: AssertionError
