1 : Job ID 432fb6639aab4c7b952773bce9093ad8
test outcome: killed
permutations.py, start pos: (11, 28), end pos: (11, 29)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current - remaining[i], remaining[:i] + remaining[i+1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - TypeError: unsu...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Typ...
========================= 4 failed, 1 passed in 0.14s ==========================

2 : Job ID a3cf1db8fbf047629a625f45b15334a4
test outcome: killed
permutations.py, start pos: (11, 58), end pos: (11, 59)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 1
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] - remaining[i+1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - TypeError: unsu...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Typ...
========================= 4 failed, 1 passed in 0.14s ==========================

3 : Job ID beb39e5b9879465fa60eb457f9d3d975
test outcome: killed
permutations.py, start pos: (11, 71), end pos: (11, 72)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 2
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] + remaining[i-1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - RecursionError:...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Rec...
========================= 4 failed, 1 passed in 0.33s ==========================

4 : Job ID 94794a73c2e84ea2b8f9095decbee53c
test outcome: killed
permutations.py, start pos: (11, 28), end pos: (11, 29)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current * remaining[i], remaining[:i] + remaining[i+1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - TypeError: can'...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Typ...
========================= 4 failed, 1 passed in 0.15s ==========================

5 : Job ID eb80090c3641405e910897a7e403e81c
test outcome: killed
permutations.py, start pos: (11, 58), end pos: (11, 59)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 1
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] * remaining[i+1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - TypeError: can'...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Typ...
========================= 4 failed, 1 passed in 0.14s ==========================

6 : Job ID 479dd7d592434740863dc86de35933b9
test outcome: killed
permutations.py, start pos: (11, 71), end pos: (11, 72)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 2
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] + remaining[i*1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - RecursionError:...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Rec...
========================= 4 failed, 1 passed in 0.33s ==========================

7 : Job ID 6d82727cfc4e4b3f98a108924672ae9e
test outcome: killed
permutations.py, start pos: (11, 28), end pos: (11, 29)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current / remaining[i], remaining[:i] + remaining[i+1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - TypeError: unsu...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Typ...
========================= 4 failed, 1 passed in 0.14s ==========================

8 : Job ID 8e1c62b688e7413e8ebc9074c7073f87
test outcome: killed
permutations.py, start pos: (11, 58), end pos: (11, 59)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 1
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] / remaining[i+1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - TypeError: unsu...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Typ...
========================= 4 failed, 1 passed in 0.15s ==========================

9 : Job ID 0681e554f0e646fb9945e7c7e2c07c6a
test outcome: killed
permutations.py, start pos: (11, 71), end pos: (11, 72)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 2
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] + remaining[i/1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - TypeError: slic...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Typ...
========================= 4 failed, 1 passed in 0.15s ==========================

10 : Job ID 0055646cae1c43aeb250a8d003004e2d
test outcome: killed
permutations.py, start pos: (11, 28), end pos: (11, 29)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current // remaining[i], remaining[:i] + remaining[i+1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - TypeError: unsu...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Typ...
========================= 4 failed, 1 passed in 0.15s ==========================

11 : Job ID f39cf44a517c43de9ebd6a73c4f0f8de
test outcome: killed
permutations.py, start pos: (11, 58), end pos: (11, 59)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 1
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] // remaining[i+1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - TypeError: unsu...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Typ...
========================= 4 failed, 1 passed in 0.15s ==========================

12 : Job ID a3c8a42c3667446ca7ebca80df35c94f
test outcome: killed
permutations.py, start pos: (11, 71), end pos: (11, 72)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 2
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] + remaining[i//1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - RecursionError:...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Rec...
========================= 4 failed, 1 passed in 0.37s ==========================

13 : Job ID c114495cc54e4e5585525ed6f963a695
test outcome: killed
permutations.py, start pos: (11, 28), end pos: (11, 29)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current % remaining[i], remaining[:i] + remaining[i+1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - TypeError: not ...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Typ...
========================= 4 failed, 1 passed in 0.14s ==========================

14 : Job ID aaab734fcf0844e1a032597b38349776
test outcome: killed
permutations.py, start pos: (11, 58), end pos: (11, 59)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 1
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] % remaining[i+1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - TypeError: unsu...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Typ...
========================= 4 failed, 1 passed in 0.14s ==========================

15 : Job ID 80c1d28f154e4afd813ad371345870c2
test outcome: killed
permutations.py, start pos: (11, 71), end pos: (11, 72)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 2
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] + remaining[i%1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - RecursionError:...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Rec...
========================= 4 failed, 1 passed in 0.36s ==========================

16 : Job ID f757dd59381d4caba8d8cf611f3fbdc4
test outcome: killed
permutations.py, start pos: (11, 28), end pos: (11, 29)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current ** remaining[i], remaining[:i] + remaining[i+1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - TypeError: unsu...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Typ...
========================= 4 failed, 1 passed in 0.14s ==========================

17 : Job ID 0aa68113cfe44ad9b80ee43e25843ac1
test outcome: killed
permutations.py, start pos: (11, 58), end pos: (11, 59)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 1
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] ** remaining[i+1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - TypeError: unsu...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Typ...
========================= 4 failed, 1 passed in 0.14s ==========================

18 : Job ID 619015d945a24df5948ccf0e1302ced5
test outcome: killed
permutations.py, start pos: (11, 71), end pos: (11, 72)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 2
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] + remaining[i**1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - RecursionError:...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Rec...
========================= 4 failed, 1 passed in 0.32s ==========================

19 : Job ID babc5bd79495474ea7a45c70a0a8594c
test outcome: killed
permutations.py, start pos: (11, 28), end pos: (11, 29)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current >> remaining[i], remaining[:i] + remaining[i+1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - TypeError: unsu...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Typ...
========================= 4 failed, 1 passed in 0.14s ==========================

20 : Job ID 3a437504e26740b4ac484178b84c34ea
test outcome: killed
permutations.py, start pos: (11, 58), end pos: (11, 59)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 1
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] >> remaining[i+1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - TypeError: unsu...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Typ...
========================= 4 failed, 1 passed in 0.15s ==========================

21 : Job ID 07c834009f0a4a77bde5d544ddbaac6f
test outcome: killed
permutations.py, start pos: (11, 71), end pos: (11, 72)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 2
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] + remaining[i>>1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - RecursionError:...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Rec...
========================= 4 failed, 1 passed in 0.35s ==========================

22 : Job ID fbd47ea09cb945e3ad306844d15eee06
test outcome: killed
permutations.py, start pos: (11, 28), end pos: (11, 29)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current << remaining[i], remaining[:i] + remaining[i+1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - TypeError: unsu...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Typ...
========================= 4 failed, 1 passed in 0.15s ==========================

23 : Job ID 22a9543167564e85a0221c2e07ace701
test outcome: killed
permutations.py, start pos: (11, 58), end pos: (11, 59)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 1
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] << remaining[i+1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - TypeError: unsu...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Typ...
========================= 4 failed, 1 passed in 0.14s ==========================

24 : Job ID 7ed18ede3d0a4283b4a7f935bcc21188
test outcome: killed
permutations.py, start pos: (11, 71), end pos: (11, 72)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 2
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] + remaining[i<<1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - RecursionError:...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Rec...
========================= 4 failed, 1 passed in 0.32s ==========================

25 : Job ID 85d3cdcc27e34a2091f29f9d7501fd1e
test outcome: killed
permutations.py, start pos: (11, 28), end pos: (11, 29)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current | remaining[i], remaining[:i] + remaining[i+1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - TypeError: unsu...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Typ...
========================= 4 failed, 1 passed in 0.14s ==========================

26 : Job ID c6bc201b7093440fb27742e66da85b30
test outcome: killed
permutations.py, start pos: (11, 58), end pos: (11, 59)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 1
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] | remaining[i+1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - TypeError: unsu...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Typ...
========================= 4 failed, 1 passed in 0.14s ==========================
