27 : Job ID 65c4007c733e48618aecea044b24e8f6
test outcome: killed
permutations.py, start pos: (11, 71), end pos: (11, 72)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 2
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] + remaining[i|1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F..FF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - RecursionError:...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Rec...
========================= 3 failed, 2 passed in 0.30s ==========================

28 : Job ID 5621b68f543d4fdead58d637bfcf5dc8
test outcome: killed
permutations.py, start pos: (11, 28), end pos: (11, 29)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current & remaining[i], remaining[:i] + remaining[i+1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - TypeError: unsu...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Typ...
========================= 4 failed, 1 passed in 0.14s ==========================

29 : Job ID 2b37bf24444b46f3a42f053c9e4948e2
test outcome: killed
permutations.py, start pos: (11, 58), end pos: (11, 59)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 1
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] & remaining[i+1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - TypeError: unsu...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Typ...
========================= 4 failed, 1 passed in 0.15s ==========================

30 : Job ID 942c94772cf94ccc9e34a4ab48242543
test outcome: killed
permutations.py, start pos: (11, 71), end pos: (11, 72)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 2
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] + remaining[i&1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - RecursionError:...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Rec...
========================= 4 failed, 1 passed in 0.32s ==========================

31 : Job ID 87fda81f4bdb4204a544b62085e8bde5
test outcome: killed
permutations.py, start pos: (11, 28), end pos: (11, 29)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current ^ remaining[i], remaining[:i] + remaining[i+1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - TypeError: unsu...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Typ...
========================= 4 failed, 1 passed in 0.14s ==========================

32 : Job ID 1009af90be744f6d8bbf5bae029d10c9
test outcome: killed
permutations.py, start pos: (11, 58), end pos: (11, 59)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 1
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] ^ remaining[i+1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - TypeError: unsu...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Typ...
========================= 4 failed, 1 passed in 0.15s ==========================

33 : Job ID f9776d6e14b841b8ac41743bb88d22e8
test outcome: killed
permutations.py, start pos: (11, 71), end pos: (11, 72)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 2
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] + remaining[i^1:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F..FF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - RecursionError:...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Rec...
========================= 3 failed, 2 passed in 0.29s ==========================

34 : Job ID 59437259efc04365864bc482236ffed4
test outcome: killed
permutations.py, start pos: (7, 11), end pos: (7, 14)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 0
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -4,7 +4,7 @@
     """
     def permute(current, remaining):
-        if not remaining:
+        if  remaining:
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
ts-3-5/test_3-5_0-2_84.py FFFFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - AssertionError:...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_empty_string - As...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Ass...
============================== 5 failed in 0.14s ===============================

35 : Job ID fa6393f6adb844b48f31a44f6635b354
test outcome: killed
permutations.py, start pos: (7, 11), end pos: (7, 24)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -4,7 +4,7 @@
     """
     def permute(current, remaining):
-        if not remaining:
+        if not not remaining:
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
ts-3-5/test_3-5_0-2_84.py FFFFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - AssertionError:...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_empty_string - As...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Ass...
============================== 5 failed in 0.15s ===============================

36 : Job ID af9c5fe0713f4159ba28157af0debc41
test outcome: killed
permutations.py, start pos: (10, 23), end pos: (10, 24)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -7,7 +7,7 @@
         if not remaining:
             permute.list.append(current)
             return
-        for i in range(0,len(remaining)):
+        for i in range( 1,len(remaining)):
             permute(current + remaining[i], remaining[:i] + remaining[i+1:])
     permute.list = []
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - AssertionError:...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Ass...
========================= 4 failed, 1 passed in 0.14s ==========================

37 : Job ID e2bae376465f4d6082b4639d5217649f
test outcome: killed
permutations.py, start pos: (10, 23), end pos: (10, 24)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -7,7 +7,7 @@
         if not remaining:
             permute.list.append(current)
             return
-        for i in range(0,len(remaining)):
+        for i in range( -1,len(remaining)):
             permute(current + remaining[i], remaining[:i] + remaining[i+1:])
     permute.list = []
timeout

38 : Job ID 2dd51b5e444144968928e77cef4354ab
test outcome: killed
permutations.py, start pos: (11, 72), end pos: (11, 73)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] + remaining[i+ 2:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F..FF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - AssertionError:...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Ass...
========================= 3 failed, 2 passed in 0.15s ==========================

39 : Job ID f5940ee40255442bb1fa2070fc7f6304
test outcome: killed
permutations.py, start pos: (11, 72), end pos: (11, 73)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -8,7 +8,7 @@
             permute.list.append(current)
             return
         for i in range(0,len(remaining)):
-            permute(current + remaining[i], remaining[:i] + remaining[i+1:])
+            permute(current + remaining[i], remaining[:i] + remaining[i+ 0:])
     permute.list = []
     permute('', list(string))
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - RecursionError:...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Rec...
========================= 4 failed, 1 passed in 0.33s ==========================

40 : Job ID b29b4eba56db4758a02a74f5fee7ee88
test outcome: killed
permutations.py, start pos: (10, 17), end pos: (10, 40)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- apermutations.py
+++ bpermutations.py
@@ -7,7 +7,7 @@
         if not remaining:
             permute.list.append(current)
             return
-        for i in range(0,len(remaining)):
+        for i in []:
             permute(current + remaining[i], remaining[:i] + remaining[i+1:])
     permute.list = []
ts-3-5/test_3-5_0-2_84.py F.FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word - AssertionError:...
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_single_character
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_repeated_characters
FAILED ts-3-5/test_3-5_0-2_84.py::test_permutations_of_word_long_string - Ass...
========================= 4 failed, 1 passed in 0.15s ==========================
