   - [#   5] COI permutations: 
--------------------------------------------------------------------------------
   3:     Find all permutations of letters in a word.
   4: 
   5:     '''
   6:     def permute(current, remaining):
-  7:         if not remaining:
+  7:         if not ((not remaining)):
   8:             permute.list.append(current)
   9:             return
  10:         for i in range(0, len(remaining)):
  11:             permute(current + remaining[i], remaining[:i] + remaining[i + 1:])
--------------------------------------------------------------------------------
[0.19639 s] killed by ts-3-5/test_3-5_0-6_200.py::test_permutations_of_word_empty_string

def test_permutations_of_word_empty_string():
>       assert permutations_of_word('') == ['']
E       AssertionError

ts-3-5/test_3-5_0-6_200.py:10: AssertionError

   - [#   6] OIL permutations: 
--------------------------------------------------------------------------------
   8:             permute.list.append(current)
   9:             return
  10:         for i in range(0, len(remaining)):
  11:             permute(current + remaining[i], remaining[:i] + remaining[i + 1:])
- 12:     
+ 12:             break
  13:     permute.list = []
  14:     permute('', list(string))
  15:     return permute.list
--------------------------------------------------------------------------------
[0.20332 s] killed by ts-3-5/test_3-5_0-6_200.py::test_permutations_of_word_three_chars

def test_permutations_of_word_three_chars():
>       assert set(permutations_of_word('abc')) == set(['abc', 'acb', 'bac', 'bca', 'cab', 'cba'])
E       AssertionError

ts-3-5/test_3-5_0-6_200.py:16: AssertionError

   - [#   7] RIL permutations: 
--------------------------------------------------------------------------------
   6:     def permute(current, remaining):
   7:         if not remaining:
   8:             permute.list.append(current)
   9:             return
- 10:         for i in range(0, len(remaining)):
+ 10:         for i in reversed(range(0, len(remaining))):
  11:             permute(current + remaining[i], remaining[:i] + remaining[i + 1:])
  12:     
  13:     permute.list = []
  14:     permute('', list(string))
--------------------------------------------------------------------------------
[0.17810 s] survived

   - [#   8] SDL permutations: 
--------------------------------------------------------------------------------
   4: 
   5:     '''
   6:     def permute(current, remaining):
   7:         if not remaining:
-  8:             permute.list.append(current)
+  8:             pass
   9:             return
  10:         for i in range(0, len(remaining)):
  11:             permute(current + remaining[i], remaining[:i] + remaining[i + 1:])
  12:     
--------------------------------------------------------------------------------
[0.19389 s] killed by ts-3-5/test_3-5_0-6_200.py::test_permutations_of_word_empty_string

def test_permutations_of_word_empty_string():
>       assert permutations_of_word('') == ['']
E       AssertionError

ts-3-5/test_3-5_0-6_200.py:10: AssertionError

   - [#   9] SDL permutations: 
--------------------------------------------------------------------------------
   5:     '''
   6:     def permute(current, remaining):
   7:         if not remaining:
   8:             permute.list.append(current)
-  9:             return
+  9:             pass
  10:         for i in range(0, len(remaining)):
  11:             permute(current + remaining[i], remaining[:i] + remaining[i + 1:])
  12:     
  13:     permute.list = []
--------------------------------------------------------------------------------
[0.17218 s] survived

   - [#  10] SDL permutations: 
--------------------------------------------------------------------------------
   7:         if not remaining:
   8:             permute.list.append(current)
   9:             return
  10:         for i in range(0, len(remaining)):
- 11:             permute(current + remaining[i], remaining[:i] + remaining[i + 1:])
+ 11:             pass
  12:     
  13:     permute.list = []
  14:     permute('', list(string))
  15:     return permute.list
--------------------------------------------------------------------------------
[0.20309 s] killed by ts-3-5/test_3-5_0-6_200.py::test_permutations_of_word_single_char

def test_permutations_of_word_single_char():
>       assert permutations_of_word('a') == ['a']
E       AssertionError

ts-3-5/test_3-5_0-6_200.py:13: AssertionError

   - [#  11] SDL permutations: 
--------------------------------------------------------------------------------
   9:             return
  10:         for i in range(0, len(remaining)):
  11:             permute(current + remaining[i], remaining[:i] + remaining[i + 1:])
  12:     
- 13:     permute.list = []
+ 13:     pass
  14:     permute('', list(string))
  15:     return permute.list
--------------------------------------------------------------------------------
[0.19323 s] killed by ts-3-5/test_3-5_0-6_200.py::test_permutations_of_word_empty_string

def test_permutations_of_word_empty_string():
>       assert permutations_of_word('') == ['']

ts-3-5/test_3-5_0-6_200.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
permutations:14: in permutations_of_word
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

current = '', remaining = []

>   ???
E   AttributeError: 'function' object has no attribute 'list'

permutations:8: AttributeError

   - [#  12] SDL permutations: 
--------------------------------------------------------------------------------
  10:         for i in range(0, len(remaining)):
  11:             permute(current + remaining[i], remaining[:i] + remaining[i + 1:])
  12:     
  13:     permute.list = []
- 14:     permute('', list(string))
+ 14:     pass
  15:     return permute.list
--------------------------------------------------------------------------------
[0.19805 s] killed by ts-3-5/test_3-5_0-6_200.py::test_permutations_of_word_empty_string

def test_permutations_of_word_empty_string():
>       assert permutations_of_word('') == ['']
E       AssertionError

ts-3-5/test_3-5_0-6_200.py:10: AssertionError

   - [#  13] SDL permutations: 
--------------------------------------------------------------------------------
  11:             permute(current + remaining[i], remaining[:i] + remaining[i + 1:])
  12:     
  13:     permute.list = []
  14:     permute('', list(string))
- 15:     return permute.list
+ 15:     pass
--------------------------------------------------------------------------------
[0.19629 s] killed by ts-3-5/test_3-5_0-6_200.py::test_permutations_of_word_empty_string

def test_permutations_of_word_empty_string():
>       assert permutations_of_word('') == ['']
E       AssertionError

ts-3-5/test_3-5_0-6_200.py:10: AssertionError

   - [#  14] SIR permutations: 
--------------------------------------------------------------------------------
   7:         if not remaining:
   8:             permute.list.append(current)
   9:             return
  10:         for i in range(0, len(remaining)):
- 11:             permute(current + remaining[i], remaining[:i] + remaining[i + 1:])
+ 11:             permute(current + remaining[i], remaining[:] + remaining[i + 1:])
  12:     
  13:     permute.list = []
  14:     permute('', list(string))
  15:     return permute.list
--------------------------------------------------------------------------------
[0.48434 s] killed by ts-3-5/test_3-5_0-6_200.py::test_permutations_of_word_single_char

def test_permutations_of_word_single_char():
>       assert permutations_of_word('a') == ['a']

ts-3-5/test_3-5_0-6_200.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
permutations:14: in permutations_of_word
    ???
permutations:11: in permute
    ???
permutations:11: in permute
    ???
permutations:11: in permute
    ???
permutations:11: in permute
    ???
permutations:11: in permute
    ???
permutations:11: in permute
    ???
permutations:11: in permute
    ???
permutations:11: in permute
    ???
permutations:11: in permute
    ???
permutations:11: in permute
    ???
permutations:11: in permute
    ???
permutations:11: in permute

   - [#  15] SIR permutations: 
--------------------------------------------------------------------------------
   7:         if not remaining:
   8:             permute.list.append(current)
   9:             return
  10:         for i in range(0, len(remaining)):
- 11:             permute(current + remaining[i], remaining[:i] + remaining[i + 1:])
+ 11:             permute(current + remaining[i], remaining[:i] + remaining[:])
  12:     
  13:     permute.list = []
  14:     permute('', list(string))
  15:     return permute.list
--------------------------------------------------------------------------------
[0.49738 s] killed by ts-3-5/test_3-5_0-6_200.py::test_permutations_of_word_single_char

def test_permutations_of_word_single_char():
>       assert permutations_of_word('a') == ['a']

ts-3-5/test_3-5_0-6_200.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
permutations:14: in permutations_of_word
    ???
permutations:11: in permute
    ???
permutations:11: in permute
    ???
permutations:11: in permute
    ???
permutations:11: in permute
    ???
permutations:11: in permute
    ???
permutations:11: in permute
    ???
permutations:11: in permute
    ???
permutations:11: in permute
    ???
permutations:11: in permute
    ???
permutations:11: in permute
    ???
permutations:11: in permute
    ???
permutations:11: in permute

   - [#  16] ZIL permutations: 
--------------------------------------------------------------------------------
   7:         if not remaining:
   8:             permute.list.append(current)
   9:             return
  10:         for i in range(0, len(remaining)):
- 11:             permute(current + remaining[i], remaining[:i] + remaining[i + 1:])
+ 11:             break
  12:     
  13:     permute.list = []
  14:     permute('', list(string))
  15:     return permute.list
--------------------------------------------------------------------------------
[0.19486 s] killed by ts-3-5/test_3-5_0-6_200.py::test_permutations_of_word_single_char

def test_permutations_of_word_single_char():
>       assert permutations_of_word('a') == ['a']
E       AssertionError

ts-3-5/test_3-5_0-6_200.py:13: AssertionError
