1 : Job ID d2eee26569ce460eb3c49d9f7708c43d
SURVIVED
test outcome: survived
priority_queue1.py, start pos: (31, 43), end pos: (31, 44)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -28,7 +28,7 @@
             entry = self.mapper.pop(task)
             if not priority:
-                priority = min(0, entry[0] - 1)
+                priority = min(0, entry[0] + 1)
             self.add_task(entry[2], priority)
ts-3-5/test_3-5_0-8_249.py ....                                          [100%]
============================== 4 passed in 0.14s ===============================

2 : Job ID 0285f4a4687a47dd999e2aacb6abf6fa
SURVIVED
test outcome: survived
priority_queue1.py, start pos: (31, 43), end pos: (31, 44)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -28,7 +28,7 @@
             entry = self.mapper.pop(task)
             if not priority:
-                priority = min(0, entry[0] - 1)
+                priority = min(0, entry[0] * 1)
             self.add_task(entry[2], priority)
ts-3-5/test_3-5_0-8_249.py ....                                          [100%]
============================== 4 passed in 0.14s ===============================

3 : Job ID 8b9a874a8f0d4f53b02982f91111e83a
SURVIVED
test outcome: survived
priority_queue1.py, start pos: (31, 43), end pos: (31, 44)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -28,7 +28,7 @@
             entry = self.mapper.pop(task)
             if not priority:
-                priority = min(0, entry[0] - 1)
+                priority = min(0, entry[0] / 1)
             self.add_task(entry[2], priority)
ts-3-5/test_3-5_0-8_249.py ....                                          [100%]
============================== 4 passed in 0.14s ===============================

4 : Job ID ff063425ea9a42a887f2d563d9c6d6ed
SURVIVED
test outcome: survived
priority_queue1.py, start pos: (31, 43), end pos: (31, 44)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -28,7 +28,7 @@
             entry = self.mapper.pop(task)
             if not priority:
-                priority = min(0, entry[0] - 1)
+                priority = min(0, entry[0] // 1)
             self.add_task(entry[2], priority)
ts-3-5/test_3-5_0-8_249.py ....                                          [100%]
============================== 4 passed in 0.14s ===============================

5 : Job ID cc9ac83bbdeb4535a5791e449f7a7ea0
SURVIVED
test outcome: survived
priority_queue1.py, start pos: (31, 43), end pos: (31, 44)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -28,7 +28,7 @@
             entry = self.mapper.pop(task)
             if not priority:
-                priority = min(0, entry[0] - 1)
+                priority = min(0, entry[0] % 1)
             self.add_task(entry[2], priority)
ts-3-5/test_3-5_0-8_249.py ....                                          [100%]
============================== 4 passed in 0.14s ===============================

6 : Job ID 4f6c71f9c185441d8fbac7512e470216
SURVIVED
test outcome: survived
priority_queue1.py, start pos: (31, 43), end pos: (31, 44)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -28,7 +28,7 @@
             entry = self.mapper.pop(task)
             if not priority:
-                priority = min(0, entry[0] - 1)
+                priority = min(0, entry[0] ** 1)
             self.add_task(entry[2], priority)
ts-3-5/test_3-5_0-8_249.py ....                                          [100%]
============================== 4 passed in 0.14s ===============================

7 : Job ID eab95425e2044cd1af7370a9325a1295
SURVIVED
test outcome: survived
priority_queue1.py, start pos: (31, 43), end pos: (31, 44)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -28,7 +28,7 @@
             entry = self.mapper.pop(task)
             if not priority:
-                priority = min(0, entry[0] - 1)
+                priority = min(0, entry[0] >> 1)
             self.add_task(entry[2], priority)
ts-3-5/test_3-5_0-8_249.py ....                                          [100%]
============================== 4 passed in 0.15s ===============================

8 : Job ID 31d06aabd3e845e295b6e941593e0db6
SURVIVED
test outcome: survived
priority_queue1.py, start pos: (31, 43), end pos: (31, 44)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -28,7 +28,7 @@
             entry = self.mapper.pop(task)
             if not priority:
-                priority = min(0, entry[0] - 1)
+                priority = min(0, entry[0] << 1)
             self.add_task(entry[2], priority)
ts-3-5/test_3-5_0-8_249.py ....                                          [100%]
============================== 4 passed in 0.14s ===============================

9 : Job ID a17bbd8acbcb437f9b64de60f69e68b4
SURVIVED
test outcome: survived
priority_queue1.py, start pos: (31, 43), end pos: (31, 44)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -28,7 +28,7 @@
             entry = self.mapper.pop(task)
             if not priority:
-                priority = min(0, entry[0] - 1)
+                priority = min(0, entry[0] | 1)
             self.add_task(entry[2], priority)
ts-3-5/test_3-5_0-8_249.py ....                                          [100%]
============================== 4 passed in 0.14s ===============================

10 : Job ID 6ba3f445b4304af28cc5a479e2ce614b
SURVIVED
test outcome: survived
priority_queue1.py, start pos: (31, 43), end pos: (31, 44)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -28,7 +28,7 @@
             entry = self.mapper.pop(task)
             if not priority:
-                priority = min(0, entry[0] - 1)
+                priority = min(0, entry[0] & 1)
             self.add_task(entry[2], priority)
ts-3-5/test_3-5_0-8_249.py ....                                          [100%]
============================== 4 passed in 0.14s ===============================

11 : Job ID de13cae71f984ce4990d53b7bab2f142
SURVIVED
test outcome: survived
priority_queue1.py, start pos: (31, 43), end pos: (31, 44)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -28,7 +28,7 @@
             entry = self.mapper.pop(task)
             if not priority:
-                priority = min(0, entry[0] - 1)
+                priority = min(0, entry[0] ^ 1)
             self.add_task(entry[2], priority)
ts-3-5/test_3-5_0-8_249.py ....                                          [100%]
============================== 4 passed in 0.14s ===============================

12 : Job ID d0e6760469d74736bc1fccd5335e5405
test outcome: killed
priority_queue1.py, start pos: (38, 20), end pos: (38, 26)
operator: core/ReplaceComparisonOperator_IsNot_Eq, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -35,7 +35,7 @@
     def pop_task(self):
         while self.pq:
             _, _, task = heappop(self.pq)
-            if task is not self.REMOVED:
+            if task == self.REMOVED:
                 del self.mapper[task]
                 return task
         raise KeyError('Pop from empty priority queue.')
ts-3-5/test_3-5_0-8_249.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_249.py::test_pop_task - KeyError: '__removed-task__'
========================= 1 failed, 3 passed in 0.14s ==========================

13 : Job ID 10abe85a567f454985c962b88a2ecb91
SURVIVED
test outcome: survived
priority_queue1.py, start pos: (38, 20), end pos: (38, 26)
operator: core/ReplaceComparisonOperator_IsNot_NotEq, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -35,7 +35,7 @@
     def pop_task(self):
         while self.pq:
             _, _, task = heappop(self.pq)
-            if task is not self.REMOVED:
+            if task != self.REMOVED:
                 del self.mapper[task]
                 return task
         raise KeyError('Pop from empty priority queue.')
ts-3-5/test_3-5_0-8_249.py ....                                          [100%]
============================== 4 passed in 0.14s ===============================

14 : Job ID 6fcfeff06d31448aa9b303674f3d427e
test outcome: killed
priority_queue1.py, start pos: (38, 20), end pos: (38, 26)
operator: core/ReplaceComparisonOperator_IsNot_Lt, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -35,7 +35,7 @@
     def pop_task(self):
         while self.pq:
             _, _, task = heappop(self.pq)
-            if task is not self.REMOVED:
+            if task < self.REMOVED:
                 del self.mapper[task]
                 return task
         raise KeyError('Pop from empty priority queue.')
ts-3-5/test_3-5_0-8_249.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_249.py::test_pop_task - KeyError: 'Pop from empty ...
========================= 1 failed, 3 passed in 0.14s ==========================

15 : Job ID 21beea22d7f44540995ae705adfeb58a
test outcome: killed
priority_queue1.py, start pos: (38, 20), end pos: (38, 26)
operator: core/ReplaceComparisonOperator_IsNot_LtE, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -35,7 +35,7 @@
     def pop_task(self):
         while self.pq:
             _, _, task = heappop(self.pq)
-            if task is not self.REMOVED:
+            if task <= self.REMOVED:
                 del self.mapper[task]
                 return task
         raise KeyError('Pop from empty priority queue.')
ts-3-5/test_3-5_0-8_249.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_249.py::test_pop_task - KeyError: '__removed-task__'
========================= 1 failed, 3 passed in 0.14s ==========================

16 : Job ID 99e5ce7151fc443db402f989938e885b
SURVIVED
test outcome: survived
priority_queue1.py, start pos: (38, 20), end pos: (38, 26)
operator: core/ReplaceComparisonOperator_IsNot_Gt, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -35,7 +35,7 @@
     def pop_task(self):
         while self.pq:
             _, _, task = heappop(self.pq)
-            if task is not self.REMOVED:
+            if task > self.REMOVED:
                 del self.mapper[task]
                 return task
         raise KeyError('Pop from empty priority queue.')
ts-3-5/test_3-5_0-8_249.py ....                                          [100%]
============================== 4 passed in 0.14s ===============================

17 : Job ID 44c343422bc64e3e8362b7b892587ac9
test outcome: killed
priority_queue1.py, start pos: (38, 20), end pos: (38, 26)
operator: core/ReplaceComparisonOperator_IsNot_GtE, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -35,7 +35,7 @@
     def pop_task(self):
         while self.pq:
             _, _, task = heappop(self.pq)
-            if task is not self.REMOVED:
+            if task >= self.REMOVED:
                 del self.mapper[task]
                 return task
         raise KeyError('Pop from empty priority queue.')
ts-3-5/test_3-5_0-8_249.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_249.py::test_pop_task - KeyError: '__removed-task__'
========================= 1 failed, 3 passed in 0.14s ==========================

18 : Job ID ba20f435f42c4413b4df2e3b8638c0d0
test outcome: killed
priority_queue1.py, start pos: (38, 20), end pos: (38, 26)
operator: core/ReplaceComparisonOperator_IsNot_Is, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -35,7 +35,7 @@
     def pop_task(self):
         while self.pq:
             _, _, task = heappop(self.pq)
-            if task is not self.REMOVED:
+            if task is self.REMOVED:
                 del self.mapper[task]
                 return task
         raise KeyError('Pop from empty priority queue.')
ts-3-5/test_3-5_0-8_249.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_249.py::test_pop_task - KeyError: '__removed-task__'
========================= 1 failed, 3 passed in 0.14s ==========================

19 : Job ID b3bc28ddcea24e7d9d13b396b8cd7641
test outcome: killed
priority_queue1.py, start pos: (24, 14), end pos: (24, 15)
operator: core/ReplaceUnaryOperator_USub_UAdd, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -21,7 +21,7 @@
     def remove_task(self, task):
         entry = self.mapper.pop(task)
-        entry[-1] = self.REMOVED
+        entry[+1] = self.REMOVED
     def set_priority(self, task, priority=None):
         if task in self.mapper:
ts-3-5/test_3-5_0-8_249.py .FF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_249.py::test_remove_task - TypeError: '<' not supp...
FAILED ts-3-5/test_3-5_0-8_249.py::test_set_priority - TypeError: '<' not sup...
========================= 2 failed, 2 passed in 0.14s ==========================

20 : Job ID 1df39c8d14a0412f908ceb5bdb7510ce
test outcome: killed
priority_queue1.py, start pos: (24, 14), end pos: (24, 15)
operator: core/ReplaceUnaryOperator_USub_Invert, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -21,7 +21,7 @@
     def remove_task(self, task):
         entry = self.mapper.pop(task)
-        entry[-1] = self.REMOVED
+        entry[~1] = self.REMOVED
     def set_priority(self, task, priority=None):
         if task in self.mapper:
ts-3-5/test_3-5_0-8_249.py .FF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_249.py::test_remove_task - TypeError: '<' not supp...
FAILED ts-3-5/test_3-5_0-8_249.py::test_set_priority - TypeError: '<' not sup...
========================= 2 failed, 2 passed in 0.15s ==========================

21 : Job ID 63c3fd5e01214c63b5c9b6aed87eb47d
test outcome: killed
priority_queue1.py, start pos: (24, 14), end pos: (24, 15)
operator: core/ReplaceUnaryOperator_USub_Not, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -21,7 +21,7 @@
     def remove_task(self, task):
         entry = self.mapper.pop(task)
-        entry[-1] = self.REMOVED
+        entry[not 1] = self.REMOVED
     def set_priority(self, task, priority=None):
         if task in self.mapper:
ts-3-5/test_3-5_0-8_249.py .FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_249.py::test_remove_task - TypeError: '<' not supp...
FAILED ts-3-5/test_3-5_0-8_249.py::test_set_priority - TypeError: '<' not sup...
FAILED ts-3-5/test_3-5_0-8_249.py::test_pop_task - TypeError: '<' not support...
========================= 3 failed, 1 passed in 0.15s ==========================

22 : Job ID 300ec1ef758f41b6a34fbe929201ec58
test outcome: killed
priority_queue1.py, start pos: (24, 14), end pos: (24, 15)
operator: core/ReplaceUnaryOperator_Delete_USub, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -21,7 +21,7 @@
     def remove_task(self, task):
         entry = self.mapper.pop(task)
-        entry[-1] = self.REMOVED
+        entry[1] = self.REMOVED
     def set_priority(self, task, priority=None):
         if task in self.mapper:
ts-3-5/test_3-5_0-8_249.py .FF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_249.py::test_remove_task - TypeError: '<' not supp...
FAILED ts-3-5/test_3-5_0-8_249.py::test_set_priority - TypeError: '<' not sup...
========================= 2 failed, 2 passed in 0.15s ==========================

23 : Job ID 4d2a93aaba1a483995033c2701916028
test outcome: killed
priority_queue1.py, start pos: (30, 15), end pos: (30, 18)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -27,7 +27,7 @@
         if task in self.mapper:
             entry = self.mapper.pop(task)
-            if not priority:
+            if  priority:
                 priority = min(0, entry[0] - 1)
             self.add_task(entry[2], priority)
ts-3-5/test_3-5_0-8_249.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_249.py::test_set_priority - assert -1 == 5
========================= 1 failed, 3 passed in 0.14s ==========================

24 : Job ID a4c0f143a59e422990a3c4f3852b911b
test outcome: killed
priority_queue1.py, start pos: (15, 11), end pos: (15, 30)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -12,7 +12,7 @@
         pass
     def add_task(self, task, priority=0):
-        if task in self.mapper:
+        if not task in self.mapper:
             self.remove_task(task)
         count = next(self.counter)
         entry = [priority, count, task]
ts-3-5/test_3-5_0-8_249.py FFFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_249.py::test_add_task - KeyError: 'task1'
FAILED ts-3-5/test_3-5_0-8_249.py::test_remove_task - KeyError: 'task1'
FAILED ts-3-5/test_3-5_0-8_249.py::test_set_priority - KeyError: 'task1'
FAILED ts-3-5/test_3-5_0-8_249.py::test_pop_task - KeyError: 'task1'
============================== 4 failed in 0.14s ===============================

25 : Job ID 3432093d879441f5b818036518d274de
test outcome: killed
priority_queue1.py, start pos: (27, 11), end pos: (27, 30)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -24,7 +24,7 @@
         entry[-1] = self.REMOVED
     def set_priority(self, task, priority=None):
-        if task in self.mapper:
+        if not task in self.mapper:
             entry = self.mapper.pop(task)
             if not priority:
ts-3-5/test_3-5_0-8_249.py ..FF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_249.py::test_set_priority - assert 0 == 5
FAILED ts-3-5/test_3-5_0-8_249.py::test_pop_task - Failed: DID NOT RAISE <cla...
========================= 2 failed, 2 passed in 0.14s ==========================

26 : Job ID 844c8d61749b4dfab6d453da88590294
test outcome: killed
priority_queue1.py, start pos: (30, 15), end pos: (30, 27)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -27,7 +27,7 @@
         if task in self.mapper:
             entry = self.mapper.pop(task)
-            if not priority:
+            if not not priority:
                 priority = min(0, entry[0] - 1)
             self.add_task(entry[2], priority)
ts-3-5/test_3-5_0-8_249.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_249.py::test_set_priority - assert -1 == 5
========================= 1 failed, 3 passed in 0.14s ==========================

27 : Job ID e6efd9d3ff0c49c9ba3848ac8b582535
test outcome: killed
priority_queue1.py, start pos: (36, 14), end pos: (36, 21)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -33,7 +33,7 @@
             self.add_task(entry[2], priority)
     def pop_task(self):
-        while self.pq:
+        while not self.pq:
             _, _, task = heappop(self.pq)
             if task is not self.REMOVED:
                 del self.mapper[task]
ts-3-5/test_3-5_0-8_249.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_249.py::test_pop_task - KeyError: 'Pop from empty ...
========================= 1 failed, 3 passed in 0.14s ==========================

28 : Job ID bd4330d525154a409ee3cf8867e0502a
test outcome: killed
priority_queue1.py, start pos: (38, 15), end pos: (38, 39)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -35,7 +35,7 @@
     def pop_task(self):
         while self.pq:
             _, _, task = heappop(self.pq)
-            if task is not self.REMOVED:
+            if not task is not self.REMOVED:
                 del self.mapper[task]
                 return task
         raise KeyError('Pop from empty priority queue.')
ts-3-5/test_3-5_0-8_249.py ...F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_249.py::test_pop_task - KeyError: '__removed-task__'
========================= 1 failed, 3 passed in 0.14s ==========================

29 : Job ID 475310fecfdb47429a47bf3123e87dd7
SURVIVED
test outcome: survived
priority_queue1.py, start pos: (14, 38), end pos: (14, 39)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -11,7 +11,7 @@
     def __init__(self):
         pass
-    def add_task(self, task, priority=0):
+    def add_task(self, task, priority= 1):
         if task in self.mapper:
             self.remove_task(task)
         count = next(self.counter)
ts-3-5/test_3-5_0-8_249.py ....                                          [100%]
============================== 4 passed in 0.14s ===============================

30 : Job ID 56b896543c70484d9e4d161cc8a402d6
SURVIVED
test outcome: survived
priority_queue1.py, start pos: (14, 38), end pos: (14, 39)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -11,7 +11,7 @@
     def __init__(self):
         pass
-    def add_task(self, task, priority=0):
+    def add_task(self, task, priority= -1):
         if task in self.mapper:
             self.remove_task(task)
         count = next(self.counter)
ts-3-5/test_3-5_0-8_249.py ....                                          [100%]
============================== 4 passed in 0.14s ===============================

31 : Job ID cd992d13cde34a12846e45de4896d32b
test outcome: killed
priority_queue1.py, start pos: (24, 15), end pos: (24, 16)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -21,7 +21,7 @@
     def remove_task(self, task):
         entry = self.mapper.pop(task)
-        entry[-1] = self.REMOVED
+        entry[- 2] = self.REMOVED
     def set_priority(self, task, priority=None):
         if task in self.mapper:
ts-3-5/test_3-5_0-8_249.py .FF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_249.py::test_remove_task - TypeError: '<' not supp...
FAILED ts-3-5/test_3-5_0-8_249.py::test_set_priority - TypeError: '<' not sup...
========================= 2 failed, 2 passed in 0.15s ==========================

32 : Job ID 3244c700e05c4384a03f635145c1df9d
test outcome: killed
priority_queue1.py, start pos: (24, 15), end pos: (24, 16)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -21,7 +21,7 @@
     def remove_task(self, task):
         entry = self.mapper.pop(task)
-        entry[-1] = self.REMOVED
+        entry[- 0] = self.REMOVED
     def set_priority(self, task, priority=None):
         if task in self.mapper:
ts-3-5/test_3-5_0-8_249.py .FFF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_249.py::test_remove_task - TypeError: '<' not supp...
FAILED ts-3-5/test_3-5_0-8_249.py::test_set_priority - TypeError: '<' not sup...
FAILED ts-3-5/test_3-5_0-8_249.py::test_pop_task - TypeError: '<' not support...
========================= 3 failed, 1 passed in 0.14s ==========================

33 : Job ID d98c209f957c4b479babe5a2c2f26825
SURVIVED
test outcome: survived
priority_queue1.py, start pos: (31, 31), end pos: (31, 32)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -28,7 +28,7 @@
             entry = self.mapper.pop(task)
             if not priority:
-                priority = min(0, entry[0] - 1)
+                priority = min( 1, entry[0] - 1)
             self.add_task(entry[2], priority)
ts-3-5/test_3-5_0-8_249.py ....                                          [100%]
============================== 4 passed in 0.14s ===============================

34 : Job ID b8d3a03ca34849bc82de9fce69ba8dcc
SURVIVED
test outcome: survived
priority_queue1.py, start pos: (31, 31), end pos: (31, 32)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -28,7 +28,7 @@
             entry = self.mapper.pop(task)
             if not priority:
-                priority = min(0, entry[0] - 1)
+                priority = min( -1, entry[0] - 1)
             self.add_task(entry[2], priority)
ts-3-5/test_3-5_0-8_249.py ....                                          [100%]
============================== 4 passed in 0.15s ===============================

35 : Job ID b01eeee977284488a84b39ac6fb469f0
SURVIVED
test outcome: survived
priority_queue1.py, start pos: (31, 40), end pos: (31, 41)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -28,7 +28,7 @@
             entry = self.mapper.pop(task)
             if not priority:
-                priority = min(0, entry[0] - 1)
+                priority = min(0, entry[ 1] - 1)
             self.add_task(entry[2], priority)
ts-3-5/test_3-5_0-8_249.py ....                                          [100%]
============================== 4 passed in 0.13s ===============================

36 : Job ID 563900d587694e2b8e1f4d5c63e86e33
SURVIVED
test outcome: survived
priority_queue1.py, start pos: (31, 40), end pos: (31, 41)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -28,7 +28,7 @@
             entry = self.mapper.pop(task)
             if not priority:
-                priority = min(0, entry[0] - 1)
+                priority = min(0, entry[ -1] - 1)
             self.add_task(entry[2], priority)
ts-3-5/test_3-5_0-8_249.py ....                                          [100%]
============================== 4 passed in 0.14s ===============================

37 : Job ID a5d53788618e40018b5ff01e5f29113e
SURVIVED
test outcome: survived
priority_queue1.py, start pos: (31, 45), end pos: (31, 46)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -28,7 +28,7 @@
             entry = self.mapper.pop(task)
             if not priority:
-                priority = min(0, entry[0] - 1)
+                priority = min(0, entry[0] - 2)
             self.add_task(entry[2], priority)
ts-3-5/test_3-5_0-8_249.py ....                                          [100%]
============================== 4 passed in 0.14s ===============================

38 : Job ID 70bab8914a7f4f8aa667b429ad3e4f86
SURVIVED
test outcome: survived
priority_queue1.py, start pos: (31, 45), end pos: (31, 46)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -28,7 +28,7 @@
             entry = self.mapper.pop(task)
             if not priority:
-                priority = min(0, entry[0] - 1)
+                priority = min(0, entry[0] - 0)
             self.add_task(entry[2], priority)
ts-3-5/test_3-5_0-8_249.py ....                                          [100%]
============================== 4 passed in 0.14s ===============================
