39 : Job ID 398fc57b83124b348a142431cb3c4484
test outcome: killed
priority_queue1.py, start pos: (33, 32), end pos: (33, 33)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -30,7 +30,7 @@
             if not priority:
                 priority = min(0, entry[0] - 1)
-            self.add_task(entry[2], priority)
+            self.add_task(entry[ 3], priority)
     def pop_task(self):
         while self.pq:
ts-3-5/test_3-5_0-8_249.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_249.py::test_set_priority - IndexError: list index...
========================= 1 failed, 3 passed in 0.14s ==========================

40 : Job ID c3564d08a48d43928c1763189011e7c7
test outcome: killed
priority_queue1.py, start pos: (33, 32), end pos: (33, 33)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- apriority_queue1.py
+++ bpriority_queue1.py
@@ -30,7 +30,7 @@
             if not priority:
                 priority = min(0, entry[0] - 1)
-            self.add_task(entry[2], priority)
+            self.add_task(entry[ 1], priority)
     def pop_task(self):
         while self.pq:
ts-3-5/test_3-5_0-8_249.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-8_249.py::test_set_priority - KeyError: 'task1'
========================= 1 failed, 3 passed in 0.14s ==========================
