   - [#  37] SDL priority_queue1: 
--------------------------------------------------------------------------------
  33:             self.add_task(entry[2], priority)
  34:     
  35:     def pop_task(self):
  36:         while self.pq:
- 37:             (_, _, task) = heappop(self.pq)
+ 37:             pass
  38:             if task is not self.REMOVED:
  39:                 del self.mapper[task]
  40:                 return task
  41:         raise KeyError('Pop from empty priority queue.')
--------------------------------------------------------------------------------
[0.20279 s] killed by ts-3-5/test_3-5_0-9_288.py::test_pop_task

priority_queue = <priority_queue1.PriorityQueue object at 0x7a41d7accd60>

    def test_pop_task(priority_queue):
        priority_queue.add_task('Task1', 5)
>       task = priority_queue.pop_task()

ts-3-5/test_3-5_0-9_288.py:34: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue1.PriorityQueue object at 0x7a41d7accd60>

>   ???
E   NameError: name 'task' is not defined

priority_queue1:38: NameError

   - [#  38] SDL priority_queue1: 
--------------------------------------------------------------------------------
  36:         while self.pq:
  37:             (_, _, task) = heappop(self.pq)
  38:             if task is not self.REMOVED:
  39:                 del self.mapper[task]
- 40:                 return task
+ 40:                 pass
  41:         raise KeyError('Pop from empty priority queue.')
--------------------------------------------------------------------------------
[0.20733 s] killed by ts-3-5/test_3-5_0-9_288.py::test_pop_task

priority_queue = <priority_queue1.PriorityQueue object at 0x7a41d7b3cc40>

    def test_pop_task(priority_queue):
        priority_queue.add_task('Task1', 5)
>       task = priority_queue.pop_task()

ts-3-5/test_3-5_0-9_288.py:34: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue1.PriorityQueue object at 0x7a41d7b3cc40>

>   ???
E   KeyError: 'Task1'

priority_queue1:39: KeyError

   - [#  39] SVD priority_queue1: 
--------------------------------------------------------------------------------
  11:     def __init__(self):
  12:         pass
  13:     
  14:     def add_task(self, task, priority=0):
- 15:         if task in self.mapper:
+ 15:         if task in mapper:
  16:             self.remove_task(task)
  17:         count = next(self.counter)
  18:         entry = [priority, count, task]
  19:         self.mapper[task] = entry
--------------------------------------------------------------------------------
[0.20423 s] killed by ts-3-5/test_3-5_0-9_288.py::test_add_task

priority_queue = <priority_queue1.PriorityQueue object at 0x7a41d7c07ca0>

    def test_add_task(priority_queue):
>       priority_queue.add_task('Task1', 5)

ts-3-5/test_3-5_0-9_288.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue1.PriorityQueue object at 0x7a41d7c07ca0>, task = 'Task1'
priority = 5

>   ???
E   NameError: name 'mapper' is not defined

priority_queue1:15: NameError

   - [#  40] SVD priority_queue1: 
--------------------------------------------------------------------------------
  12:         pass
  13:     
  14:     def add_task(self, task, priority=0):
  15:         if task in self.mapper:
- 16:             self.remove_task(task)
+ 16:             remove_task(task)
  17:         count = next(self.counter)
  18:         entry = [priority, count, task]
  19:         self.mapper[task] = entry
  20:         heappush(self.pq, entry)
--------------------------------------------------------------------------------
[0.20519 s] killed by ts-3-5/test_3-5_0-9_288.py::test_remove_task

priority_queue = <priority_queue1.PriorityQueue object at 0x7a41d7b175b0>

    def test_remove_task(priority_queue):
>       priority_queue.add_task('Task1', 5)

ts-3-5/test_3-5_0-9_288.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue1.PriorityQueue object at 0x7a41d7b175b0>, task = 'Task1'
priority = 5

>   ???
E   NameError: name 'remove_task' is not defined

priority_queue1:16: NameError

   - [#  41] SVD priority_queue1: 
--------------------------------------------------------------------------------
  13:     
  14:     def add_task(self, task, priority=0):
  15:         if task in self.mapper:
  16:             self.remove_task(task)
- 17:         count = next(self.counter)
+ 17:         count = next(counter)
  18:         entry = [priority, count, task]
  19:         self.mapper[task] = entry
  20:         heappush(self.pq, entry)
  21:     
--------------------------------------------------------------------------------
[0.20148 s] killed by ts-3-5/test_3-5_0-9_288.py::test_add_task

priority_queue = <priority_queue1.PriorityQueue object at 0x7a41d7b16b90>

    def test_add_task(priority_queue):
>       priority_queue.add_task('Task1', 5)

ts-3-5/test_3-5_0-9_288.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue1.PriorityQueue object at 0x7a41d7b16b90>, task = 'Task1'
priority = 5

>   ???
E   NameError: name 'counter' is not defined

priority_queue1:17: NameError

   - [#  42] SVD priority_queue1: 
--------------------------------------------------------------------------------
  15:         if task in self.mapper:
  16:             self.remove_task(task)
  17:         count = next(self.counter)
  18:         entry = [priority, count, task]
- 19:         self.mapper[task] = entry
+ 19:         mapper[task] = entry
  20:         heappush(self.pq, entry)
  21:     
  22:     def remove_task(self, task):
  23:         entry = self.mapper.pop(task)
--------------------------------------------------------------------------------
[0.20206 s] killed by ts-3-5/test_3-5_0-9_288.py::test_add_task

priority_queue = <priority_queue1.PriorityQueue object at 0x7a41d7c3c0a0>

    def test_add_task(priority_queue):
>       priority_queue.add_task('Task1', 5)

ts-3-5/test_3-5_0-9_288.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue1.PriorityQueue object at 0x7a41d7c3c0a0>, task = 'Task1'
priority = 5

>   ???
E   NameError: name 'mapper' is not defined

priority_queue1:19: NameError

   - [#  43] SVD priority_queue1: 
--------------------------------------------------------------------------------
  16:             self.remove_task(task)
  17:         count = next(self.counter)
  18:         entry = [priority, count, task]
  19:         self.mapper[task] = entry
- 20:         heappush(self.pq, entry)
+ 20:         heappush(pq, entry)
  21:     
  22:     def remove_task(self, task):
  23:         entry = self.mapper.pop(task)
  24:         entry[-1] = self.REMOVED
--------------------------------------------------------------------------------
[0.20177 s] killed by ts-3-5/test_3-5_0-9_288.py::test_add_task

priority_queue = <priority_queue1.PriorityQueue object at 0x7a41d7b48e20>

    def test_add_task(priority_queue):
>       priority_queue.add_task('Task1', 5)

ts-3-5/test_3-5_0-9_288.py:19: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue1.PriorityQueue object at 0x7a41d7b48e20>, task = 'Task1'
priority = 5

>   ???
E   NameError: name 'pq' is not defined

priority_queue1:20: NameError

   - [#  44] SVD priority_queue1: 
--------------------------------------------------------------------------------
  19:         self.mapper[task] = entry
  20:         heappush(self.pq, entry)
  21:     
  22:     def remove_task(self, task):
- 23:         entry = self.mapper.pop(task)
+ 23:         entry = mapper.pop(task)
  24:         entry[-1] = self.REMOVED
  25:     
  26:     def set_priority(self, task, priority=None):
  27:         if task in self.mapper:
--------------------------------------------------------------------------------
[0.19933 s] killed by ts-3-5/test_3-5_0-9_288.py::test_remove_task

priority_queue = <priority_queue1.PriorityQueue object at 0x7a41d7c05bd0>

    def test_remove_task(priority_queue):
>       priority_queue.add_task('Task1', 5)

ts-3-5/test_3-5_0-9_288.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
priority_queue1:16: in add_task
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue1.PriorityQueue object at 0x7a41d7c05bd0>, task = 'Task1'

>   ???
E   NameError: name 'mapper' is not defined

priority_queue1:23: NameError

   - [#  45] SVD priority_queue1: 
--------------------------------------------------------------------------------
  20:         heappush(self.pq, entry)
  21:     
  22:     def remove_task(self, task):
  23:         entry = self.mapper.pop(task)
- 24:         entry[-1] = self.REMOVED
+ 24:         entry[-1] = REMOVED
  25:     
  26:     def set_priority(self, task, priority=None):
  27:         if task in self.mapper:
  28:             entry = self.mapper.pop(task)
--------------------------------------------------------------------------------
[0.20269 s] killed by ts-3-5/test_3-5_0-9_288.py::test_remove_task

priority_queue = <priority_queue1.PriorityQueue object at 0x7a41d7d64b20>

    def test_remove_task(priority_queue):
>       priority_queue.add_task('Task1', 5)

ts-3-5/test_3-5_0-9_288.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
priority_queue1:16: in add_task
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue1.PriorityQueue object at 0x7a41d7d64b20>, task = 'Task1'

>   ???
E   NameError: name 'REMOVED' is not defined

priority_queue1:24: NameError

   - [#  46] SVD priority_queue1: 
--------------------------------------------------------------------------------
  23:         entry = self.mapper.pop(task)
  24:         entry[-1] = self.REMOVED
  25:     
  26:     def set_priority(self, task, priority=None):
- 27:         if task in self.mapper:
+ 27:         if task in mapper:
  28:             entry = self.mapper.pop(task)
  29:             
  30:             if not priority:
  31:                 priority = min(0, entry[0] - 1)
--------------------------------------------------------------------------------
[0.20561 s] killed by ts-3-5/test_3-5_0-9_288.py::test_set_priority

priority_queue = <priority_queue1.PriorityQueue object at 0x7a41d7c07a30>

    def test_set_priority(priority_queue):
        priority_queue.add_task('Task1', 5)
>       priority_queue.set_priority('Task1', 10)

ts-3-5/test_3-5_0-9_288.py:29: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue1.PriorityQueue object at 0x7a41d7c07a30>, task = 'Task1'
priority = 10

>   ???
E   NameError: name 'mapper' is not defined

priority_queue1:27: NameError

   - [#  47] SVD priority_queue1: 
--------------------------------------------------------------------------------
  24:         entry[-1] = self.REMOVED
  25:     
  26:     def set_priority(self, task, priority=None):
  27:         if task in self.mapper:
- 28:             entry = self.mapper.pop(task)
+ 28:             entry = mapper.pop(task)
  29:             
  30:             if not priority:
  31:                 priority = min(0, entry[0] - 1)
  32:             
--------------------------------------------------------------------------------
[0.20449 s] killed by ts-3-5/test_3-5_0-9_288.py::test_set_priority

priority_queue = <priority_queue1.PriorityQueue object at 0x7a41d7998880>

    def test_set_priority(priority_queue):
        priority_queue.add_task('Task1', 5)
>       priority_queue.set_priority('Task1', 10)

ts-3-5/test_3-5_0-9_288.py:29: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue1.PriorityQueue object at 0x7a41d7998880>, task = 'Task1'
priority = 10

>   ???
E   NameError: name 'mapper' is not defined

priority_queue1:28: NameError

   - [#  48] SVD priority_queue1: 
--------------------------------------------------------------------------------
  29:             
  30:             if not priority:
  31:                 priority = min(0, entry[0] - 1)
  32:             
- 33:             self.add_task(entry[2], priority)
+ 33:             add_task(entry[2], priority)
  34:     
  35:     def pop_task(self):
  36:         while self.pq:
  37:             (_, _, task) = heappop(self.pq)
--------------------------------------------------------------------------------
[0.22105 s] killed by ts-3-5/test_3-5_0-9_288.py::test_set_priority

priority_queue = <priority_queue1.PriorityQueue object at 0x7a41d7b61b40>

    def test_set_priority(priority_queue):
        priority_queue.add_task('Task1', 5)
>       priority_queue.set_priority('Task1', 10)

ts-3-5/test_3-5_0-9_288.py:29: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue1.PriorityQueue object at 0x7a41d7b61b40>, task = 'Task1'
priority = 10

>   ???
E   NameError: name 'add_task' is not defined

priority_queue1:33: NameError

   - [#  49] SVD priority_queue1: 
--------------------------------------------------------------------------------
  32:             
  33:             self.add_task(entry[2], priority)
  34:     
  35:     def pop_task(self):
- 36:         while self.pq:
+ 36:         while pq:
  37:             (_, _, task) = heappop(self.pq)
  38:             if task is not self.REMOVED:
  39:                 del self.mapper[task]
  40:                 return task
--------------------------------------------------------------------------------
[0.20191 s] killed by ts-3-5/test_3-5_0-9_288.py::test_pop_task

priority_queue = <priority_queue1.PriorityQueue object at 0x7a41d7b15030>

    def test_pop_task(priority_queue):
        priority_queue.add_task('Task1', 5)
>       task = priority_queue.pop_task()

ts-3-5/test_3-5_0-9_288.py:34: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue1.PriorityQueue object at 0x7a41d7b15030>

>   ???
E   NameError: name 'pq' is not defined

priority_queue1:36: NameError

   - [#  50] SVD priority_queue1: 
--------------------------------------------------------------------------------
  33:             self.add_task(entry[2], priority)
  34:     
  35:     def pop_task(self):
  36:         while self.pq:
- 37:             (_, _, task) = heappop(self.pq)
+ 37:             (_, _, task) = heappop(pq)
  38:             if task is not self.REMOVED:
  39:                 del self.mapper[task]
  40:                 return task
  41:         raise KeyError('Pop from empty priority queue.')
--------------------------------------------------------------------------------
[0.19891 s] killed by ts-3-5/test_3-5_0-9_288.py::test_pop_task

priority_queue = <priority_queue1.PriorityQueue object at 0x7a41d7b14130>

    def test_pop_task(priority_queue):
        priority_queue.add_task('Task1', 5)
>       task = priority_queue.pop_task()

ts-3-5/test_3-5_0-9_288.py:34: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue1.PriorityQueue object at 0x7a41d7b14130>

>   ???
E   NameError: name 'pq' is not defined

priority_queue1:37: NameError

   - [#  51] SVD priority_queue1: 
--------------------------------------------------------------------------------
  34:     
  35:     def pop_task(self):
  36:         while self.pq:
  37:             (_, _, task) = heappop(self.pq)
- 38:             if task is not self.REMOVED:
+ 38:             if task is not REMOVED:
  39:                 del self.mapper[task]
  40:                 return task
  41:         raise KeyError('Pop from empty priority queue.')
--------------------------------------------------------------------------------
[0.20146 s] killed by ts-3-5/test_3-5_0-9_288.py::test_pop_task

priority_queue = <priority_queue1.PriorityQueue object at 0x7a41d7ca3f10>

    def test_pop_task(priority_queue):
        priority_queue.add_task('Task1', 5)
>       task = priority_queue.pop_task()

ts-3-5/test_3-5_0-9_288.py:34: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue1.PriorityQueue object at 0x7a41d7ca3f10>

>   ???
E   NameError: name 'REMOVED' is not defined

priority_queue1:38: NameError

   - [#  52] SVD priority_queue1: 
--------------------------------------------------------------------------------
  35:     def pop_task(self):
  36:         while self.pq:
  37:             (_, _, task) = heappop(self.pq)
  38:             if task is not self.REMOVED:
- 39:                 del self.mapper[task]
+ 39:                 del mapper[task]
  40:                 return task
  41:         raise KeyError('Pop from empty priority queue.')
--------------------------------------------------------------------------------
[0.20303 s] killed by ts-3-5/test_3-5_0-9_288.py::test_pop_task

priority_queue = <priority_queue1.PriorityQueue object at 0x7a41d7cf6ef0>

    def test_pop_task(priority_queue):
        priority_queue.add_task('Task1', 5)
>       task = priority_queue.pop_task()

ts-3-5/test_3-5_0-9_288.py:34: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue1.PriorityQueue object at 0x7a41d7cf6ef0>

>   ???
E   NameError: name 'mapper' is not defined

priority_queue1:39: NameError

   - [#  53] ZIL priority_queue1: 
--------------------------------------------------------------------------------
  33:             self.add_task(entry[2], priority)
  34:     
  35:     def pop_task(self):
  36:         while self.pq:
- 37:             (_, _, task) = heappop(self.pq)
- 38:             if task is not self.REMOVED:
- 39:                 del self.mapper[task]
- 40:                 return task
+ 37:             break
+ 38:         
+ 39:         
+ 40:         
  41:         raise KeyError('Pop from empty priority queue.')
--------------------------------------------------------------------------------
[0.19865 s] killed by ts-3-5/test_3-5_0-9_288.py::test_pop_task

priority_queue = <priority_queue1.PriorityQueue object at 0x7a41d7acf130>

    def test_pop_task(priority_queue):
        priority_queue.add_task('Task1', 5)
>       task = priority_queue.pop_task()

ts-3-5/test_3-5_0-9_288.py:34: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue1.PriorityQueue object at 0x7a41d7acf130>

>   ???
E   KeyError: 'Pop from empty priority queue.'

priority_queue1:41: KeyError
