1 : Job ID b92b0d39e9114b1099fb62d9407e4844
test outcome: killed
priority_queue2.py, start pos: (30, 11), end pos: (30, 14)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 0
--- mutation diff ---
--- apriority_queue2.py
+++ bpriority_queue2.py
@@ -27,7 +27,7 @@
     def pop(self):
         """Remove the most important item from the queue."""
         to_return = self._container.container[1][1]
-        if not to_return:
+        if  to_return:
             raise(IndexError, 'Can\'t pop from an empty queue.')
         self._container.pop()
         return to_return
ts-3-5/test_3-5_0-9_286.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_286.py::test_insert_and_pop - TypeError: exception...
========================= 1 failed, 3 passed in 0.10s ==========================

2 : Job ID 44871b8c368d46c495cf7559fb6c689c
test outcome: killed
priority_queue2.py, start pos: (30, 11), end pos: (30, 24)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- apriority_queue2.py
+++ bpriority_queue2.py
@@ -27,7 +27,7 @@
     def pop(self):
         """Remove the most important item from the queue."""
         to_return = self._container.container[1][1]
-        if not to_return:
+        if not not to_return:
             raise(IndexError, 'Can\'t pop from an empty queue.')
         self._container.pop()
         return to_return
ts-3-5/test_3-5_0-9_286.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_286.py::test_insert_and_pop - TypeError: exception...
========================= 1 failed, 3 passed in 0.10s ==========================

3 : Job ID c2537523dc314f658a8432944213d0d0
test outcome: killed
priority_queue2.py, start pos: (39, 15), end pos: (39, 25)
operator: core/ExceptionReplacer, occurrence: 0
--- mutation diff ---
--- apriority_queue2.py
+++ bpriority_queue2.py
@@ -36,6 +36,6 @@
         """Return the most important item without removing it."""
         try:
             return self._container.container[1][1]
-        except IndexError:
+        except CosmicRayTestingException:
             return None
ts-3-5/test_3-5_0-9_286.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_286.py::test_insert_and_pop - NameError: name 'Cos...
========================= 1 failed, 3 passed in 0.10s ==========================

4 : Job ID dfbf9c6be2f444ad8d70623587572cb6
SURVIVED
test outcome: survived
priority_queue2.py, start pos: (23, 35), end pos: (23, 36)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- apriority_queue2.py
+++ bpriority_queue2.py
@@ -20,7 +20,7 @@
         """Initialize priorityq."""
         self._container = Binheap()
-    def insert(self, val, priority=0):
+    def insert(self, val, priority= 1):
         """Insert a val into the queue with an argument for the priority."""
         self._container.push((priority, val))
ts-3-5/test_3-5_0-9_286.py ....                                          [100%]
============================== 4 passed in 0.10s ===============================

5 : Job ID e3979a52638f4dc0b6edaf2dae83a4bd
SURVIVED
test outcome: survived
priority_queue2.py, start pos: (23, 35), end pos: (23, 36)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- apriority_queue2.py
+++ bpriority_queue2.py
@@ -20,7 +20,7 @@
         """Initialize priorityq."""
         self._container = Binheap()
-    def insert(self, val, priority=0):
+    def insert(self, val, priority= -1):
         """Insert a val into the queue with an argument for the priority."""
         self._container.push((priority, val))
ts-3-5/test_3-5_0-9_286.py ....                                          [100%]
============================== 4 passed in 0.10s ===============================

6 : Job ID dbb4ebe429034ae18cc5acaf1e7a3da2
test outcome: killed
priority_queue2.py, start pos: (29, 46), end pos: (29, 47)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- apriority_queue2.py
+++ bpriority_queue2.py
@@ -26,7 +26,7 @@
     def pop(self):
         """Remove the most important item from the queue."""
-        to_return = self._container.container[1][1]
+        to_return = self._container.container[ 2][1]
         if not to_return:
             raise(IndexError, 'Can\'t pop from an empty queue.')
         self._container.pop()
ts-3-5/test_3-5_0-9_286.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_286.py::test_insert_and_pop - AssertionError: asse...
========================= 1 failed, 3 passed in 0.09s ==========================

7 : Job ID 08d5902af23e4a029b949b5adb0e715f
test outcome: killed
priority_queue2.py, start pos: (29, 46), end pos: (29, 47)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- apriority_queue2.py
+++ bpriority_queue2.py
@@ -26,7 +26,7 @@
     def pop(self):
         """Remove the most important item from the queue."""
-        to_return = self._container.container[1][1]
+        to_return = self._container.container[ 0][1]
         if not to_return:
             raise(IndexError, 'Can\'t pop from an empty queue.')
         self._container.pop()
ts-3-5/test_3-5_0-9_286.py .FF.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_286.py::test_pop_from_empty_queue - TypeError: 'No...
FAILED ts-3-5/test_3-5_0-9_286.py::test_insert_and_pop - TypeError: 'NoneType...
========================= 2 failed, 2 passed in 0.10s ==========================

8 : Job ID bdfb657ff6a84f0abb6111ad9fa9f58e
test outcome: killed
priority_queue2.py, start pos: (29, 49), end pos: (29, 50)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- apriority_queue2.py
+++ bpriority_queue2.py
@@ -26,7 +26,7 @@
     def pop(self):
         """Remove the most important item from the queue."""
-        to_return = self._container.container[1][1]
+        to_return = self._container.container[1][ 2]
         if not to_return:
             raise(IndexError, 'Can\'t pop from an empty queue.')
         self._container.pop()
ts-3-5/test_3-5_0-9_286.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_286.py::test_insert_and_pop - IndexError: tuple in...
========================= 1 failed, 3 passed in 0.10s ==========================

9 : Job ID 5d886eda95f44bb3aba447414f328a75
test outcome: killed
priority_queue2.py, start pos: (29, 49), end pos: (29, 50)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- apriority_queue2.py
+++ bpriority_queue2.py
@@ -26,7 +26,7 @@
     def pop(self):
         """Remove the most important item from the queue."""
-        to_return = self._container.container[1][1]
+        to_return = self._container.container[1][ 0]
         if not to_return:
             raise(IndexError, 'Can\'t pop from an empty queue.')
         self._container.pop()
ts-3-5/test_3-5_0-9_286.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_286.py::test_insert_and_pop - AssertionError: asse...
========================= 1 failed, 3 passed in 0.10s ==========================

10 : Job ID 3f41fd9e5fcc4ff98229fd9db7c56fcf
test outcome: killed
priority_queue2.py, start pos: (38, 45), end pos: (38, 46)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- apriority_queue2.py
+++ bpriority_queue2.py
@@ -35,7 +35,7 @@
     def peek(self):
         """Return the most important item without removing it."""
         try:
-            return self._container.container[1][1]
+            return self._container.container[ 2][1]
         except IndexError:
             return None
ts-3-5/test_3-5_0-9_286.py F..F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_286.py::test_insert_and_peek - AssertionError: ass...
FAILED ts-3-5/test_3-5_0-9_286.py::test_insert_with_default_priority - Assert...
========================= 2 failed, 2 passed in 0.10s ==========================

11 : Job ID cde3ce0148374643bdfd9d3ef7f99968
test outcome: killed
priority_queue2.py, start pos: (38, 45), end pos: (38, 46)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- apriority_queue2.py
+++ bpriority_queue2.py
@@ -35,7 +35,7 @@
     def peek(self):
         """Return the most important item without removing it."""
         try:
-            return self._container.container[1][1]
+            return self._container.container[ 0][1]
         except IndexError:
             return None
ts-3-5/test_3-5_0-9_286.py F.FF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_286.py::test_insert_and_peek - TypeError: 'NoneTyp...
FAILED ts-3-5/test_3-5_0-9_286.py::test_insert_and_pop - TypeError: 'NoneType...
FAILED ts-3-5/test_3-5_0-9_286.py::test_insert_with_default_priority - TypeEr...
========================= 3 failed, 1 passed in 0.10s ==========================

12 : Job ID ba6a0e18598b432cbb370ca87a4c35c4
test outcome: killed
priority_queue2.py, start pos: (38, 48), end pos: (38, 49)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- apriority_queue2.py
+++ bpriority_queue2.py
@@ -35,7 +35,7 @@
     def peek(self):
         """Return the most important item without removing it."""
         try:
-            return self._container.container[1][1]
+            return self._container.container[1][ 2]
         except IndexError:
             return None
ts-3-5/test_3-5_0-9_286.py F..F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_286.py::test_insert_and_peek - AssertionError: ass...
FAILED ts-3-5/test_3-5_0-9_286.py::test_insert_with_default_priority - Assert...
========================= 2 failed, 2 passed in 0.10s ==========================

13 : Job ID b78f9396cd1b4cf6881ef1c229f4706f
test outcome: killed
priority_queue2.py, start pos: (38, 48), end pos: (38, 49)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- apriority_queue2.py
+++ bpriority_queue2.py
@@ -35,7 +35,7 @@
     def peek(self):
         """Return the most important item without removing it."""
         try:
-            return self._container.container[1][1]
+            return self._container.container[1][ 0]
         except IndexError:
             return None
ts-3-5/test_3-5_0-9_286.py F..F                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_286.py::test_insert_and_peek - AssertionError: ass...
FAILED ts-3-5/test_3-5_0-9_286.py::test_insert_with_default_priority - Assert...
========================= 2 failed, 2 passed in 0.09s ==========================
