   - [#   1] CDI priority_queue2: 
--------------------------------------------------------------------------------
  15:     and returns its value.
  16:     peek(): returns the most important item without removing it from the queue.
  17:     """
  18:     
- 19:     def __init__(self):
- 20:         '''Initialize priorityq.'''
- 21:         self._container = Binheap()
- 22:     
+ 19:     @classmethod
+ 20:     def __init__(self):
+ 21:         '''Initialize priorityq.'''
+ 22:         self._container = Binheap()
  23:     def insert(self, val, priority=0):
  24:         '''Insert a val into the queue with an argument for the priority.'''
  25:         self._container.push((priority, val))
  26:     
--------------------------------------------------------------------------------
[0.12115 s] survived

   - [#   2] CDI priority_queue2: 
--------------------------------------------------------------------------------
  19:     def __init__(self):
  20:         '''Initialize priorityq.'''
  21:         self._container = Binheap()
  22:     
- 23:     def insert(self, val, priority=0):
- 24:         '''Insert a val into the queue with an argument for the priority.'''
- 25:         self._container.push((priority, val))
- 26:     
+ 23:     @classmethod
+ 24:     def insert(self, val, priority=0):
+ 25:         '''Insert a val into the queue with an argument for the priority.'''
+ 26:         self._container.push((priority, val))
  27:     def pop(self):
  28:         '''Remove the most important item from the queue.'''
  29:         to_return = self._container.container[1][1]
  30:         if not to_return:
--------------------------------------------------------------------------------
[0.15461 s] killed by ts-3-5/test_3-5_0-3_101.py::test_insert

priorityq = <priority_queue2.PriorityQ object at 0x74e0326caaa0>

    def test_insert(priorityq):
>       priorityq.insert(5, 2)

ts-3-5/test_3-5_0-3_101.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'priority_queue2.PriorityQ'>, val = 5, priority = 2

>   ???
E   AttributeError: type object 'PriorityQ' has no attribute '_container'

priority_queue2:26: AttributeError

   - [#   3] CDI priority_queue2: 
--------------------------------------------------------------------------------
  23:     def insert(self, val, priority=0):
  24:         '''Insert a val into the queue with an argument for the priority.'''
  25:         self._container.push((priority, val))
  26:     
- 27:     def pop(self):
- 28:         '''Remove the most important item from the queue.'''
- 29:         to_return = self._container.container[1][1]
- 30:         if not to_return:
- 31:             raise (IndexError, "Can't pop from an empty queue.")
- 32:         self._container.pop()
- 33:         return to_return
- 34:     
+ 27:     @classmethod
+ 28:     def pop(self):
+ 29:         '''Remove the most important item from the queue.'''
+ 30:         to_return = self._container.container[1][1]
+ 31:         if not to_return:
+ 32:             raise (IndexError, "Can't pop from an empty queue.")
+ 33:         self._container.pop()
+ 34:         return to_return
  35:     def peek(self):
  36:         '''Return the most important item without removing it.'''
  37:         try:
  38:             return self._container.container[1][1]
--------------------------------------------------------------------------------
[0.16068 s] killed by ts-3-5/test_3-5_0-3_101.py::test_pop

priorityq = <priority_queue2.PriorityQ object at 0x74e0326ca680>

    def test_pop(priorityq):
        priorityq.insert(10, 1)
        priorityq.insert(20, 2)
>       assert priorityq.pop() == 20

ts-3-5/test_3-5_0-3_101.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'priority_queue2.PriorityQ'>

>   ???
E   AttributeError: type object 'PriorityQ' has no attribute '_container'

priority_queue2:30: AttributeError

   - [#   4] CDI priority_queue2: 
--------------------------------------------------------------------------------
  31:             raise (IndexError, "Can't pop from an empty queue.")
  32:         self._container.pop()
  33:         return to_return
  34:     
- 35:     def peek(self):
- 36:         '''Return the most important item without removing it.'''
- 37:         try:
- 38:             return self._container.container[1][1]
- 39:         except IndexError:
- 40:             return None
+ 35:     @classmethod
+ 36:     def peek(self):
+ 37:         '''Return the most important item without removing it.'''
+ 38:         try:
+ 39:             return self._container.container[1][1]
+ 40:         except IndexError:
+ 41:             return None
--------------------------------------------------------------------------------
[0.16141 s] killed by ts-3-5/test_3-5_0-3_101.py::test_insert

priorityq = <priority_queue2.PriorityQ object at 0x74e032706e90>

    def test_insert(priorityq):
        priorityq.insert(5, 2)
>       assert priorityq.peek() == 5

ts-3-5/test_3-5_0-3_101.py:18: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'priority_queue2.PriorityQ'>

>   ???
E   AttributeError: type object 'PriorityQ' has no attribute '_container'

priority_queue2:39: AttributeError

   - [#   7] EHD priority_queue2: 
--------------------------------------------------------------------------------
  36:         '''Return the most important item without removing it.'''
  37:         try:
  38:             return self._container.container[1][1]
  39:         except IndexError:
- 40:             return None
+ 40:             raise
--------------------------------------------------------------------------------
[0.15199 s] killed by ts-3-5/test_3-5_0-3_101.py::test_peek_empty

priorityq = <priority_queue2.PriorityQ object at 0x74e032707ca0>

    def test_peek_empty(priorityq):
>       assert priorityq.peek() is None

ts-3-5/test_3-5_0-3_101.py:26: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue2.PriorityQ object at 0x74e032707ca0>

>   ???
E   IndexError: list index out of range

priority_queue2:38: IndexError

   - [#   8] EXS priority_queue2: 
--------------------------------------------------------------------------------
  36:         '''Return the most important item without removing it.'''
  37:         try:
  38:             return self._container.container[1][1]
  39:         except IndexError:
- 40:             return None
+ 40:             pass
--------------------------------------------------------------------------------
[0.14856 s] survived

   - [#  10] SDI priority_queue2: 
--------------------------------------------------------------------------------
  19:     def __init__(self):
  20:         '''Initialize priorityq.'''
  21:         self._container = Binheap()
  22:     
- 23:     def insert(self, val, priority=0):
- 24:         '''Insert a val into the queue with an argument for the priority.'''
- 25:         self._container.push((priority, val))
- 26:     
+ 23:     @staticmethod
+ 24:     def insert(self, val, priority=0):
+ 25:         '''Insert a val into the queue with an argument for the priority.'''
+ 26:         self._container.push((priority, val))
  27:     def pop(self):
  28:         '''Remove the most important item from the queue.'''
  29:         to_return = self._container.container[1][1]
  30:         if not to_return:
--------------------------------------------------------------------------------
[0.15530 s] killed by ts-3-5/test_3-5_0-3_101.py::test_insert

priorityq = <priority_queue2.PriorityQ object at 0x74e0327289a0>

    def test_insert(priorityq):
>       priorityq.insert(5, 2)

ts-3-5/test_3-5_0-3_101.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = 5, val = 2, priority = 0

>   ???
E   AttributeError: 'int' object has no attribute '_container'

priority_queue2:26: AttributeError

   - [#  13] SDL priority_queue2: 
--------------------------------------------------------------------------------
  17:     """
  18:     
  19:     def __init__(self):
  20:         '''Initialize priorityq.'''
- 21:         self._container = Binheap()
+ 21:         pass
  22:     
  23:     def insert(self, val, priority=0):
  24:         '''Insert a val into the queue with an argument for the priority.'''
  25:         self._container.push((priority, val))
--------------------------------------------------------------------------------
[0.14564 s] killed by ts-3-5/test_3-5_0-3_101.py::test_insert

priorityq = <priority_queue2.PriorityQ object at 0x74e03278eb30>

    def test_insert(priorityq):
>       priorityq.insert(5, 2)

ts-3-5/test_3-5_0-3_101.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue2.PriorityQ object at 0x74e03278eb30>, val = 5
priority = 2

>   ???
E   AttributeError: 'PriorityQ' object has no attribute '_container'

priority_queue2:25: AttributeError

   - [#  14] SDL priority_queue2: 
--------------------------------------------------------------------------------
  21:         self._container = Binheap()
  22:     
  23:     def insert(self, val, priority=0):
  24:         '''Insert a val into the queue with an argument for the priority.'''
- 25:         self._container.push((priority, val))
+ 25:         pass
  26:     
  27:     def pop(self):
  28:         '''Remove the most important item from the queue.'''
  29:         to_return = self._container.container[1][1]
--------------------------------------------------------------------------------
[0.14969 s] killed by ts-3-5/test_3-5_0-3_101.py::test_insert

priorityq = <priority_queue2.PriorityQ object at 0x74e03285b1f0>

    def test_insert(priorityq):
        priorityq.insert(5, 2)
>       assert priorityq.peek() == 5
E       AssertionError

ts-3-5/test_3-5_0-3_101.py:18: AssertionError

   - [#  15] SDL priority_queue2: 
--------------------------------------------------------------------------------
  25:         self._container.push((priority, val))
  26:     
  27:     def pop(self):
  28:         '''Remove the most important item from the queue.'''
- 29:         to_return = self._container.container[1][1]
+ 29:         pass
  30:         if not to_return:
  31:             raise (IndexError, "Can't pop from an empty queue.")
  32:         self._container.pop()
  33:         return to_return
--------------------------------------------------------------------------------
[0.15229 s] killed by ts-3-5/test_3-5_0-3_101.py::test_pop

priorityq = <priority_queue2.PriorityQ object at 0x74e0327076d0>

    def test_pop(priorityq):
        priorityq.insert(10, 1)
        priorityq.insert(20, 2)
>       assert priorityq.pop() == 20

ts-3-5/test_3-5_0-3_101.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue2.PriorityQ object at 0x74e0327076d0>

>   ???
E   NameError: name 'to_return' is not defined

priority_queue2:30: NameError

   - [#  16] SDL priority_queue2: 
--------------------------------------------------------------------------------
  28:         '''Remove the most important item from the queue.'''
  29:         to_return = self._container.container[1][1]
  30:         if not to_return:
  31:             raise (IndexError, "Can't pop from an empty queue.")
- 32:         self._container.pop()
+ 32:         pass
  33:         return to_return
  34:     
  35:     def peek(self):
  36:         '''Return the most important item without removing it.'''
--------------------------------------------------------------------------------
[0.15031 s] killed by ts-3-5/test_3-5_0-3_101.py::test_pop_all

priorityq = <priority_queue2.PriorityQ object at 0x74e0326ef460>

    def test_pop_all(priorityq):
        priorityq.insert(5, 2)
        priorityq.insert(10, 1)
        priorityq.insert(15, 3)
        assert priorityq.pop() == 15
>       assert priorityq.pop() == 5
E       AssertionError

ts-3-5/test_3-5_0-3_101.py:43: AssertionError

   - [#  17] SDL priority_queue2: 
--------------------------------------------------------------------------------
  29:         to_return = self._container.container[1][1]
  30:         if not to_return:
  31:             raise (IndexError, "Can't pop from an empty queue.")
  32:         self._container.pop()
- 33:         return to_return
+ 33:         pass
  34:     
  35:     def peek(self):
  36:         '''Return the most important item without removing it.'''
  37:         try:
--------------------------------------------------------------------------------
[0.14985 s] killed by ts-3-5/test_3-5_0-3_101.py::test_pop

priorityq = <priority_queue2.PriorityQ object at 0x74e032614370>

    def test_pop(priorityq):
        priorityq.insert(10, 1)
        priorityq.insert(20, 2)
>       assert priorityq.pop() == 20
E       AssertionError

ts-3-5/test_3-5_0-3_101.py:23: AssertionError

   - [#  18] SDL priority_queue2: 
--------------------------------------------------------------------------------
  34:     
  35:     def peek(self):
  36:         '''Return the most important item without removing it.'''
  37:         try:
- 38:             return self._container.container[1][1]
+ 38:             pass
  39:         except IndexError:
  40:             return None
--------------------------------------------------------------------------------
[0.15035 s] killed by ts-3-5/test_3-5_0-3_101.py::test_insert

priorityq = <priority_queue2.PriorityQ object at 0x74e0327cfac0>

    def test_insert(priorityq):
        priorityq.insert(5, 2)
>       assert priorityq.peek() == 5
E       AssertionError

ts-3-5/test_3-5_0-3_101.py:18: AssertionError

   - [#  21] SVD priority_queue2: 
--------------------------------------------------------------------------------
  21:         self._container = Binheap()
  22:     
  23:     def insert(self, val, priority=0):
  24:         '''Insert a val into the queue with an argument for the priority.'''
- 25:         self._container.push((priority, val))
+ 25:         _container.push((priority, val))
  26:     
  27:     def pop(self):
  28:         '''Remove the most important item from the queue.'''
  29:         to_return = self._container.container[1][1]
--------------------------------------------------------------------------------
[0.14943 s] killed by ts-3-5/test_3-5_0-3_101.py::test_insert

priorityq = <priority_queue2.PriorityQ object at 0x74e032614c70>

    def test_insert(priorityq):
>       priorityq.insert(5, 2)

ts-3-5/test_3-5_0-3_101.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue2.PriorityQ object at 0x74e032614c70>, val = 5
priority = 2

>   ???
E   NameError: name '_container' is not defined

priority_queue2:25: NameError

   - [#  22] SVD priority_queue2: 
--------------------------------------------------------------------------------
  25:         self._container.push((priority, val))
  26:     
  27:     def pop(self):
  28:         '''Remove the most important item from the queue.'''
- 29:         to_return = self._container.container[1][1]
+ 29:         to_return = _container.container[1][1]
  30:         if not to_return:
  31:             raise (IndexError, "Can't pop from an empty queue.")
  32:         self._container.pop()
  33:         return to_return
--------------------------------------------------------------------------------
[0.15095 s] killed by ts-3-5/test_3-5_0-3_101.py::test_pop

priorityq = <priority_queue2.PriorityQ object at 0x74e032608e20>

    def test_pop(priorityq):
        priorityq.insert(10, 1)
        priorityq.insert(20, 2)
>       assert priorityq.pop() == 20

ts-3-5/test_3-5_0-3_101.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue2.PriorityQ object at 0x74e032608e20>

>   ???
E   NameError: name '_container' is not defined

priority_queue2:29: NameError

   - [#  23] SVD priority_queue2: 
--------------------------------------------------------------------------------
  28:         '''Remove the most important item from the queue.'''
  29:         to_return = self._container.container[1][1]
  30:         if not to_return:
  31:             raise (IndexError, "Can't pop from an empty queue.")
- 32:         self._container.pop()
+ 32:         _container.pop()
  33:         return to_return
  34:     
  35:     def peek(self):
  36:         '''Return the most important item without removing it.'''
--------------------------------------------------------------------------------
[0.15812 s] killed by ts-3-5/test_3-5_0-3_101.py::test_pop

priorityq = <priority_queue2.PriorityQ object at 0x74e0327b5f00>

    def test_pop(priorityq):
        priorityq.insert(10, 1)
        priorityq.insert(20, 2)
>       assert priorityq.pop() == 20

ts-3-5/test_3-5_0-3_101.py:23: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue2.PriorityQ object at 0x74e0327b5f00>

>   ???
E   NameError: name '_container' is not defined

priority_queue2:32: NameError

   - [#  24] SVD priority_queue2: 
--------------------------------------------------------------------------------
  34:     
  35:     def peek(self):
  36:         '''Return the most important item without removing it.'''
  37:         try:
- 38:             return self._container.container[1][1]
+ 38:             return _container.container[1][1]
  39:         except IndexError:
  40:             return None
--------------------------------------------------------------------------------
[0.14368 s] killed by ts-3-5/test_3-5_0-3_101.py::test_insert

priorityq = <priority_queue2.PriorityQ object at 0x74e0325fcdc0>

    def test_insert(priorityq):
        priorityq.insert(5, 2)
>       assert priorityq.peek() == 5

ts-3-5/test_3-5_0-3_101.py:18: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <priority_queue2.PriorityQ object at 0x74e0325fcdc0>

>   ???
E   NameError: name '_container' is not defined

priority_queue2:38: NameError
