1 : Job ID 6dfeaa93212446f29361e31016189b5b
test outcome: killed
quicksort.py, start pos: (24, 37), end pos: (24, 38)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -21,7 +21,7 @@
             partition_index = partition(ar, lo, hi)
             # sort both sides
             sort(ar, lo, partition_index - 1)
-            sort(ar, partition_index + 1, hi)
+            sort(ar, partition_index - 1, hi)
     def partition(ar, lo, hi):
         # basic partition by using the high value as a pivot
ts-3-5/test_3-5_0-0_8.py .FFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - RecursionE...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - RecursionError: ...
========================= 6 failed, 2 passed in 0.14s ==========================

2 : Job ID 661da60687c64c1c9a54539748c21fc0
SURVIVED
test outcome: survived
quicksort.py, start pos: (24, 37), end pos: (24, 38)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -21,7 +21,7 @@
             partition_index = partition(ar, lo, hi)
             # sort both sides
             sort(ar, lo, partition_index - 1)
-            sort(ar, partition_index + 1, hi)
+            sort(ar, partition_index * 1, hi)
     def partition(ar, lo, hi):
         # basic partition by using the high value as a pivot
ts-3-5/test_3-5_0-0_8.py ........                                        [100%]
============================== 8 passed in 0.15s ===============================

3 : Job ID c3fad9d803e34f3a8c40d363b01a664d
test outcome: killed
quicksort.py, start pos: (24, 37), end pos: (24, 38)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -21,7 +21,7 @@
             partition_index = partition(ar, lo, hi)
             # sort both sides
             sort(ar, lo, partition_index - 1)
-            sort(ar, partition_index + 1, hi)
+            sort(ar, partition_index / 1, hi)
     def partition(ar, lo, hi):
         # basic partition by using the high value as a pivot
ts-3-5/test_3-5_0-0_8.py ..FFF..F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - TypeErr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - TypeError: 'flo...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - TypeError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - TypeError: 'floa...
========================= 4 failed, 4 passed in 0.09s ==========================

4 : Job ID 4d59be4244944ceb8745c2a63eb2c728
SURVIVED
test outcome: survived
quicksort.py, start pos: (24, 37), end pos: (24, 38)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -21,7 +21,7 @@
             partition_index = partition(ar, lo, hi)
             # sort both sides
             sort(ar, lo, partition_index - 1)
-            sort(ar, partition_index + 1, hi)
+            sort(ar, partition_index // 1, hi)
     def partition(ar, lo, hi):
         # basic partition by using the high value as a pivot
ts-3-5/test_3-5_0-0_8.py ........                                        [100%]
============================== 8 passed in 0.14s ===============================

5 : Job ID 70a5ae9a28ab48bfa173905e6bca8e92
test outcome: killed
quicksort.py, start pos: (24, 37), end pos: (24, 38)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -21,7 +21,7 @@
             partition_index = partition(ar, lo, hi)
             # sort both sides
             sort(ar, lo, partition_index - 1)
-            sort(ar, partition_index + 1, hi)
+            sort(ar, partition_index % 1, hi)
     def partition(ar, lo, hi):
         # basic partition by using the high value as a pivot
ts-3-5/test_3-5_0-0_8.py .FFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - RecursionE...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - RecursionError: ...
========================= 6 failed, 2 passed in 0.14s ==========================

6 : Job ID f10d043f997a44479dc9a2e6a5c1b5f9
SURVIVED
test outcome: survived
quicksort.py, start pos: (24, 37), end pos: (24, 38)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -21,7 +21,7 @@
             partition_index = partition(ar, lo, hi)
             # sort both sides
             sort(ar, lo, partition_index - 1)
-            sort(ar, partition_index + 1, hi)
+            sort(ar, partition_index ** 1, hi)
     def partition(ar, lo, hi):
         # basic partition by using the high value as a pivot
ts-3-5/test_3-5_0-0_8.py ........                                        [100%]
============================== 8 passed in 0.15s ===============================

7 : Job ID 5d7a4ea9980b435ca6509d202e38d95f
test outcome: killed
quicksort.py, start pos: (24, 37), end pos: (24, 38)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -21,7 +21,7 @@
             partition_index = partition(ar, lo, hi)
             # sort both sides
             sort(ar, lo, partition_index - 1)
-            sort(ar, partition_index + 1, hi)
+            sort(ar, partition_index >> 1, hi)
     def partition(ar, lo, hi):
         # basic partition by using the high value as a pivot
ts-3-5/test_3-5_0-0_8.py .FFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - RecursionE...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - RecursionError: ...
========================= 6 failed, 2 passed in 0.14s ==========================

8 : Job ID c5a16d2373a744bdb2409a3650882f5c
test outcome: killed
quicksort.py, start pos: (24, 37), end pos: (24, 38)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -21,7 +21,7 @@
             partition_index = partition(ar, lo, hi)
             # sort both sides
             sort(ar, lo, partition_index - 1)
-            sort(ar, partition_index + 1, hi)
+            sort(ar, partition_index << 1, hi)
     def partition(ar, lo, hi):
         # basic partition by using the high value as a pivot
ts-3-5/test_3-5_0-0_8.py ....F..F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [1,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [1, 2, 3,...
========================= 2 failed, 6 passed in 0.09s ==========================

9 : Job ID 6da4458729e44abd9ee8f6016d5843d5
SURVIVED
test outcome: survived
quicksort.py, start pos: (24, 37), end pos: (24, 38)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -21,7 +21,7 @@
             partition_index = partition(ar, lo, hi)
             # sort both sides
             sort(ar, lo, partition_index - 1)
-            sort(ar, partition_index + 1, hi)
+            sort(ar, partition_index | 1, hi)
     def partition(ar, lo, hi):
         # basic partition by using the high value as a pivot
ts-3-5/test_3-5_0-0_8.py ........                                        [100%]
============================== 8 passed in 0.15s ===============================

10 : Job ID 516327cc956141f380a4ccd285e3f5e7
test outcome: killed
quicksort.py, start pos: (24, 37), end pos: (24, 38)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -21,7 +21,7 @@
             partition_index = partition(ar, lo, hi)
             # sort both sides
             sort(ar, lo, partition_index - 1)
-            sort(ar, partition_index + 1, hi)
+            sort(ar, partition_index & 1, hi)
     def partition(ar, lo, hi):
         # basic partition by using the high value as a pivot
ts-3-5/test_3-5_0-0_8.py .FFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - RecursionE...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - RecursionError: ...
========================= 6 failed, 2 passed in 0.15s ==========================

11 : Job ID 972637a7cbf14aec9d9d21985ad8c4f5
test outcome: killed
quicksort.py, start pos: (24, 37), end pos: (24, 38)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -21,7 +21,7 @@
             partition_index = partition(ar, lo, hi)
             # sort both sides
             sort(ar, lo, partition_index - 1)
-            sort(ar, partition_index + 1, hi)
+            sort(ar, partition_index ^ 1, hi)
     def partition(ar, lo, hi):
         # basic partition by using the high value as a pivot
ts-3-5/test_3-5_0-0_8.py .FFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - RecursionE...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - RecursionError: ...
========================= 6 failed, 2 passed in 0.13s ==========================

12 : Job ID 82e4dcb81c5b4e288c0319843f8d14bb
test outcome: killed
quicksort.py, start pos: (23, 41), end pos: (23, 42)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -20,7 +20,7 @@
             # find the partition
             partition_index = partition(ar, lo, hi)
             # sort both sides
-            sort(ar, lo, partition_index - 1)
+            sort(ar, lo, partition_index + 1)
             sort(ar, partition_index + 1, hi)
     def partition(ar, lo, hi):
ts-3-5/test_3-5_0-0_8.py .FFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - IndexError: lis...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - IndexError: lis...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - IndexError...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - RecursionError: ...
========================= 6 failed, 2 passed in 0.10s ==========================

13 : Job ID 948fb153ff52462cbafc38a430cdb86f
test outcome: killed
quicksort.py, start pos: (42, 23), end pos: (42, 24)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 1
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -39,6 +39,6 @@
         return i
-    sort(ar, 0, len(ar)-1)
+    sort(ar, 0, len(ar)+1)
     return ar
ts-3-5/test_3-5_0-0_8.py FFFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_empty_list - IndexError: list...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - IndexError: lis...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - IndexError: lis...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - IndexError...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_single_element_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - IndexError: list...
============================== 8 failed in 0.10s ===============================

14 : Job ID b9eb1a393ef44d6dbff63fcb63e83d28
test outcome: killed
quicksort.py, start pos: (23, 41), end pos: (23, 42)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -20,7 +20,7 @@
             # find the partition
             partition_index = partition(ar, lo, hi)
             # sort both sides
-            sort(ar, lo, partition_index - 1)
+            sort(ar, lo, partition_index * 1)
             sort(ar, partition_index + 1, hi)
     def partition(ar, lo, hi):
ts-3-5/test_3-5_0-0_8.py .FFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - RecursionE...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - RecursionError: ...
========================= 6 failed, 2 passed in 0.39s ==========================

15 : Job ID 5ec4ab118f34442db389b03f8b894e6c
test outcome: killed
quicksort.py, start pos: (42, 23), end pos: (42, 24)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 1
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -39,6 +39,6 @@
         return i
-    sort(ar, 0, len(ar)-1)
+    sort(ar, 0, len(ar)*1)
     return ar
ts-3-5/test_3-5_0-0_8.py .FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - IndexError: lis...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - IndexError: lis...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - IndexError...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_single_element_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - IndexError: list...
========================= 7 failed, 1 passed in 0.09s ==========================

16 : Job ID 0a1e6a3eacf8498a8d937fca3956c813
test outcome: killed
quicksort.py, start pos: (23, 41), end pos: (23, 42)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -20,7 +20,7 @@
             # find the partition
             partition_index = partition(ar, lo, hi)
             # sort both sides
-            sort(ar, lo, partition_index - 1)
+            sort(ar, lo, partition_index / 1)
             sort(ar, partition_index + 1, hi)
     def partition(ar, lo, hi):
ts-3-5/test_3-5_0-0_8.py .FFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - TypeError: list...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - TypeErr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - TypeError: list...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - TypeError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - TypeErr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - TypeError: list ...
========================= 6 failed, 2 passed in 0.09s ==========================

17 : Job ID e7306b89498e4a2da3be8ea3afe7d8b0
test outcome: killed
quicksort.py, start pos: (42, 23), end pos: (42, 24)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 1
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -39,6 +39,6 @@
         return i
-    sort(ar, 0, len(ar)-1)
+    sort(ar, 0, len(ar)/1)
     return ar
ts-3-5/test_3-5_0-0_8.py .FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - TypeError: list...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - TypeErr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - TypeError: list...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - TypeError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_single_element_list - TypeErr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - TypeErr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - TypeError: list ...
========================= 7 failed, 1 passed in 0.09s ==========================

18 : Job ID 9289f41257ff4d91b12dc54ebbae8f7a
test outcome: killed
quicksort.py, start pos: (23, 41), end pos: (23, 42)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -20,7 +20,7 @@
             # find the partition
             partition_index = partition(ar, lo, hi)
             # sort both sides
-            sort(ar, lo, partition_index - 1)
+            sort(ar, lo, partition_index // 1)
             sort(ar, partition_index + 1, hi)
     def partition(ar, lo, hi):
ts-3-5/test_3-5_0-0_8.py .FFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - RecursionE...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - RecursionError: ...
========================= 6 failed, 2 passed in 0.37s ==========================

19 : Job ID a7ded634329445728279d6bf6f3b6298
test outcome: killed
quicksort.py, start pos: (42, 23), end pos: (42, 24)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 1
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -39,6 +39,6 @@
         return i
-    sort(ar, 0, len(ar)-1)
+    sort(ar, 0, len(ar)//1)
     return ar
ts-3-5/test_3-5_0-0_8.py .FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - IndexError: lis...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - IndexError: lis...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - IndexError...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_single_element_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - IndexError: list...
========================= 7 failed, 1 passed in 0.09s ==========================

20 : Job ID d787622a7a8b4c888f1ff5dd1c434249
test outcome: killed
quicksort.py, start pos: (23, 41), end pos: (23, 42)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -20,7 +20,7 @@
             # find the partition
             partition_index = partition(ar, lo, hi)
             # sort both sides
-            sort(ar, lo, partition_index - 1)
+            sort(ar, lo, partition_index % 1)
             sort(ar, partition_index + 1, hi)
     def partition(ar, lo, hi):
ts-3-5/test_3-5_0-0_8.py ..FFF..F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [3, 1, 4...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [3,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [1, 999, ...
========================= 4 failed, 4 passed in 0.09s ==========================

21 : Job ID 9bb8ac68219541358a0e6712bf63b818
test outcome: killed
quicksort.py, start pos: (42, 23), end pos: (42, 24)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 1
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -39,6 +39,6 @@
         return i
-    sort(ar, 0, len(ar)-1)
+    sort(ar, 0, len(ar)%1)
     return ar
ts-3-5/test_3-5_0-0_8.py ..FFF..F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [3, 1, 4...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [3,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [1000, 99...
========================= 4 failed, 4 passed in 0.09s ==========================

22 : Job ID 0edba771d5644228adf0a2549d3ee4cb
test outcome: killed
quicksort.py, start pos: (23, 41), end pos: (23, 42)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -20,7 +20,7 @@
             # find the partition
             partition_index = partition(ar, lo, hi)
             # sort both sides
-            sort(ar, lo, partition_index - 1)
+            sort(ar, lo, partition_index ** 1)
             sort(ar, partition_index + 1, hi)
     def partition(ar, lo, hi):
ts-3-5/test_3-5_0-0_8.py .FFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - RecursionE...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - RecursionError: ...
========================= 6 failed, 2 passed in 0.39s ==========================

23 : Job ID 15ba81a64df34f3db3beeab7318612c9
test outcome: killed
quicksort.py, start pos: (42, 23), end pos: (42, 24)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 1
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -39,6 +39,6 @@
         return i
-    sort(ar, 0, len(ar)-1)
+    sort(ar, 0, len(ar)**1)
     return ar
ts-3-5/test_3-5_0-0_8.py .FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - IndexError: lis...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - IndexError: lis...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - IndexError...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_single_element_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - IndexError: list...
========================= 7 failed, 1 passed in 0.09s ==========================

24 : Job ID 13e93ab90ca749aeae4228591d560626
test outcome: killed
quicksort.py, start pos: (23, 41), end pos: (23, 42)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -20,7 +20,7 @@
             # find the partition
             partition_index = partition(ar, lo, hi)
             # sort both sides
-            sort(ar, lo, partition_index - 1)
+            sort(ar, lo, partition_index >> 1)
             sort(ar, partition_index + 1, hi)
     def partition(ar, lo, hi):
ts-3-5/test_3-5_0-0_8.py ..FFF..F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [1, 3, 4...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [1,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [1, 501, ...
========================= 4 failed, 4 passed in 0.10s ==========================

25 : Job ID 39892b42cbe14e66978b64759114f1ca
test outcome: killed
quicksort.py, start pos: (42, 23), end pos: (42, 24)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 1
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -39,6 +39,6 @@
         return i
-    sort(ar, 0, len(ar)-1)
+    sort(ar, 0, len(ar)>>1)
     return ar
ts-3-5/test_3-5_0-0_8.py ..FFF..F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [1, 1, 3...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [1,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [500, 501...
========================= 4 failed, 4 passed in 0.11s ==========================

26 : Job ID 8ebb99cb483d4ee1b8afe2afa18f82c7
test outcome: killed
quicksort.py, start pos: (23, 41), end pos: (23, 42)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -20,7 +20,7 @@
             # find the partition
             partition_index = partition(ar, lo, hi)
             # sort both sides
-            sort(ar, lo, partition_index - 1)
+            sort(ar, lo, partition_index << 1)
             sort(ar, partition_index + 1, hi)
     def partition(ar, lo, hi):
ts-3-5/test_3-5_0-0_8.py .FFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - IndexError: lis...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - IndexError: lis...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - IndexError...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - IndexError: list...
========================= 6 failed, 2 passed in 0.09s ==========================
