27 : Job ID d03adcc381a64dcf91942749b42915c7
test outcome: killed
quicksort.py, start pos: (42, 23), end pos: (42, 24)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 1
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -39,6 +39,6 @@
         return i
-    sort(ar, 0, len(ar)-1)
+    sort(ar, 0, len(ar)<<1)
     return ar
ts-3-5/test_3-5_0-0_8.py .FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - IndexError: lis...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - IndexError: lis...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - IndexError...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_single_element_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - IndexError: list...
========================= 7 failed, 1 passed in 0.09s ==========================

28 : Job ID 2614453d4e004b9f81e6855dc504c2fc
test outcome: killed
quicksort.py, start pos: (23, 41), end pos: (23, 42)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -20,7 +20,7 @@
             # find the partition
             partition_index = partition(ar, lo, hi)
             # sort both sides
-            sort(ar, lo, partition_index - 1)
+            sort(ar, lo, partition_index | 1)
             sort(ar, partition_index + 1, hi)
     def partition(ar, lo, hi):
ts-3-5/test_3-5_0-0_8.py .FFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - IndexError: lis...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - RecursionE...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - RecursionError: ...
========================= 6 failed, 2 passed in 0.12s ==========================

29 : Job ID 9c02339bb48d48d094eb6695cda24882
test outcome: killed
quicksort.py, start pos: (42, 23), end pos: (42, 24)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 1
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -39,6 +39,6 @@
         return i
-    sort(ar, 0, len(ar)-1)
+    sort(ar, 0, len(ar)|1)
     return ar
ts-3-5/test_3-5_0-0_8.py FFFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_empty_list - IndexError: list...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - IndexError: lis...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - IndexError: lis...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - IndexError...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_single_element_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - IndexError: list...
============================== 8 failed in 0.09s ===============================

30 : Job ID d134096d0f104032b0a527f3807a4b0c
test outcome: killed
quicksort.py, start pos: (23, 41), end pos: (23, 42)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -20,7 +20,7 @@
             # find the partition
             partition_index = partition(ar, lo, hi)
             # sort both sides
-            sort(ar, lo, partition_index - 1)
+            sort(ar, lo, partition_index & 1)
             sort(ar, partition_index + 1, hi)
     def partition(ar, lo, hi):
ts-3-5/test_3-5_0-0_8.py ..FFF..F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [3, 1, 4...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [3,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [1, 999, ...
========================= 4 failed, 4 passed in 0.10s ==========================

31 : Job ID 54c12a1d824c47548dfcafc385e6edc5
test outcome: killed
quicksort.py, start pos: (42, 23), end pos: (42, 24)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 1
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -39,6 +39,6 @@
         return i
-    sort(ar, 0, len(ar)-1)
+    sort(ar, 0, len(ar)&1)
     return ar
ts-3-5/test_3-5_0-0_8.py ..FFFF.F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [1, 3, 4...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [3,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_single_element_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [1000, 99...
========================= 5 failed, 3 passed in 0.09s ==========================

32 : Job ID d3bc11fa88454ddcaa61ca1a759742c3
test outcome: killed
quicksort.py, start pos: (23, 41), end pos: (23, 42)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -20,7 +20,7 @@
             # find the partition
             partition_index = partition(ar, lo, hi)
             # sort both sides
-            sort(ar, lo, partition_index - 1)
+            sort(ar, lo, partition_index ^ 1)
             sort(ar, partition_index + 1, hi)
     def partition(ar, lo, hi):
ts-3-5/test_3-5_0-0_8.py .FFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - IndexError: lis...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - RecursionE...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - RecursionError: ...
========================= 6 failed, 2 passed in 0.38s ==========================

33 : Job ID 0c1d070422da4156b878c5a9212a6608
test outcome: killed
quicksort.py, start pos: (42, 23), end pos: (42, 24)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 1
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -39,6 +39,6 @@
         return i
-    sort(ar, 0, len(ar)-1)
+    sort(ar, 0, len(ar)^1)
     return ar
ts-3-5/test_3-5_0-0_8.py F...F..F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_empty_list - IndexError: list...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - IndexError...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - IndexError: list...
========================= 3 failed, 5 passed in 0.09s ==========================

34 : Job ID bb3b26c4d94d4b43b2839c30c516904f
test outcome: killed
quicksort.py, start pos: (19, 14), end pos: (19, 15)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -16,7 +16,7 @@
     """
     def sort(ar, lo, hi):
         # if the two ends haven't swapped
-        if lo < hi:
+        if lo == hi:
             # find the partition
             partition_index = partition(ar, lo, hi)
             # sort both sides
ts-3-5/test_3-5_0-0_8.py ..FFF..F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [3, 1, 4...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [3,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [1000, 99...
========================= 4 failed, 4 passed in 0.09s ==========================

35 : Job ID fc96ee85d23e4bda960a6b64a30dd2b3
test outcome: killed
quicksort.py, start pos: (19, 14), end pos: (19, 15)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -16,7 +16,7 @@
     """
     def sort(ar, lo, hi):
         # if the two ends haven't swapped
-        if lo < hi:
+        if lo != hi:
             # find the partition
             partition_index = partition(ar, lo, hi)
             # sort both sides
ts-3-5/test_3-5_0-0_8.py FFFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_empty_list - IndexError: list...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - RecursionE...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - RecursionError: ...
========================= 7 failed, 1 passed in 0.13s ==========================

36 : Job ID f2de96cab6e24c12bd80aac7e91602cf
SURVIVED
test outcome: survived
quicksort.py, start pos: (19, 14), end pos: (19, 15)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -16,7 +16,7 @@
     """
     def sort(ar, lo, hi):
         # if the two ends haven't swapped
-        if lo < hi:
+        if lo <= hi:
             # find the partition
             partition_index = partition(ar, lo, hi)
             # sort both sides
ts-3-5/test_3-5_0-0_8.py ........                                        [100%]
============================== 8 passed in 0.15s ===============================

37 : Job ID 922d1ea0ca464e669e998f8c6e7c7f4c
test outcome: killed
quicksort.py, start pos: (19, 14), end pos: (19, 15)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -16,7 +16,7 @@
     """
     def sort(ar, lo, hi):
         # if the two ends haven't swapped
-        if lo < hi:
+        if lo > hi:
             # find the partition
             partition_index = partition(ar, lo, hi)
             # sort both sides
ts-3-5/test_3-5_0-0_8.py F.FFF..F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_empty_list - IndexError: list...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [3, 1, 4...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [3,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [1000, 99...
========================= 5 failed, 3 passed in 0.09s ==========================

38 : Job ID 337702eb0bf04fb9bfe6c938b3173612
test outcome: killed
quicksort.py, start pos: (19, 14), end pos: (19, 15)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -16,7 +16,7 @@
     """
     def sort(ar, lo, hi):
         # if the two ends haven't swapped
-        if lo < hi:
+        if lo >= hi:
             # find the partition
             partition_index = partition(ar, lo, hi)
             # sort both sides
ts-3-5/test_3-5_0-0_8.py F.FFFF.F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_empty_list - IndexError: list...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [3, 1, 4...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [3,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_single_element_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [1000, 99...
========================= 6 failed, 2 passed in 0.10s ==========================

39 : Job ID d4695ee0b5c74d86a4313c5c36980557
test outcome: killed
quicksort.py, start pos: (19, 14), end pos: (19, 15)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -16,7 +16,7 @@
     """
     def sort(ar, lo, hi):
         # if the two ends haven't swapped
-        if lo < hi:
+        if lo is hi:
             # find the partition
             partition_index = partition(ar, lo, hi)
             # sort both sides
ts-3-5/test_3-5_0-0_8.py ..FFF..F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [3, 1, 4...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [3,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [1000, 99...
========================= 4 failed, 4 passed in 0.09s ==========================

40 : Job ID b90d37e5d22f42faa7cb2b15f2ccd2af
test outcome: killed
quicksort.py, start pos: (19, 14), end pos: (19, 15)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -16,7 +16,7 @@
     """
     def sort(ar, lo, hi):
         # if the two ends haven't swapped
-        if lo < hi:
+        if lo is not hi:
             # find the partition
             partition_index = partition(ar, lo, hi)
             # sort both sides
ts-3-5/test_3-5_0-0_8.py FFFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_empty_list - IndexError: list...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - RecursionE...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - RecursionError: ...
========================= 7 failed, 1 passed in 0.14s ==========================

41 : Job ID 07f2bd63827e49358a9b36c5e9ad7464
test outcome: killed
quicksort.py, start pos: (34, 21), end pos: (34, 23)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -31,7 +31,7 @@
         i = lo
         for j in range(lo, hi):
             # 
-            if ar[j] <= pivot:
+            if ar[j] == pivot:
                 ar[i], ar[j] = ar[j], ar[i]
                 i += 1
         # swap the pivot into place
ts-3-5/test_3-5_0-0_8.py .FFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - assert [5, 1, 2...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [5, 5, 5...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [4,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [1, 1000,...
========================= 6 failed, 2 passed in 0.12s ==========================

42 : Job ID 7d40dfd75a344436b6f6ae78ddb1012b
test outcome: killed
quicksort.py, start pos: (34, 21), end pos: (34, 23)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -31,7 +31,7 @@
         i = lo
         for j in range(lo, hi):
             # 
-            if ar[j] <= pivot:
+            if ar[j] != pivot:
                 ar[i], ar[j] = ar[j], ar[i]
                 i += 1
         # swap the pivot into place
ts-3-5/test_3-5_0-0_8.py ..FFF..F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [4, 1, 1...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [1,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [1000, 99...
========================= 4 failed, 4 passed in 0.16s ==========================

43 : Job ID 4888fa7a9f3b4844b8174eb93319a231
SURVIVED
test outcome: survived
quicksort.py, start pos: (34, 21), end pos: (34, 23)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -31,7 +31,7 @@
         i = lo
         for j in range(lo, hi):
             # 
-            if ar[j] <= pivot:
+            if ar[j] < pivot:
                 ar[i], ar[j] = ar[j], ar[i]
                 i += 1
         # swap the pivot into place
ts-3-5/test_3-5_0-0_8.py ........                                        [100%]
============================== 8 passed in 0.14s ===============================

44 : Job ID 51bc15fc389d4a43b9290da5f9e65826
test outcome: killed
quicksort.py, start pos: (34, 21), end pos: (34, 23)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -31,7 +31,7 @@
         i = lo
         for j in range(lo, hi):
             # 
-            if ar[j] <= pivot:
+            if ar[j] > pivot:
                 ar[i], ar[j] = ar[j], ar[i]
                 i += 1
         # swap the pivot into place
ts-3-5/test_3-5_0-0_8.py .FFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - assert [5, 4, 3...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [9, 6, 5...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [9,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [1000, 99...
========================= 6 failed, 2 passed in 0.18s ==========================

45 : Job ID daf80b0adcaa4e828bf16c17faf2e826
test outcome: killed
quicksort.py, start pos: (34, 21), end pos: (34, 23)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -31,7 +31,7 @@
         i = lo
         for j in range(lo, hi):
             # 
-            if ar[j] <= pivot:
+            if ar[j] >= pivot:
                 ar[i], ar[j] = ar[j], ar[i]
                 i += 1
         # swap the pivot into place
ts-3-5/test_3-5_0-0_8.py .FFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - assert [5, 4, 3...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [9, 6, 5...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [9,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [1000, 99...
========================= 6 failed, 2 passed in 0.18s ==========================

46 : Job ID fc0085d89cc74c20b37d1e4f723a246e
test outcome: killed
quicksort.py, start pos: (34, 21), end pos: (34, 23)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -31,7 +31,7 @@
         i = lo
         for j in range(lo, hi):
             # 
-            if ar[j] <= pivot:
+            if ar[j] is pivot:
                 ar[i], ar[j] = ar[j], ar[i]
                 i += 1
         # swap the pivot into place
ts-3-5/test_3-5_0-0_8.py .FFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - assert [5, 1, 2...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [5, 5, 5...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [4,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [1, 1000,...
========================= 6 failed, 2 passed in 0.12s ==========================

47 : Job ID 7741173271e64b7da941cd3959df1dfd
test outcome: killed
quicksort.py, start pos: (34, 21), end pos: (34, 23)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -31,7 +31,7 @@
         i = lo
         for j in range(lo, hi):
             # 
-            if ar[j] <= pivot:
+            if ar[j] is not pivot:
                 ar[i], ar[j] = ar[j], ar[i]
                 i += 1
         # swap the pivot into place
ts-3-5/test_3-5_0-0_8.py ..FFF..F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [4, 1, 1...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [1,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [1000, 99...
========================= 4 failed, 4 passed in 0.17s ==========================

48 : Job ID 0382f63c1b4046bb8f0b4b3fddf4a9af
test outcome: killed
quicksort.py, start pos: (19, 11), end pos: (19, 18)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -16,7 +16,7 @@
     """
     def sort(ar, lo, hi):
         # if the two ends haven't swapped
-        if lo < hi:
+        if not lo < hi:
             # find the partition
             partition_index = partition(ar, lo, hi)
             # sort both sides
ts-3-5/test_3-5_0-0_8.py F.FFFF.F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_empty_list - IndexError: list...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [3, 1, 4...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [3,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_single_element_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [1000, 99...
========================= 6 failed, 2 passed in 0.10s ==========================

49 : Job ID 5e263668e3dc441aa3401d3d27626462
test outcome: killed
quicksort.py, start pos: (34, 15), end pos: (34, 29)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -31,7 +31,7 @@
         i = lo
         for j in range(lo, hi):
             # 
-            if ar[j] <= pivot:
+            if not ar[j] <= pivot:
                 ar[i], ar[j] = ar[j], ar[i]
                 i += 1
         # swap the pivot into place
ts-3-5/test_3-5_0-0_8.py .FFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - assert [5, 4, 3...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [9, 6, 5...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [9,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [1000, 99...
========================= 6 failed, 2 passed in 0.18s ==========================

50 : Job ID c906b332e69345b1b718fc5153a9746f
test outcome: killed
quicksort.py, start pos: (23, 43), end pos: (23, 44)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -20,7 +20,7 @@
             # find the partition
             partition_index = partition(ar, lo, hi)
             # sort both sides
-            sort(ar, lo, partition_index - 1)
+            sort(ar, lo, partition_index - 2)
             sort(ar, partition_index + 1, hi)
     def partition(ar, lo, hi):
ts-3-5/test_3-5_0-0_8.py ..FFF..F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [3, 1, 4...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [1,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [1, 3, 5,...
========================= 4 failed, 4 passed in 0.13s ==========================

51 : Job ID c016b5a39480482da0b24739c6db2eaf
test outcome: killed
quicksort.py, start pos: (23, 43), end pos: (23, 44)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -20,7 +20,7 @@
             # find the partition
             partition_index = partition(ar, lo, hi)
             # sort both sides
-            sort(ar, lo, partition_index - 1)
+            sort(ar, lo, partition_index - 0)
             sort(ar, partition_index + 1, hi)
     def partition(ar, lo, hi):
ts-3-5/test_3-5_0-0_8.py .FFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - RecursionError:...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - RecursionE...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - Recursi...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - RecursionError: ...
========================= 6 failed, 2 passed in 0.39s ==========================

52 : Job ID 1a2667f886a54110ab922eff5dbdceb7
test outcome: killed
quicksort.py, start pos: (24, 39), end pos: (24, 40)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -21,7 +21,7 @@
             partition_index = partition(ar, lo, hi)
             # sort both sides
             sort(ar, lo, partition_index - 1)
-            sort(ar, partition_index + 1, hi)
+            sort(ar, partition_index + 2, hi)
     def partition(ar, lo, hi):
         # basic partition by using the high value as a pivot
ts-3-5/test_3-5_0-0_8.py ..F.F..F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [1,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [1, 999, ...
========================= 3 failed, 5 passed in 0.12s ==========================

53 : Job ID 0336dea4d1354e3dba8629e611671f40
SURVIVED
test outcome: survived
quicksort.py, start pos: (24, 39), end pos: (24, 40)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -21,7 +21,7 @@
             partition_index = partition(ar, lo, hi)
             # sort both sides
             sort(ar, lo, partition_index - 1)
-            sort(ar, partition_index + 1, hi)
+            sort(ar, partition_index + 0, hi)
     def partition(ar, lo, hi):
         # basic partition by using the high value as a pivot
ts-3-5/test_3-5_0-0_8.py ........                                        [100%]
============================== 8 passed in 0.14s ===============================
