54 : Job ID d1e83f7914df4cd9bdfd3ee2112db161
test outcome: killed
quicksort.py, start pos: (36, 21), end pos: (36, 22)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -33,7 +33,7 @@
             # 
             if ar[j] <= pivot:
                 ar[i], ar[j] = ar[j], ar[i]
-                i += 1
+                i += 2
         # swap the pivot into place
         ar[i], ar[hi] = ar[hi], ar[i]
ts-3-5/test_3-5_0-0_8.py .FFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - IndexError: lis...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - IndexError: lis...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - IndexError...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - IndexError: list...
========================= 6 failed, 2 passed in 0.09s ==========================

55 : Job ID 9b3ea9fbab724e1f83495d59a263ba14
test outcome: killed
quicksort.py, start pos: (36, 21), end pos: (36, 22)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -33,7 +33,7 @@
             # 
             if ar[j] <= pivot:
                 ar[i], ar[j] = ar[j], ar[i]
-                i += 1
+                i += 0
         # swap the pivot into place
         ar[i], ar[hi] = ar[hi], ar[i]
ts-3-5/test_3-5_0-0_8.py .FFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - assert [5, 4, 3...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [5, 3, 2...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [4,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [1, 1000,...
========================= 6 failed, 2 passed in 0.15s ==========================

56 : Job ID a6790ef755264668b5f7c2b96de72827
test outcome: killed
quicksort.py, start pos: (42, 13), end pos: (42, 14)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -39,6 +39,6 @@
         return i
-    sort(ar, 0, len(ar)-1)
+    sort(ar, 1, len(ar)-1)
     return ar
ts-3-5/test_3-5_0-0_8.py ..FFF..F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [3, 1, 1...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [3,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [1000, 1,...
========================= 4 failed, 4 passed in 0.14s ==========================

57 : Job ID 49f6116a78b14dfea05f775a2e855e54
test outcome: killed
quicksort.py, start pos: (42, 13), end pos: (42, 14)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -39,6 +39,6 @@
         return i
-    sort(ar, 0, len(ar)-1)
+    sort(ar, -1, len(ar)-1)
     return ar
ts-3-5/test_3-5_0-0_8.py .F.FF.F.                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - assert [2, 3, 4...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [1, 2, 3...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [1,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - assert ...
========================= 4 failed, 4 passed in 0.15s ==========================

58 : Job ID fde50afd319e4c068e77f766d0f43cdb
test outcome: killed
quicksort.py, start pos: (42, 24), end pos: (42, 25)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -39,6 +39,6 @@
         return i
-    sort(ar, 0, len(ar)-1)
+    sort(ar, 0, len(ar)- 2)
     return ar
ts-3-5/test_3-5_0-0_8.py ..FFF..F                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [1, 1, 2...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [1,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [2, 3, 4,...
========================= 4 failed, 4 passed in 0.15s ==========================

59 : Job ID e83a37c4cfee4599802dc5e28db4f2cc
test outcome: killed
quicksort.py, start pos: (42, 24), end pos: (42, 25)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -39,6 +39,6 @@
         return i
-    sort(ar, 0, len(ar)-1)
+    sort(ar, 0, len(ar)- 0)
     return ar
ts-3-5/test_3-5_0-0_8.py .FFFFFFF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - IndexError: lis...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - IndexError: lis...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - IndexError...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_single_element_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - IndexEr...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - IndexError: list...
========================= 7 failed, 1 passed in 0.11s ==========================

60 : Job ID f1c3fbec6b114c02ab936843a0a31498
test outcome: killed
quicksort.py, start pos: (32, 17), end pos: (32, 30)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- aquicksort.py
+++ bquicksort.py
@@ -29,7 +29,7 @@
         # the value being examined 
         i = lo
-        for j in range(lo, hi):
+        for j in []:
             # 
             if ar[j] <= pivot:
                 ar[i], ar[j] = ar[j], ar[i]
ts-3-5/test_3-5_0-0_8.py .FFFF.FF                                        [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_sorted_list - assert [5, 1, 2...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_reverse_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_random_list - assert [5, 3, 1...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_duplicate_values - assert [4,...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_already_sorted_list - assert ...
FAILED ts-3-5/test_3-5_0-0_8.py::test_quicksort_large_list - assert [1, 1000,...
========================= 6 failed, 2 passed in 0.09s ==========================
