   - [#   1] AOR quicksort: 
--------------------------------------------------------------------------------
  19:         if lo < hi:
  20:             
  21:             partition_index = partition(ar, lo, hi)
  22:             
- 23:             sort(ar, lo, partition_index - 1)
+ 23:             sort(ar, lo, partition_index + 1)
  24:             sort(ar, partition_index + 1, hi)
  25:     
  26:     def partition(ar, lo, hi):
  27:         
--------------------------------------------------------------------------------
[0.15492 s] killed by ts-3-5/test_3-5_0-9_272.py::test_quicksort_sorted_list

def test_quicksort_sorted_list():
        ar = [1, 2, 3, 4, 5]
        expected = [1, 2, 3, 4, 5]
>       quicksort(ar)

ts-3-5/test_3-5_0-9_272.py:21: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
quicksort:42: in quicksort
    ???
quicksort:23: in sort
    ???
quicksort:21: in sort
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

ar = [1, 2, 3, 4, 5], lo = 0, hi = 5

>   ???
E   IndexError: list index out of range

quicksort:28: IndexError

   - [#   3] AOR quicksort: 
--------------------------------------------------------------------------------
  38:         (ar[i], ar[hi]) = (ar[hi], ar[i])
  39:         
  40:         return i
  41:     
- 42:     sort(ar, 0, len(ar) - 1)
+ 42:     sort(ar, 0, len(ar) + 1)
  43:     
  44:     return ar
--------------------------------------------------------------------------------
[0.13810 s] killed by ts-3-5/test_3-5_0-9_272.py::test_quicksort_empty_list

def test_quicksort_empty_list():
        ar = []
        expected = []
>       quicksort(ar)

ts-3-5/test_3-5_0-9_272.py:15: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
quicksort:42: in quicksort
    ???
quicksort:21: in sort
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

ar = [], lo = 0, hi = 1

>   ???
E   IndexError: list index out of range

quicksort:28: IndexError

   - [#   4] ASR quicksort: 
--------------------------------------------------------------------------------
  32:         for j in range(lo, hi):
  33:             
  34:             if ar[j] <= pivot:
  35:                 (ar[i], ar[j]) = (ar[j], ar[i])
- 36:                 i += 1
+ 36:                 i -= 1
  37:         
  38:         (ar[i], ar[hi]) = (ar[hi], ar[i])
  39:         
  40:         return i
--------------------------------------------------------------------------------
[0.13923 s] killed by ts-3-5/test_3-5_0-9_272.py::test_quicksort_sorted_list

def test_quicksort_sorted_list():
        ar = [1, 2, 3, 4, 5]
        expected = [1, 2, 3, 4, 5]
>       quicksort(ar)

ts-3-5/test_3-5_0-9_272.py:21: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
quicksort:42: in quicksort
    ???
quicksort:24: in sort
    ???
quicksort:21: in sort
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

ar = [5, 4, 3, 2, 1], lo = -3, hi = 4

>   ???
E   IndexError: list index out of range

quicksort:35: IndexError

   - [#   5] COI quicksort: 
--------------------------------------------------------------------------------
  15:         The input list sorted.
  16:     '''
  17:     def sort(ar, lo, hi):
  18:         
- 19:         if lo < hi:
+ 19:         if not (lo < hi):
  20:             
  21:             partition_index = partition(ar, lo, hi)
  22:             
  23:             sort(ar, lo, partition_index - 1)
--------------------------------------------------------------------------------
[0.14123 s] killed by ts-3-5/test_3-5_0-9_272.py::test_quicksort_empty_list

def test_quicksort_empty_list():
        ar = []
        expected = []
>       quicksort(ar)

ts-3-5/test_3-5_0-9_272.py:15: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
quicksort:42: in quicksort
    ???
quicksort:21: in sort
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

ar = [], lo = 0, hi = -1

>   ???
E   IndexError: list index out of range

quicksort:28: IndexError

   - [#   6] COI quicksort: 
--------------------------------------------------------------------------------
  30:         
  31:         i = lo
  32:         for j in range(lo, hi):
  33:             
- 34:             if ar[j] <= pivot:
+ 34:             if not (ar[j] <= pivot):
  35:                 (ar[i], ar[j]) = (ar[j], ar[i])
  36:                 i += 1
  37:         
  38:         (ar[i], ar[hi]) = (ar[hi], ar[i])
--------------------------------------------------------------------------------
[0.13980 s] killed by ts-3-5/test_3-5_0-9_272.py::test_quicksort_sorted_list

def test_quicksort_sorted_list():
        ar = [1, 2, 3, 4, 5]
        expected = [1, 2, 3, 4, 5]
        quicksort(ar)
>       assert ar == expected
E       AssertionError

ts-3-5/test_3-5_0-9_272.py:22: AssertionError

   - [#   7] OIL quicksort: 
--------------------------------------------------------------------------------
  33:             
  34:             if ar[j] <= pivot:
  35:                 (ar[i], ar[j]) = (ar[j], ar[i])
  36:                 i += 1
- 37:         
+ 37:             break
  38:         (ar[i], ar[hi]) = (ar[hi], ar[i])
  39:         
  40:         return i
  41:     
--------------------------------------------------------------------------------
[0.14002 s] killed by ts-3-5/test_3-5_0-9_272.py::test_quicksort_sorted_list

def test_quicksort_sorted_list():
        ar = [1, 2, 3, 4, 5]
        expected = [1, 2, 3, 4, 5]
        quicksort(ar)
>       assert ar == expected
E       AssertionError

ts-3-5/test_3-5_0-9_272.py:22: AssertionError

   - [#   8] RIL quicksort: 
--------------------------------------------------------------------------------
  28:         pivot = ar[hi]
  29:         
  30:         
  31:         i = lo
- 32:         for j in range(lo, hi):
+ 32:         for j in reversed(range(lo, hi)):
  33:             
  34:             if ar[j] <= pivot:
  35:                 (ar[i], ar[j]) = (ar[j], ar[i])
  36:                 i += 1
--------------------------------------------------------------------------------
[0.14089 s] killed by ts-3-5/test_3-5_0-9_272.py::test_quicksort_random_list

def test_quicksort_random_list():
        ar = [3, 1, 4, 1, 5, 9, 2, 6]
        expected = [1, 1, 2, 3, 4, 5, 6, 9]
        quicksort(ar)
>       assert ar == expected
E       AssertionError

ts-3-5/test_3-5_0-9_272.py:34: AssertionError

   - [#   9] ROR quicksort: 
--------------------------------------------------------------------------------
  15:         The input list sorted.
  16:     '''
  17:     def sort(ar, lo, hi):
  18:         
- 19:         if lo < hi:
+ 19:         if lo > hi:
  20:             
  21:             partition_index = partition(ar, lo, hi)
  22:             
  23:             sort(ar, lo, partition_index - 1)
--------------------------------------------------------------------------------
[0.13949 s] killed by ts-3-5/test_3-5_0-9_272.py::test_quicksort_empty_list

def test_quicksort_empty_list():
        ar = []
        expected = []
>       quicksort(ar)

ts-3-5/test_3-5_0-9_272.py:15: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
quicksort:42: in quicksort
    ???
quicksort:21: in sort
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

ar = [], lo = 0, hi = -1

>   ???
E   IndexError: list index out of range

quicksort:28: IndexError

   - [#  10] ROR quicksort: 
--------------------------------------------------------------------------------
  15:         The input list sorted.
  16:     '''
  17:     def sort(ar, lo, hi):
  18:         
- 19:         if lo < hi:
+ 19:         if lo <= hi:
  20:             
  21:             partition_index = partition(ar, lo, hi)
  22:             
  23:             sort(ar, lo, partition_index - 1)
--------------------------------------------------------------------------------
[0.11575 s] survived

   - [#  11] ROR quicksort: 
--------------------------------------------------------------------------------
  30:         
  31:         i = lo
  32:         for j in range(lo, hi):
  33:             
- 34:             if ar[j] <= pivot:
+ 34:             if ar[j] >= pivot:
  35:                 (ar[i], ar[j]) = (ar[j], ar[i])
  36:                 i += 1
  37:         
  38:         (ar[i], ar[hi]) = (ar[hi], ar[i])
--------------------------------------------------------------------------------
[0.14278 s] killed by ts-3-5/test_3-5_0-9_272.py::test_quicksort_sorted_list

def test_quicksort_sorted_list():
        ar = [1, 2, 3, 4, 5]
        expected = [1, 2, 3, 4, 5]
        quicksort(ar)
>       assert ar == expected
E       AssertionError

ts-3-5/test_3-5_0-9_272.py:22: AssertionError

   - [#  12] ROR quicksort: 
--------------------------------------------------------------------------------
  30:         
  31:         i = lo
  32:         for j in range(lo, hi):
  33:             
- 34:             if ar[j] <= pivot:
+ 34:             if ar[j] < pivot:
  35:                 (ar[i], ar[j]) = (ar[j], ar[i])
  36:                 i += 1
  37:         
  38:         (ar[i], ar[hi]) = (ar[hi], ar[i])
--------------------------------------------------------------------------------
[0.12621 s] survived

   - [#  13] SDL quicksort: 
--------------------------------------------------------------------------------
  17:     def sort(ar, lo, hi):
  18:         
  19:         if lo < hi:
  20:             
- 21:             partition_index = partition(ar, lo, hi)
+ 21:             pass
  22:             
  23:             sort(ar, lo, partition_index - 1)
  24:             sort(ar, partition_index + 1, hi)
  25:     
--------------------------------------------------------------------------------
[0.13940 s] killed by ts-3-5/test_3-5_0-9_272.py::test_quicksort_sorted_list

def test_quicksort_sorted_list():
        ar = [1, 2, 3, 4, 5]
        expected = [1, 2, 3, 4, 5]
>       quicksort(ar)

ts-3-5/test_3-5_0-9_272.py:21: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
quicksort:42: in quicksort
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

ar = [1, 2, 3, 4, 5], lo = 0, hi = 4

>   ???
E   NameError: name 'partition_index' is not defined

quicksort:23: NameError

   - [#  14] SDL quicksort: 
--------------------------------------------------------------------------------
  19:         if lo < hi:
  20:             
  21:             partition_index = partition(ar, lo, hi)
  22:             
- 23:             sort(ar, lo, partition_index - 1)
+ 23:             pass
  24:             sort(ar, partition_index + 1, hi)
  25:     
  26:     def partition(ar, lo, hi):
  27:         
--------------------------------------------------------------------------------
[0.13992 s] killed by ts-3-5/test_3-5_0-9_272.py::test_quicksort_reverse_sorted_list

def test_quicksort_reverse_sorted_list():
        ar = [5, 4, 3, 2, 1]
        expected = [1, 2, 3, 4, 5]
        quicksort(ar)
>       assert ar == expected
E       AssertionError

ts-3-5/test_3-5_0-9_272.py:28: AssertionError

   - [#  15] SDL quicksort: 
--------------------------------------------------------------------------------
  20:             
  21:             partition_index = partition(ar, lo, hi)
  22:             
  23:             sort(ar, lo, partition_index - 1)
- 24:             sort(ar, partition_index + 1, hi)
+ 24:             pass
  25:     
  26:     def partition(ar, lo, hi):
  27:         
  28:         pivot = ar[hi]
--------------------------------------------------------------------------------
[0.13951 s] killed by ts-3-5/test_3-5_0-9_272.py::test_quicksort_reverse_sorted_list

def test_quicksort_reverse_sorted_list():
        ar = [5, 4, 3, 2, 1]
        expected = [1, 2, 3, 4, 5]
        quicksort(ar)
>       assert ar == expected
E       AssertionError

ts-3-5/test_3-5_0-9_272.py:28: AssertionError

   - [#  16] SDL quicksort: 
--------------------------------------------------------------------------------
  24:             sort(ar, partition_index + 1, hi)
  25:     
  26:     def partition(ar, lo, hi):
  27:         
- 28:         pivot = ar[hi]
+ 28:         pass
  29:         
  30:         
  31:         i = lo
  32:         for j in range(lo, hi):
--------------------------------------------------------------------------------
[0.14046 s] killed by ts-3-5/test_3-5_0-9_272.py::test_quicksort_sorted_list

def test_quicksort_sorted_list():
        ar = [1, 2, 3, 4, 5]
        expected = [1, 2, 3, 4, 5]
>       quicksort(ar)

ts-3-5/test_3-5_0-9_272.py:21: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
quicksort:42: in quicksort
    ???
quicksort:21: in sort
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

ar = [1, 2, 3, 4, 5], lo = 0, hi = 4

>   ???
E   NameError: name 'pivot' is not defined

quicksort:34: NameError

   - [#  17] SDL quicksort: 
--------------------------------------------------------------------------------
  27:         
  28:         pivot = ar[hi]
  29:         
  30:         
- 31:         i = lo
+ 31:         pass
  32:         for j in range(lo, hi):
  33:             
  34:             if ar[j] <= pivot:
  35:                 (ar[i], ar[j]) = (ar[j], ar[i])
--------------------------------------------------------------------------------
[0.13981 s] killed by ts-3-5/test_3-5_0-9_272.py::test_quicksort_sorted_list

def test_quicksort_sorted_list():
        ar = [1, 2, 3, 4, 5]
        expected = [1, 2, 3, 4, 5]
>       quicksort(ar)

ts-3-5/test_3-5_0-9_272.py:21: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
quicksort:42: in quicksort
    ???
quicksort:21: in sort
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

ar = [1, 2, 3, 4, 5], lo = 0, hi = 4

>   ???
E   UnboundLocalError: local variable 'i' referenced before assignment

quicksort:35: UnboundLocalError

   - [#  18] SDL quicksort: 
--------------------------------------------------------------------------------
  31:         i = lo
  32:         for j in range(lo, hi):
  33:             
  34:             if ar[j] <= pivot:
- 35:                 (ar[i], ar[j]) = (ar[j], ar[i])
+ 35:                 pass
  36:                 i += 1
  37:         
  38:         (ar[i], ar[hi]) = (ar[hi], ar[i])
  39:         
--------------------------------------------------------------------------------
[0.14333 s] killed by ts-3-5/test_3-5_0-9_272.py::test_quicksort_random_list

def test_quicksort_random_list():
        ar = [3, 1, 4, 1, 5, 9, 2, 6]
        expected = [1, 1, 2, 3, 4, 5, 6, 9]
        quicksort(ar)
>       assert ar == expected
E       AssertionError

ts-3-5/test_3-5_0-9_272.py:34: AssertionError

   - [#  19] SDL quicksort: 
--------------------------------------------------------------------------------
  34:             if ar[j] <= pivot:
  35:                 (ar[i], ar[j]) = (ar[j], ar[i])
  36:                 i += 1
  37:         
- 38:         (ar[i], ar[hi]) = (ar[hi], ar[i])
+ 38:         pass
  39:         
  40:         return i
  41:     
  42:     sort(ar, 0, len(ar) - 1)
--------------------------------------------------------------------------------
[0.16178 s] killed by ts-3-5/test_3-5_0-9_272.py::test_quicksort_reverse_sorted_list

def test_quicksort_reverse_sorted_list():
        ar = [5, 4, 3, 2, 1]
        expected = [1, 2, 3, 4, 5]
        quicksort(ar)
>       assert ar == expected
E       AssertionError

ts-3-5/test_3-5_0-9_272.py:28: AssertionError

   - [#  21] SDL quicksort: 
--------------------------------------------------------------------------------
  38:         (ar[i], ar[hi]) = (ar[hi], ar[i])
  39:         
  40:         return i
  41:     
- 42:     sort(ar, 0, len(ar) - 1)
+ 42:     pass
  43:     
  44:     return ar
--------------------------------------------------------------------------------
[0.14217 s] killed by ts-3-5/test_3-5_0-9_272.py::test_quicksort_reverse_sorted_list

def test_quicksort_reverse_sorted_list():
        ar = [5, 4, 3, 2, 1]
        expected = [1, 2, 3, 4, 5]
        quicksort(ar)
>       assert ar == expected
E       AssertionError

ts-3-5/test_3-5_0-9_272.py:28: AssertionError

   - [#  22] SDL quicksort: 
--------------------------------------------------------------------------------
  40:         return i
  41:     
  42:     sort(ar, 0, len(ar) - 1)
  43:     
- 44:     return ar
+ 44:     pass
--------------------------------------------------------------------------------
[0.11982 s] survived

   - [#  23] ZIL quicksort: 
--------------------------------------------------------------------------------
  30:         
  31:         i = lo
  32:         for j in range(lo, hi):
  33:             
- 34:             if ar[j] <= pivot:
- 35:                 (ar[i], ar[j]) = (ar[j], ar[i])
- 36:                 i += 1
+ 34:             break
+ 35:         
+ 36:         
  37:         
  38:         (ar[i], ar[hi]) = (ar[hi], ar[i])
  39:         
  40:         return i
--------------------------------------------------------------------------------
[0.14140 s] killed by ts-3-5/test_3-5_0-9_272.py::test_quicksort_sorted_list

def test_quicksort_sorted_list():
        ar = [1, 2, 3, 4, 5]
        expected = [1, 2, 3, 4, 5]
        quicksort(ar)
>       assert ar == expected
E       AssertionError

ts-3-5/test_3-5_0-9_272.py:22: AssertionError
