1 : Job ID e8b152c14fd84eee92b3b4fee0d51df8
test outcome: killed
rabin_karp_substring_search.py, start pos: (30, 44), end pos: (30, 45)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -27,7 +27,7 @@
     # get the initial hashes
     for i in range(len(substring)):
-        rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
+        rolling_hash = (base * rolling_hash - ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

2 : Job ID cd301d2a8dbd4795aab192d9581599a6
test outcome: killed
rabin_karp_substring_search.py, start pos: (31, 48), end pos: (31, 49)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -28,7 +28,7 @@
     # get the initial hashes
     for i in range(len(substring)):
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
-        substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
+        substring_hash = (base * substring_hash - ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
ts-3-5/test_3-5_1-0_310.py F.F.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 3 failed, 2 passed in 0.14s ==========================

3 : Job ID 17eee8f538ea4934ba3c4e764cc58977
test outcome: killed
rabin_karp_substring_search.py, start pos: (33, 47), end pos: (33, 48)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -30,7 +30,7 @@
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
-    for i in range(len(string) - len(substring)+1):
+    for i in range(len(string) - len(substring)-1):
         # check if hash matches hash of substring
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
ts-3-5/test_3-5_1-0_310.py FF..F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 3 failed, 2 passed in 0.14s ==========================

4 : Job ID 78f2fa8af6a64545bece68dba327f242
test outcome: killed
rabin_karp_substring_search.py, start pos: (38, 37), end pos: (38, 38)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -35,7 +35,7 @@
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
-                if letter != string[i+s_i]:
+                if letter != string[i-s_i]:
                     break
             else:
                 return i
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

5 : Job ID 48c8ed51439c439190e601ddca7c9181
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 79), end pos: (45, 80)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 4
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) - ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

6 : Job ID 2a7c8c70b87f4caaab7a15391d4ccac7
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 94), end pos: (45, 95)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 5
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i - len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

7 : Job ID b96d0cc147ea42949c3eb2a5ff3850a6
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (48, 41), end pos: (48, 42)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 6
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -45,7 +45,7 @@
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
-            rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
+            rolling_hash = (rolling_hash - prime_modulus) % prime_modulus
     return -1
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.13s ===============================

8 : Job ID aa5dcf20ad384bfab080223472867e0e
test outcome: killed
rabin_karp_substring_search.py, start pos: (30, 44), end pos: (30, 45)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -27,7 +27,7 @@
     # get the initial hashes
     for i in range(len(substring)):
-        rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
+        rolling_hash = (base * rolling_hash * ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.13s ==========================

9 : Job ID 70a26419eb33452a8b35c33cfe1b3c5b
test outcome: killed
rabin_karp_substring_search.py, start pos: (31, 48), end pos: (31, 49)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -28,7 +28,7 @@
     # get the initial hashes
     for i in range(len(substring)):
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
-        substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
+        substring_hash = (base * substring_hash * ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
ts-3-5/test_3-5_1-0_310.py F.F.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 3 failed, 2 passed in 0.14s ==========================

10 : Job ID d1b557da5ab143419af300547563c9a7
test outcome: killed
rabin_karp_substring_search.py, start pos: (33, 47), end pos: (33, 48)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -30,7 +30,7 @@
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
-    for i in range(len(string) - len(substring)+1):
+    for i in range(len(string) - len(substring)*1):
         # check if hash matches hash of substring
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
ts-3-5/test_3-5_1-0_310.py .F..F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 2 failed, 3 passed in 0.13s ==========================

11 : Job ID b2b71b29bf124f11a54b8712753ceb85
test outcome: killed
rabin_karp_substring_search.py, start pos: (38, 37), end pos: (38, 38)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -35,7 +35,7 @@
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
-                if letter != string[i+s_i]:
+                if letter != string[i*s_i]:
                     break
             else:
                 return i
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

12 : Job ID 0fa9851c373946b88e8825818b25feb9
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 79), end pos: (45, 80)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 4
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) * ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.13s ==========================

13 : Job ID 1a727f637dc4489fa63ca5cd7ff207a0
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 94), end pos: (45, 95)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 5
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i * len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FF...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
========================= 2 failed, 3 passed in 0.13s ==========================

14 : Job ID f354a6cc1a14475eb7f6f58a93b5a246
test outcome: killed
rabin_karp_substring_search.py, start pos: (48, 41), end pos: (48, 42)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 6
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -45,7 +45,7 @@
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
-            rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
+            rolling_hash = (rolling_hash * prime_modulus) % prime_modulus
     return -1
ts-3-5/test_3-5_1-0_310.py F.F..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 2 failed, 3 passed in 0.13s ==========================

15 : Job ID 1ef14be53387478ab62b98e0e17bbc92
test outcome: killed
rabin_karp_substring_search.py, start pos: (30, 44), end pos: (30, 45)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -27,7 +27,7 @@
     # get the initial hashes
     for i in range(len(substring)):
-        rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
+        rolling_hash = (base * rolling_hash / ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

16 : Job ID b2dea2b1a1dd40a5b79544f00513ea25
test outcome: killed
rabin_karp_substring_search.py, start pos: (31, 48), end pos: (31, 49)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -28,7 +28,7 @@
     # get the initial hashes
     for i in range(len(substring)):
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
-        substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
+        substring_hash = (base * substring_hash / ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
ts-3-5/test_3-5_1-0_310.py F.F.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 3 failed, 2 passed in 0.14s ==========================

17 : Job ID 6abc3ce6e81a425c95ba474f06e8c890
test outcome: killed
rabin_karp_substring_search.py, start pos: (33, 47), end pos: (33, 48)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -30,7 +30,7 @@
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
-    for i in range(len(string) - len(substring)+1):
+    for i in range(len(string) - len(substring)/1):
         # check if hash matches hash of substring
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
ts-3-5/test_3-5_1-0_310.py FFFFF                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - TypeError...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
============================== 5 failed in 0.14s ===============================

18 : Job ID b672f104841249a7a689e7875d2c925d
test outcome: killed
rabin_karp_substring_search.py, start pos: (38, 37), end pos: (38, 38)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -35,7 +35,7 @@
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
-                if letter != string[i+s_i]:
+                if letter != string[i/s_i]:
                     break
             else:
                 return i
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - ZeroDivis...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.13s ==========================

19 : Job ID d26e5b196cd246fb8350422f0bb7d54a
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 79), end pos: (45, 80)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 4
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) / ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

20 : Job ID bd05efe4988047e3a8f6fb26dd53b58a
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 94), end pos: (45, 95)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 5
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i / len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFFF.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - TypeError...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
========================= 4 failed, 1 passed in 0.13s ==========================

21 : Job ID 9661c911c356419c865098282b929acb
test outcome: killed
rabin_karp_substring_search.py, start pos: (48, 41), end pos: (48, 42)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 6
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -45,7 +45,7 @@
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
-            rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
+            rolling_hash = (rolling_hash / prime_modulus) % prime_modulus
     return -1
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

22 : Job ID e330e487dfc041c3aea3ec2054cad46e
test outcome: killed
rabin_karp_substring_search.py, start pos: (30, 44), end pos: (30, 45)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -27,7 +27,7 @@
     # get the initial hashes
     for i in range(len(substring)):
-        rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
+        rolling_hash = (base * rolling_hash // ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

23 : Job ID eb2a9e3ee8af471ba326635ed31add62
test outcome: killed
rabin_karp_substring_search.py, start pos: (31, 48), end pos: (31, 49)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -28,7 +28,7 @@
     # get the initial hashes
     for i in range(len(substring)):
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
-        substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
+        substring_hash = (base * substring_hash // ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
ts-3-5/test_3-5_1-0_310.py F.F.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 3 failed, 2 passed in 0.14s ==========================

24 : Job ID dd99b95b15724f3285ec133e2a4c1641
test outcome: killed
rabin_karp_substring_search.py, start pos: (33, 47), end pos: (33, 48)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -30,7 +30,7 @@
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
-    for i in range(len(string) - len(substring)+1):
+    for i in range(len(string) - len(substring)//1):
         # check if hash matches hash of substring
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
ts-3-5/test_3-5_1-0_310.py .F..F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 2 failed, 3 passed in 0.13s ==========================
