25 : Job ID 630b73cc4bdd4b0eb592a6a6bbb0ad82
test outcome: killed
rabin_karp_substring_search.py, start pos: (38, 37), end pos: (38, 38)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -35,7 +35,7 @@
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
-                if letter != string[i+s_i]:
+                if letter != string[i//s_i]:
                     break
             else:
                 return i
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - ZeroDivis...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

26 : Job ID ee18ff683cdf4bc5a694df622e825b81
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 79), end pos: (45, 80)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 4
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) // ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.13s ==========================

27 : Job ID dbb5c607777e449982a7cf47cfc51dee
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 94), end pos: (45, 95)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 5
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i // len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FF...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
========================= 2 failed, 3 passed in 0.14s ==========================

28 : Job ID fab7215e131345b98fd1580dc89a7b6c
test outcome: killed
rabin_karp_substring_search.py, start pos: (48, 41), end pos: (48, 42)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 6
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -45,7 +45,7 @@
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
-            rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
+            rolling_hash = (rolling_hash // prime_modulus) % prime_modulus
     return -1
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

29 : Job ID 23134b5cd2c542bb821d74ea709a6d14
test outcome: killed
rabin_karp_substring_search.py, start pos: (30, 44), end pos: (30, 45)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -27,7 +27,7 @@
     # get the initial hashes
     for i in range(len(substring)):
-        rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
+        rolling_hash = (base * rolling_hash % ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

30 : Job ID c55d15b7ae124109ab5e526b0260d4c6
test outcome: killed
rabin_karp_substring_search.py, start pos: (31, 48), end pos: (31, 49)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -28,7 +28,7 @@
     # get the initial hashes
     for i in range(len(substring)):
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
-        substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
+        substring_hash = (base * substring_hash % ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
ts-3-5/test_3-5_1-0_310.py F.F.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 3 failed, 2 passed in 0.14s ==========================

31 : Job ID 3957245027e74fd29e6e02c63a777612
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (33, 47), end pos: (33, 48)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -30,7 +30,7 @@
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
-    for i in range(len(string) - len(substring)+1):
+    for i in range(len(string) - len(substring)%1):
         # check if hash matches hash of substring
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.13s ===============================

32 : Job ID 36b01cced13e4b3491b26f282a441349
test outcome: killed
rabin_karp_substring_search.py, start pos: (38, 37), end pos: (38, 38)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -35,7 +35,7 @@
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
-                if letter != string[i+s_i]:
+                if letter != string[i%s_i]:
                     break
             else:
                 return i
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - ZeroDivis...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

33 : Job ID 47f71e6adbeb47cfb20e7b8af60b46aa
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 79), end pos: (45, 80)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 4
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) % ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

34 : Job ID 7c00dccc0542470db42ef47a688fdb46
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 94), end pos: (45, 95)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 5
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i % len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FF...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
========================= 2 failed, 3 passed in 0.13s ==========================

35 : Job ID f76bcfe31acd4a62a753577ba4c9c1f5
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (48, 41), end pos: (48, 42)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 6
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -45,7 +45,7 @@
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
-            rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
+            rolling_hash = (rolling_hash % prime_modulus) % prime_modulus
     return -1
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.13s ===============================

36 : Job ID 034733feba1449639657014582808b18
test outcome: killed
rabin_karp_substring_search.py, start pos: (30, 44), end pos: (30, 45)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -27,7 +27,7 @@
     # get the initial hashes
     for i in range(len(substring)):
-        rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
+        rolling_hash = (base * rolling_hash ** ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

37 : Job ID 34f34f6015984b78ad7f879f71f8edbd
test outcome: killed
rabin_karp_substring_search.py, start pos: (31, 48), end pos: (31, 49)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -28,7 +28,7 @@
     # get the initial hashes
     for i in range(len(substring)):
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
-        substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
+        substring_hash = (base * substring_hash ** ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
ts-3-5/test_3-5_1-0_310.py F.F.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 3 failed, 2 passed in 0.14s ==========================

38 : Job ID 98120140009e4374a0f1e6e5d6f103db
test outcome: killed
rabin_karp_substring_search.py, start pos: (33, 47), end pos: (33, 48)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -30,7 +30,7 @@
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
-    for i in range(len(string) - len(substring)+1):
+    for i in range(len(string) - len(substring)**1):
         # check if hash matches hash of substring
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
ts-3-5/test_3-5_1-0_310.py .F..F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 2 failed, 3 passed in 0.14s ==========================

39 : Job ID 1d8d0c3a5a524304b9f4374a70a4c14c
test outcome: killed
rabin_karp_substring_search.py, start pos: (38, 37), end pos: (38, 38)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -35,7 +35,7 @@
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
-                if letter != string[i+s_i]:
+                if letter != string[i**s_i]:
                     break
             else:
                 return i
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.13s ==========================

40 : Job ID 1b2b629e14c74187ac0c059221c2f74d
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 79), end pos: (45, 80)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 4
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) ** ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.13s ==========================

41 : Job ID c29454bde73345efa77882390bdd4521
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 94), end pos: (45, 95)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 5
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i ** len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FF...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
========================= 2 failed, 3 passed in 0.13s ==========================

42 : Job ID 4a16d9235eae4895bd6c33e597dd2a5c
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (48, 41), end pos: (48, 42)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 6
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -45,7 +45,7 @@
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
-            rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
+            rolling_hash = (rolling_hash ** prime_modulus) % prime_modulus
     return -1
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.13s ===============================

43 : Job ID 584a12a9450d4716b2971e893131ef0b
test outcome: killed
rabin_karp_substring_search.py, start pos: (30, 44), end pos: (30, 45)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -27,7 +27,7 @@
     # get the initial hashes
     for i in range(len(substring)):
-        rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
+        rolling_hash = (base * rolling_hash >> ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.13s ==========================

44 : Job ID 96ef261f0d9a469fbed43a7af765a705
test outcome: killed
rabin_karp_substring_search.py, start pos: (31, 48), end pos: (31, 49)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -28,7 +28,7 @@
     # get the initial hashes
     for i in range(len(substring)):
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
-        substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
+        substring_hash = (base * substring_hash >> ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
ts-3-5/test_3-5_1-0_310.py F.F.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 3 failed, 2 passed in 0.14s ==========================

45 : Job ID baac8115337642e09d25d07eb48c22e8
test outcome: killed
rabin_karp_substring_search.py, start pos: (33, 47), end pos: (33, 48)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -30,7 +30,7 @@
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
-    for i in range(len(string) - len(substring)+1):
+    for i in range(len(string) - len(substring)>>1):
         # check if hash matches hash of substring
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
ts-3-5/test_3-5_1-0_310.py FF..F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 3 failed, 2 passed in 0.14s ==========================

46 : Job ID 74a67f3b1d4248d0a736667394517102
test outcome: killed
rabin_karp_substring_search.py, start pos: (38, 37), end pos: (38, 38)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -35,7 +35,7 @@
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
-                if letter != string[i+s_i]:
+                if letter != string[i>>s_i]:
                     break
             else:
                 return i
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.13s ==========================

47 : Job ID 9b2750902b2345cd96e022d7cef12a28
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 79), end pos: (45, 80)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 4
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) >> ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

48 : Job ID da4c30c3f6564638aee8ebf4953be1d6
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 94), end pos: (45, 95)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 5
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i >> len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FF...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
========================= 2 failed, 3 passed in 0.13s ==========================

49 : Job ID 58cc0ebe4044468e90db06bf7c06dfd8
test outcome: killed
rabin_karp_substring_search.py, start pos: (48, 41), end pos: (48, 42)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 6
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -45,7 +45,7 @@
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
-            rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
+            rolling_hash = (rolling_hash >> prime_modulus) % prime_modulus
     return -1
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================
