50 : Job ID d66bdab3b5cf4e2d8167f2e2fb971456
test outcome: killed
rabin_karp_substring_search.py, start pos: (30, 44), end pos: (30, 45)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -27,7 +27,7 @@
     # get the initial hashes
     for i in range(len(substring)):
-        rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
+        rolling_hash = (base * rolling_hash << ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

51 : Job ID b85eddce909644168f1dfe9da19969f3
test outcome: killed
rabin_karp_substring_search.py, start pos: (31, 48), end pos: (31, 49)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -28,7 +28,7 @@
     # get the initial hashes
     for i in range(len(substring)):
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
-        substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
+        substring_hash = (base * substring_hash << ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
ts-3-5/test_3-5_1-0_310.py F.F.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 3 failed, 2 passed in 0.14s ==========================

52 : Job ID dc7c214d730945d4a2d7943058d3615e
test outcome: killed
rabin_karp_substring_search.py, start pos: (33, 47), end pos: (33, 48)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -30,7 +30,7 @@
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
-    for i in range(len(string) - len(substring)+1):
+    for i in range(len(string) - len(substring)<<1):
         # check if hash matches hash of substring
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
ts-3-5/test_3-5_1-0_310.py ....F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 1 failed, 4 passed in 0.14s ==========================

53 : Job ID 1f8fc9670eb8411e9dd31a877ad56f6a
test outcome: killed
rabin_karp_substring_search.py, start pos: (38, 37), end pos: (38, 38)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -35,7 +35,7 @@
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
-                if letter != string[i+s_i]:
+                if letter != string[i<<s_i]:
                     break
             else:
                 return i
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.13s ==========================

54 : Job ID 41b7143b06e543649f99e9084aa5352a
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 79), end pos: (45, 80)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 4
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) << ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

55 : Job ID 732e1299ab594d5b84a5bffa37dcc99f
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 94), end pos: (45, 95)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 5
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i << len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FF.F.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - IndexErro...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
========================= 3 failed, 2 passed in 0.13s ==========================

56 : Job ID 7b79e3848f1c4d5295ccdb761987f396
test outcome: killed
rabin_karp_substring_search.py, start pos: (48, 41), end pos: (48, 42)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 6
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -45,7 +45,7 @@
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
-            rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
+            rolling_hash = (rolling_hash << prime_modulus) % prime_modulus
     return -1
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

57 : Job ID a73ae4153a4744c5ad774aaea2f21b3d
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (30, 44), end pos: (30, 45)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -27,7 +27,7 @@
     # get the initial hashes
     for i in range(len(substring)):
-        rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
+        rolling_hash = (base * rolling_hash | ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.13s ===============================

58 : Job ID 5081ac1097f945b7bc370d9d7ed4ff02
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (31, 48), end pos: (31, 49)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -28,7 +28,7 @@
     # get the initial hashes
     for i in range(len(substring)):
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
-        substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
+        substring_hash = (base * substring_hash | ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.13s ===============================

59 : Job ID 89196ddb2c81417e92663c1f0219c311
test outcome: killed
rabin_karp_substring_search.py, start pos: (33, 47), end pos: (33, 48)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -30,7 +30,7 @@
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
-    for i in range(len(string) - len(substring)+1):
+    for i in range(len(string) - len(substring)|1):
         # check if hash matches hash of substring
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
ts-3-5/test_3-5_1-0_310.py .F...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
========================= 1 failed, 4 passed in 0.14s ==========================

60 : Job ID 8a6e35df9b2c4d16b40dc53de24757dd
test outcome: killed
rabin_karp_substring_search.py, start pos: (38, 37), end pos: (38, 38)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -35,7 +35,7 @@
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
-                if letter != string[i+s_i]:
+                if letter != string[i|s_i]:
                     break
             else:
                 return i
ts-3-5/test_3-5_1-0_310.py .FF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 2 failed, 3 passed in 0.14s ==========================

61 : Job ID 9d30b8f5aabd439e8781745d02cba085
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (45, 79), end pos: (45, 80)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 4
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) | ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.14s ===============================

62 : Job ID d744af5a8cee4a328c2b5abda0518a7a
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 94), end pos: (45, 95)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 5
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i | len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py .F...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
========================= 1 failed, 4 passed in 0.13s ==========================

63 : Job ID 2095abb2865b49c1b0eca43340d82135
test outcome: killed
rabin_karp_substring_search.py, start pos: (48, 41), end pos: (48, 42)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 6
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -45,7 +45,7 @@
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
-            rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
+            rolling_hash = (rolling_hash | prime_modulus) % prime_modulus
     return -1
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

64 : Job ID c2f27296eb0b4b909ee33c6b5a46a6c5
test outcome: killed
rabin_karp_substring_search.py, start pos: (30, 44), end pos: (30, 45)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -27,7 +27,7 @@
     # get the initial hashes
     for i in range(len(substring)):
-        rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
+        rolling_hash = (base * rolling_hash & ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

65 : Job ID 21bcc3cdd96d45839673df212fd1119d
test outcome: killed
rabin_karp_substring_search.py, start pos: (31, 48), end pos: (31, 49)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -28,7 +28,7 @@
     # get the initial hashes
     for i in range(len(substring)):
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
-        substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
+        substring_hash = (base * substring_hash & ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
ts-3-5/test_3-5_1-0_310.py F.F.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 3 failed, 2 passed in 0.14s ==========================

66 : Job ID 64165b09618e46fcbc4cd6c06fa1f699
test outcome: killed
rabin_karp_substring_search.py, start pos: (33, 47), end pos: (33, 48)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -30,7 +30,7 @@
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
-    for i in range(len(string) - len(substring)+1):
+    for i in range(len(string) - len(substring)&1):
         # check if hash matches hash of substring
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

67 : Job ID f41bc92bce2e49af8065d78210a312bc
test outcome: killed
rabin_karp_substring_search.py, start pos: (38, 37), end pos: (38, 38)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -35,7 +35,7 @@
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
-                if letter != string[i+s_i]:
+                if letter != string[i&s_i]:
                     break
             else:
                 return i
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

68 : Job ID 4fd6c50f0c254defa9bf5a6302a84932
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 79), end pos: (45, 80)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 4
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) & ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py F.F..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 2 failed, 3 passed in 0.14s ==========================

69 : Job ID 78922a4e544640818d60487634f47400
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 94), end pos: (45, 95)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 5
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i & len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FF...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
========================= 2 failed, 3 passed in 0.13s ==========================

70 : Job ID 141e9123b9e240ecb773c5052912b7db
test outcome: killed
rabin_karp_substring_search.py, start pos: (48, 41), end pos: (48, 42)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 6
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -45,7 +45,7 @@
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
-            rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
+            rolling_hash = (rolling_hash & prime_modulus) % prime_modulus
     return -1
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

71 : Job ID 6e6f318c55bf48a486bf410974943251
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (30, 44), end pos: (30, 45)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -27,7 +27,7 @@
     # get the initial hashes
     for i in range(len(substring)):
-        rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
+        rolling_hash = (base * rolling_hash ^ ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.14s ===============================

72 : Job ID 79a60d0ace384c2b9ad166a2ad582cd9
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (31, 48), end pos: (31, 49)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -28,7 +28,7 @@
     # get the initial hashes
     for i in range(len(substring)):
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
-        substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
+        substring_hash = (base * substring_hash ^ ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.13s ===============================

73 : Job ID c0e71aa2b4294c389c7429b1bd25f447
test outcome: killed
rabin_karp_substring_search.py, start pos: (33, 47), end pos: (33, 48)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -30,7 +30,7 @@
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
-    for i in range(len(string) - len(substring)+1):
+    for i in range(len(string) - len(substring)^1):
         # check if hash matches hash of substring
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
ts-3-5/test_3-5_1-0_310.py FF...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
========================= 2 failed, 3 passed in 0.14s ==========================

74 : Job ID 68cb429f669e4a738d37a719e5135f6f
test outcome: killed
rabin_karp_substring_search.py, start pos: (38, 37), end pos: (38, 38)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -35,7 +35,7 @@
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
-                if letter != string[i+s_i]:
+                if letter != string[i^s_i]:
                     break
             else:
                 return i
ts-3-5/test_3-5_1-0_310.py .FF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 2 failed, 3 passed in 0.13s ==========================

75 : Job ID 2f652865526c440ea8bf3c4d1661bfa5
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (45, 79), end pos: (45, 80)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 4
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) ^ ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.13s ===============================
