76 : Job ID ebd69bde2f27472d900da5f9683ca3d4
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 94), end pos: (45, 95)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 5
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i ^ len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py .F...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
========================= 1 failed, 4 passed in 0.14s ==========================

77 : Job ID 43daceb51b254303853d41af4cce1663
test outcome: killed
rabin_karp_substring_search.py, start pos: (48, 41), end pos: (48, 42)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 6
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -45,7 +45,7 @@
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
-            rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
+            rolling_hash = (rolling_hash ^ prime_modulus) % prime_modulus
     return -1
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

78 : Job ID 1d3f80181c4b4138b91addaaa7d43868
test outcome: killed
rabin_karp_substring_search.py, start pos: (26, 36), end pos: (26, 37)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -23,7 +23,7 @@
     # substring hash
     substring_hash = 0
     rolling_hash = 0
-    base_n = pow(base,len(substring)-1)%prime_modulus
+    base_n = pow(base,len(substring)+1)%prime_modulus
     # get the initial hashes
     for i in range(len(substring)):
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

79 : Job ID 9766dc4c375e4054a88cfc02302a3e3b
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (33, 31), end pos: (33, 32)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -30,7 +30,7 @@
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
-    for i in range(len(string) - len(substring)+1):
+    for i in range(len(string) + len(substring)+1):
         # check if hash matches hash of substring
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.14s ===============================

80 : Job ID c53b6c6667074133bdee1620767626b1
test outcome: killed
rabin_karp_substring_search.py, start pos: (43, 27), end pos: (43, 28)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -40,7 +40,7 @@
             else:
                 return i
         # recalulate hash
-        if i < len(string) - len(substring):
+        if i < len(string) + len(substring):
             # remove the ith number and add the i+len(substring)th number
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
ts-3-5/test_3-5_1-0_310.py ...F.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
========================= 1 failed, 4 passed in 0.13s ==========================

81 : Job ID dc1bac278a8d40e4bd50418654a238cd
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 42), end pos: (45, 43)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash + (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.13s ==========================

82 : Job ID 4ed8bf3f0fbf4a66916a426c053d25b3
test outcome: killed
rabin_karp_substring_search.py, start pos: (26, 36), end pos: (26, 37)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -23,7 +23,7 @@
     # substring hash
     substring_hash = 0
     rolling_hash = 0
-    base_n = pow(base,len(substring)-1)%prime_modulus
+    base_n = pow(base,len(substring)*1)%prime_modulus
     # get the initial hashes
     for i in range(len(substring)):
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.13s ==========================

83 : Job ID fe56c63d191143b688f224ca6dc91785
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (33, 31), end pos: (33, 32)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -30,7 +30,7 @@
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
-    for i in range(len(string) - len(substring)+1):
+    for i in range(len(string) * len(substring)+1):
         # check if hash matches hash of substring
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.13s ===============================

84 : Job ID f7a5a70d1f24411cbd4e14f3c766cb96
test outcome: killed
rabin_karp_substring_search.py, start pos: (43, 27), end pos: (43, 28)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -40,7 +40,7 @@
             else:
                 return i
         # recalulate hash
-        if i < len(string) - len(substring):
+        if i < len(string) * len(substring):
             # remove the ith number and add the i+len(substring)th number
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
ts-3-5/test_3-5_1-0_310.py ...F.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
========================= 1 failed, 4 passed in 0.13s ==========================

85 : Job ID 1ab5d11c6caf4fbaaf177557f69128fb
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 42), end pos: (45, 43)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash * (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

86 : Job ID 241d45efd0e14571b153f274ede40aea
test outcome: killed
rabin_karp_substring_search.py, start pos: (26, 36), end pos: (26, 37)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -23,7 +23,7 @@
     # substring hash
     substring_hash = 0
     rolling_hash = 0
-    base_n = pow(base,len(substring)-1)%prime_modulus
+    base_n = pow(base,len(substring)/1)%prime_modulus
     # get the initial hashes
     for i in range(len(substring)):
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

87 : Job ID f0f5829035404141a1a6eca779a5aa4a
test outcome: killed
rabin_karp_substring_search.py, start pos: (33, 31), end pos: (33, 32)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -30,7 +30,7 @@
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
-    for i in range(len(string) - len(substring)+1):
+    for i in range(len(string) / len(substring)+1):
         # check if hash matches hash of substring
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
ts-3-5/test_3-5_1-0_310.py FFFFF                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - TypeError...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
============================== 5 failed in 0.14s ===============================

88 : Job ID 1432574f8ba84d5b93cbece0dfef8b91
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (43, 27), end pos: (43, 28)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -40,7 +40,7 @@
             else:
                 return i
         # recalulate hash
-        if i < len(string) - len(substring):
+        if i < len(string) / len(substring):
             # remove the ith number and add the i+len(substring)th number
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.14s ===============================

89 : Job ID f558835ee08a4b67b4777267f5733de4
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 42), end pos: (45, 43)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash / (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

90 : Job ID 145c0b08f1184182b23b4be6aaeeed0f
test outcome: killed
rabin_karp_substring_search.py, start pos: (26, 36), end pos: (26, 37)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -23,7 +23,7 @@
     # substring hash
     substring_hash = 0
     rolling_hash = 0
-    base_n = pow(base,len(substring)-1)%prime_modulus
+    base_n = pow(base,len(substring)//1)%prime_modulus
     # get the initial hashes
     for i in range(len(substring)):
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

91 : Job ID 2948929284714391a13da13ec366f027
test outcome: killed
rabin_karp_substring_search.py, start pos: (33, 31), end pos: (33, 32)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -30,7 +30,7 @@
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
-    for i in range(len(string) - len(substring)+1):
+    for i in range(len(string) // len(substring)+1):
         # check if hash matches hash of substring
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
ts-3-5/test_3-5_1-0_310.py .F...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
========================= 1 failed, 4 passed in 0.13s ==========================

92 : Job ID 72f64835d49248e8b44b44ac7c950859
test outcome: killed
rabin_karp_substring_search.py, start pos: (43, 27), end pos: (43, 28)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -40,7 +40,7 @@
             else:
                 return i
         # recalulate hash
-        if i < len(string) - len(substring):
+        if i < len(string) // len(substring):
             # remove the ith number and add the i+len(substring)th number
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
ts-3-5/test_3-5_1-0_310.py .F...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
========================= 1 failed, 4 passed in 0.13s ==========================

93 : Job ID de7260a7e0e148878b8883acae9a0a96
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 42), end pos: (45, 43)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash // (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.13s ==========================

94 : Job ID cf3d15a4ff9c465ba29b206b26580a3d
test outcome: killed
rabin_karp_substring_search.py, start pos: (26, 36), end pos: (26, 37)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -23,7 +23,7 @@
     # substring hash
     substring_hash = 0
     rolling_hash = 0
-    base_n = pow(base,len(substring)-1)%prime_modulus
+    base_n = pow(base,len(substring)%1)%prime_modulus
     # get the initial hashes
     for i in range(len(substring)):
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.13s ==========================

95 : Job ID b80cb02910f74c4ba4ee674d77b623ef
test outcome: killed
rabin_karp_substring_search.py, start pos: (33, 31), end pos: (33, 32)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -30,7 +30,7 @@
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
-    for i in range(len(string) - len(substring)+1):
+    for i in range(len(string) % len(substring)+1):
         # check if hash matches hash of substring
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
ts-3-5/test_3-5_1-0_310.py FF...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
========================= 2 failed, 3 passed in 0.14s ==========================

96 : Job ID fd72945a2baf4b9c8413037dd6f48da3
test outcome: killed
rabin_karp_substring_search.py, start pos: (43, 27), end pos: (43, 28)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -40,7 +40,7 @@
             else:
                 return i
         # recalulate hash
-        if i < len(string) - len(substring):
+        if i < len(string) % len(substring):
             # remove the ith number and add the i+len(substring)th number
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
ts-3-5/test_3-5_1-0_310.py FF...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
========================= 2 failed, 3 passed in 0.13s ==========================

97 : Job ID 93bfcf6edd2048de8e91bb4926d989cf
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 42), end pos: (45, 43)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash % (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

98 : Job ID 25886d4e6e1e47288483a91937936780
test outcome: killed
rabin_karp_substring_search.py, start pos: (26, 36), end pos: (26, 37)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -23,7 +23,7 @@
     # substring hash
     substring_hash = 0
     rolling_hash = 0
-    base_n = pow(base,len(substring)-1)%prime_modulus
+    base_n = pow(base,len(substring)**1)%prime_modulus
     # get the initial hashes
     for i in range(len(substring)):
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.13s ==========================

99 : Job ID 0e96dea74c90450bb8c5b1275920d532
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (33, 31), end pos: (33, 32)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -30,7 +30,7 @@
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
-    for i in range(len(string) - len(substring)+1):
+    for i in range(len(string) ** len(substring)+1):
         # check if hash matches hash of substring
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.13s ===============================

100 : Job ID cf929030350244998f0ec95ab996b312
test outcome: killed
rabin_karp_substring_search.py, start pos: (43, 27), end pos: (43, 28)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -40,7 +40,7 @@
             else:
                 return i
         # recalulate hash
-        if i < len(string) - len(substring):
+        if i < len(string) ** len(substring):
             # remove the ith number and add the i+len(substring)th number
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
ts-3-5/test_3-5_1-0_310.py ...F.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
========================= 1 failed, 4 passed in 0.14s ==========================

101 : Job ID 39e928a5e2c949669160bf8ed893b5d6
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 42), end pos: (45, 43)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash ** (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.18s ==========================

102 : Job ID 26e6396953094cf8908ce2a972ecf618
test outcome: killed
rabin_karp_substring_search.py, start pos: (26, 36), end pos: (26, 37)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -23,7 +23,7 @@
     # substring hash
     substring_hash = 0
     rolling_hash = 0
-    base_n = pow(base,len(substring)-1)%prime_modulus
+    base_n = pow(base,len(substring)>>1)%prime_modulus
     # get the initial hashes
     for i in range(len(substring)):
ts-3-5/test_3-5_1-0_310.py ..F..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 1 failed, 4 passed in 0.13s ==========================
