128 : Job ID 3681e621d4404ea3bbc6af89148baaee
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 52), end pos: (45, 53)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n - ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FF...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
========================= 2 failed, 3 passed in 0.13s ==========================

129 : Job ID cfb3576001804626a5dec7aebb2fac14
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 71), end pos: (45, 72)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) - base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

130 : Job ID 92fe5d48683946cd87f82f1f7769e354
test outcome: killed
rabin_karp_substring_search.py, start pos: (30, 29), end pos: (30, 30)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -27,7 +27,7 @@
     # get the initial hashes
     for i in range(len(substring)):
-        rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
+        rolling_hash = (base / rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
ts-3-5/test_3-5_1-0_310.py FFFFF                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - ZeroDivis...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
============================== 5 failed in 0.13s ===============================

131 : Job ID e11ff42b6c68418180d4c25b6bab762c
test outcome: killed
rabin_karp_substring_search.py, start pos: (31, 31), end pos: (31, 32)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -28,7 +28,7 @@
     # get the initial hashes
     for i in range(len(substring)):
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
-        substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
+        substring_hash = (base / substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
ts-3-5/test_3-5_1-0_310.py FFFFF                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - ZeroDivis...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
============================== 5 failed in 0.13s ===============================

132 : Job ID b3b9b775c5284f88bc37e87d571b6a15
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 52), end pos: (45, 53)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n / ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

133 : Job ID 681af811a95f4fd98c9fd9a81f5da805
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 71), end pos: (45, 72)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) / base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

134 : Job ID aa488808ba524ce099c4dccea419b979
test outcome: killed
rabin_karp_substring_search.py, start pos: (30, 29), end pos: (30, 30)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -27,7 +27,7 @@
     # get the initial hashes
     for i in range(len(substring)):
-        rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
+        rolling_hash = (base // rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
ts-3-5/test_3-5_1-0_310.py FFFFF                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - ZeroDivis...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
============================== 5 failed in 0.14s ===============================

135 : Job ID 58262d6867e14fd0af859cac9eb12a42
test outcome: killed
rabin_karp_substring_search.py, start pos: (31, 31), end pos: (31, 32)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -28,7 +28,7 @@
     # get the initial hashes
     for i in range(len(substring)):
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
-        substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
+        substring_hash = (base // substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
ts-3-5/test_3-5_1-0_310.py FFFFF                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - ZeroDivis...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
============================== 5 failed in 0.13s ===============================

136 : Job ID 7435a6199bc94987b7a443a695775d5c
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 52), end pos: (45, 53)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n // ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

137 : Job ID 007823c4b669433f92c618ad3f0eba87
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 71), end pos: (45, 72)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) // base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.15s ==========================

138 : Job ID 105577e64af04cb1bf742905b8165323
test outcome: killed
rabin_karp_substring_search.py, start pos: (30, 29), end pos: (30, 30)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -27,7 +27,7 @@
     # get the initial hashes
     for i in range(len(substring)):
-        rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
+        rolling_hash = (base % rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
ts-3-5/test_3-5_1-0_310.py FFFFF                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - ZeroDivis...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
============================== 5 failed in 0.16s ===============================

139 : Job ID 977d81693488473ba35a0132f5d81cb3
test outcome: killed
rabin_karp_substring_search.py, start pos: (31, 31), end pos: (31, 32)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -28,7 +28,7 @@
     # get the initial hashes
     for i in range(len(substring)):
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
-        substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
+        substring_hash = (base % substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
ts-3-5/test_3-5_1-0_310.py FFFFF                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - ZeroDivis...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
============================== 5 failed in 0.13s ===============================

140 : Job ID 5a5c47a77b824094babe9bfc6930f163
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 52), end pos: (45, 53)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n % ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

141 : Job ID 37ef570c3fc64a9b82e92a11671d9ac9
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 71), end pos: (45, 72)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) % base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.13s ==========================

142 : Job ID 2e050131683f47178575d1eabb98a315
test outcome: killed
rabin_karp_substring_search.py, start pos: (30, 29), end pos: (30, 30)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -27,7 +27,7 @@
     # get the initial hashes
     for i in range(len(substring)):
-        rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
+        rolling_hash = (base ** rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

143 : Job ID 4a5ec001077c4f9f9d67bd520f13212c
test outcome: killed
rabin_karp_substring_search.py, start pos: (31, 31), end pos: (31, 32)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -28,7 +28,7 @@
     # get the initial hashes
     for i in range(len(substring)):
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
-        substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
+        substring_hash = (base ** substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

144 : Job ID 761b1a4ddcd54d978376ef3af2c90acf
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 52), end pos: (45, 53)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n ** ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py F.F..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 2 failed, 3 passed in 0.13s ==========================

145 : Job ID e76d0820569d47bca2d8a2b7b1fe2ca3
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 71), end pos: (45, 72)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) ** base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.13s ==========================

146 : Job ID 7d66ebe43ef74586b8e77470962a44e4
test outcome: killed
rabin_karp_substring_search.py, start pos: (30, 29), end pos: (30, 30)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -27,7 +27,7 @@
     # get the initial hashes
     for i in range(len(substring)):
-        rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
+        rolling_hash = (base >> rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

147 : Job ID 67d942c1abe44a3fb92dd976c20805d5
test outcome: killed
rabin_karp_substring_search.py, start pos: (31, 31), end pos: (31, 32)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -28,7 +28,7 @@
     # get the initial hashes
     for i in range(len(substring)):
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
-        substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
+        substring_hash = (base >> substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
ts-3-5/test_3-5_1-0_310.py F.F.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 3 failed, 2 passed in 0.13s ==========================

148 : Job ID c01b9d029daf48ac9fe95f639d2ca766
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 52), end pos: (45, 53)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n >> ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

149 : Job ID 0cff6964749840329e191c3f7dda44af
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 71), end pos: (45, 72)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) >> base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.13s ==========================
