200 : Job ID 97bb8a3b34124206baf259b4bfb7abe6
test outcome: killed
rabin_karp_substring_search.py, start pos: (48, 58), end pos: (48, 59)
operator: core/ReplaceBinaryOperator_Mod_RShift, occurrence: 4
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -45,7 +45,7 @@
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
-            rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
+            rolling_hash = (rolling_hash + prime_modulus) >> prime_modulus
     return -1
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

201 : Job ID 291a70bd4ddc46fd86b258bfb9b59ddf
test outcome: killed
rabin_karp_substring_search.py, start pos: (26, 39), end pos: (26, 40)
operator: core/ReplaceBinaryOperator_Mod_LShift, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -23,7 +23,7 @@
     # substring hash
     substring_hash = 0
     rolling_hash = 0
-    base_n = pow(base,len(substring)-1)%prime_modulus
+    base_n = pow(base,len(substring)-1)<<prime_modulus
     # get the initial hashes
     for i in range(len(substring)):
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.13s ==========================

202 : Job ID 239aef34305a4bb69333b0427a5120ea
test outcome: killed
rabin_karp_substring_search.py, start pos: (30, 61), end pos: (30, 62)
operator: core/ReplaceBinaryOperator_Mod_LShift, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -27,7 +27,7 @@
     # get the initial hashes
     for i in range(len(substring)):
-        rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
+        rolling_hash = (base * rolling_hash + ord(string[i]))<<prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

203 : Job ID de2dd93896f34846a53e05bcc9bf38b2
test outcome: killed
rabin_karp_substring_search.py, start pos: (31, 68), end pos: (31, 69)
operator: core/ReplaceBinaryOperator_Mod_LShift, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -28,7 +28,7 @@
     # get the initial hashes
     for i in range(len(substring)):
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
-        substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
+        substring_hash = (base * substring_hash + ord(substring[i]))<<prime_modulus
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

204 : Job ID 4a64f8448e5c43b5b0a23c1a8ff5b2a3
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 112), end pos: (45, 113)
operator: core/ReplaceBinaryOperator_Mod_LShift, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])<<prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.13s ==========================

205 : Job ID 55f09144f1ed45b785ea709032341c0c
test outcome: killed
rabin_karp_substring_search.py, start pos: (48, 58), end pos: (48, 59)
operator: core/ReplaceBinaryOperator_Mod_LShift, occurrence: 4
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -45,7 +45,7 @@
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
-            rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
+            rolling_hash = (rolling_hash + prime_modulus) << prime_modulus
     return -1
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

206 : Job ID 81814635538b4cdabb06811139a4d0e6
test outcome: killed
rabin_karp_substring_search.py, start pos: (26, 39), end pos: (26, 40)
operator: core/ReplaceBinaryOperator_Mod_BitOr, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -23,7 +23,7 @@
     # substring hash
     substring_hash = 0
     rolling_hash = 0
-    base_n = pow(base,len(substring)-1)%prime_modulus
+    base_n = pow(base,len(substring)-1)|prime_modulus
     # get the initial hashes
     for i in range(len(substring)):
ts-3-5/test_3-5_1-0_310.py FF...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
========================= 2 failed, 3 passed in 0.14s ==========================

207 : Job ID be3077971d0a43959af97903ada6f63a
test outcome: killed
rabin_karp_substring_search.py, start pos: (30, 61), end pos: (30, 62)
operator: core/ReplaceBinaryOperator_Mod_BitOr, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -27,7 +27,7 @@
     # get the initial hashes
     for i in range(len(substring)):
-        rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
+        rolling_hash = (base * rolling_hash + ord(string[i]))|prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

208 : Job ID dc6fddeb7ccf464fbfac9cc67d8a37a5
test outcome: killed
rabin_karp_substring_search.py, start pos: (31, 68), end pos: (31, 69)
operator: core/ReplaceBinaryOperator_Mod_BitOr, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -28,7 +28,7 @@
     # get the initial hashes
     for i in range(len(substring)):
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
-        substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
+        substring_hash = (base * substring_hash + ord(substring[i]))|prime_modulus
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.13s ==========================

209 : Job ID 02ffa15aa8ab455985e3250c861205cb
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 112), end pos: (45, 113)
operator: core/ReplaceBinaryOperator_Mod_BitOr, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])|prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.13s ==========================

210 : Job ID 087d720ebffa4b3ebdf6e637c4fff394
test outcome: killed
rabin_karp_substring_search.py, start pos: (48, 58), end pos: (48, 59)
operator: core/ReplaceBinaryOperator_Mod_BitOr, occurrence: 4
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -45,7 +45,7 @@
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
-            rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
+            rolling_hash = (rolling_hash + prime_modulus) | prime_modulus
     return -1
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.13s ==========================

211 : Job ID b9b2e2b97ca54c0da2ff0d0435d5fe52
test outcome: killed
rabin_karp_substring_search.py, start pos: (26, 39), end pos: (26, 40)
operator: core/ReplaceBinaryOperator_Mod_BitAnd, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -23,7 +23,7 @@
     # substring hash
     substring_hash = 0
     rolling_hash = 0
-    base_n = pow(base,len(substring)-1)%prime_modulus
+    base_n = pow(base,len(substring)-1)&prime_modulus
     # get the initial hashes
     for i in range(len(substring)):
ts-3-5/test_3-5_1-0_310.py ..F..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 1 failed, 4 passed in 0.13s ==========================

212 : Job ID 5a8e7a8bff4b47c39a24c980276e233d
test outcome: killed
rabin_karp_substring_search.py, start pos: (30, 61), end pos: (30, 62)
operator: core/ReplaceBinaryOperator_Mod_BitAnd, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -27,7 +27,7 @@
     # get the initial hashes
     for i in range(len(substring)):
-        rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
+        rolling_hash = (base * rolling_hash + ord(string[i]))&prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.16s ==========================

213 : Job ID d4f4a86939a043a5bddff7a097dd76b0
test outcome: killed
rabin_karp_substring_search.py, start pos: (31, 68), end pos: (31, 69)
operator: core/ReplaceBinaryOperator_Mod_BitAnd, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -28,7 +28,7 @@
     # get the initial hashes
     for i in range(len(substring)):
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
-        substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
+        substring_hash = (base * substring_hash + ord(substring[i]))&prime_modulus
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

214 : Job ID 9f6b3cf77d2c4118bce8abb4e5c66f0b
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 112), end pos: (45, 113)
operator: core/ReplaceBinaryOperator_Mod_BitAnd, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])&prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

215 : Job ID f23f6113e6b8481ba73f12be645e71db
test outcome: killed
rabin_karp_substring_search.py, start pos: (48, 58), end pos: (48, 59)
operator: core/ReplaceBinaryOperator_Mod_BitAnd, occurrence: 4
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -45,7 +45,7 @@
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
-            rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
+            rolling_hash = (rolling_hash + prime_modulus) & prime_modulus
     return -1
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.13s ==========================

216 : Job ID 5166b00b14f3464eb38d9356daf54d58
test outcome: killed
rabin_karp_substring_search.py, start pos: (26, 39), end pos: (26, 40)
operator: core/ReplaceBinaryOperator_Mod_BitXor, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -23,7 +23,7 @@
     # substring hash
     substring_hash = 0
     rolling_hash = 0
-    base_n = pow(base,len(substring)-1)%prime_modulus
+    base_n = pow(base,len(substring)-1)^prime_modulus
     # get the initial hashes
     for i in range(len(substring)):
ts-3-5/test_3-5_1-0_310.py FF...                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
========================= 2 failed, 3 passed in 0.13s ==========================

217 : Job ID 2eda9d80f9804b329d1a6330f6d69142
test outcome: killed
rabin_karp_substring_search.py, start pos: (30, 61), end pos: (30, 62)
operator: core/ReplaceBinaryOperator_Mod_BitXor, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -27,7 +27,7 @@
     # get the initial hashes
     for i in range(len(substring)):
-        rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
+        rolling_hash = (base * rolling_hash + ord(string[i]))^prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
     for i in range(len(string) - len(substring)+1):
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.13s ==========================

218 : Job ID 00a569f140384642b6326a422c16f31a
test outcome: killed
rabin_karp_substring_search.py, start pos: (31, 68), end pos: (31, 69)
operator: core/ReplaceBinaryOperator_Mod_BitXor, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -28,7 +28,7 @@
     # get the initial hashes
     for i in range(len(substring)):
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
-        substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
+        substring_hash = (base * substring_hash + ord(substring[i]))^prime_modulus
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

219 : Job ID a7764dc3ecbd4a8d842322c2427286cd
test outcome: killed
rabin_karp_substring_search.py, start pos: (45, 112), end pos: (45, 113)
operator: core/ReplaceBinaryOperator_Mod_BitXor, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -42,7 +42,7 @@
         # recalulate hash
         if i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
-            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
+            rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])^prime_modulus
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

220 : Job ID 3840eec8871c4673a7aabbb855b363af
test outcome: killed
rabin_karp_substring_search.py, start pos: (48, 58), end pos: (48, 59)
operator: core/ReplaceBinaryOperator_Mod_BitXor, occurrence: 4
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -45,7 +45,7 @@
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
             # make sure t >= 0
-            rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
+            rolling_hash = (rolling_hash + prime_modulus) ^ prime_modulus
     return -1
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.13s ==========================

221 : Job ID 02467fcca949420f9bae69093b5bb021
test outcome: killed
rabin_karp_substring_search.py, start pos: (35, 24), end pos: (35, 26)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -32,7 +32,7 @@
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
-        if rolling_hash == substring_hash:
+        if rolling_hash != substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
                 if letter != string[i+s_i]:
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.13s ==========================

222 : Job ID 11ba6bf61c2a46a7b31b417e7ecc5726
test outcome: killed
rabin_karp_substring_search.py, start pos: (35, 24), end pos: (35, 26)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -32,7 +32,7 @@
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
-        if rolling_hash == substring_hash:
+        if rolling_hash < substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
                 if letter != string[i+s_i]:
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.13s ==========================

223 : Job ID d5fe399a88f4418d9f38e999789c8924
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (35, 24), end pos: (35, 26)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -32,7 +32,7 @@
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
-        if rolling_hash == substring_hash:
+        if rolling_hash <= substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
                 if letter != string[i+s_i]:
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.13s ===============================

224 : Job ID cc5ebd81ffe34489bf9671580539cec1
test outcome: killed
rabin_karp_substring_search.py, start pos: (35, 24), end pos: (35, 26)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -32,7 +32,7 @@
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
-        if rolling_hash == substring_hash:
+        if rolling_hash > substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
                 if letter != string[i+s_i]:
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.13s ==========================
