225 : Job ID 62be00749ead4711be07f4abfbeecc40
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (35, 24), end pos: (35, 26)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -32,7 +32,7 @@
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
-        if rolling_hash == substring_hash:
+        if rolling_hash >= substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
                 if letter != string[i+s_i]:
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.13s ===============================

226 : Job ID 2950e815c28841dc8f57bd5fb5360650
test outcome: killed
rabin_karp_substring_search.py, start pos: (35, 24), end pos: (35, 26)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -32,7 +32,7 @@
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
-        if rolling_hash == substring_hash:
+        if rolling_hash is substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
                 if letter != string[i+s_i]:
ts-3-5/test_3-5_1-0_310.py F....                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
========================= 1 failed, 4 passed in 0.13s ==========================

227 : Job ID 6a408ef2a23a419ca2af190364cc4f06
test outcome: killed
rabin_karp_substring_search.py, start pos: (35, 24), end pos: (35, 26)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -32,7 +32,7 @@
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
-        if rolling_hash == substring_hash:
+        if rolling_hash is not substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
                 if letter != string[i+s_i]:
ts-3-5/test_3-5_1-0_310.py .FF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 3 failed, 2 passed in 0.14s ==========================

228 : Job ID 31119567d1f54478859ffb761be064ec
test outcome: killed
rabin_karp_substring_search.py, start pos: (38, 26), end pos: (38, 28)
operator: core/ReplaceComparisonOperator_NotEq_Eq, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -35,7 +35,7 @@
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
-                if letter != string[i+s_i]:
+                if letter == string[i+s_i]:
                     break
             else:
                 return i
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.15s ==========================

229 : Job ID 34d0916d062d4cd8a3cdaaf3760923ed
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (38, 26), end pos: (38, 28)
operator: core/ReplaceComparisonOperator_NotEq_Lt, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -35,7 +35,7 @@
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
-                if letter != string[i+s_i]:
+                if letter < string[i+s_i]:
                     break
             else:
                 return i
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.12s ===============================

230 : Job ID a0dd176debbd4e5994044659b7a1057c
test outcome: killed
rabin_karp_substring_search.py, start pos: (38, 26), end pos: (38, 28)
operator: core/ReplaceComparisonOperator_NotEq_LtE, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -35,7 +35,7 @@
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
-                if letter != string[i+s_i]:
+                if letter <= string[i+s_i]:
                     break
             else:
                 return i
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.13s ==========================

231 : Job ID ecd6ba48bdc64da088e5a8a0674ac5a1
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (38, 26), end pos: (38, 28)
operator: core/ReplaceComparisonOperator_NotEq_Gt, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -35,7 +35,7 @@
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
-                if letter != string[i+s_i]:
+                if letter > string[i+s_i]:
                     break
             else:
                 return i
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.13s ===============================

232 : Job ID 7053876b905c4e14aeb414991e29dc00
test outcome: killed
rabin_karp_substring_search.py, start pos: (38, 26), end pos: (38, 28)
operator: core/ReplaceComparisonOperator_NotEq_GtE, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -35,7 +35,7 @@
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
-                if letter != string[i+s_i]:
+                if letter >= string[i+s_i]:
                     break
             else:
                 return i
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.13s ==========================

233 : Job ID 8fa0ca9c53a64cb2a94d7f8f7a79ab23
test outcome: killed
rabin_karp_substring_search.py, start pos: (38, 26), end pos: (38, 28)
operator: core/ReplaceComparisonOperator_NotEq_Is, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -35,7 +35,7 @@
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
-                if letter != string[i+s_i]:
+                if letter is string[i+s_i]:
                     break
             else:
                 return i
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

234 : Job ID 3091579114ac47449cea6f70af9621fe
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (38, 26), end pos: (38, 28)
operator: core/ReplaceComparisonOperator_NotEq_IsNot, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -35,7 +35,7 @@
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
-                if letter != string[i+s_i]:
+                if letter is not string[i+s_i]:
                     break
             else:
                 return i
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.13s ===============================

235 : Job ID 91b7bb2f8c2c4eceab4b9aa6fe38fbc4
test outcome: killed
rabin_karp_substring_search.py, start pos: (43, 13), end pos: (43, 14)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -40,7 +40,7 @@
             else:
                 return i
         # recalulate hash
-        if i < len(string) - len(substring):
+        if i == len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
ts-3-5/test_3-5_1-0_310.py FFFF.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - IndexErro...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
========================= 4 failed, 1 passed in 0.13s ==========================

236 : Job ID 3a70be4c64624a12a0788d9a7591c7d9
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (43, 13), end pos: (43, 14)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -40,7 +40,7 @@
             else:
                 return i
         # recalulate hash
-        if i < len(string) - len(substring):
+        if i != len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.13s ===============================

237 : Job ID e5eebb112fab411993d33e1c25572b3a
test outcome: killed
rabin_karp_substring_search.py, start pos: (43, 13), end pos: (43, 14)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -40,7 +40,7 @@
             else:
                 return i
         # recalulate hash
-        if i < len(string) - len(substring):
+        if i <= len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
ts-3-5/test_3-5_1-0_310.py ...F.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
========================= 1 failed, 4 passed in 0.13s ==========================

238 : Job ID 3b97b3e80c6e4626a360b85b010ac2a9
test outcome: killed
rabin_karp_substring_search.py, start pos: (43, 13), end pos: (43, 14)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -40,7 +40,7 @@
             else:
                 return i
         # recalulate hash
-        if i < len(string) - len(substring):
+        if i > len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

239 : Job ID 0d3f791c530a4390aa22dad4036a8990
test outcome: killed
rabin_karp_substring_search.py, start pos: (43, 13), end pos: (43, 14)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -40,7 +40,7 @@
             else:
                 return i
         # recalulate hash
-        if i < len(string) - len(substring):
+        if i >= len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
ts-3-5/test_3-5_1-0_310.py FFFF.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - IndexErro...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
========================= 4 failed, 1 passed in 0.14s ==========================

240 : Job ID 568ea18f258142c59581cc248e413753
test outcome: killed
rabin_karp_substring_search.py, start pos: (43, 13), end pos: (43, 14)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -40,7 +40,7 @@
             else:
                 return i
         # recalulate hash
-        if i < len(string) - len(substring):
+        if i is len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
ts-3-5/test_3-5_1-0_310.py FFFF.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - IndexErro...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
========================= 4 failed, 1 passed in 0.14s ==========================

241 : Job ID 685d50e4269a487399f5188cce990311
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (43, 13), end pos: (43, 14)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -40,7 +40,7 @@
             else:
                 return i
         # recalulate hash
-        if i < len(string) - len(substring):
+        if i is not len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.13s ===============================

242 : Job ID 344e8ee7b01643169852f98ff4659cce
test outcome: killed
rabin_karp_substring_search.py, start pos: (50, 11), end pos: (50, 12)
operator: core/ReplaceUnaryOperator_USub_UAdd, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -47,5 +47,5 @@
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
-    return -1
+    return +1
ts-3-5/test_3-5_1-0_310.py ...F.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
========================= 1 failed, 4 passed in 0.13s ==========================

243 : Job ID 28256f27a49c46118fe69e342399b61f
test outcome: killed
rabin_karp_substring_search.py, start pos: (50, 11), end pos: (50, 12)
operator: core/ReplaceUnaryOperator_USub_Invert, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -47,5 +47,5 @@
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
-    return -1
+    return ~1
ts-3-5/test_3-5_1-0_310.py ...F.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
========================= 1 failed, 4 passed in 0.13s ==========================

244 : Job ID d3385d2de8fd4956ac287bd4bc0a00d9
test outcome: killed
rabin_karp_substring_search.py, start pos: (50, 11), end pos: (50, 12)
operator: core/ReplaceUnaryOperator_USub_Not, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -47,5 +47,5 @@
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
-    return -1
+    return not 1
ts-3-5/test_3-5_1-0_310.py ...F.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
========================= 1 failed, 4 passed in 0.13s ==========================

245 : Job ID 4b1ce3b1913044d28f85b98080f56b30
test outcome: killed
rabin_karp_substring_search.py, start pos: (50, 11), end pos: (50, 12)
operator: core/ReplaceUnaryOperator_Delete_USub, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -47,5 +47,5 @@
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
-    return -1
+    return 1
ts-3-5/test_3-5_1-0_310.py ...F.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
========================= 1 failed, 4 passed in 0.13s ==========================

246 : Job ID 1366a510076e457c99809e91e5acc6fc
test outcome: killed
rabin_karp_substring_search.py, start pos: (35, 11), end pos: (35, 41)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -32,7 +32,7 @@
     for i in range(len(string) - len(substring)+1):
         # check if hash matches hash of substring
-        if rolling_hash == substring_hash:
+        if not rolling_hash == substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
                 if letter != string[i+s_i]:
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.13s ==========================

247 : Job ID c7c1bfe80d38474cb7a8e880b96a0b54
test outcome: killed
rabin_karp_substring_search.py, start pos: (38, 19), end pos: (38, 42)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -35,7 +35,7 @@
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
-                if letter != string[i+s_i]:
+                if not letter != string[i+s_i]:
                     break
             else:
                 return i
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

248 : Job ID fe3156edd2aa4636a7fac9fa617dd447
test outcome: killed
rabin_karp_substring_search.py, start pos: (43, 11), end pos: (43, 43)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -40,7 +40,7 @@
             else:
                 return i
         # recalulate hash
-        if i < len(string) - len(substring):
+        if not i < len(string) - len(substring):
             # remove the ith number and add the i+len(substring)th number
             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + ord(string[i + len(substring)])%prime_modulus
ts-3-5/test_3-5_1-0_310.py FFFF.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - IndexErro...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
========================= 4 failed, 1 passed in 0.14s ==========================

249 : Job ID 67aebff2f58d45bdbeb75232e478715b
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (39, 20), end pos: (39, 25)
operator: core/ReplaceBreakWithContinue, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -36,7 +36,7 @@
             # check if the letters are 1:1
             for s_i, letter in enumerate(substring):
                 if letter != string[i+s_i]:
-                    break
+                    continue
             else:
                 return i
         # recalulate hash
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.13s ===============================

250 : Job ID 1f1aa96f142d4c8a88a27745385cef80
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (1, 54), end pos: (1, 57)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -1,4 +1,4 @@
-def rabin_karp_find_substring(string, substring, base=256, prime_modulus=487):
+def rabin_karp_find_substring(string, substring, base= 257, prime_modulus=487):
     """
     Finds occurances of a substring in a string.
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.13s ===============================

251 : Job ID 3916ffcabe0f413ab19e74ea00d03e0c
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (1, 54), end pos: (1, 57)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -1,4 +1,4 @@
-def rabin_karp_find_substring(string, substring, base=256, prime_modulus=487):
+def rabin_karp_find_substring(string, substring, base= 255, prime_modulus=487):
     """
     Finds occurances of a substring in a string.
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.13s ===============================

252 : Job ID 3c8d8b06362a4f5ebe4bd73e9cfc7cb6
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (1, 73), end pos: (1, 76)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -1,4 +1,4 @@
-def rabin_karp_find_substring(string, substring, base=256, prime_modulus=487):
+def rabin_karp_find_substring(string, substring, base=256, prime_modulus= 488):
     """
     Finds occurances of a substring in a string.
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.14s ===============================

253 : Job ID 21343e3e70f646bba0954207a1a3d48f
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (1, 73), end pos: (1, 76)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -1,4 +1,4 @@
-def rabin_karp_find_substring(string, substring, base=256, prime_modulus=487):
+def rabin_karp_find_substring(string, substring, base=256, prime_modulus= 486):
     """
     Finds occurances of a substring in a string.
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.13s ===============================

254 : Job ID 978df492dc3e43e68fa78d19a2a070b7
test outcome: killed
rabin_karp_substring_search.py, start pos: (24, 21), end pos: (24, 22)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -21,7 +21,7 @@
     """
     # substring hash
-    substring_hash = 0
+    substring_hash = 1
     rolling_hash = 0
     base_n = pow(base,len(substring)-1)%prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================
