255 : Job ID 3060953c8aa243ce84f895bc9683b68a
test outcome: killed
rabin_karp_substring_search.py, start pos: (24, 21), end pos: (24, 22)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -21,7 +21,7 @@
     """
     # substring hash
-    substring_hash = 0
+    substring_hash = -1
     rolling_hash = 0
     base_n = pow(base,len(substring)-1)%prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.13s ==========================

256 : Job ID fee4769d92e94a46835feb1183703ad1
test outcome: killed
rabin_karp_substring_search.py, start pos: (25, 19), end pos: (25, 20)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -22,7 +22,7 @@
     """
     # substring hash
     substring_hash = 0
-    rolling_hash = 0
+    rolling_hash = 1
     base_n = pow(base,len(substring)-1)%prime_modulus
     # get the initial hashes
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

257 : Job ID 36c25a637d2141498a4ae2da1e7e7986
test outcome: killed
rabin_karp_substring_search.py, start pos: (25, 19), end pos: (25, 20)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -22,7 +22,7 @@
     """
     # substring hash
     substring_hash = 0
-    rolling_hash = 0
+    rolling_hash = -1
     base_n = pow(base,len(substring)-1)%prime_modulus
     # get the initial hashes
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

258 : Job ID 2c258c5c253f4de7b93360eb84066e22
test outcome: killed
rabin_karp_substring_search.py, start pos: (26, 37), end pos: (26, 38)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -23,7 +23,7 @@
     # substring hash
     substring_hash = 0
     rolling_hash = 0
-    base_n = pow(base,len(substring)-1)%prime_modulus
+    base_n = pow(base,len(substring)- 2)%prime_modulus
     # get the initial hashes
     for i in range(len(substring)):
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

259 : Job ID 8c42aabc0c8b4bb99ef9278300904ab5
test outcome: killed
rabin_karp_substring_search.py, start pos: (26, 37), end pos: (26, 38)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -23,7 +23,7 @@
     # substring hash
     substring_hash = 0
     rolling_hash = 0
-    base_n = pow(base,len(substring)-1)%prime_modulus
+    base_n = pow(base,len(substring)- 0)%prime_modulus
     # get the initial hashes
     for i in range(len(substring)):
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.13s ==========================

260 : Job ID 8550155e50ca4ee898f73935b54853ec
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (33, 48), end pos: (33, 49)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -30,7 +30,7 @@
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
-    for i in range(len(string) - len(substring)+1):
+    for i in range(len(string) - len(substring)+ 2):
         # check if hash matches hash of substring
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.13s ===============================

261 : Job ID 4ef698d5b5d34d978e162944ec2e9b76
test outcome: killed
rabin_karp_substring_search.py, start pos: (33, 48), end pos: (33, 49)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -30,7 +30,7 @@
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
-    for i in range(len(string) - len(substring)+1):
+    for i in range(len(string) - len(substring)+ 0):
         # check if hash matches hash of substring
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
ts-3-5/test_3-5_1-0_310.py .F..F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 2 failed, 3 passed in 0.14s ==========================

262 : Job ID b155c4d425214e76b5d02ac6fbe1e5b1
test outcome: killed
rabin_karp_substring_search.py, start pos: (50, 12), end pos: (50, 13)
operator: core/NumberReplacer, occurrence: 12
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -47,5 +47,5 @@
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
-    return -1
+    return - 2
ts-3-5/test_3-5_1-0_310.py ...F.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
========================= 1 failed, 4 passed in 0.14s ==========================

263 : Job ID 8ce8867de98a4d79b90ac86749952eb6
test outcome: killed
rabin_karp_substring_search.py, start pos: (50, 12), end pos: (50, 13)
operator: core/NumberReplacer, occurrence: 13
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -47,5 +47,5 @@
             # make sure t >= 0
             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
-    return -1
+    return - 0
ts-3-5/test_3-5_1-0_310.py ...F.                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_no_occurrence
========================= 1 failed, 4 passed in 0.13s ==========================

264 : Job ID 3055bbd624454de98d2adb0bd711b24e
test outcome: killed
rabin_karp_substring_search.py, start pos: (29, 13), end pos: (29, 34)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -26,7 +26,7 @@
     base_n = pow(base,len(substring)-1)%prime_modulus
     # get the initial hashes
-    for i in range(len(substring)):
+    for i in []:
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
ts-3-5/test_3-5_1-0_310.py FFF..                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
========================= 3 failed, 2 passed in 0.14s ==========================

265 : Job ID ae463c25912b4985ba7dbf3f80ea1b61
test outcome: killed
rabin_karp_substring_search.py, start pos: (33, 13), end pos: (33, 50)
operator: core/ZeroIterationForLoop, occurrence: 1
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -30,7 +30,7 @@
         rolling_hash = (base * rolling_hash + ord(string[i]))%prime_modulus
         substring_hash = (base * substring_hash + ord(substring[i]))%prime_modulus
-    for i in range(len(string) - len(substring)+1):
+    for i in []:
         # check if hash matches hash of substring
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
ts-3-5/test_3-5_1-0_310.py FFF.F                                         [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring - Assertion...
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_with_base_and_prime_modulus
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_multiple_occurrences
FAILED ts-3-5/test_3-5_1-0_310.py::test_rabin_karp_find_substring_long_substring
========================= 4 failed, 1 passed in 0.14s ==========================

266 : Job ID 1e7ecb69a85c4c658c3c77fa3a76f894
SURVIVED
test outcome: survived
rabin_karp_substring_search.py, start pos: (37, 31), end pos: (37, 51)
operator: core/ZeroIterationForLoop, occurrence: 2
--- mutation diff ---
--- arabin_karp_substring_search.py
+++ brabin_karp_substring_search.py
@@ -34,7 +34,7 @@
         # check if hash matches hash of substring
         if rolling_hash == substring_hash:
             # check if the letters are 1:1
-            for s_i, letter in enumerate(substring):
+            for s_i, letter in []:
                 if letter != string[i+s_i]:
                     break
             else:
ts-3-5/test_3-5_1-0_310.py .....                                         [100%]
============================== 5 passed in 0.14s ===============================
