   - [#   1] AOD rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  46:             
  47:             
  48:             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
  49:     
- 50:     return -1
+ 50:     return 1
--------------------------------------------------------------------------------
[0.18658 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_no_match

def test_rabin_karp_find_substring_no_match():
>       assert rabin_karp_find_substring('hello', 'world') == -1
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:17: AssertionError

   - [#   4] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  26:     base_n = pow(base, len(substring) - 1) % prime_modulus
  27:     
  28:     
  29:     for i in range(len(substring)):
- 30:         rolling_hash = ((base * rolling_hash) + ord(string[i])) % prime_modulus
+ 30:         rolling_hash = ((base / rolling_hash) + ord(string[i])) % prime_modulus
  31:         substring_hash = ((base * substring_hash) + ord(substring[i])) % prime_modulus
  32:     
  33:     for i in range((len(string) - len(substring)) + 1):
  34:         
--------------------------------------------------------------------------------
[0.18884 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3

ts-3-5/test_3-5_0-9_276.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

string = 'hello', substring = 'lo', base = 256, prime_modulus = 487

>   ???
E   ZeroDivisionError: division by zero

rabin_karp_substring_search:30: ZeroDivisionError

   - [#   5] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  26:     base_n = pow(base, len(substring) - 1) % prime_modulus
  27:     
  28:     
  29:     for i in range(len(substring)):
- 30:         rolling_hash = ((base * rolling_hash) + ord(string[i])) % prime_modulus
+ 30:         rolling_hash = ((base // rolling_hash) + ord(string[i])) % prime_modulus
  31:         substring_hash = ((base * substring_hash) + ord(substring[i])) % prime_modulus
  32:     
  33:     for i in range((len(string) - len(substring)) + 1):
  34:         
--------------------------------------------------------------------------------
[0.19185 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3

ts-3-5/test_3-5_0-9_276.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

string = 'hello', substring = 'lo', base = 256, prime_modulus = 487

>   ???
E   ZeroDivisionError: integer division or modulo by zero

rabin_karp_substring_search:30: ZeroDivisionError

   - [#   6] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  26:     base_n = pow(base, len(substring) - 1) % prime_modulus
  27:     
  28:     
  29:     for i in range(len(substring)):
- 30:         rolling_hash = ((base * rolling_hash) + ord(string[i])) % prime_modulus
+ 30:         rolling_hash = ((base ** rolling_hash) + ord(string[i])) % prime_modulus
  31:         substring_hash = ((base * substring_hash) + ord(substring[i])) % prime_modulus
  32:     
  33:     for i in range((len(string) - len(substring)) + 1):
  34:         
--------------------------------------------------------------------------------
[0.19057 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#   7] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  26:     base_n = pow(base, len(substring) - 1) % prime_modulus
  27:     
  28:     
  29:     for i in range(len(substring)):
- 30:         rolling_hash = ((base * rolling_hash) + ord(string[i])) % prime_modulus
+ 30:         rolling_hash = ((base * rolling_hash) - ord(string[i])) % prime_modulus
  31:         substring_hash = ((base * substring_hash) + ord(substring[i])) % prime_modulus
  32:     
  33:     for i in range((len(string) - len(substring)) + 1):
  34:         
--------------------------------------------------------------------------------
[0.19322 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#   8] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  26:     base_n = pow(base, len(substring) - 1) % prime_modulus
  27:     
  28:     
  29:     for i in range(len(substring)):
- 30:         rolling_hash = ((base * rolling_hash) + ord(string[i])) % prime_modulus
+ 30:         rolling_hash = ((base * rolling_hash) + ord(string[i])) * prime_modulus
  31:         substring_hash = ((base * substring_hash) + ord(substring[i])) % prime_modulus
  32:     
  33:     for i in range((len(string) - len(substring)) + 1):
  34:         
--------------------------------------------------------------------------------
[0.19138 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#   9] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  27:     
  28:     
  29:     for i in range(len(substring)):
  30:         rolling_hash = ((base * rolling_hash) + ord(string[i])) % prime_modulus
- 31:         substring_hash = ((base * substring_hash) + ord(substring[i])) % prime_modulus
+ 31:         substring_hash = ((base / substring_hash) + ord(substring[i])) % prime_modulus
  32:     
  33:     for i in range((len(string) - len(substring)) + 1):
  34:         
  35:         if rolling_hash == substring_hash:
--------------------------------------------------------------------------------
[0.19326 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3

ts-3-5/test_3-5_0-9_276.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

string = 'hello', substring = 'lo', base = 256, prime_modulus = 487

>   ???
E   ZeroDivisionError: division by zero

rabin_karp_substring_search:31: ZeroDivisionError

   - [#  10] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  27:     
  28:     
  29:     for i in range(len(substring)):
  30:         rolling_hash = ((base * rolling_hash) + ord(string[i])) % prime_modulus
- 31:         substring_hash = ((base * substring_hash) + ord(substring[i])) % prime_modulus
+ 31:         substring_hash = ((base // substring_hash) + ord(substring[i])) % prime_modulus
  32:     
  33:     for i in range((len(string) - len(substring)) + 1):
  34:         
  35:         if rolling_hash == substring_hash:
--------------------------------------------------------------------------------
[0.19487 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3

ts-3-5/test_3-5_0-9_276.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

string = 'hello', substring = 'lo', base = 256, prime_modulus = 487

>   ???
E   ZeroDivisionError: integer division or modulo by zero

rabin_karp_substring_search:31: ZeroDivisionError

   - [#  11] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  27:     
  28:     
  29:     for i in range(len(substring)):
  30:         rolling_hash = ((base * rolling_hash) + ord(string[i])) % prime_modulus
- 31:         substring_hash = ((base * substring_hash) + ord(substring[i])) % prime_modulus
+ 31:         substring_hash = ((base ** substring_hash) + ord(substring[i])) % prime_modulus
  32:     
  33:     for i in range((len(string) - len(substring)) + 1):
  34:         
  35:         if rolling_hash == substring_hash:
--------------------------------------------------------------------------------
[0.19297 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  12] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  27:     
  28:     
  29:     for i in range(len(substring)):
  30:         rolling_hash = ((base * rolling_hash) + ord(string[i])) % prime_modulus
- 31:         substring_hash = ((base * substring_hash) + ord(substring[i])) % prime_modulus
+ 31:         substring_hash = ((base * substring_hash) - ord(substring[i])) % prime_modulus
  32:     
  33:     for i in range((len(string) - len(substring)) + 1):
  34:         
  35:         if rolling_hash == substring_hash:
--------------------------------------------------------------------------------
[0.21716 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_partial_match

def test_rabin_karp_find_substring_partial_match():
>       assert rabin_karp_find_substring('hello', 'ell') == 1
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:20: AssertionError

   - [#  13] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  27:     
  28:     
  29:     for i in range(len(substring)):
  30:         rolling_hash = ((base * rolling_hash) + ord(string[i])) % prime_modulus
- 31:         substring_hash = ((base * substring_hash) + ord(substring[i])) % prime_modulus
+ 31:         substring_hash = ((base * substring_hash) + ord(substring[i])) * prime_modulus
  32:     
  33:     for i in range((len(string) - len(substring)) + 1):
  34:         
  35:         if rolling_hash == substring_hash:
--------------------------------------------------------------------------------
[0.18368 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  14] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  29:     for i in range(len(substring)):
  30:         rolling_hash = ((base * rolling_hash) + ord(string[i])) % prime_modulus
  31:         substring_hash = ((base * substring_hash) + ord(substring[i])) % prime_modulus
  32:     
- 33:     for i in range((len(string) - len(substring)) + 1):
+ 33:     for i in range((len(string) + len(substring)) + 1):
  34:         
  35:         if rolling_hash == substring_hash:
  36:             
  37:             for (s_i, letter) in enumerate(substring):
--------------------------------------------------------------------------------
[0.16477 s] survived

   - [#  15] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  29:     for i in range(len(substring)):
  30:         rolling_hash = ((base * rolling_hash) + ord(string[i])) % prime_modulus
  31:         substring_hash = ((base * substring_hash) + ord(substring[i])) % prime_modulus
  32:     
- 33:     for i in range((len(string) - len(substring)) + 1):
+ 33:     for i in range((len(string) - len(substring)) - 1):
  34:         
  35:         if rolling_hash == substring_hash:
  36:             
  37:             for (s_i, letter) in enumerate(substring):
--------------------------------------------------------------------------------
[0.19875 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  16] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  34:         
  35:         if rolling_hash == substring_hash:
  36:             
  37:             for (s_i, letter) in enumerate(substring):
- 38:                 if letter != string[i + s_i]:
+ 38:                 if letter != string[i - s_i]:
  39:                     break
  40:             else:
  41:                 return i
  42:         
--------------------------------------------------------------------------------
[0.20106 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  17] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  39:                     break
  40:             else:
  41:                 return i
  42:         
- 43:         if i < len(string) - len(substring):
+ 43:         if i < len(string) + len(substring):
  44:             
  45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
  46:             
  47:             
--------------------------------------------------------------------------------
[0.20305 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_no_match

def test_rabin_karp_find_substring_no_match():
>       assert rabin_karp_find_substring('hello', 'world') == -1

ts-3-5/test_3-5_0-9_276.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

string = 'hello', substring = 'world', base = 256, prime_modulus = 487

>   ???
E   IndexError: string index out of range

rabin_karp_substring_search:45: IndexError

   - [#  18] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  41:                 return i
  42:         
  43:         if i < len(string) - len(substring):
  44:             
- 45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
+ 45:             rolling_hash = ((rolling_hash + (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
  46:             
  47:             
  48:             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
  49:     
--------------------------------------------------------------------------------
[0.18490 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  19] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  41:                 return i
  42:         
  43:         if i < len(string) - len(substring):
  44:             
- 45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
+ 45:             rolling_hash = ((rolling_hash - (base_n / ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
  46:             
  47:             
  48:             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
  49:     
--------------------------------------------------------------------------------
[0.18805 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  20] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  41:                 return i
  42:         
  43:         if i < len(string) - len(substring):
  44:             
- 45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
+ 45:             rolling_hash = ((rolling_hash - (base_n // ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
  46:             
  47:             
  48:             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
  49:     
--------------------------------------------------------------------------------
[0.19941 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  21] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  41:                 return i
  42:         
  43:         if i < len(string) - len(substring):
  44:             
- 45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
+ 45:             rolling_hash = ((rolling_hash - (base_n ** ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
  46:             
  47:             
  48:             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
  49:     
--------------------------------------------------------------------------------
[0.20210 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_partial_match

def test_rabin_karp_find_substring_partial_match():
>       assert rabin_karp_find_substring('hello', 'ell') == 1
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:20: AssertionError

   - [#  22] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  41:                 return i
  42:         
  43:         if i < len(string) - len(substring):
  44:             
- 45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
+ 45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) / base) + (ord(string[i + len(substring)]) % prime_modulus)
  46:             
  47:             
  48:             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
  49:     
--------------------------------------------------------------------------------
[0.19787 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  23] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  41:                 return i
  42:         
  43:         if i < len(string) - len(substring):
  44:             
- 45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
+ 45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) // base) + (ord(string[i + len(substring)]) % prime_modulus)
  46:             
  47:             
  48:             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
  49:     
--------------------------------------------------------------------------------
[0.19901 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  24] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  41:                 return i
  42:         
  43:         if i < len(string) - len(substring):
  44:             
- 45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
+ 45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) ** base) + (ord(string[i + len(substring)]) % prime_modulus)
  46:             
  47:             
  48:             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
  49:     
--------------------------------------------------------------------------------
[0.19923 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  25] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  41:                 return i
  42:         
  43:         if i < len(string) - len(substring):
  44:             
- 45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
+ 45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) - (ord(string[i + len(substring)]) % prime_modulus)
  46:             
  47:             
  48:             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
  49:     
--------------------------------------------------------------------------------
[0.20029 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  26] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  41:                 return i
  42:         
  43:         if i < len(string) - len(substring):
  44:             
- 45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
+ 45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i - len(substring)]) % prime_modulus)
  46:             
  47:             
  48:             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
  49:     
--------------------------------------------------------------------------------
[0.18621 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  27] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  41:                 return i
  42:         
  43:         if i < len(string) - len(substring):
  44:             
- 45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
+ 45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) * prime_modulus)
  46:             
  47:             
  48:             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
  49:     
--------------------------------------------------------------------------------
[0.19980 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  28] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  44:             
  45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
  46:             
  47:             
- 48:             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
+ 48:             rolling_hash = (rolling_hash - prime_modulus) % prime_modulus
  49:     
  50:     return -1
--------------------------------------------------------------------------------
[0.17724 s] survived

   - [#  29] AOR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  44:             
  45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
  46:             
  47:             
- 48:             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
+ 48:             rolling_hash = (rolling_hash + prime_modulus) * prime_modulus
  49:     
  50:     return -1
--------------------------------------------------------------------------------
[0.21382 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  32] COI rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  31:         substring_hash = ((base * substring_hash) + ord(substring[i])) % prime_modulus
  32:     
  33:     for i in range((len(string) - len(substring)) + 1):
  34:         
- 35:         if rolling_hash == substring_hash:
+ 35:         if not (rolling_hash == substring_hash):
  36:             
  37:             for (s_i, letter) in enumerate(substring):
  38:                 if letter != string[i + s_i]:
  39:                     break
--------------------------------------------------------------------------------
[0.19546 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  33] COI rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  34:         
  35:         if rolling_hash == substring_hash:
  36:             
  37:             for (s_i, letter) in enumerate(substring):
- 38:                 if letter != string[i + s_i]:
+ 38:                 if not (letter != string[i + s_i]):
  39:                     break
  40:             else:
  41:                 return i
  42:         
--------------------------------------------------------------------------------
[0.20113 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  34] COI rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  39:                     break
  40:             else:
  41:                 return i
  42:         
- 43:         if i < len(string) - len(substring):
+ 43:         if not (i < len(string) - len(substring)):
  44:             
  45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
  46:             
  47:             
--------------------------------------------------------------------------------
[0.19990 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3

ts-3-5/test_3-5_0-9_276.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

string = 'hello', substring = 'lo', base = 256, prime_modulus = 487

>   ???
E   IndexError: string index out of range

rabin_karp_substring_search:45: IndexError
