   - [#  35] OIL rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  28:     
  29:     for i in range(len(substring)):
  30:         rolling_hash = ((base * rolling_hash) + ord(string[i])) % prime_modulus
  31:         substring_hash = ((base * substring_hash) + ord(substring[i])) % prime_modulus
- 32:     
+ 32:         break
  33:     for i in range((len(string) - len(substring)) + 1):
  34:         
  35:         if rolling_hash == substring_hash:
  36:             
--------------------------------------------------------------------------------
[0.19628 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  36] OIL rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
  46:             
  47:             
  48:             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
- 49:     
+ 49:         break
  50:     return -1
--------------------------------------------------------------------------------
[0.19803 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  37] OIL rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  36:             
  37:             for (s_i, letter) in enumerate(substring):
  38:                 if letter != string[i + s_i]:
  39:                     break
- 40:             else:
- 41:                 return i
+ 40:                 break
+ 41:             else:return i
  42:         
  43:         if i < len(string) - len(substring):
  44:             
  45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
--------------------------------------------------------------------------------
[0.19071 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  38] RIL rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  25:     rolling_hash = 0
  26:     base_n = pow(base, len(substring) - 1) % prime_modulus
  27:     
  28:     
- 29:     for i in range(len(substring)):
+ 29:     for i in reversed(range(len(substring))):
  30:         rolling_hash = ((base * rolling_hash) + ord(string[i])) % prime_modulus
  31:         substring_hash = ((base * substring_hash) + ord(substring[i])) % prime_modulus
  32:     
  33:     for i in range((len(string) - len(substring)) + 1):
--------------------------------------------------------------------------------
[0.19893 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  39] RIL rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  29:     for i in range(len(substring)):
  30:         rolling_hash = ((base * rolling_hash) + ord(string[i])) % prime_modulus
  31:         substring_hash = ((base * substring_hash) + ord(substring[i])) % prime_modulus
  32:     
- 33:     for i in range((len(string) - len(substring)) + 1):
+ 33:     for i in reversed(range((len(string) - len(substring)) + 1)):
  34:         
  35:         if rolling_hash == substring_hash:
  36:             
  37:             for (s_i, letter) in enumerate(substring):
--------------------------------------------------------------------------------
[0.19877 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  41] ROR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  31:         substring_hash = ((base * substring_hash) + ord(substring[i])) % prime_modulus
  32:     
  33:     for i in range((len(string) - len(substring)) + 1):
  34:         
- 35:         if rolling_hash == substring_hash:
+ 35:         if rolling_hash != substring_hash:
  36:             
  37:             for (s_i, letter) in enumerate(substring):
  38:                 if letter != string[i + s_i]:
  39:                     break
--------------------------------------------------------------------------------
[0.19547 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  42] ROR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  34:         
  35:         if rolling_hash == substring_hash:
  36:             
  37:             for (s_i, letter) in enumerate(substring):
- 38:                 if letter != string[i + s_i]:
+ 38:                 if letter == string[i + s_i]:
  39:                     break
  40:             else:
  41:                 return i
  42:         
--------------------------------------------------------------------------------
[0.20068 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  43] ROR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  39:                     break
  40:             else:
  41:                 return i
  42:         
- 43:         if i < len(string) - len(substring):
+ 43:         if i > len(string) - len(substring):
  44:             
  45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
  46:             
  47:             
--------------------------------------------------------------------------------
[0.20009 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  44] ROR rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  39:                     break
  40:             else:
  41:                 return i
  42:         
- 43:         if i < len(string) - len(substring):
+ 43:         if i <= len(string) - len(substring):
  44:             
  45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
  46:             
  47:             
--------------------------------------------------------------------------------
[0.20365 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_no_match

def test_rabin_karp_find_substring_no_match():
>       assert rabin_karp_find_substring('hello', 'world') == -1

ts-3-5/test_3-5_0-9_276.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

string = 'hello', substring = 'world', base = 256, prime_modulus = 487

>   ???
E   IndexError: string index out of range

rabin_karp_substring_search:45: IndexError

   - [#  45] SDL rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  20:         of a substring that is within the string.
  21: 
  22:     '''
  23:     
- 24:     substring_hash = 0
+ 24:     pass
  25:     rolling_hash = 0
  26:     base_n = pow(base, len(substring) - 1) % prime_modulus
  27:     
  28:     
--------------------------------------------------------------------------------
[0.18767 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3

ts-3-5/test_3-5_0-9_276.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

string = 'hello', substring = 'lo', base = 256, prime_modulus = 487

>   ???
E   UnboundLocalError: local variable 'substring_hash' referenced before assignment

rabin_karp_substring_search:31: UnboundLocalError

   - [#  46] SDL rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  21: 
  22:     '''
  23:     
  24:     substring_hash = 0
- 25:     rolling_hash = 0
+ 25:     pass
  26:     base_n = pow(base, len(substring) - 1) % prime_modulus
  27:     
  28:     
  29:     for i in range(len(substring)):
--------------------------------------------------------------------------------
[0.18884 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3

ts-3-5/test_3-5_0-9_276.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

string = 'hello', substring = 'lo', base = 256, prime_modulus = 487

>   ???
E   UnboundLocalError: local variable 'rolling_hash' referenced before assignment

rabin_karp_substring_search:30: UnboundLocalError

   - [#  47] SDL rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  22:     '''
  23:     
  24:     substring_hash = 0
  25:     rolling_hash = 0
- 26:     base_n = pow(base, len(substring) - 1) % prime_modulus
+ 26:     pass
  27:     
  28:     
  29:     for i in range(len(substring)):
  30:         rolling_hash = ((base * rolling_hash) + ord(string[i])) % prime_modulus
--------------------------------------------------------------------------------
[0.18978 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3

ts-3-5/test_3-5_0-9_276.py:14: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

string = 'hello', substring = 'lo', base = 256, prime_modulus = 487

>   ???
E   NameError: name 'base_n' is not defined

rabin_karp_substring_search:45: NameError

   - [#  48] SDL rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  26:     base_n = pow(base, len(substring) - 1) % prime_modulus
  27:     
  28:     
  29:     for i in range(len(substring)):
- 30:         rolling_hash = ((base * rolling_hash) + ord(string[i])) % prime_modulus
+ 30:         pass
  31:         substring_hash = ((base * substring_hash) + ord(substring[i])) % prime_modulus
  32:     
  33:     for i in range((len(string) - len(substring)) + 1):
  34:         
--------------------------------------------------------------------------------
[0.19775 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  49] SDL rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  27:     
  28:     
  29:     for i in range(len(substring)):
  30:         rolling_hash = ((base * rolling_hash) + ord(string[i])) % prime_modulus
- 31:         substring_hash = ((base * substring_hash) + ord(substring[i])) % prime_modulus
+ 31:         pass
  32:     
  33:     for i in range((len(string) - len(substring)) + 1):
  34:         
  35:         if rolling_hash == substring_hash:
--------------------------------------------------------------------------------
[0.19137 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_partial_match

def test_rabin_karp_find_substring_partial_match():
>       assert rabin_karp_find_substring('hello', 'ell') == 1
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:20: AssertionError

   - [#  50] SDL rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  37:             for (s_i, letter) in enumerate(substring):
  38:                 if letter != string[i + s_i]:
  39:                     break
  40:             else:
- 41:                 return i
+ 41:                 pass
  42:         
  43:         if i < len(string) - len(substring):
  44:             
  45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
--------------------------------------------------------------------------------
[0.18646 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  51] SDL rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  41:                 return i
  42:         
  43:         if i < len(string) - len(substring):
  44:             
- 45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
+ 45:             pass
  46:             
  47:             
  48:             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
  49:     
--------------------------------------------------------------------------------
[0.21965 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  52] SDL rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  44:             
  45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
  46:             
  47:             
- 48:             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
+ 48:             pass
  49:     
  50:     return -1
--------------------------------------------------------------------------------
[0.19996 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  53] SDL rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  46:             
  47:             
  48:             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
  49:     
- 50:     return -1
+ 50:     pass
--------------------------------------------------------------------------------
[0.18741 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_no_match

def test_rabin_karp_find_substring_no_match():
>       assert rabin_karp_find_substring('hello', 'world') == -1
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:17: AssertionError

   - [#  54] ZIL rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  26:     base_n = pow(base, len(substring) - 1) % prime_modulus
  27:     
  28:     
  29:     for i in range(len(substring)):
- 30:         rolling_hash = ((base * rolling_hash) + ord(string[i])) % prime_modulus
- 31:         substring_hash = ((base * substring_hash) + ord(substring[i])) % prime_modulus
+ 30:         break
+ 31:     
  32:     
  33:     for i in range((len(string) - len(substring)) + 1):
  34:         
  35:         if rolling_hash == substring_hash:
--------------------------------------------------------------------------------
[0.18780 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  55] ZIL rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  31:         substring_hash = ((base * substring_hash) + ord(substring[i])) % prime_modulus
  32:     
  33:     for i in range((len(string) - len(substring)) + 1):
  34:         
- 35:         if rolling_hash == substring_hash:
- 36:             
- 37:             for (s_i, letter) in enumerate(substring):
- 38:                 if letter != string[i + s_i]:
- 39:                     break
- 40:             else:
- 41:                 return i
- 42:         
- 43:         if i < len(string) - len(substring):
- 44:             
- 45:             rolling_hash = ((rolling_hash - (base_n * ord(string[i]))) * base) + (ord(string[i + len(substring)]) % prime_modulus)
- 46:             
- 47:             
- 48:             rolling_hash = (rolling_hash + prime_modulus) % prime_modulus
+ 35:         break
+ 36:     
+ 37:     
+ 38:     
+ 39:     
+ 40:     
+ 41:     
+ 42:     
+ 43:     
+ 44:     
+ 45:     
+ 46:     
+ 47:     
+ 48:     
  49:     
  50:     return -1
--------------------------------------------------------------------------------
[0.19784 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError

   - [#  56] ZIL rabin_karp_substring_search: 
--------------------------------------------------------------------------------
  34:         
  35:         if rolling_hash == substring_hash:
  36:             
  37:             for (s_i, letter) in enumerate(substring):
- 38:                 if letter != string[i + s_i]:
- 39:                     break
- 40:             else:
+ 38:                 break
+ 39:             else:
+ 40:                 
  41:                 return i
  42:         
  43:         if i < len(string) - len(substring):
  44:             
--------------------------------------------------------------------------------
[0.18572 s] killed by ts-3-5/test_3-5_0-9_276.py::test_rabin_karp_find_substring_exact_match

def test_rabin_karp_find_substring_exact_match():
>       assert rabin_karp_find_substring('hello', 'lo') == 3
E       AssertionError

ts-3-5/test_3-5_0-9_276.py:14: AssertionError
