   - [#  44] SVD trie: 
--------------------------------------------------------------------------------
   4:     
   5:     def __init__(self, words):
   6:         self.head = {}
   7:         for word in words:
-  8:             current = self.head
+  8:             current = head
   9:             for letter in word:
  10:                 current = current.setdefault(letter, {})
  11:             current[self.eof] = self.eof
  12:     
--------------------------------------------------------------------------------
[0.08255 s] killed by ALL-SMART/test_trie_MOSA.py::test_case_0

def test_case_0():
        str_0 = '/j\n&u(p_*Y6-%*"y5>Q'
>       trie_0 = module_0.Trie(str_0)

ALL-SMART/test_trie_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <trie.Trie object at 0x7f846f3889a0>, words = '/j\n&u(p_*Y6-%*"y5>Q'

>   ???
E   NameError: name 'head' is not defined

trie:8: NameError

   - [#  45] SVD trie: 
--------------------------------------------------------------------------------
   7:         for word in words:
   8:             current = self.head
   9:             for letter in word:
  10:                 current = current.setdefault(letter, {})
- 11:             current[self.eof] = self.eof
+ 11:             current[eof] = self.eof
  12:     
  13:     def add(self, word):
  14:         current = self.head
  15:         for letter in word:
--------------------------------------------------------------------------------
[0.08273 s] killed by ALL-SMART/test_trie_MOSA.py::test_case_0

def test_case_0():
        str_0 = '/j\n&u(p_*Y6-%*"y5>Q'
>       trie_0 = module_0.Trie(str_0)

ALL-SMART/test_trie_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <trie.Trie object at 0x7f846f20fbe0>, words = '/j\n&u(p_*Y6-%*"y5>Q'

>   ???
E   NameError: name 'eof' is not defined

trie:11: NameError

   - [#  46] SVD trie: 
--------------------------------------------------------------------------------
   7:         for word in words:
   8:             current = self.head
   9:             for letter in word:
  10:                 current = current.setdefault(letter, {})
- 11:             current[self.eof] = self.eof
+ 11:             current[self.eof] = eof
  12:     
  13:     def add(self, word):
  14:         current = self.head
  15:         for letter in word:
--------------------------------------------------------------------------------
[0.07747 s] killed by ALL-SMART/test_trie_MOSA.py::test_case_0

def test_case_0():
        str_0 = '/j\n&u(p_*Y6-%*"y5>Q'
>       trie_0 = module_0.Trie(str_0)

ALL-SMART/test_trie_MOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <trie.Trie object at 0x7f846f4bf460>, words = '/j\n&u(p_*Y6-%*"y5>Q'

>   ???
E   NameError: name 'eof' is not defined

trie:11: NameError

   - [#  47] SVD trie: 
--------------------------------------------------------------------------------
  10:                 current = current.setdefault(letter, {})
  11:             current[self.eof] = self.eof
  12:     
  13:     def add(self, word):
- 14:         current = self.head
+ 14:         current = head
  15:         for letter in word:
  16:             current = current.setdefault(letter, {})
  17:         current[self.eof] = self.eof
  18:     
--------------------------------------------------------------------------------
[0.08143 s] killed by ALL-SMART/test_trie_MOSA.py::test_case_1

def test_case_1():
        str_0 = ";8k')N1"
        none_type_0 = None
        trie_0 = module_0.Trie(str_0)
        assert trie_0.head == {';': {'__eof__': '__eof__'}, '8': {'__eof__': '__eof__'}, 'k': {'__eof__': '__eof__'}, "'": {'__eof__': '__eof__'}, ')': {'__eof__': '__eof__'}, 'N': {'__eof__': '__eof__'}, '1': {'__eof__': '__eof__'}}
        assert module_0.Trie.eof == '__eof__'
>       var_0 = trie_0.add(str_0)

ALL-SMART/test_trie_MOSA.py:20: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <trie.Trie object at 0x7f846f411000>, word = ";8k')N1"

>   ???
E   NameError: name 'head' is not defined

trie:14: NameError

   - [#  50] SVD trie: 
--------------------------------------------------------------------------------
  17:         current[self.eof] = self.eof
  18:     
  19:     def get_all_common_prefix(self, prefix):
  20:         idx = 0
- 21:         node = self.head
+ 21:         node = head
  22:         while idx < len(prefix):
  23:             letter = prefix[idx]
  24:             if letter not in node:
  25:                 return []
--------------------------------------------------------------------------------
[0.08172 s] killed by ALL-SMART/test_trie_MOSA.py::test_case_0

def test_case_0():
        str_0 = '/j\n&u(p_*Y6-%*"y5>Q'
        trie_0 = module_0.Trie(str_0)
        assert module_0.Trie.eof == '__eof__'
>       var_0 = trie_0.get_all_common_prefix(str_0)

ALL-SMART/test_trie_MOSA.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <trie.Trie object at 0x7f846f493a00>, prefix = '/j\n&u(p_*Y6-%*"y5>Q'

>   ???
E   NameError: name 'head' is not defined

trie:21: NameError

   - [#  51] SVD trie: 
--------------------------------------------------------------------------------
  26:             node = node[letter]
  27:             idx += 1
  28:         
  29:         def getWords(node, prefix):
- 30:             if self.eof in node:
+ 30:             if eof in node:
  31:                 return [prefix]
  32:             words = []
  33:             for (key, val) in node.items():
  34:                 words.extend(getWords(val, prefix + key))
--------------------------------------------------------------------------------
[0.08501 s] killed by ALL-SMART/test_trie_MOSA.py::test_case_1

def test_case_1():
        str_0 = ";8k')N1"
        none_type_0 = None
        trie_0 = module_0.Trie(str_0)
        assert trie_0.head == {';': {'__eof__': '__eof__'}, '8': {'__eof__': '__eof__'}, 'k': {'__eof__': '__eof__'}, "'": {'__eof__': '__eof__'}, ')': {'__eof__': '__eof__'}, 'N': {'__eof__': '__eof__'}, '1': {'__eof__': '__eof__'}}
        assert module_0.Trie.eof == '__eof__'
        var_0 = trie_0.add(str_0)
        assert len(trie_0.head) == 7
>       var_1 = trie_0.get_all_common_prefix(str_0)

ALL-SMART/test_trie_MOSA.py:22: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
trie:37: in get_all_common_prefix
    ???
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

node = {'__eof__': '__eof__'}, prefix = ";8k')N1"

>   ???
E   NameError: name 'eof' is not defined

trie:30: NameError

   - [#  52] ZIL trie: 
--------------------------------------------------------------------------------
   4:     
   5:     def __init__(self, words):
   6:         self.head = {}
   7:         for word in words:
-  8:             current = self.head
-  9:             for letter in word:
- 10:                 current = current.setdefault(letter, {})
- 11:             current[self.eof] = self.eof
+  8:             break
+  9:     
+ 10:     
+ 11:     
  12:     
  13:     def add(self, word):
  14:         current = self.head
  15:         for letter in word:
--------------------------------------------------------------------------------
[0.08477 s] killed by ALL-SMART/test_trie_MOSA.py::test_case_0

def test_case_0():
        str_0 = '/j\n&u(p_*Y6-%*"y5>Q'
        trie_0 = module_0.Trie(str_0)
E       AssertionError

ALL-SMART/test_trie_MOSA.py:8: AssertionError

   - [#  53] ZIL trie: 
--------------------------------------------------------------------------------
   6:         self.head = {}
   7:         for word in words:
   8:             current = self.head
   9:             for letter in word:
- 10:                 current = current.setdefault(letter, {})
+ 10:                 break
  11:             current[self.eof] = self.eof
  12:     
  13:     def add(self, word):
  14:         current = self.head
--------------------------------------------------------------------------------
[0.08199 s] killed by ALL-SMART/test_trie_MOSA.py::test_case_0

def test_case_0():
        str_0 = '/j\n&u(p_*Y6-%*"y5>Q'
        trie_0 = module_0.Trie(str_0)
E       AssertionError

ALL-SMART/test_trie_MOSA.py:8: AssertionError

   - [#  55] ZIL trie: 
--------------------------------------------------------------------------------
  19:     def get_all_common_prefix(self, prefix):
  20:         idx = 0
  21:         node = self.head
  22:         while idx < len(prefix):
- 23:             letter = prefix[idx]
- 24:             if letter not in node:
- 25:                 return []
- 26:             node = node[letter]
- 27:             idx += 1
+ 23:             break
+ 24:         
+ 25:         
+ 26:         
+ 27:         
  28:         
  29:         def getWords(node, prefix):
  30:             if self.eof in node:
  31:                 return [prefix]
--------------------------------------------------------------------------------
[0.08256 s] killed by ALL-SMART/test_trie_MOSA.py::test_case_0

def test_case_0():
        str_0 = '/j\n&u(p_*Y6-%*"y5>Q'
        trie_0 = module_0.Trie(str_0)
        assert module_0.Trie.eof == '__eof__'
        var_0 = trie_0.get_all_common_prefix(str_0)
        trie_1 = module_0.Trie(var_0)
>       assert trie_1.head == {}
E       AssertionError

ALL-SMART/test_trie_MOSA.py:12: AssertionError

   - [#  56] ZIL trie: 
--------------------------------------------------------------------------------
  30:             if self.eof in node:
  31:                 return [prefix]
  32:             words = []
  33:             for (key, val) in node.items():
- 34:                 words.extend(getWords(val, prefix + key))
+ 34:                 break
  35:             return words
  36:         
  37:         return getWords(node, prefix)
--------------------------------------------------------------------------------
[0.07213 s] survived
