1 : Job ID 0a3e535862d248bf8485cb695eb947b8
test outcome: killed
trie.py, start pos: (34, 50), end pos: (34, 51)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -31,7 +31,7 @@
                 return [prefix]
             words = []
             for key, val in node.items():
-                words.extend(getWords(val, prefix + key))
+                words.extend(getWords(val, prefix - key))
             return words
         return getWords(node, prefix)
ts-3-5/test_3-5_0-9_289.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - TypeError: unsupp...
========================= 1 failed, 3 passed in 0.15s ==========================

2 : Job ID 99060c74b2bc48d09a72813494987621
test outcome: killed
trie.py, start pos: (34, 50), end pos: (34, 51)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -31,7 +31,7 @@
                 return [prefix]
             words = []
             for key, val in node.items():
-                words.extend(getWords(val, prefix + key))
+                words.extend(getWords(val, prefix * key))
             return words
         return getWords(node, prefix)
ts-3-5/test_3-5_0-9_289.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - TypeError: can't ...
========================= 1 failed, 3 passed in 0.15s ==========================

3 : Job ID 73613717f7764efd93eda742a5ad76e1
test outcome: killed
trie.py, start pos: (34, 50), end pos: (34, 51)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -31,7 +31,7 @@
                 return [prefix]
             words = []
             for key, val in node.items():
-                words.extend(getWords(val, prefix + key))
+                words.extend(getWords(val, prefix / key))
             return words
         return getWords(node, prefix)
ts-3-5/test_3-5_0-9_289.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - TypeError: unsupp...
========================= 1 failed, 3 passed in 0.14s ==========================

4 : Job ID 5b2660665b6f4b9c9ad9187b69b0f6ff
test outcome: killed
trie.py, start pos: (34, 50), end pos: (34, 51)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -31,7 +31,7 @@
                 return [prefix]
             words = []
             for key, val in node.items():
-                words.extend(getWords(val, prefix + key))
+                words.extend(getWords(val, prefix // key))
             return words
         return getWords(node, prefix)
ts-3-5/test_3-5_0-9_289.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - TypeError: unsupp...
========================= 1 failed, 3 passed in 0.15s ==========================

5 : Job ID 9a20fb3213a241efb356dc880da3a148
test outcome: killed
trie.py, start pos: (34, 50), end pos: (34, 51)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -31,7 +31,7 @@
                 return [prefix]
             words = []
             for key, val in node.items():
-                words.extend(getWords(val, prefix + key))
+                words.extend(getWords(val, prefix % key))
             return words
         return getWords(node, prefix)
ts-3-5/test_3-5_0-9_289.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - TypeError: not al...
========================= 1 failed, 3 passed in 0.14s ==========================

6 : Job ID 7919c5f9230c41c49f3b92069026f302
test outcome: killed
trie.py, start pos: (34, 50), end pos: (34, 51)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -31,7 +31,7 @@
                 return [prefix]
             words = []
             for key, val in node.items():
-                words.extend(getWords(val, prefix + key))
+                words.extend(getWords(val, prefix ** key))
             return words
         return getWords(node, prefix)
ts-3-5/test_3-5_0-9_289.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - TypeError: unsupp...
========================= 1 failed, 3 passed in 0.14s ==========================

7 : Job ID fbbbcfc932ee44b4a261a0e80a3eb7ab
test outcome: killed
trie.py, start pos: (34, 50), end pos: (34, 51)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -31,7 +31,7 @@
                 return [prefix]
             words = []
             for key, val in node.items():
-                words.extend(getWords(val, prefix + key))
+                words.extend(getWords(val, prefix >> key))
             return words
         return getWords(node, prefix)
ts-3-5/test_3-5_0-9_289.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - TypeError: unsupp...
========================= 1 failed, 3 passed in 0.15s ==========================

8 : Job ID 6492b36650e043df89f2d2b26330b90f
test outcome: killed
trie.py, start pos: (34, 50), end pos: (34, 51)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -31,7 +31,7 @@
                 return [prefix]
             words = []
             for key, val in node.items():
-                words.extend(getWords(val, prefix + key))
+                words.extend(getWords(val, prefix << key))
             return words
         return getWords(node, prefix)
ts-3-5/test_3-5_0-9_289.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - TypeError: unsupp...
========================= 1 failed, 3 passed in 0.15s ==========================

9 : Job ID b1dd13a2f68a4186bf1a45393e7aa5c5
test outcome: killed
trie.py, start pos: (34, 50), end pos: (34, 51)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -31,7 +31,7 @@
                 return [prefix]
             words = []
             for key, val in node.items():
-                words.extend(getWords(val, prefix + key))
+                words.extend(getWords(val, prefix | key))
             return words
         return getWords(node, prefix)
ts-3-5/test_3-5_0-9_289.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - TypeError: unsupp...
========================= 1 failed, 3 passed in 0.15s ==========================

10 : Job ID 7c692703c0864fcb9e7e3e590d862fa9
test outcome: killed
trie.py, start pos: (34, 50), end pos: (34, 51)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -31,7 +31,7 @@
                 return [prefix]
             words = []
             for key, val in node.items():
-                words.extend(getWords(val, prefix + key))
+                words.extend(getWords(val, prefix & key))
             return words
         return getWords(node, prefix)
ts-3-5/test_3-5_0-9_289.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - TypeError: unsupp...
========================= 1 failed, 3 passed in 0.14s ==========================

11 : Job ID d08cb64a044645be97a299c7252b1f11
test outcome: killed
trie.py, start pos: (34, 50), end pos: (34, 51)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -31,7 +31,7 @@
                 return [prefix]
             words = []
             for key, val in node.items():
-                words.extend(getWords(val, prefix + key))
+                words.extend(getWords(val, prefix ^ key))
             return words
         return getWords(node, prefix)
ts-3-5/test_3-5_0-9_289.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - TypeError: unsupp...
========================= 1 failed, 3 passed in 0.15s ==========================

12 : Job ID 87f76f0bc0a34b4ea595e542132c40f0
test outcome: killed
trie.py, start pos: (22, 18), end pos: (22, 19)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 0
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -19,7 +19,7 @@
     def get_all_common_prefix(self, prefix):
         idx = 0
         node = self.head
-        while idx < len(prefix):
+        while idx == len(prefix):
             letter = prefix[idx]
             if letter not in node:
                 return []
ts-3-5/test_3-5_0-9_289.py ..FF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - AssertionError: a...
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix_no_match - Assertio...
========================= 2 failed, 2 passed in 0.15s ==========================

13 : Job ID d8638bc8fba64757af7df053ab2e3a3b
SURVIVED
test outcome: survived
trie.py, start pos: (22, 18), end pos: (22, 19)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 0
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -19,7 +19,7 @@
     def get_all_common_prefix(self, prefix):
         idx = 0
         node = self.head
-        while idx < len(prefix):
+        while idx != len(prefix):
             letter = prefix[idx]
             if letter not in node:
                 return []
ts-3-5/test_3-5_0-9_289.py ....                                          [100%]
============================== 4 passed in 0.14s ===============================

14 : Job ID 2a47bd2ecdf14337a6763f2f2a9aee59
test outcome: killed
trie.py, start pos: (22, 18), end pos: (22, 19)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 0
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -19,7 +19,7 @@
     def get_all_common_prefix(self, prefix):
         idx = 0
         node = self.head
-        while idx < len(prefix):
+        while idx <= len(prefix):
             letter = prefix[idx]
             if letter not in node:
                 return []
ts-3-5/test_3-5_0-9_289.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - IndexError: strin...
========================= 1 failed, 3 passed in 0.14s ==========================

15 : Job ID 15b77b85473a4903a0fbc365b380c4a6
test outcome: killed
trie.py, start pos: (22, 18), end pos: (22, 19)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 0
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -19,7 +19,7 @@
     def get_all_common_prefix(self, prefix):
         idx = 0
         node = self.head
-        while idx < len(prefix):
+        while idx > len(prefix):
             letter = prefix[idx]
             if letter not in node:
                 return []
ts-3-5/test_3-5_0-9_289.py ..FF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - AssertionError: a...
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix_no_match - Assertio...
========================= 2 failed, 2 passed in 0.15s ==========================

16 : Job ID 36c35bfa49334a10ad8cd5ce7c04e815
test outcome: killed
trie.py, start pos: (22, 18), end pos: (22, 19)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 0
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -19,7 +19,7 @@
     def get_all_common_prefix(self, prefix):
         idx = 0
         node = self.head
-        while idx < len(prefix):
+        while idx >= len(prefix):
             letter = prefix[idx]
             if letter not in node:
                 return []
ts-3-5/test_3-5_0-9_289.py ..FF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - AssertionError: a...
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix_no_match - Assertio...
========================= 2 failed, 2 passed in 0.15s ==========================

17 : Job ID fbf3e0055b484c9fb92803f1806407c8
test outcome: killed
trie.py, start pos: (22, 18), end pos: (22, 19)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 0
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -19,7 +19,7 @@
     def get_all_common_prefix(self, prefix):
         idx = 0
         node = self.head
-        while idx < len(prefix):
+        while idx is len(prefix):
             letter = prefix[idx]
             if letter not in node:
                 return []
ts-3-5/test_3-5_0-9_289.py ..FF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - AssertionError: a...
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix_no_match - Assertio...
========================= 2 failed, 2 passed in 0.14s ==========================

18 : Job ID 2f79cd1dbb354f62a354d4ab0a742f64
SURVIVED
test outcome: survived
trie.py, start pos: (22, 18), end pos: (22, 19)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 0
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -19,7 +19,7 @@
     def get_all_common_prefix(self, prefix):
         idx = 0
         node = self.head
-        while idx < len(prefix):
+        while idx is not len(prefix):
             letter = prefix[idx]
             if letter not in node:
                 return []
ts-3-5/test_3-5_0-9_289.py ....                                          [100%]
============================== 4 passed in 0.15s ===============================

19 : Job ID d108eaf1827a458dba77ae72ea7ecc81
test outcome: killed
trie.py, start pos: (22, 14), end pos: (22, 31)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -19,7 +19,7 @@
     def get_all_common_prefix(self, prefix):
         idx = 0
         node = self.head
-        while idx < len(prefix):
+        while not idx < len(prefix):
             letter = prefix[idx]
             if letter not in node:
                 return []
ts-3-5/test_3-5_0-9_289.py ..FF                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - AssertionError: a...
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix_no_match - Assertio...
========================= 2 failed, 2 passed in 0.15s ==========================

20 : Job ID bbc9fbc218564256a43cd9e3c3ccff29
test outcome: killed
trie.py, start pos: (24, 15), end pos: (24, 33)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -21,7 +21,7 @@
         node = self.head
         while idx < len(prefix):
             letter = prefix[idx]
-            if letter not in node:
+            if not letter not in node:
                 return []
             node = node[letter]
             idx += 1
ts-3-5/test_3-5_0-9_289.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - AssertionError: a...
========================= 1 failed, 3 passed in 0.14s ==========================

21 : Job ID f884511b69fe42b096bdb00ceb0f67eb
test outcome: killed
trie.py, start pos: (30, 15), end pos: (30, 31)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -27,7 +27,7 @@
             idx += 1
         # get all words after this node
         def getWords(node, prefix):
-            if self.eof in node:
+            if not self.eof in node:
                 return [prefix]
             words = []
             for key, val in node.items():
ts-3-5/test_3-5_0-9_289.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - AssertionError: a...
========================= 1 failed, 3 passed in 0.14s ==========================

22 : Job ID 9a82110a17ab480e85b70a49ee368382
test outcome: killed
trie.py, start pos: (20, 14), end pos: (20, 15)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -17,7 +17,7 @@
         current[self.eof] = self.eof
     def get_all_common_prefix(self, prefix):
-        idx = 0
+        idx = 1
         node = self.head
         while idx < len(prefix):
             letter = prefix[idx]
ts-3-5/test_3-5_0-9_289.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - AssertionError: a...
========================= 1 failed, 3 passed in 0.15s ==========================

23 : Job ID 5e98b3915a614e0fb60199b26fedfbed
test outcome: killed
trie.py, start pos: (20, 14), end pos: (20, 15)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -17,7 +17,7 @@
         current[self.eof] = self.eof
     def get_all_common_prefix(self, prefix):
-        idx = 0
+        idx = -1
         node = self.head
         while idx < len(prefix):
             letter = prefix[idx]
ts-3-5/test_3-5_0-9_289.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - AssertionError: a...
========================= 1 failed, 3 passed in 0.14s ==========================

24 : Job ID db3d7d19e63046f9ae9ac0fb7a172922
test outcome: killed
trie.py, start pos: (27, 19), end pos: (27, 20)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -24,7 +24,7 @@
             if letter not in node:
                 return []
             node = node[letter]
-            idx += 1
+            idx += 2
         # get all words after this node
         def getWords(node, prefix):
             if self.eof in node:
ts-3-5/test_3-5_0-9_289.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - AssertionError: a...
========================= 1 failed, 3 passed in 0.14s ==========================

25 : Job ID 24815352ac024412a14561905095cf80
test outcome: killed
trie.py, start pos: (27, 19), end pos: (27, 20)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -24,7 +24,7 @@
             if letter not in node:
                 return []
             node = node[letter]
-            idx += 1
+            idx += 0
         # get all words after this node
         def getWords(node, prefix):
             if self.eof in node:
ts-3-5/test_3-5_0-9_289.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - AssertionError: a...
========================= 1 failed, 3 passed in 0.14s ==========================

26 : Job ID 9ffad53543d64982bb5c99460a517111
test outcome: killed
trie.py, start pos: (7, 20), end pos: (7, 25)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -4,7 +4,7 @@
     def __init__(self, words):
         self.head = {}
-        for word in words:
+        for word in []:
             current = self.head
             for letter in word:
                 current = current.setdefault(letter, {})
ts-3-5/test_3-5_0-9_289.py F.F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_initialize_trie - assert 0 == 2
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - AssertionError: a...
========================= 2 failed, 2 passed in 0.14s ==========================

27 : Job ID 202b3475d8c74e98914cea95a45df26e
test outcome: killed
trie.py, start pos: (9, 26), end pos: (9, 30)
operator: core/ZeroIterationForLoop, occurrence: 1
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -6,7 +6,7 @@
         self.head = {}
         for word in words:
             current = self.head
-            for letter in word:
+            for letter in []:
                 current = current.setdefault(letter, {})
             current[self.eof] = self.eof
ts-3-5/test_3-5_0-9_289.py F.F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_initialize_trie - AssertionError: ass...
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - AssertionError: a...
========================= 2 failed, 2 passed in 0.15s ==========================

29 : Job ID 43320c5516304b0b9df2bd3513569f0f
test outcome: killed
trie.py, start pos: (33, 28), end pos: (33, 40)
operator: core/ZeroIterationForLoop, occurrence: 3
--- mutation diff ---
--- atrie.py
+++ btrie.py
@@ -30,7 +30,7 @@
             if self.eof in node:
                 return [prefix]
             words = []
-            for key, val in node.items():
+            for key, val in []:
                 words.extend(getWords(val, prefix + key))
             return words
ts-3-5/test_3-5_0-9_289.py ..F.                                          [100%]
=========================== short test summary info ============================
FAILED ts-3-5/test_3-5_0-9_289.py::test_get_common_prefix - AssertionError: a...
========================= 1 failed, 3 passed in 0.14s ==========================
